{
  "subreddit": "privacy",
  "post_id": "ljp02h",
  "title": "How do I bypass the new youtube age restriction block?",
  "body": "I'm talking about the recent change they made for european users who now have to send in their ID card or credit card to \"verify their age\" before they can watch videos flagged as mature content.\n\nNeedless to say, I have no intention of sending my ID card to google, nor do I want to give my credit card to a service that's twisting my arm into it, so is there a way to bypass this yet? I already tried the old hooktube and nsfwyoutube methods, they do not work.\n\nCheers.",
  "author": "Tuke668",
  "comments": [
    {
      "author": "rmyco98",
      "timestamp": "",
      "body": "We're in a world now where it's easier for kids to access porn than history documentaries. It really does boggle my mind, it's ridiculous.EDIT: I wonder is there any browser plugins that can bypass the age verification?"
    },
    {
      "author": "devicemodder2",
      "timestamp": "",
      "body": "tampermonkey, get it and install:https://greasyfork.org/en/scripts/423851-simple-youtube-age-restriction-bypassEDIT: The tampermonkey script no longer works. hopefully the devs update it.Edit 2: looks like it's working again, as of 10/17/2021as for the easier access to porn than history docs, go watch idiocracy and you'll see why."
    },
    {
      "author": "Chad_Pringle",
      "timestamp": "",
      "body": "Invidious,Piped,Freetube,Newpipe,Skytube."
    },
    {
      "author": "vega_D",
      "timestamp": "",
      "body": "Edit: Hey guys, if you read this right now and want to reply, please also tell why the fuck are you here in the first place. I get a reply or two every month and it drives me crazy.+1 for NewPipe.It actually gives you better gesture based controls during video playback than official app, free background listening, godly working video downloading and that's all packed into free and open source privacy respecting app. Official YouTube app was outplayed in its own game."
    },
    {
      "author": "keenjataimu",
      "timestamp": "",
      "body": "NewPipe on the Fdroid store (FOSS) is just fantastic.. get Fdroid herehttps://f-droid.org/and then just look for newpipe. Fdroid are checking the open source apps on their store if my understanding is correct so it's a safe way to get good apps that will never be approved by Google play store. Blokada is another great example."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Google:We only collect anonymous data.EU:Hang on Google, we can fix that for you... one min... here you go, new legislation that lets you collect credit card numbers, age, address, full name, even photo IDs if you're lucky. And because they have to submit that data through the same browser you're collecting anonymous data from, you can now put a name and address to everything you have collected... how cool is that?Google:That's awesome, thanks. We promise we will delete all the collected info after verification... honestly. ;-)"
    },
    {
      "author": "manifestsilence",
      "timestamp": "",
      "body": "Could try a VPN or proxy server since they don't do that in the US. Not sure if they do it by IP each time though or by the IP when you make your Google account. If the latter then you'd also have to make a new account through the VPN/proxy but would only have to use the VPN/proxy once."
    },
    {
      "author": "Peachykeenpal",
      "timestamp": "",
      "body": "I'm a techie now considering going Luddite"
    },
    {
      "author": "Tuke668",
      "timestamp": "",
      "body": "You can use VLC media player and play video from directly youtube video url.It takes like 3 clicks on vlc and you are ready to roll."
    }
  ]
}