{
  "subreddit": "NewTubers",
  "post_id": "1cyeujd",
  "title": "Is it just me or does it feel super sketchy uploading an ID to get verified on YouTube?",
  "body": "I am tempted to do it but I have a voice in my head (kind of like Dexter's) telling me I am insane for even considering that. Am I being too paranoid or does it make sense not wanting to upload it. I am okay with sending them a video of myself but the actual link is disabled so I don't know HOW to do that. How do you upload it if the button is disabled?\n\nhttps://snipboard.io/qTl56t.jpg\n\nhttps://snipboard.io/Tb7oDw.jpg",
  "author": "uffno",
  "comments": [
    {
      "author": "AudibleNoodles",
      "timestamp": "",
      "body": "I was able to do the video verification when I tried to add a “related video” to one of my shorts. It will send a link to your email which will send you to a page with instructions where you record a video of your face."
    },
    {
      "author": "OCDcentral",
      "timestamp": "",
      "body": "Thank you so much for your comment. I'm trying to figure out how to do just that. So far I could not find how to do it."
    },
    {
      "author": "Jiggle-BellyGaming",
      "timestamp": "",
      "body": "Google already has more info on you than you could imagine, your ID isn't some big PII threat in comparison"
    },
    {
      "author": "OCDcentral",
      "timestamp": "",
      "body": "I was waiting for a comment like that but I don't really disagree with you. I just don't feel like potentially giving them something they might not have. Trust me, a part of me ridicules myself for even saying that because they probably have EVERYTHING but I just really don't feel like uploading this ID."
    },
    {
      "author": "DaddyMoshe",
      "timestamp": "",
      "body": "I’d say you’re overly paranoid. But that’s your choice, and my opinion. I mean, you use all of google’s free services daily already, so all of your information is theirs anyway. I’d rather youtube (google) have my ID than all my data l have on my phones, computer, drives, anything else. It’s the price you pay though, for “free” service"
    },
    {
      "author": "OCDcentral",
      "timestamp": "",
      "body": "Just like I didn't dispute what the other person said, I'm not disputing what you're saying. Just feels crazy to give them this as well."
    },
    {
      "author": "JASHIKO_",
      "timestamp": "",
      "body": "If you're planning on being monetised you will need to hand over a lot more information as well. Tax info, ID, address, bank details, etc. So if that's you're goal there's no avoiding giving up the data."
    },
    {
      "author": "Carter_Azathoth",
      "timestamp": "",
      "body": "I’m an overly paranoid person as well so I get it but I did it and I’ve had no issues. I looked at it more as if a job was request an ID since you’ll need to give them even more personal info to earn money from your videos."
    },
    {
      "author": "MichaelGoosebumpsfan",
      "timestamp": "",
      "body": "People should be more angry about this, and I would absolutely never recommend doing it. There’s no reason for them to know who you are, and if anyone in this comments section tells you otherwise, they’re dumb and part of the problem."
    },
    {
      "author": "uffno",
      "timestamp": "",
      "body": "yeah, Idiocracy. Humanity is getting dumber."
    }
  ]
}