{
  "subreddit": "VRchat",
  "post_id": "1jme0ir",
  "title": "Keep your age verification bouncers away from public game lobbies",
  "body": "If you want an 18+ server on some random ass popular game, then restrict it to verified 18+. I am over 18. I will not be giving randos my real birth date. I'm sick of giving fake unverifiable birth dates to random power tripping losers who themselves sound like they're a few years from 18.\n\nIf you want to wack it to your NSFW avatar, don't do it in a public lobby for trash compactor or prison escape.",
  "author": "mexicandiaper",
  "comments": [
    {
      "author": "metroidmen",
      "timestamp": "",
      "body": "Yeah, I agree. It’s usually a power trip.With that said, if we REALLY want to think about it, tons of users record and/or stream their game. So when someone walks up and gives their literal date of birth with their username, who knows what doxxing rabbit hole that could lead to."
    },
    {
      "author": "No-Reality-2744",
      "timestamp": "",
      "body": "Yeah it was always a risk to wave your DOB around public instances. They aren't protecting people by asking this, if we claim to be an adult that is the same as hearing us say whatever year makes us 18 anyway. If they don't believe us claiming to be an adult why would they believe whatever date we slap in their faces? It's stupid and it's like talking to a wall to even try asking how it actually helps. The best they can say is \"we are just doing what we can\" when it isn't doing \"what you can\" when the doing does not actually result in a safer environment. They're just saying that to convince themselves they're not wrong."
    },
    {
      "author": "FlexiCake",
      "timestamp": "",
      "body": "Exactly why I don't give out my DOB or age online. VRChat is just another online social media platform to me despite being a different style.I'm also a Vtuber so I gotta be careful to try and conceal my identity the best I can."
    },
    {
      "author": "chunarii-chan",
      "timestamp": "",
      "body": "Most of the people that do this are underage themselves. As an adult I have no problem immediately identifying other adults. Adults don't do what they do. And I am not giving out my fucking information to random children on the internet when I could just be making it up anyway. Also I am 18+ verified. I can't remember the last time I saw an age gated instance except for the American eboy h party group who always have one"
    },
    {
      "author": "Helioskull",
      "timestamp": "",
      "body": "It is EXCLUSIVELY a power trip now, the point has been driven home over and over, and it'll be driven home even more until the point is somehow managed to be driven to them. If you cannot trust a ID matched to selfie verification, you don't want verification, you just want the ability to stop people and make them do what YOU want."
    },
    {
      "author": "Embarrassed-Touch-62",
      "timestamp": "",
      "body": "Damn people you are so unlucky or I was so lucky? Had this situation only once.If you do an 18+ instance and want to gate keep it, then allow verified people in. So simple, yet too hard for some people with concrete instead of a brain."
    },
    {
      "author": "pokemonfan95",
      "timestamp": "",
      "body": "Even age verified instances some still ask for dob even tho they use the age verified instance type and say we don't trust age verified system .... then why tf are u using verified 18+ only instance? They ofc try to make the excuse minors can lie on the 18+ verification . they can't spoof or cheat there way past it i swear the groups that do this are stupid power hungry idiots smh possibly there creeps running it who knows"
    },
    {
      "author": "drksolrsing",
      "timestamp": "",
      "body": "They can't get much out of \"41, 83\".That's all I give them because fuck them, my birthday I'll be 42. The day doesn't matter."
    },
    {
      "author": "LittleChi-",
      "timestamp": "",
      "body": "There's people going as far as opening  \"21+\" instances yet where they give allowance to 18+ if they know people within the group or instance where I'm like \"that must be power tripping\" I couldn't explain it any other way"
    },
    {
      "author": "mexicandiaper",
      "timestamp": "",
      "body": "Yeah as soon as they ask I nope out. I'm trying to relax after work not have a papers please situation from a 22-year-old in a fursona."
    }
  ]
}