{
  "subreddit": "MetaQuestVR",
  "post_id": "1hv4l4f",
  "title": "Age verification teen account email legit?",
  "body": "Hi\n\nMy son got a meta quest 3s. He has had an email asking him to verify his age. The email comes fromdo_not_reply@email.meta.com\n\nIf I go to verify it asks for his card details or ID. Obviously his card is going to have his age (11) connected to it but I assume I can’t use mine?\n\nI know people will just say wait, and usually I would but he’s now spent some actual money on games I don’t want the account lost particularly. I’ve included the email but not his details I wouldn’t mind him having the account for his age if I was able to approve apps and games but since it limits that we set the birthday to be just turned 13 so I could still have an element of parental control.\n\nThanks in advance !",
  "author": "SuperbSmuffette420",
  "comments": [
    {
      "author": "Markgulfcoast",
      "timestamp": "",
      "body": "It is legit. They don't play when it comes to the kids. Irritating, but probably better off because of it. Lots of creeps in VR."
    },
    {
      "author": "W00lph",
      "timestamp": "",
      "body": "If he's under 13 and you set him up as 13+ then it's a problem. If you use his ID then he should not be on 13+ account. If you use your ID and they decide someone under 13 is using your account can get account banned."
    },
    {
      "author": "Flaming_F",
      "timestamp": "",
      "body": "It's legit and there is also a possibility of a spoof and scam. So don't click any link in this emailBest advice would be to go directly on meta.com website , log into your account, then go in your personal informations and update/Confirm your birthdate there ."
    },
    {
      "author": "popticle",
      "timestamp": "",
      "body": "He doesn’t play any online games but does play some age restricted games.Thanks all. I’m just unsure how to verify."
    },
    {
      "author": "Tikcash",
      "timestamp": "",
      "body": "I don’t understand, if your son is 11 then if you verify it it’ll still be under 13, and if you use your own do the names match? I’m assuming you used your sons name for the sub account"
    },
    {
      "author": "popticle",
      "timestamp": "",
      "body": "Yeah they won’t match, I just wasn’t sure if there was a workaround. I can set up a new account for him or set one up for me and he uses that, but is there any way to share the games ? Or are they now lost. They’re within the 14 days but I think he’s played over 2 hours of them"
    },
    {
      "author": "SJLJOSH",
      "timestamp": "",
      "body": "That happened to me once I just had to use a credit card and tada"
    },
    {
      "author": "TedRuxpin",
      "timestamp": "",
      "body": "I believe the issue is Roblox normally - if a child's account logs into Roblox associated with a Quest this is triggered if the ages don't match (Roblox child on an adult Meta account) at least that's what I've noticed a few times."
    },
    {
      "author": "SuperbSmuffette420",
      "timestamp": "",
      "body": "They actually asked me to pay $1.00 for a kid to use and play VR. No one should pay for a dollar for a kid to use it. Unacceptable of Meta."
    }
  ]
}