{
  "subreddit": "AskConservatives",
  "post_id": "18znr34",
  "title": "What are your thoughts on the age verification laws for porn?",
  "body": "I feel like we’re mostly all going to agree it’s insanity and massive invasion of privacy. (Granted, we’re also Reddit people though so slightly more “liberal” and exposed to more online than the average non-internet conservative even if we hold the same view points in reality. Just my own thoughts.)\n\nBut why is it mostly red states that are introducing this legislation? There’s no way that it’ll actually protect children from finding it.\n\nOn the other hand, I read something from an ex-porn addict who supported it because it turned him into someone that only viewed women as objects and was unable to see their value as friends and people. So I get that.\n\nBut as we all know, banning something doesn’t solve the issue.\n\nThoughts?",
  "author": "gaxxzz",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Please useGood Faithwhen commenting. Gender issues are only allowed on Wednesdays. Antisemitism and calls for violence will not be tolerated, especially whendiscussing the Israeli-Palestinian conflict.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "LongDropSlowStop",
      "timestamp": "",
      "body": "Hard pass. You want my ID or credit card? Enjoy permanently losing any of my traffic."
    },
    {
      "author": "MaybeTheDoctor",
      "timestamp": "",
      "body": "Enjoy permanently losing any of my traffic.I think this is exactly what the laws are aiming at achieving ...."
    },
    {
      "author": "hope-luminescence",
      "timestamp": "",
      "body": "I think modern Internet porn is a serious public health problem. Specifically, the combination of the normalization of extreme sadomasochistic-ish content, or content seeming to depict rape and violent misogyny, along with the tendency for someone to watch alotof porn all at once and jump from video to video.I am skeptical as to whether those laws are a good, effective, Constitutional, or viable method of solving the problem."
    },
    {
      "author": "JoeCensored",
      "timestamp": "",
      "body": "They are pointless.  Any young teen with 2 brain cells can figure out how to get passed any age verification.  The minor challenge of doing so is likely to encourage rather than deter."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Louisiana, Arkansas, Mississippi. It’s been introduced in North Carolina, Montana, Texas.Probably more, I haven’t done much reading on it because I’m lucky to live in a state that probably never will 🤫"
    },
    {
      "author": "Fantastic_Captain",
      "timestamp": "",
      "body": "Louisiana, Arkansas, Mississippi. It’s been introduced in North Carolina, Montana, Texas.Probably more, I haven’t done much reading on it because I’m lucky to live in a state that probably never will 🤫"
    },
    {
      "author": "WhoCares1224",
      "timestamp": "",
      "body": "They are good. What other age restricted product do you just ask a user to pinky promise they qualify for?"
    },
    {
      "author": "3pxp",
      "timestamp": "",
      "body": "VPN"
    },
    {
      "author": "gaxxzz",
      "timestamp": "",
      "body": "Ridiculous."
    }
  ]
}