{
  "subreddit": "AskUK",
  "post_id": "1i55qty",
  "title": "Does the o2 Arena check IDs for teenagers?",
  "body": "The o2 Arena has some specific rules about ages of children attending concerts without parents. According to their terms under 15s have to be accompanied by an adult which intake to mean that two 15 year olds can attend a concert without parents.\n\nMy daughter is 14 and her friend is 15, same school year. The friend has a spare ticket to an upcoming concert and has invited my daughter. What are the chances they will actually have their IDs checked and this rule be enforced? If it makes any difference they both look much older than 14/15.\n\nWould be interested to hear any experiences of IDs being checked or not checked when entering the o2. Thanks!",
  "author": "Bradley_the_Buyer",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Please help keep AskUK welcoming!When repling to submission/post pleasemake genuine efforts to answer the question given. Please no jokes, judgements,  etc.Don't be a dickto each other. If getting heated, just block and move on.This is a strictlyno-politicssubreddit!Please help us by reporting comments that break these rules.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "chonk-chonk-chonk",
      "timestamp": "",
      "body": "IDs do get checked depending on how old they look. Ive had mine checked a few times (18 years old currently, going to shows since 13). Its not as strict as buying alcohol or anything but if they dont have proof of age they could be refused entry."
    },
    {
      "author": "let_me_use_reddit",
      "timestamp": "",
      "body": "They may well check their ID, but it's more likely going to determine the colour of the wristband they get (i.e. can be served alcohol / cannot) rather than entry refusal. I don't think Swift's era tour would have survived otherwise."
    },
    {
      "author": "eventworker",
      "timestamp": "",
      "body": "How strict they are will depend entirely on the event."
    },
    {
      "author": "mr-dirtybassist",
      "timestamp": "",
      "body": "Yes. If you look young they will check your id"
    },
    {
      "author": "Bradley_the_Buyer",
      "timestamp": "",
      "body": "Hi everyone, just to come back on this and close the circle for anyone looking for and finding this advice in the future.I consulted o2 arena’s customer services. They confirmed that two children between the ages of 15 (under 16) and 17 (under 18) who are not in the standing area (so seated tickets only) could attend without someone 18 plus.They also made clear that ID will sometimes be checked but it is not consistent and is at the discretion of the security team working that particular event.They confirmed that original official ID is preferred but that they may accept photocopies / photos, again at the security team’s discretion.In the circumstances we decided to chance it and my daughter (14) attended with her friend (16). This was a breach of their terms.No ID checking appeared to be in operation though as I said both my daughter and her friend look much older than they are. They were able to attend the concert without issue."
    },
    {
      "author": "Sad-Huckleberry-1166",
      "timestamp": "",
      "body": "we're going to shepherd's bush, do you think same will apply?  Also are there separate checks  for stalls etc, as we bought tickets for there."
    },
    {
      "author": "Tuarangi",
      "timestamp": "",
      "body": "The policy clearly states that anyone under 15 has to be accompanied by an adult - in case people are somehow unaware of what an adult is, they explicitly state this is someone 18+. I am not sure where you get the idea two 15 year olds or a 15 year old with a 14 year old would be ok - a 15 year old is not an adult. If they looked over 16, they may get away with it, if they are asked for ID, they will be refused entry when they show they are not old enough.Also note than anyone under 16 cannot go in the standing area so if they were bought for that, they would be more likely to be ID checkedTicket terms:6.2  The following restrictions apply to Events taking place at the Venue (subject to any additional age restrictions that may apply to individual Events or Venues):(a) children under 15 must be accompanied by an adult aged 18 or over; and(b) children under 16 may only enter the Event with seated Tickets and cannot enter any standing area. We will not be liable to refund any standing Tickets which have been purchased for children under 16.ETA I am assuming it's a concert without other age restrictions - some events have additional onesETA 2 - down voting me for giving you information that is correct, but that you don't want to hear is not helpful"
    },
    {
      "author": "Bradley_the_Buyer",
      "timestamp": "",
      "body": "Thanks for this. Logically, two 15 year olds can attend by themselves without an adult in the seated area, correct? My daughter’s friend is 15, my daughter is 14, and will be about a month off being 15 at the time of the concert.An ID check would be to confirm they are both at least 15. Not many 15 year olds have official ID beyond a passport. I’m trying to ascertain the likelihood of this being specifically checked and enforced, I.e. if one of them (doesn’t matter which really) does not have ID are they likely to be refused entry?"
    }
  ]
}