{
  "subreddit": "facepalm",
  "post_id": "1bny0mv",
  "title": "You know that one Florida age-verification law? Yeah, turns out it’s much worse than it first seems.",
  "body": "",
  "author": "merica-4-d-win",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.Help us make this a better community by becoming familiar with therules.Report any suspicious users to the mods of this subreddit using Modmailhereor Reddit site adminshere.All reports to Modmail should include evidence such as screenshots or any other relevant information.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Doesn't kick in until 2025, after the election.What a coincidence."
    },
    {
      "author": "Immediate_Loss_4370",
      "timestamp": "",
      "body": "Damn, I thought he had signed his own death warrant with that law, guess he is not as dumb as he looks."
    },
    {
      "author": "my20cworth",
      "timestamp": "",
      "body": "Republican parents must be in a dilemma. We want controls but we don't want the Government interfering in how we parent. It's almost looks and feels like a socialist agenda."
    },
    {
      "author": "Beaglescout15",
      "timestamp": "",
      "body": "Republican parents want to control both their own children and everyone else's children."
    },
    {
      "author": "engr77",
      "timestamp": "",
      "body": "I seriously want to hear how those parents who screech \"I AM NOT COPARENTING WITH THE GOVERNMENT feel about this."
    },
    {
      "author": "corax_lives",
      "timestamp": "",
      "body": "This is the same state that loosens labor laws for children. They can't know about what gay people are but they can work dangerous jobs! Also same state that thinks 14 year Olds can be parents"
    },
    {
      "author": "Gakoknight",
      "timestamp": "",
      "body": "Fucking yikes."
    },
    {
      "author": "Flashy_Passion16",
      "timestamp": "",
      "body": "Keep sliding to 1930s Germany ‘Murica"
    },
    {
      "author": "merica-4-d-win",
      "timestamp": "",
      "body": "I swear we’re trying not to, it’s just that half the country is (arguably) uneducated and keeps pushing it further away."
    }
  ]
}