{
  "subreddit": "paypigsupportgroup",
  "post_id": "14u2p1m",
  "title": "How many subs check for age verification before they engage a Dominant?",
  "body": "I had a dominant on twitter get real mad at me for asking for age verification and I had to block her. She got nasty over me just asking if she had an only fans or something. I feel weird asking for an ID.\n\nI worry that tiktok is bringing a flood of underage women and i don't want to accidentally send money to a teenager.\n\nHow are other subs dealing with age verifying?",
  "author": "FindomGoddessRae",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I only serve Dommes that have a clip store, like IWC. That requires age verification."
    },
    {
      "author": "alleriamystic",
      "timestamp": "",
      "body": "It's good that you make an effort to check. Some don't and it's gross and creepy."
    },
    {
      "author": "giahoney",
      "timestamp": "",
      "body": "Even the submissive person isnt asking for an age verification I am making sure that as a seller I have everything ready for a proof of identity/age. Yeah, the ID thing its not a thing as its weird to spread your Id over the internet but if the domme has an age verified site its easy to check up. I wouldnt reccomend you to approach persons that dont have any of those because you either are going to deal with a scammer or an underage person."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Just go on sites that have clear verification. Like Fetlife. No verification? Can DM and ask them to verify with you personally . Still no verification? Find another Domme"
    },
    {
      "author": "goddesss_sapphire",
      "timestamp": "",
      "body": "She sounds amateur (even tho im fairly new) A real dom should know that they should be age verified and make it easy to see for the sub"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Please always check this!!! I was member of a discord server owned and managed by underage girls 😵‍💫 of course I reported and left. You can ask for ID with everything blured but the DOB or any website."
    },
    {
      "author": "goddessnina666",
      "timestamp": "",
      "body": "hi! twitter domme here! i just want to say that dommes are trying to re-enforce age verification as well! that being OF, LY, FANLSY! so don’t worry about it too much and please do keep asking for age verification if needed!"
    },
    {
      "author": "LadyLilithDeVille",
      "timestamp": "",
      "body": "Thats a HUGE yikes. They should already have it posted to their profile. If its not there and you ask for the link and they get pissy /run/"
    },
    {
      "author": "FindomGoddessRae",
      "timestamp": "",
      "body": "This is why I signed up for loyal fans. I don't use it like I should but it's there and my age is verified"
    }
  ]
}