{
  "subreddit": "RobloxHelp",
  "post_id": "qq5ho8",
  "title": "Roblox age verification",
  "body": "I have tried to verify my age with an ID multiple times now, it takes 10 minutes on the \"verifying you\" stage, but after 10 minutes it says there was an error and took too long to verify.Any solutions please?I am 13+",
  "author": "BiloYang",
  "comments": [
    {
      "author": "Resyinc",
      "timestamp": "",
      "body": "For anyone needing it, here is a page listing all accepted documents from each country.https://www.veriff.com/supported-countries"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I tried reusing my I.D. on a different account but its working at all. It keeps giving me the error \"Sorry, your verification was declined. For security reasons, please wait 7 day(s) before trying again.\" It's driving me insane because on my alt it has Voice Chat Privileges' cuz I wanted to test it, but on my main I don't. MAN"
    },
    {
      "author": "ZackyPlaysRoblox",
      "timestamp": "",
      "body": "I had my voice chat back in kuwait until it suddenly disappeared when I came to egypt.My age IS verified and it even verified instantly, but now that I tried it with different accounts, it says the same \"declined verification\" thing always.I think it's still under work and roblox is trying to fix it, though idk much about my own situation. and the fact that I have my age verified yet it doesn't give me the ability to even use it in egypt."
    },
    {
      "author": "Mountain_Magician",
      "timestamp": "",
      "body": "same i do everything and it says it was successful then when i come back they decline me, it’s like they give me a slither of hope then take it all away lol"
    },
    {
      "author": "EvidenceNo6866",
      "timestamp": "",
      "body": "When I go to “My settings”, and go to “Verify My Age”…. when I’m pressing the “Start Session” button, nothing’s happen. What should I do to verify my age??"
    },
    {
      "author": "VTPCISMYNAME",
      "timestamp": "",
      "body": "can someone help? i verified and stuff but when i went back into the app the button had not changed. i clicked it again and the page said i did my verification popped up. it hasn't changed and ive tried on all devices, can someone help?"
    },
    {
      "author": "mikkunnn",
      "timestamp": "",
      "body": "hello ik this is a bit late, im from India and it just won't take my ID LIKE???? IT keeps saying my ID couldn't be verified or couldn't verify photos even tho they're very clear???😭 im so done man I'm literally over 18 it just won't accept mine I don't have  licence or passport yet too😭"
    },
    {
      "author": "BiloYang",
      "timestamp": "",
      "body": "I also tried to verify my id on it but it says (scan the back) and I'm from romania(WE DO NOT HAVE ANY BARCODE ON THE BACK,IN FACT WE HAVE NOTHING ON THE BACK)so it's quite literally impossible for me to do somethingdoes anybody know anything I can do?"
    }
  ]
}