{
  "subreddit": "AskALiberal",
  "post_id": "1iu4jca",
  "title": "What do you think about age verification laws ?",
  "body": "Obviously adults should be able to watch  porn if they want, but I mean we do not allow kids to even drink until they are 18 or 21. Age verification laws require you to prove that you are at least 18 to use stuff like Pornhub. Some more libertarians say \" gubmint survivance\", which I mean is one criticism I can understand where it is coming from, even if I do not buy it myself. Number of  states have such laws, seems like SCOTUS will allow them based on oral arguments:https://www.nytimes.com/2025/01/15/us/supreme-court-texas-law-porn.html\n\nShould Congress make them nationally? Clinton back in 90s signed such similar law but the courts sturck it down on the first amendment grounds, but seems like now the court is more tolerant to such regulations.",
  "author": "torytho",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »The following is a copy of the original post to record the post as it was originally written.Obviously adults should be able to watch  porn if they want, but I mean we do not allow kids to even drink until they are 18. Age verification laws require you proof that you are 18 to use stuff like Pornhub. Some more libertarians say \" oh gubmint survivance\", which I mean is one criticizm I can understand where it is coming from, even if I do not buy it myself. Some states have such laws, seems like SCOTUS will allow them based on oral arguments. Should federal government have them too? Clintin back in 90s signed such law but courts sturck it down in first amandment grounds, but seems like now court is more tolerant to such regulations.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "jar36",
      "timestamp": "",
      "body": "You don't have to be a libertarian to not want big brother in your browsing history"
    },
    {
      "author": "Orbital2",
      "timestamp": "",
      "body": "Don't like them, but it's mostly because I don't think those sites should be collecting that kind of data on users.Parents can monitor their own kids internet usage."
    },
    {
      "author": "othelloinc",
      "timestamp": "",
      "body": "What do you think about age verification laws ?I don't object to them on principle.However, I am a bit concerned about implementation. Can this be done effectively? Can it be done without privacy violations?...and...is this actually the endgame of the people pushing for it, or are they just trying to get their foot in the door for a complete ban on pornography?"
    },
    {
      "author": "FifteenEchoes",
      "timestamp": "",
      "body": "Can this be done effectively? Can it be done without privacy violations?It absolutely cannot. Digital data safety is fundamentally a losing game, at least for organizations that aren't literal CIA blacksites. It's why high-profile data breaches from big-name companies happen every year. It's not that they're not trying hard enough, it's that no amount of human care and investment can ever hope to patch all the vulnerabilities in a system of this scale and complexity. The only way to guarantee sensitive data won't be leaked is to not store it at all, and most certainly to not store it in a database that has access to the Internet....and...is this actually the endgame of the people pushing for it, or are they just trying to get their foot in the door for a complete ban on pornography?I mean obviously it is, look at Project 2025."
    },
    {
      "author": "Different-Gas5704",
      "timestamp": "",
      "body": "I believe in parents, not the government, being responsible for their children. Don't want your kid watching porn? Put a blocker on their devices. Don't want your kid going to Drag Queen Story Hour or playing Doom or listening to Twisted Sister? Don't let them. However, you have no right to parent other people's kids.If the GOP actually cared about keeping kids safe, they would be calling for RICO investigations into the Catholic Church, the Southern Baptist Convention, and other groups found to have abused thousands of children and subsequently protected the abusers from punishment."
    },
    {
      "author": "MountaineerChemist10",
      "timestamp": "",
      "body": "I don’t think it’ll make a difference.Because if you’re going to restrict pornography from teenagers & attempt to prevent porn addiction, then why haven’t you done anything to prevent Problematic Social Media Use (PSMU) yet?"
    },
    {
      "author": "BoratWife",
      "timestamp": "",
      "body": "I imagine it would be better for people to advocate that parents don't give kids unlimited access to the Internet all day every day.Remember when Republicans would say that the scariest thing you could hear is 'I'm from the government and I'm here to help'?"
    },
    {
      "author": "prasunya",
      "timestamp": "",
      "body": "I'm against it."
    },
    {
      "author": "torytho",
      "timestamp": "",
      "body": "Most age stuff is just evangelical nonsense."
    }
  ]
}