{
  "subreddit": "australia",
  "post_id": "1g3pb1l",
  "title": "It’s not just a ‘teen social media ban’, it’s a national age verification scheme",
  "body": "",
  "author": "vacri",
  "comments": [
    {
      "author": "drayraelau",
      "timestamp": "",
      "body": "Yeah this whole thing makes no sense.What counts as social media? Facebook? Twitter? Discord? Youtube? Twitch?And now we're going to have to supply them all with our ID just to prove we're over a certain age and trust them to not misuse that?Sounds like a great, well thought out idea."
    },
    {
      "author": "Yrrebnot",
      "timestamp": "",
      "body": "Take it further. Are forums social media. What about sites with forums? Help desks? Does Steam count? The whole thing is stupid all the way down."
    },
    {
      "author": "aldkGoodAussieName",
      "timestamp": "",
      "body": "My Facebook account is older than the required age limit. Who would I still need to provide ID?"
    },
    {
      "author": "Nixilaas",
      "timestamp": "",
      "body": "You know all those data breaches we’ve been having, well here’s our plan to make them worse!"
    },
    {
      "author": "Asmodean129",
      "timestamp": "",
      "body": "Can't be enforced, this has been shown in other countries. It is also straight up dumb and a waste of taxpayer money/resources.Needs to be scrapped ASAP."
    },
    {
      "author": "evmcl",
      "timestamp": "",
      "body": "It is actually worse than that. It is not just an age verification scheme, it is anidentityverification scheme. Otherwise, how would you verify a person's age?"
    },
    {
      "author": "FakeCurlyGherkin",
      "timestamp": "",
      "body": "This is the real story. It's a national ID scheme by stealth. Governments have been wanting this for decades (e.g. the \"Australia Card\" in the 80s)"
    },
    {
      "author": "GloomyFondant526",
      "timestamp": "",
      "body": "Government makes up weak piece of garbage ban to make it look like it's doing something, is a bit long for a headline."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "This is going to be unworkable and will likely be delayed over and over again until it is scrapped. Also how they announced all of this has been very cart before the horse."
    },
    {
      "author": "vacri",
      "timestamp": "",
      "body": "until it is scrapedTypo is also accurate."
    }
  ]
}