{
  "subreddit": "privacy",
  "post_id": "182wgy5",
  "title": "One way age verification could be exploited by criminals",
  "body": "I believe it is crucial to bring attention to the potential risks of age verification methods, particularly in obtaining recordings of individuals without their explicit consent. I seek to promote how actively harmful these policies are, with specific concern to the privacy and security of women.\n\nThis post will explore the potential risks associated with fraudulent age verification websites, specifically addressing their capacity to conduct unauthorized surveillance on users by webcams. This post discusses age verification methods reliant on webcams, including those involving document and biometric verification techniques.\n\nI hope the information is clear, I am considering further elaboration on this topic in a potential future article.\n\nOne method threat actors can use is the manipulation of the Domain Name System (DNS), a system responsible for translating domain names into corresponding IP addresses.\n\nDNS hijacking involves a threat actor altering DNS settings to redirect users to undesired content, typically ads or an alternative search engines. This same approach is also utilized for DNS blocking, as seen in the EU, where Internet Service Providers employ it to restrict access to pirate websites, due to its efficiency and minimal collateral damage (compared to IP blocking which could block totally innocent sites).\n\nI personally encountered a situation earlier this year where my Google Chrome browser repeatedly redirected to Bing and displayed ads for blatant drop-shipping sites. Upon investigation, I discovered that a video download extension I had installed was the source of the issue.\n\nWhether it was inherently malicious or became compromised through acquisition or updates is anybody’s guess, however the problems ceased upon removal of the extension. I was not aware of the situation primarily because of my consistent use of a virtual privacy network, which modifies my DNS settings and likely prevented the malicious extension from redirecting me from Google to Bing or serving ads. I am sure it was a DNS hijacker and not adware due to that.\n\nAlso In 2022, it was discovered that a browser colour modification extension exhibited similar behaviour, these extensions are out there and can be abused.\n\nIt is conceivable for threat actors to use this method, redirecting individuals attempting to access adult websites to deceptive or otherwise bogus age verification website. A threat actor could discreetly establish an innocent looking extension, purporting to provide something like local weather information or enhance website font size on websites for people with eye sight issues. Then when a user attempts to access an adult website, the extension could redirect them to a fake age verification site. Something like a fake YOTi page.\n\nThis deceptive age verification website may coerce users into granting access to their webcam under the guise of biometric or document based age verification, enabling the unconsensual recording of the user's webcam activity, It’s a creeps dream.\n\nThe risk of such crimes does not necessitate any downloads as well; rather, threat actors could easily establish a deceptive adult website hidden behind age verification measures.\n\nThere is already a fake Pornhub website that exists with an obscure domain extension, it’s obviously a fake Pornhub site when you visit it. The primary purpose of this site is not data theft or deception; rather, it serves to circumvent restrictions present in certain countries such as India and Pakistan. To bypass blocks on adult websites in these regions, the content is hosted on another separate domain.\n\nHowever, obscured by an age verification page, the inherent risks associated with this website significantly increase. The website's legitimacy is unable to be verified without potentially giving it your sensitive info and allowing it access to your webcam. This situation even enables the potential for threat actors to populate a site with illegal material, waiting until a victim verifies their age and identity to then exploit them through blackmail. People won’t go to the police, people will take their lives.\n\nI have yet to address additional potential risks associated with these systems, such as invasive webcam surveillance akin to how Remote Administration Tools (RATS) are used now, the majority of victims being women or teenagers.\n\nThe lobbying efforts undertaken by age verification companies in support of these policies have, in certain instances, positioned them in a manner that potentially shields them from legal or regulatory repercussions by the government.. For example, within the context of the United Kingdom, the Age Verification Providers Association, a profit oriented trade group actively involved in lobbying the government for age verification implementation, could potentially exploit their ability to withdraw from the UK jurisdiction in response to any intervention by regulatory bodies such as the Information Commissioner's Office (ICO) or the Department for Digital, Culture, Media & Sport (DCMS).\n\nThis situation presents a catch 22 moment for the government, creating a situation where pursuing legal action against these entities becomes a challenging prospect. The fear of backlash from various \"children safety\" advocacy groups and campaigners could cast the government as weak towards adult websites.\n\nAn instance highlighting this issue arose when it was disclosed that the Department of Education had shared children's information with betting firms to prevent the opening of accounts by underage individuals. Given the timeframe, it is likely that my data was included in this.\n\nRather than pursuing formal action against the Department of Education, the Information Commissioner's Office (ICO) sent their concerns through a strongly worded letter. Despite the potential risks, such as the misplacement of this data or a threat actor carrying out a data breach once they reach adulthood.\n\nA similar response may be expected in the event that age verification companies like YOTi are implicated in recording users and selling such information to data brokers—though it’s crucial to clarify that I am not asserting YOTi’s involvement in such a scheme. However, the implementation of policies involving a severe intrusion into people’s privacy increases the likelihood of such occurrences over time.\n\nProfit over privacy (and people)…",
  "author": "YetAnotherPenguin13",
  "comments": [
    {
      "author": "YetAnotherPenguin13",
      "timestamp": "",
      "body": "age verification methods reliant on webcams, including those involving document and biometric verification techniquesJust never agree to it and don't forget to add that you won't be using the service for that very reason, these bastards know how to count money and when there are enough people like that, they will be forced to make some concessions."
    }
  ]
}