{
  "subreddit": "samsclub",
  "post_id": "1fxrbsu",
  "title": "Age verification for alcohol",
  "body": "Does anyone know why Sam’s club raised their age verification for alcohol to 44 years old?!! I live in NC was trying to get some wine and they told me they changed their age verification from 27 to 44. That just seems excessive also such a random number",
  "author": "EducatorMoti",
  "comments": [
    {
      "author": "TableRockFish",
      "timestamp": "",
      "body": "If you are of age and can provide the required ID why does it matter?"
    },
    {
      "author": "iceman9819",
      "timestamp": "",
      "body": "That’s what I thought but she put it in the system and it still said age verification failed. They even called a manager cause I was like that makes no sense and they said you have to be 44 to purchase it"
    },
    {
      "author": "mrBill12",
      "timestamp": "",
      "body": "I’m greater than 60, both Costco and Sam’s ask for my ID everytime.  I just have my ID out and ready.  Only time it’s been an inconvenience was when my license was expired—only a few days— but they wouldn’t accept it.  (I actually didn’t realize it had expired.  Fortunately my wife was there.)"
    },
    {
      "author": "iceman9819",
      "timestamp": "",
      "body": "Yeah and I’m over 21, and they put it in the system at the checkout and everything and it still said age verification failed and then the manager came over and was like yeah you have to be 44 or over. I’ve bought alcohol at Costco before and didn’t have any issues. It was super weird!"
    },
    {
      "author": "linktlh",
      "timestamp": "",
      "body": "We're just matching what Walmart already does. Even if you don't look that, we just have to ask for ID. It doesn't change anything on your end really, beyond if you happen to look 27, and now no longer qualify for not requiring ID check."
    },
    {
      "author": "CertifiedYorkie",
      "timestamp": "",
      "body": "It tickles me that Walmart kids (I'm likely old enough to be his grandmother) asks for ID. The one that brought my pickup order to me on Friday must have read the entire front of my DL making mm hhm noises. I now wonder if he was old enough to be bringing my husband's beer out of the building. I've not shopped in store forever, but remember if an under age person was running a checking out line, they had to get an \"adult\" to check me out."
    },
    {
      "author": "Dolphin_Hornet",
      "timestamp": "",
      "body": "This could have been easily handled in 30 seconds at the club..."
    },
    {
      "author": "CXTKRS1",
      "timestamp": "",
      "body": "Even when I have been ID the associate just puts something random on the screen"
    },
    {
      "author": "EducatorMoti",
      "timestamp": "",
      "body": "What happened when the manager showed up? Did the manager make sure that the employee put in the date correctly?"
    }
  ]
}