{
  "subreddit": "onguardforthee",
  "post_id": "1bzv0yb",
  "title": "Requiring age-verification for porn won’t save children from online harm. But it will invade our privacy",
  "body": "",
  "author": "[deleted]",
  "comments": [
    {
      "author": "jmac1915",
      "timestamp": "",
      "body": "When will the parents pushing for this shit take responsibility for what their goddamn children have access to?"
    },
    {
      "author": "fredy31",
      "timestamp": "",
      "body": "How did little timmy see sodomy? Wont someone think of the children???Did you, idk, install firewalls, make sure your kid doesn't have 100% free access to the internet (like the tablet in his room with no supervision)No ITS THE GOVERNMENT THAT SHOULD DO SOMETHING.ffs, my dad had an easy solution to this; no PCs in our rooms, the family pc was in the middle of the living room. That makes you wont watch porn lol"
    },
    {
      "author": "remimorin",
      "timestamp": "",
      "body": "Exactly this and only this.Legislation is not a substitute to parenting and never was."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Isn’t that part of the reason Pornhub restricted access in Texas, because of the very obvious privacy issues for users?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Isn’t that part of the reason Pornhub restricted access in Texas, because of the very obvious privacy issues for users?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "The excuse on Reddit is that they pushed it so JT would push out the online harms bill. Nobody should be fond of either one."
    },
    {
      "author": "OutWithTheNew",
      "timestamp": "",
      "body": "The excuse on Reddit is that they pushed it so JT would push out the online harms bill. Nobody should be fond of either one."
    },
    {
      "author": "howismyspelling",
      "timestamp": "",
      "body": "I don't care how many people view me as immoral or gross in public socials or just in general public, I will alwaysalwayspush back against this insane overreach power grab. It happens to be over a situation that people view me as defending porn for minors, or being perverted myself, but it's in fact just about upholding my personal right to freely and anonymously navigate the free web. The kids who want to will always find a way to get the access, so it's not at all going to accomplish what they claim it will accomplish. The most ironic part is I actuallyin a sensebelieve that a digital ID can actually solve many issues in society, and a social credit scorecouldactually clean up some social dumpster fires we have in society today; but theremustbe boundaries, there is a fine line between helping and having control in this predicament. The bottleneck is always humans, humans are flawed, and can lie, and can obfuscate, and manipulate, and change their mind, and take, and the list goes on. Humans can be horrible people, and the problem is that the better humans typically don't want the job of leading a country because they know better."
    },
    {
      "author": "reinKAWnated",
      "timestamp": "",
      "body": "And most saliently, it will be used as a cudgel to stifle and further oppress marginalized groups like the LGBTQ+ community and sex workers.Our Conservatives will do their damndest to follow suite with their southern counterparts (who they envy) and start with \"porn\" in the commonly-understood sense, and very quickly start decreeing that anything to do with queer people/identities is *also* \"porn\" or \"adult materials\", and try to crack down on educational resources and even just \"media that has queer characters in it\" in a direct attack on free speech.Because that's what this is really about."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "The government needs to stop wasting time and resources on garbage like this. Let individuals take care of protecting their own children. It is impossible to enforce on every porn site on the internet anyway. The government is not supposed to act as a moral police."
    }
  ]
}