{
  "subreddit": "VRchat",
  "post_id": "1hi3l5p",
  "title": "My only concern that's stopping me from verifying my account to 18+",
  "body": "Age verification certainly has its advantages. It provides a huge level of security against underage and malicious users, and being able to properly control access to 18+ groups is a great step towards making VRChat a safer and more enjoyable environment for adults.\n\nHowever, today, I want to focus on a serious concern that I have. what happens if you are falsely banned? What if you are unjustly, unjustifiably banned and find yourself caught in the system? I know from experience that false bans are very real. I got hit with a month long temp ban after someone, a former friend, spam reported me after I unfriended them. Thankfully, I was able to appeal it and had it lifted, but I know this is not the case for everyone.\n\nThere are many instances of people being caught in coordinated report attacks and facing permanent or IP bans. They may even be caught in the crossfire of something they had no part in. When these players submit appeals to VRChat, sometimes, they are ignored or declined. The consequence is devastating, they're left with either a new account or an entirely new computer.\n\nMy biggest worry, as a regular and positive community member in VRChat is the possibility of getting verified and then being falsely accused. It's not that I worry about being banned in general, I try my best to be a good sport. But here's the thing, if I happen to run into the wrong group of people who decide to spam report me, maybe even someone I'm friendly with is targeted and they decide to target me to get me permabanned, or whatever happens, I would have to rely on the appeal process to get cleared. If VRChat’s support doesn't see it or declines it, then I am out of luck. I'm screwed, and I won’t be able to verify another account. I’d be locked out of the benefits of age verification, and in that case, I would be back to square one.\n\nThis concern is a huge factor in my hesitation to verify my own account. It feels like there’s no real safety net in place if you are unjustly targeted.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "LegallyRegarded",
      "timestamp": "",
      "body": "i mena, i guess you'd have to talk to VRC mods jsut like you would any other time youd get banned. The only thing the 18+ verification would stop you from doing is making another acount and verifying again, which I think is a good thing, because that means people who are verified will be less likley to be shitheads."
    },
    {
      "author": "Careful-Kiwi9206",
      "timestamp": "",
      "body": "no because i literally got banned a month or so ago for client modifications, i don’t even have a pc AND I DONT KNOW HOW TO USE CLIENTS 😭😭(i tried to appeal it and i never got a response)"
    },
    {
      "author": "Hades6578",
      "timestamp": "",
      "body": "I was banned for a similar reason, no response other than the instant deny I got for the first one. It’s not just you and I’m worried that this may be due to mods power tripping."
    },
    {
      "author": "Artificial_Lives",
      "timestamp": "",
      "body": "This is a positive.If you get banned and deserve it im glad you'll be locked out of verification if you make a new account.If banned and didn't deserve it you appeal it just like you do now .The only reason I see people annoyed by this is if they want to be shitty and just make new accounts"
    },
    {
      "author": "Hades6578",
      "timestamp": "",
      "body": "I mean if their appeal system actually worked and they didn’t turn down submissions with robots…"
    },
    {
      "author": "IkouyDaBolt",
      "timestamp": "",
      "body": "If banned and didn't deserve it you appeal it just like you do now .Over the past 20 years, I've played a handful of various video games.  Whether it be virtual pet sites, MMORPGs, FPSes...The issue persists where an actor can craft enough inquiries and the account is locked.  We're in 2024, we shouldnotbe having to worry about it.  World of Warcraft currently has this issue.If it were something like a temporarily lock on an account until an actual human reviews the data and decides appropriately on the user's behalf that's one thing.  As it stands, needing users to jump through hoops could easily be utilized to put more strain on VRChat's staff than they already have.Aside: I had an Apple account deactivated for a similar reason.  Imagine having a disabled iPhone for 24 hours."
    },
    {
      "author": "Hades6578",
      "timestamp": "",
      "body": "I got falsely banned before the age verification bit, they’re continuing to ignore me, I need to get through to them because it was very wrong"
    },
    {
      "author": "XxXlolgamerXxX",
      "timestamp": "",
      "body": "The thing is: that also can happen even without verification, a lot of people dont have the posibility to change hardware or ip. So is the same imo. Also Persona and VRChat dont store personal data after the verification, just the date of birth and a hash, using another method of verification in theory would generate another hash."
    },
    {
      "author": "Acceptable-Bat-9577",
      "timestamp": "",
      "body": "I’d be more concerned by the fact that this Persona company is currently facing a massive lawsuit for misusing personal data for their own profit and benefit."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "That's not what the lawsuit is about. It's a suit from Illinois (a state with some of the most strict data laws) that is stating Persona has stored data without the proper channels of consent of that data being stored."
    }
  ]
}