{
  "subreddit": "changemyview",
  "post_id": "1bz23lw",
  "title": "CMV: A minor lying about their age on a dating app is NOT a victim.",
  "body": "I need to explain fully what I mean. Let’s say you’re on a dating app, take Grindr for example. Then you start talking with a person who says they’re 18 and looks 18, and you start sexting. Let’s then say it turns out the person you’re talking to actually is 16. Who is in the wrong then? I don’t understand this. Cause to me it’s so obvious who’s in the wrong, the 16 year old… They lied about their damn age, so how could you be the one in the wrong then? But, apparently you could be the one facing charges then? Right? How… That’s literally so messed up. But it feels like society would view the 16 year old as the victim, or am I wrong??",
  "author": "Wand3ring3yes",
  "comments": [
    {
      "author": "reginald-aka-bubbles",
      "timestamp": "",
      "body": "Honest question since i've never used one, but is there any form of age verification for these sites?"
    },
    {
      "author": "Real-Ruin-5446",
      "timestamp": "",
      "body": "Not from my knowledge. I’ve never had to verify while making Grindr."
    },
    {
      "author": "Ancquar",
      "timestamp": "",
      "body": "Never used Grindr, but on Tinder you have a whole lot of women from 19 to early 20s whose profile text literally says that they are a year or two younger than their age in profile. I always assumed that a significant number of them ended up with this discrepancy because they created the profile before 18, but obviously did not explicitly write their actual age before 18."
    },
    {
      "author": "madamevanessa98",
      "timestamp": "",
      "body": "Lying about your age is wrong. However, IMO a lot of people are also pursuing 18 year olds who should be aiming older to begin with (personally I think anyone over 22-23 shouldn’t be dating 18y/o) and I think the less time you spend around kids/teens the worse you get at gauging their age. Sometimes you can absolutely tell that someone is young, and in those situations you should be verifying their age yourself to be safe, or date OLDER people who you don’t have to wonder are too young. I think a lot of the time when a girl lies about her age especially, men can tell she looks young but they don’t really care, they’d rather not ask, fuck her anyway, and have plausible deniability. You should never be so horny that you don’t use your judgement."
    },
    {
      "author": "TateIsKing",
      "timestamp": "",
      "body": "In most jurisdictions it's a strict liability crime, meaning even if the minor shows a fake ID that looks real, the adult has no defense."
    },
    {
      "author": "SMA2343",
      "timestamp": "",
      "body": "I know in many places that’s a defence for Statutory rape.For example, you’re at a club. You flirt with a girl and you go back and have sex. You have down your due diligence by 1) asking her “how old are you?” And if she says 21 you can think: “well you are in club, and holding an alcoholic drink. I can deduce you are of legal age.”There was many stepping stones for the underage person to pass through to get to you. The bouncer that checks the ID. Maybe even the person giving drinks checks ID as well. And if she had a good story of she’s in university taking classes and knows professors names for some reason.There was a lot for you to believe she is of legal age."
    },
    {
      "author": "Poly_and_RA",
      "timestamp": "",
      "body": "Do you have a source for that claim? In my jurisdiction (Norway) that isNOT true.Instead the rules about age of consent here go like this:The age of consent is 16 -- it's legal for anyone not in a position of authority or a near relative to have consensual sex with people above that age.There's no punishment for sex with someone under 16 if the involved are similar in age or development; not codified in the law exactly what this means but if you look at verdicts you see that courts have tended to interpret this as less than 3 years of age-gap is okay. (so a 17 year old with a 15 year old partner won't get in trouble, but a 19 year old with a 15 year old partner will)However, if the younger person is older than 14, then sex with them is punishable only if the older person either knew, or SHOULD have known that they are too young. If they have no blame for not knowing this, then there is no punishment. A case I remember is a guy who got accused of sex with an underage girl after he'd had sex with a girl he'd met in a bar. She had faked her ID to get in even though she was only 15. Court said it's *reasonable* to believe that women you meet in an 18+ bar are in fact older than 16, so he wasn't to blame for not knowing that she is underage -- and thus acquitted."
    },
    {
      "author": "Kotoperek",
      "timestamp": "",
      "body": "You should usually have at least a brief conversation with someone before you start sexting them, especially since they look very young as in close to 18 and you aren't sure whether they really are. If someone is making up an entire persona and lying about their job when they are really in school and so on, that is on them I guess. But usually it is easy to see someone is a minor by the way they text and their choice of topics. If you're also barely 18 or 19, it's fine, nobody would charge you with pedophilia for interacting with a 16-year-old. If you're in your twenties maybe just don't date barely legal teens as a rule of thumb."
    },
    {
      "author": "DoeCommaJohn",
      "timestamp": "",
      "body": "I’d still say that they are a victim, but their date on the app is not the perpetrator. However, a minor who believes that they should be dating an adult is likely in a bad situation through some combination of parental neglect and outside influences (friends, social media, etc). If we can agree that the child should not be doing that and a typical child would not be doing that, and a child is not fully responsible for their actions, that must mean they are a victim on some level"
    },
    {
      "author": "Wand3ring3yes",
      "timestamp": "",
      "body": "Nah dude, you're in the wrong. My protocol when it came to online dating was to always ask age, and if they aren't of age to be on the site, report them (multiple times if necessary) and stop messaging. In the long run getting them banned will save them from eventually coming into contact with a creeper."
    }
  ]
}