{
  "subreddit": "Destiny",
  "post_id": "1i3kmbx",
  "title": "What is your opinion on age verification on porn sites?",
  "body": "I have conflicting feelings on it. It makes a lot of sense to me that you would have to verify your age to view porn online. I think that it is currently way too easy for underage people to watch porn online, but I would also never upload my id onto a porn site.\n\nI do think that going forward we are going to need more strict age verification, not just for porn but probably for a lot of online content, but I don't know what the best way to implement that would be.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Blondeenosauce",
      "timestamp": "",
      "body": "it’s cringe, I don’t trust Republican attorneys general not to fuck with requested user data."
    },
    {
      "author": "Booboononcents",
      "timestamp": "",
      "body": "I’m also concerned about how secure the user data is going to be stored."
    },
    {
      "author": "Cellophane7",
      "timestamp": "",
      "body": "If I have to give my ID to watch porn, that's an insane fucking invasion of privacy. And for what? So kids won't watch porn? Who gives a shit? Is there a single person alive today who didn't at leastpeekat porn out of curiosity when they were underage? How many of our ancestors stole nudie magazines and hid them from their parents? How long are we gonna pretend teenagers are asexual creatures when they're in the middle of exploding sexually, metaphorically and literally?It's extreme government overreach for absolutely no legitimate reason. The only goal these fascists have is to control us as much as possible so they can keep us in like. I couldn't possibly oppose this shit more."
    },
    {
      "author": "FrostyArctic47",
      "timestamp": "",
      "body": "And where's the line going to be? Conservatives have already argued that any mention, reference, depiction, acknowledgement of gays, in any way, is pornographic, among other things."
    },
    {
      "author": "dabicus_maximus",
      "timestamp": "",
      "body": "They just want to pull the ladder up from behind them. I watched the most insane gooner shit back when I was 12 and would edge for weeks on end.And look at me now! I contribute to the economy by having my mom by dino nuggets and I pay money to my favorite streamers."
    },
    {
      "author": "Top_Gun_2021",
      "timestamp": "",
      "body": "It's the parents/network admins job to restrict access."
    },
    {
      "author": "Public-Variation-940",
      "timestamp": "",
      "body": "Nothing wrong with it in principle, it’s just practically ridiculous."
    },
    {
      "author": "TheMarbleTrouble",
      "timestamp": "",
      "body": "It’s a way to avoid fixing the issue, while painting those that have solutions as wanting kids to watch porn.The issue is that parents do not have time to be with their kids. Watching porn or watching Tate, is the direct outcome of parents not being able to be with their kids. We need things like the child tax credit proposed by Harris, but beyond first few years. The priority should be helping parents be able to inhibit bad behavior of their kids, regardless of it being porn or tide pod eating tick tock challenges.This ban will not impact a single porn site that broadcasts from outside US. The only sites that will be impacted by this are the legitimate sites like PornHub, that don’t really have some of the nastiest shit online. Two girls and a cup is one of the nastiest porn that is commonly known, which hit mainstream without just being on a porn site. To execute the ID restriction effectively, they would need national filtering that currently exists in China and Russia. Not just for porn sites, but all sites being able to display images or video… which is all of them.This will not solve the problem, but becomes an excuse to avoid addressing the problem and might result in significant limitation to what is viewable on US Internet."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It's inevitable but there are much better ways to do it. Pornhub is trying to push for device based authentication where your Apple/Google/Microsoft account has a proven ID verified age set. The porn service (or any other 18+ site) then makes an anonymous call to them and due to restrictions placed on those accounts, can only retrieve validation of your age. Apple/Google/Microsoft would have no idea what the service is, just that you authorized something to verify your age. I think this is much better than submitting your photo ID or image of your face to an unknown third party."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It's fucking regarded to make Americans give their identifying information to access porn. This shit could be breached and that's how you end up with data hackers threatening to send your porn searches to your family unless you pay 500 dollars. Or even worse, politicians pressured to vote for specific laws under threat of revealing their porn browsing habits. Nothing good comes of this."
    }
  ]
}