{
  "subreddit": "australian",
  "post_id": "1gte9z6",
  "title": "No-one's really sure how age verification will work on under 16s social media ban",
  "body": "",
  "author": "xiphoidthorax",
  "comments": [
    {
      "author": "Icy_Caterpillar4834",
      "timestamp": "",
      "body": "Remembering our government used cheap servers to deploy the ATOs portal. Crashed immediately when users tried to submit a tax return online. This was an industry joke for many years until the many IT fails of COVID. More recently the government low-key removed IP Cameras from secure buildings due to the hardware and software being of CCP design and manufacturing. You would think designing/manufacturing IP Cameras locally would be a win/win and ensure a high level of security. You have absolute shit for the brains of you feel any government in Australia can solve the issue of minors on social media"
    },
    {
      "author": "Manmoth57",
      "timestamp": "",
      "body": "About 5 minutes then some 14/15 year old will crack the road block and it’s game over"
    },
    {
      "author": "VorpalSplade",
      "timestamp": "",
      "body": "There was proposals for mandatory internet filters in the early 2000s - my mum worked with an internet lobby at the time and managed to get a test copy of the internet filter software. I can confirm it took me about 5 minutes as a 15 year old to crack then (I just had a website with frames open the porn in a separate frame)."
    },
    {
      "author": "VorpalSplade",
      "timestamp": "",
      "body": "It simply won't, it's ridiculous. They can't even ban piracy sites, who obviously aren't following the law - why would they be able to stop other sites?Driving kids away from 'big safe sites' and into the dark web where there's really fucked up shit is such a dumb idea."
    },
    {
      "author": "FrogsMakePoorSoup",
      "timestamp": "",
      "body": "We've apparently gotta support it before we'll learn how it works.Because that's exactly how you run an IT project."
    },
    {
      "author": "Ibvkoff",
      "timestamp": "",
      "body": "Sounds just like the voice."
    },
    {
      "author": "jonnieggg",
      "timestamp": "",
      "body": "Safety and the common good are always the excuses of the tyrant. It's always done in your best interest"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Anyone who believes this is about protecting kids is utterly delusional"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "\"Safety\" is always the excuse to implement censorship.It'll be as effective as porn websites 'verifying' people are over 18 when they enter the site."
    },
    {
      "author": "xiphoidthorax",
      "timestamp": "",
      "body": "By making this about kids, the complacent adult doesn’t think it’s going to impact them."
    }
  ]
}