{
  "subreddit": "CamGirlProblems",
  "post_id": "1ikav6n",
  "title": "Age verification laws, Project 2025, Porn bans and YOU!",
  "body": "For the last year I've seen lots of posts about these topics or posts not about these topics where these things have come up.  I've seen a lot of people say a lot of things.  I've seen sex workers supporting laws that are actually not only harmful to us as sex workers but to us as women and harmful to everyone INCLUDING children.\n\nSince I haven't seen a really in depth post talking about it I figured....why not post it myself?  As sex workers we are in a very unique position to have conversations about this with people.  And I think at the very least we should be educated on the laws that impact us and our work.\n\nI'm not an expert.  Im just someone who is passionate about not losing the rights to my own body and what I do with it and have been trying my best to keep up with this stuff since I learned about Project 2025.  Knowledge is power so dig in.\n\n---------------------------------------------------------------------------------------------\n\nAs of today these 18 states have passed laws requiring adult websites to verify the age of people visiting their sites (Georgia will join this list Effective July 1, 2025):\n\nAlabama: HB 164, effective October 1, 2024\n\nArkansas: SB 66, effective April 11, 2023\n\nFlorida: HB 3, effective January 1, 2025\n\nIdaho: H 498, effective July 1, 2024\n\nIndiana: SB 17, effective August 16, 2024\n\nKansas: SB 394, effective July 1, 2024\n\nKentucky: HB 278, effective July 15, 2024\n\nLouisiana: Act 440, effective January 1, 2023\n\nMississippi: SB 2346, effective July 1, 2023\n\nMontana: SB 544, effective January 1, 2024\n\nNebraska: LB 1092, effective July 19, 2024\n\nNorth Carolina: HB 8, effective January 1, 2024\n\nOklahoma: SB 1959, effective November 1, 2024\n\nSouth Carolina: HB 3424, effective January 1, 2025\n\nTennessee: SB 1792, effective January 1, 2025\n\nTexas: HB 1181, effective September 19, 2023\n\nUtah: SB 287, effective May 3, 2023\n\nVirginiaSB 1515, effective July 1, 2023\n\nThese laws require websites with 33.3% or more pornographic content to verify the age of users by requiring they upload a government issued ID and in at least one state (Utah) facial scans are required.\n\nThere are currently23 other stateswhere age verification bills have been proposed (you can view them and track the status of these bills here:Free Speech Coalition Age Verification Bill Tracker)\n\nSome of you may be thinking \"That's great!  I don't want underage people viewing my content!\" and well, I don't think ANY of us want that.  But THIS IS NOT THE ANSWER.  Because this isn't actually about protecting children (just like abortion rights arent about protecting children either).\n\nWhy not???\n\nThere is currently no way to enforce these laws.  Websites do not have to comply.  Especially if they are not based in the US.  This means the sites that do comply are not only losing a ton of money (age verification can cost a business over $1 per user - that is an enormous business cost when you consider billions of people look at porn every day) they're also losing a ton of traffic since most people will NOT upload their ID and will choose to visit a site that HASN'T implemented age verification.\n\n\"Well Inky, if users don't want to upload their ID they can just go elsewhere for their porn since there are sites who aren't following the laws!  So they still have access to porn!  It's not a big deal!\"\n\nYup, they do still have access to it.  But they'll have access to it through sites who are choosing not to comply with state/federal laws.  So guess which other laws those folks probably aren't paying too much mind to?  The ones that keep content of minors and sex trafficking victims off their platform.  The types of sites who exploit the people whose content is being consumed.  So do we really want to give them MORE traffic?  This IS a big deal.\n\nAnd don't forget as more and more of these laws are passed we WILL see it impact our traffic as workers.  Do YOU want to work for a platform that doesn't mind breaking the law?  You think they're going to give you a good cut and treat you well especially when they know we have no where else to go to work?  Not a chance.\n\nThese laws will end up punishing those who follow the law with higher operating costs and decreased traffic which will put many adult sites out of business and this will drive business to platforms who don't follow the law - exposing the adults and minors who use them as alternative to illegal content worse than porn.\n\nBut wait....there's more!\n\nIt is unconstitutional and poses a threat to our first amendment rights to free speech.\n\nPrivacy concerns.  While companies are barred from retaining AV data, simply transmitting it leaves people open to data breaches.  And this alone creates the opportunity for criminals to obtain this data and use it to blackmail people (think about those \"I know what you've been watching and if you dont send me $1 million dollars in bitcoin immediately I'll send it to your family and friends\" scams....but make it REAL because they would have your name, address etc not to mention possibly have your porn browsing history but for real this time).  Not to mention how this info could be used to \"out\" LGBTQ individuals or accuse people of being in that community because of the porn they watch.\n\nKids know how to use VPNs. A recentstudyshows 41% of kids aged 11-14 already use a VPN to browse the internet. Surely this number is higher now - bottom line its not going to stop kids from seeing porn.  We should be focusing our efforts on educating kids about porn and how its not for them and that it's not real and that things conversations about consent and boundaries and testing all take place even if you don't see it etc. That sex work is a job and people who do it deserve respect and all that good stuff that simply saying \"DONT LOOK AT IT\" wont address.  We know that when you tell someone they're not allowed to do something they just want to do it more.....this will be no different.\n\nWell if these laws don't effectively keep children safe what are they for?\n\nIt's pretty simple, really.  They want to ban and criminalize porn entirely.  These laws aim to put adult sites out of business.  If enough states hop on board (and if you did the math 19 states already have bans and 23 have bans proposed - thats 42 states....) the costs of age verification alone would be enough to hurt a business.  But pair that will decreased traffic because people will go to sites not complying and its a recipe for exactly what they want.\n\nAnd it's very important to note that conservatives don't have the same definition of porn that we do.  They believe anything having to do with sexuality or gender is porn.  This means sex education and anything connected to LGBTQIA individuals or communities is porn.  And on page 5 of the foreword of Project 2025 they make it very clear that they want to ban and criminalize porn.  It says:\n\n\"Pornography should be outlawed. The people who produce and distribute it should be imprisoned. Educators and public librarians who purvey it should be classed as registered sex offenders. And telecommunications and technology firms that facilitate its spread should be shuttered.\"\n\nThis will not just criminalize sex workers and the platforms we use for our work it will also criminalize gay/trans folks and we'll all be classified as sex offenders.  Because in their eyes thats exactly what we are. We are a threat to their idea that marriage should be between a man and a woman, that sex is for procreation, the list goes on.  WE ARE A THREAT.\n\nWhich brings me to the other thing this is really about.  Controlling women and our bodies.\n\nNotice the wording in the above statement.  People who produce and distribute porn should be imprisoned.  Kind of convenient that men who consume it aren't going to prison, right?  Because boys will be boys and it's a womans fault for being a temptress.  So we'll be the ones punished despite the fact that this work only exists because of the demand for our bodies from men.  And that demand isn't going to go anywhere.  They just won't have to pay for it anymore.\n\nSo what will happen?  Well...thats TBD but I don't for one second put it past them to imprison sex workers and offer us up as sex slaves or handmaid types to billionaires or anyone else who can afford it. They have no respect for us, they want to govern our bodies....so whats to stop them, really?  This is Trump and his buddies we're talking about after all.\n\nAnd to anyone who thinks \"well it'll be 4 years and then it'll all get overturned\" don't forget that Trump has no plans on leaving office.  And even if he does he is working diligently to turn everything over and everything is being run by his pals.  We can NOT ignore what is happening.  We certainly have to stop being BLIND to it and only thinking about \"well its not my state\" or \"well I haven't seen a decrease in traffic so what do I care\" and we have to stop with the \"I dont want minors looking at my content so these laws are good!\" and \"porn isnt going anywhere\" - this is JUST the beginning and we need to keep our eyes on itat the very least.\n\nSo do some research of your own (this is not meant to be a replacement for that in any way - this is just my response to seeing so many people on this sub who have NO CLUE ABOUT ANY OF THIS and just think its a pornhub ban*) talk about it with your friends, your family, your CLIENTS and anyone who will listen (they don't need to know you're a sex worker to know you support freedom of speech, privacy or whats left of it and that you don't want women to lose their rights to their own bodies) - because so many people dont look beyond \"minors shouldn't watch porn\" and they say \"I SUPPORT THIS LAW!\" - but NO ONE THINKS THEY SHOULD and thats NOT what this is about. So someones got to tell them....let it be you.\n\nAnd if anyone has suggestions of ways to get involved to actively work towards stopping any of this - please share for people to check out.  Im not prepared to post about that yet myself because I'm still trying to figure out what I can do (while also trying not to fall apart as a human being).\n\n*Pornhub has not been banned ANYWHERE.  Pornhub has opted out of operating in the places that require age verification.  It is THEIR choice.  And it's not because they want minors to view porn.  It's because they know this is all bullshit and many people have been educated by visiting PH and reading that their states legislature is to blame and what they can do about it....so good for them.",
  "author": "HairyBiAmelia",
  "comments": [
    {
      "author": "AstraNaughty321",
      "timestamp": "",
      "body": "This is probably the most important information that has been posted in this community and I hope people will take this seriously."
    },
    {
      "author": "Strictdaddy17",
      "timestamp": "",
      "body": "Completely agree and ty OP.  If i had an award I'd give it to you 😅"
    },
    {
      "author": "Sunnythebunnie",
      "timestamp": "",
      "body": "I feel like all sex workers should know no matter what our jobs are always under attack! We should care about these things but a lot don’t. But I’m here to say I care. I have back up plan no matter what."
    },
    {
      "author": "ShesSoInky",
      "timestamp": "",
      "body": "I think some people care but for the wrong reasons - in this instance they care about kids not having access to porn.  Totally a good thing to care about.  But they don't look beyond that.  We're bombarded all the time these days with so much shit its overwhelming so when we hear a simple one we just \"YUP I support that one!\" but looking a bit further in to it tells you maybe you shouldn't.This is how I make my living but I had a vanilla career for over a decade before this.  If I have to go back to it I will.  But I don't want to.  And I certainly don't want to because I have no choice.  And I know a lot of people doing this work DON'T have anything to fall back on....so it's not just fear for myself.  But for others as well.  Which a lot of people are missing.....which is how we got here.  Thinking \"well that doesnt apply to me\" - it will if you don't have a dick.  In one way or another."
    },
    {
      "author": "Jade_Next_Door",
      "timestamp": "",
      "body": "Well said 👏🏽👏🏽👏🏽 It amazes me those who are like, 'there will always be SW and a market for it'. 🤦🏽‍♀️ Clearly, a market existing is not the issue. There's a market for CSAM, drugs, child marriages, trafficking, hacking, etc.Then the comments of, 'things won't be impossible, we'll be fine'. 🤦🏽‍♀️  So weird to be acceptable with a standard of \"not impossible\". That's a whole problematic mentality in such circumstances.The point is that we shouldn't have to jump through circus hoops, have our rights stripped, and then be penalized for doing what we want, profit from, and consent to with our bodies. People are gonna survive doing what they need to do no matter what. But adding all these unnecessary hurdles and punishments so that it limits the people while benefiting those up top is the issue. Capitalism at its finest. We literally could be living in a much better circumstance, but capitalists are more than happy to create long-term/generational destruction of the masses just to say they topped the next best thing."
    },
    {
      "author": "ShesSoInky",
      "timestamp": "",
      "body": "Honestly the fact that the market exists and is SO strong is the most terrifying part.  Because they will still want it. They just wont have to pay for it anymore.  And we won't be doing it by choice if they have their way."
    },
    {
      "author": "Lizard_Zepplin",
      "timestamp": "",
      "body": "it’s all their big plan to get more wage slaves, people aren’t having kids anymore for a multitude of reasons, and the rich aren’t happy about it. So how do they fix it? Ban abortions so people are forced to have kids, ban being gay or LGBTQ+ so people are breeding more, ban porn so people are wound up and horny and breeding. That’s all this sick plan is leading to, making more wage slaves in the working class so we can be exploited. This country is truly becoming disgusting, i’ve been planning on moving out of country for years now (been saving up) and hopefully i can ik the next year or 2."
    },
    {
      "author": "littlerosexo",
      "timestamp": "",
      "body": "Myself and a few others in the industry have been yelling about P2025 since the end of 2023, and I wholeheartedly believed that if democrats just had the balls to talk about sex workers, it would have been the bridge to the young men and kinda-conservatives who could have swung the election back to sanity.But more insidious than fucking with out lives and livelihoods is the fact that sex workers are being used as the canary in a coal mine for the mass incarceration, erasure, and eventual extermination of other groups that will be classified as \"obscene\". Starting with the trans community.Russell Vought, co-author of P2025 is now the head of the US Office of Management and Budget. Oklahoma senator Dusty Deevers has introduced a bill criminalizing adult content of any kind. IfOK SB593passes at the state level, it becomes that much easier to use as precident to adopt the law nationwide.Everything we warned about is here. The time for prevention is past, and all we can do now is fight. None of us will ever be \"one of the good ones\" to the Christian Nationalists, so being meek won't change a thing for us. All of us need to be loud on our platforms, do everything we can to protect ourselves and our loved ones, resist in every way possible, and never obey in advance."
    },
    {
      "author": "Gwennie_pooh",
      "timestamp": "",
      "body": "I really just want to live my life and exist! I'm trans and this whole administration has made me feel like its a matter of time before I'm swept up and put in prison. With the fact he wants to ban porn but also just being gay or queer is so scary! I just wish more people would take this all more serious it will effect lives no ifs and or but about it."
    },
    {
      "author": "HairyBiAmelia",
      "timestamp": "",
      "body": "Thank you for this helpful summary!! Your labor is appreciated 💜✨"
    }
  ]
}