{
  "subreddit": "technology",
  "post_id": "1jpm70o",
  "title": "Federal judge declares Arkansas social media age-verification law unconstitutional",
  "body": "",
  "author": "weasol12",
  "comments": [
    {
      "author": "EmbarrassedHelp",
      "timestamp": "",
      "body": "The age verification tech companies hoping to get rich off of violating user privacy are going to very be upset. But they can go fuck themselves."
    },
    {
      "author": "Growbird",
      "timestamp": "",
      "body": "No kidding what is this crap? My state that I moved to five years ago and many others now require age verification for porn but yeah underage kids can get on this sht show social media no problem?Ever since I watched the documentary the social dilemma I realized pretty quickly just how methodically evil these social media apps are"
    },
    {
      "author": "loztriforce",
      "timestamp": "",
      "body": "It’s no surprise the same people that claim they’re all about small government feel the state should do such things."
    },
    {
      "author": "ITnewb30",
      "timestamp": "",
      "body": "I will never understand parents that vote for this crap. They would rather have a big brother nanny state instead of parenting their children and telling them that they can’t have social media."
    },
    {
      "author": "cyrand",
      "timestamp": "",
      "body": "Don’t forget they’re the same parents that get mad at any rules that apply to them and their kids.  It’s always people who only think everyone ELSE should have to do whatever."
    },
    {
      "author": "chronoflect",
      "timestamp": "",
      "body": "I imagine most think they're doing just fine raising their kids, buteveryone elseare clearly fucking it up and need a helping hand from The State to ensure they do what they deem as \"correct\"."
    },
    {
      "author": "asdfredditusername",
      "timestamp": "",
      "body": "Of course they did. Idiots."
    },
    {
      "author": "UPVOTE_IF_POOPING",
      "timestamp": "",
      "body": "“This ruling protects Americans from having to hand over their IDs or biometric data just to access constitutionally protected speech online,” Marchese said. “It reaffirms that parents — not politicians or bureaucrats — should decide what’s appropriate for their children.”How is this idiotic? I’m a parent and this is MY job, not the government. Sure there’s some bad parents out there who don’t properly parent but that’s not my problem.Edit: my bad guys, the government will use your biometric data properly. It was wrong of me to think otherwise."
    },
    {
      "author": "weasol12",
      "timestamp": "",
      "body": "Could have interesting implications on the porn age verification laws sprouting up if those are ever challenged."
    }
  ]
}