{
  "subreddit": "CamGirlProblems",
  "post_id": "1hworpv",
  "title": "US states requiring age verification affecting traffic yes?",
  "body": "Seeing all the posts about Pornhub now blocking 19 US states where age verification is required and after Texas sued Chaturbate last year to force them to apply age verification, was wondering if anyone is seeing any impact on earnings so far?\n\nWhat cam \\ phone sex sites have implemented age verification in these states? Anyone have a list?",
  "author": "morticiamyers",
  "comments": [
    {
      "author": "madamluxe",
      "timestamp": "",
      "body": "I cam on SC and lately I’ve had to put in more hours just to make my average since it’s been slow. But that’s expected with post holiday slowness. Unfortunately since PH is now blocking those states, advertising is taking a hit, which trickles down to sites that advertise there, which ultimately impacts us."
    },
    {
      "author": "ScarletBlond",
      "timestamp": "",
      "body": "Thats a good point about the advertising reduction.Do you know if SC is asking for age verification from it's members in these states yet?"
    },
    {
      "author": "ShesSoInky",
      "timestamp": "",
      "body": "FYI 16 out of the 19 already had these requirements in place for most of 2024 - Florida, Tennessee and South Carolina were added as of January 1st.This is the full list of states where pornhub is now no longer available and where ageverification of some type is required to access \"adult\" content:Alabama, Arkansas, Florida, Idaho, Indiana, Kansas, Kentucky, Mississippi, Montana, Nebraska, North Carolina, Oklahoma, South Carolina, Texas, Utah, and Virginia."
    },
    {
      "author": "Warden_Knox",
      "timestamp": "",
      "body": "*PH has made itself unavailable in those states"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "YES. Big drop since Jan 1. Total bs. 🤬https://avpassociation.com/4271-2/"
    },
    {
      "author": "ScarletBlond",
      "timestamp": "",
      "body": "Good link, thx!"
    },
    {
      "author": "morticiamyers",
      "timestamp": "",
      "body": "This is interesting to navigate. Does this mean our social media needs to be cleaned up, or is the social site responsible for that?"
    }
  ]
}