{
  "subreddit": "Vanced",
  "post_id": "mkjkeq",
  "title": "[Suggestion] Bypass Verify Age",
  "body": "Youtube implement a new feature where you have to confirm your age by sending them a photo of your Id or your Credit card. I don't want to send my Id to google because I don't trust them. I will provide screenshots below but I think it's an EU only thing and using a VPN doesn't work anymore.\n\nhttps://prnt.sc/114un82https://prnt.sc/114uo8t\n\nSolution:\n\nFor PC:https://www.youtube.com/watch?v=tvs9IGTe9ZA\n\nFor Mobile: Download the New Pipe Apphttps://newpipe.net/#downloadAfter Install go to Settings > Content > Check the ✅ at play adult content\n\nIf you come across a Video that is Age Restricted click on Share and select New Pipe and the video will Play\n\nAn Bypass by YouTube Vanced would still be nice tho",
  "author": "Skygamerlp17",
  "comments": [
    {
      "author": "PakWarrior",
      "timestamp": "",
      "body": "Just install NewPipe along side with youtube vanced. When you need to access a restricted video simply press on the video and tap share. Then you will have an option to open it on NewPipe. Just watch there."
    },
    {
      "author": "OZZY9696",
      "timestamp": "",
      "body": "Holy shit is this real"
    },
    {
      "author": "maxwag9",
      "timestamp": "",
      "body": "https://imgur.com/a/gKs2igX"
    },
    {
      "author": "dhthms",
      "timestamp": "",
      "body": "Maybe brexit has a good side after all"
    },
    {
      "author": "memester230",
      "timestamp": "",
      "body": "Yea that is EU only.I dont think there is a way to go around it, not without stepping on the EUs toes and getting completely banned from the EU."
    },
    {
      "author": "nam292",
      "timestamp": "",
      "body": "I never faced this issue and I'm from EU?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Bubblykit",
      "timestamp": "",
      "body": "Why do you have over 50 tabs open"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Use a fake id"
    },
    {
      "author": "Skygamerlp17",
      "timestamp": "",
      "body": "Solution:For PC:https://www.youtube.com/watch?v=tvs9IGTe9ZAFor Mobile: Download the New Pipe Apphttps://newpipe.net/#downloadAfter Install go to Settings > Content > Check the ✅ at play adult contentIf you come across a Video that is Age Restricted click on Share and select New Pipe and the video will PlayAn Bypass by YouTube Vanced would still be nice tho"
    }
  ]
}