{
  "subreddit": "AmazonDSPDrivers",
  "post_id": "15zxj35",
  "title": "Age verification for a phone charger?",
  "body": "Had an age verified delivery today, the man seemed confused why I was asking for his birth details. After we got through the process, he said it was just a charging cable? He opened it and all it is was a small cable in some plastic.\n\nIs there some law I forgot about?",
  "author": "deanroy90",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Thank You for your submission tor/AmazonDSPDrivers!Please keep the comment section clean and respectful.If you need to report a concern about your DSP, head to the Ethics Hotlinehttps://secure.ethicspoint.com/domain/media/en/gui/65221/index.htmlLooking to get some free shoes on behalf of Amazon?https://www.reddit.com/r/AmazonDSPDrivers/comments/m79v7m/free_125_credit_for_shoes/I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I wouldn’t even asked him for his age if you look the age🤦‍♀️🤷🏽‍♂️."
    },
    {
      "author": "Zanockthael",
      "timestamp": "",
      "body": "In the UK, not asking for DoB for alcohol, blades or vapes is an instant offboarding offence. Regardless of the age of the person you're delivering too. Asking for the DoB of a 95 year old is pretty silly, if you ask me, but most customers are used to it now.Funny story. When this was first brought in a few years ago, we had to ask for valid ID from everyone, not just the DoB. The AMOUNT of verbal abuse we got from people over 50...That fucking rule was in place for over a year."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Maybe it's a UK thing. You have to ask their birth year, if they are under 25 it asks you to ID them. It's mostly for alcohol"
    },
    {
      "author": "Crayen5",
      "timestamp": "",
      "body": "Maybe it's a UK thing. You have to ask their birth year, if they are under 25 it asks you to ID them. It's mostly for alcohol"
    },
    {
      "author": "LewisRyan",
      "timestamp": "",
      "body": "It’s probably the new program to deter false dnr’s being rolled out in OP’s station.Someone delivered to him and he claimed he didn’t get it, so now they want his birthday as proof"
    },
    {
      "author": "cyberspace2008",
      "timestamp": "",
      "body": "Every now and then this comes up it's just a UK and (I think?) Canada thing. Possibly just UK/Europe where Amazon delivers alcohol.You can buy ethyl alcohol from Amazon US but it's denatured."
    },
    {
      "author": "Zanockthael",
      "timestamp": "",
      "body": "For the US amoung us, it's purely a UK thing. Not allowed to leave blades, alchohol or vape products with under 18's. But yeah, I've had AVDs that were cable ties (the woman I was delivering to was really abusive towards me about it) and also one that was a frying pan. The couple I delivered it to were confused, but they told me that it was for their teenage son. I told them that I probably needed to ask for ID, because food cooked by a teenager is a lethal weapon. They found it amusing.Also remember one that was a cheese cutting board. I mean, you'd have to try really god damn hard to stab someone with one of those. It'd be more lethal to leave it in the box and hit someone over the head with it.Edit: as an amusing side note, I ordered some *very* sharp whittling knives off Amazon and they weren't AVD, because the blades weren't quite long enough, I guess. Also, chainsaws can be left with under 18's. Go figure.It might be that the charging cable was for vapes. All vape products are age verified."
    },
    {
      "author": "Crayen5",
      "timestamp": "",
      "body": "Oh if it's for vapes that's understandable, I thought he said it was a phone charger.I've had to ID people for stuff like bread knives and wine labels before, the laws can be quite strict. This one just threw me off a bit.Oddly enough, if you order lighters I don't think those are age verified either?"
    },
    {
      "author": "deanroy90",
      "timestamp": "",
      "body": "It's probably a requirement to avoid failed deliveries and verify the customer!"
    }
  ]
}