{
  "subreddit": "Vanced",
  "post_id": "ma73v9",
  "title": "[Suggestion] A way to bypass the (new and bad) age verification in the EU.",
  "body": "Hey, because of some new rules here in the EU, platforms need to make sure that 18+ videos are only watched by people above 18 and youtube forces me to send an image of my ID as a prove. I am above 18 and also have the correct year of birth on my google Account but because I'm a bit concerned about online privacy and data protection, I won't send my ID anywhere, especially not to Google. I don't know if this would be possible but it would be cool and a step in the right direction in terms of online privacy.\n\nEdit: for everyone with the same problem,u/seplaso1recommended trying NewPipe and it does work there!",
  "author": "Sc0rp10n_",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "it does seem a very shady way of proofing your age ( but i suppose not many other methods are 100% reliable ) , i bypass it by setting my vpn to south africa"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I suggest trying newpipe"
    },
    {
      "author": "BroadEstablishment",
      "timestamp": "",
      "body": "Check a recent post on my profile. Someone suggested to upload a random drivers licence pic and just set the same date. It worked for me."
    },
    {
      "author": "friendlypd",
      "timestamp": "",
      "body": "Strangely after installing the newest version it doesn't ask me to verify my age"
    },
    {
      "author": "synapsenfick",
      "timestamp": "",
      "body": "I use my google+ account on youtube now. It is completely fake Information but it says that i am 49 years old. Works like a charm."
    },
    {
      "author": "LordWurstbrot",
      "timestamp": "",
      "body": "You can add a credit card for instand access 💩"
    },
    {
      "author": "Safodo",
      "timestamp": "",
      "body": "I have the same issue. Is there a way to use ID from google search to trick verifying machine ?"
    },
    {
      "author": "Sc0rp10n_",
      "timestamp": "",
      "body": "Try this.https://imgur.com/a/FPPMvLO"
    }
  ]
}