{
  "subreddit": "VRchat",
  "post_id": "1hgk7h6",
  "title": "Persona and Age Verification",
  "body": "I've been through a ton of conversations about the Age Verification system and here's what I think.\n\nFirstly, I totally understand why people wouldn't want to give ANY corporation/site personal data. If you don't want to, then you shouldnothave to. As it stands, you will still be able to play VRChat without it, so don't feel pressured. Yeah, some rando who let the sheer raw POWER of being a group mod get to their head might scoff at you for it but... so what? Just keep playing like you always have. Plenty of other adults assessed the risks and will choose not to age verify, and you can be one of 'em.\n\nSecond, out of the possible ID confirming companies out there, there is nothing blatantly wrong with Persona. I can't find info of any Persona data breaches to date. I'm NOT saying that's proof that it's impossible in the future, but a history of data breaches or outright selling user data would be a better reason to distrust Personaspecifically.\n\nThere is the issue of Persona using user data to train their own internal AI, but that is 1. Alledged 2. Only being pursued for customers in Illinois and 3. Possibly determined by the host company, as the examples include DoorDash which had Persona hold on to users ID data for around 30 days. (VRChat has specified that their policy is for Persona to delete the user data ASAP after their age is verified.) And, again, the data was only being usedinternally, meaning the info never left Persona. Not great to do without a users permission, but not as much of a breach of privacy as selling info to a third party. STILL! I can understand why even if Persona hasn't done anything really truly nefarious, people aren't excited to use it. If you don't want to, don't.\n\nFor those with a Meta headset which requires a Meta account, I'd be more worried aboutthatinfo being leaked as Meta/Facebook has a worse track record of leaks, selling user data, manipulating user data, etc.\n\nAnd lastly... If you're excited about the new age verification, if you assessed the risks and decided it was worth it to you, I'm happy for you. You got in early on the ground floor, yippee. Now stop clogging my homepage with screenshots of your badge >:V",
  "author": "_Pendragon",
  "comments": [
    {
      "author": "bunnythistle",
      "timestamp": "",
      "body": "Now stop clogging my homepage with screenshots of your badge >:VI legitimately don't understand why we need five different threads announcing that Age Verification is here. The first thread seemed adequate enough."
    },
    {
      "author": "MuuToo",
      "timestamp": "",
      "body": "Everyone thinks they’re the first and are excited about it. Give it a week or so."
    },
    {
      "author": "MuuToo",
      "timestamp": "",
      "body": "For me, the online personal privacy ship sailed off long ago. Obviously I implore everyone to take whatever precautions they need to feel safe. But like, Google, Meta, Apple, and so many other companies have so much data on me that for me, another company that seemingly had a pretty good track record isn’t gonna be the hill I die on."
    },
    {
      "author": "ScienceAndLogic-",
      "timestamp": "",
      "body": "i agree, unless your some super rich private celeb, using anything on the internet will most likely cause your information to be somewhere you dont like or want it to and atp we cant really control that unless u live like a hermit"
    },
    {
      "author": "SpectorEscape",
      "timestamp": "",
      "body": "I will note so many companies have had lawsuits in Illinois because of their extremely strict laws on keeping info like that. I have a family member who has gotten a good amount of class action money due to it. Target has gotten sued, companies that use biometrics to get into work have gotten sued etc etc"
    },
    {
      "author": "Loc5000",
      "timestamp": "",
      "body": "your state issue ID Number gives access and information that you can't get with just a name and address. Facebook doesn't even have that info. Most businesses don't. The VRChat devs dont' have any malicious reasons for the info but its still something you should be cautious about. Plus its not hard to hop onto an already verified account via family or friends and still be under 18. So this will make it harder but not impossible"
    },
    {
      "author": "Toklankitsune",
      "timestamp": "",
      "body": "yes but at that point it's easy to prove the minor is the one in the wrong and protects the adults in the room from legal ramifications that can arise from a minor being in spaces they don't belong in. Which is the whole point of this age verification thing."
    },
    {
      "author": "AmazingPomegranate83",
      "timestamp": "",
      "body": "Anyone who pays for VRC+ has already given away their name and address. I don't see the same people complaining about that?"
    },
    {
      "author": "BUzer2017",
      "timestamp": "",
      "body": "We give that to Steam, not to VRChat"
    },
    {
      "author": "_Pendragon",
      "timestamp": "",
      "body": "Another really good point! If your banking info is already tied to your VRC account, most of the data you'd be worried about getting leaked is already right there."
    }
  ]
}