{
  "subreddit": "VRchat",
  "post_id": "1iuaj4z",
  "title": "In all honesty- are \"modders\" and minors really bypassing 18+ verification? More context below",
  "body": "Decided to stop by a couple bar worlds the other night and other \"club\" ones to see what was up, and a couple times I was told my age verification wasn't a valid answer to being asked my age because modders and minors that are using their parents information are bypassing to get the same verification I have?\n\nBesides all the \"bouncers\" all being snobby which continues to be norm with 9/10 of the ones that I speak with, is that really the case? Even if that is the case, I'll just give you a fake birthday anyways. I feel the chances of that actually happening with bypass are slim, and event then, it's a lot to go through for little reward if it's to go to bar where's there's less substance use and abuse than your average drinking night, pug oir black cat.",
  "author": "Tyrilean",
  "comments": [
    {
      "author": "Capable-Trip-4423",
      "timestamp": "",
      "body": "sounds like some idiot at the bar world still wanting to flex their only modicum of power and still ask for IDs. I don't know any way it can be bypassed in this way, and it's likely a lie to still ask for your ID and stuff."
    },
    {
      "author": "Sheimusik",
      "timestamp": "",
      "body": "kinda stupid that they say age verification isn't valid when someone can literally just lie about their age vocally and that somehow works for them like bruh"
    },
    {
      "author": "blueskyredmesas",
      "timestamp": "",
      "body": "Virtual bouncers aren't beating the allegations."
    },
    {
      "author": "LimitAffectionate266",
      "timestamp": "",
      "body": "I literally always  say \"11th of september 2001\" anytime im asked my dob and not once has anyone batted an eye, i think only once did I hear a bouncer go \"wait wtf\" after he already let me through, they literally dont care or double check, its all about the power trip for them"
    },
    {
      "author": "Mr_SunnyBones",
      "timestamp": "",
      "body": "Hey , some of us actually DO have Sep 11 as a birthday , admittedly I was in my 20s when the towers fell."
    },
    {
      "author": "RadElert_007",
      "timestamp": "",
      "body": "No, they arent. Bar bouncers just wanna big dick and still feel important."
    },
    {
      "author": "justsmokeweedkids",
      "timestamp": "",
      "body": "I feel like people that claim the bypassing stuff are ignorant of the actual verification process. You literally have to scan each side of your face along with your license. Unless you’re a clueless/unconscious/intoxicated parent or adult, I just don’t see how that’s possible for a minor to successfully pull off considering the requirements. Getting ahold of an account that’s already been verified is more realistic tbh. Even then, that’s hardly an excuse to disregard verified users as a whole. Shit, even getting age verification for IMVU has less requirements than VRC."
    },
    {
      "author": "VioViridian",
      "timestamp": "",
      "body": "This sounds like a load of horseshit that bouncers tell themselves so they can power trip. I age verified my account and it would be harder for a kid to get through. Unless they can steal an id, have the adult be intoxicated or unconscious somehow, there isn’t a good way of getting around it. The alternative is kids buying age verified accounts, which wouldn’t surprise me if it was happening."
    },
    {
      "author": "MuuToo",
      "timestamp": "",
      "body": "No. They get some weird power trip from being an inconvenience and forcing you to stop for 'em."
    },
    {
      "author": "Tyrilean",
      "timestamp": "",
      "body": "How is you telling them a date going to be more secure than the actual verification?"
    }
  ]
}