{
  "subreddit": "DataAnnotationTech",
  "post_id": "1fj68od",
  "title": "Why are they now asking for identity verification all of a sudden?",
  "body": "Is it just me, or are they asking everyone to verify their identity now?\n\nI mean, it's not a problem for me but I just find it weird how they didn't ask for identity verification earlier even though I've worked for DataAnnotation for over 3 months and have made over $15000 already.",
  "author": "Hangry_Howie",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Same here. Either a client is requiring it or they themselves are struggling with fraud"
    },
    {
      "author": "valprehension",
      "timestamp": "",
      "body": "Either some legislation changed, or one of their clients requested it, most likely."
    },
    {
      "author": "Sindorella",
      "timestamp": "",
      "body": "With the amount of people I have had messaging me asking me to take the test for them or offering to give me a cut of an account they work if I create it for them, I am assuming they want to cut down on fraud. I can't be the only person getting those stupid messages regularly."
    },
    {
      "author": "gusu_melody",
      "timestamp": "",
      "body": "Wow! Hasn’t happened to me, but I don’t post on here too often."
    },
    {
      "author": "dragonsfire14",
      "timestamp": "",
      "body": "I wondered the same. This seems like something you’d do in the beginning, not months or years later. My only guess is they’re trying to crack down on account sharers or workers in unauthorized countries."
    },
    {
      "author": "MonsterMeggu",
      "timestamp": "",
      "body": "It's probably a new feature. They didn't think fraud would be so rampant at first. And now they need to crack down on it."
    },
    {
      "author": "SajraJay",
      "timestamp": "",
      "body": "I’ve been on for 18 months and haven’t been asked yet. At one time, there was a qual to complete a background check but I didn’t take it. I had just started with DA and wasn’t sure if I trusted them enough to give all of my info."
    },
    {
      "author": "publicdefecation",
      "timestamp": "",
      "body": "I'm guessing it's to cut down on scammers flooding the platform."
    },
    {
      "author": "good_god_lemon1",
      "timestamp": "",
      "body": "They realized they need it with the rise in shared and sold accounts where Johnny Appleseed’s account is being worked by Abara in Nigeria."
    },
    {
      "author": "Hangry_Howie",
      "timestamp": "",
      "body": "There's a whole industry popping up around shady ass groups offering to work off someone's account for money."
    }
  ]
}