{
  "subreddit": "paypigsupportgroup",
  "post_id": "1ah3yrm",
  "title": "Subs age verification",
  "body": "Hey there! We had this discussion over on the findomsupportgroup and I searched here for the same subject but didn’t find a lot of useful information… so I was wondering if you can share your opinions on this matter (long post ahead 😂 but it’s a matter that really concerns me and think it’s an important conversation to have)\n\nhow do you, as subs, take it when a domme asks you to verify your age? Do you follow their requirements or you drop it and seek another one who doesn’t ask you for this?\n\nif you do not age verify, why is that (genuinely curious, i don’t wanna judge, just wanna know some reasons behind it)?\n\ndo you require your potential domme to be age verified (accounts on adult sites such as FF, OF, LF etc) or you don’t check/care about this?\n\nAnd this one is for both dommes and subs:\n\napart from sending a picture with your DOB on an ID and some sort of requirement such as holding a pen or writing something on a piece of paper and using a 3rd party like Yoti ID, what other VALID ways are to ask a sub to age verify?\n\nAnother domme suggested to ask the subs to open up an account on OF/LF as a creator and then send them a message they have previously agreed upon from that account (as you well know, LF or OF do not require age verification for payers, only for content creators). This one seems legit to me as opposed to saying “pay me through LF/OF” because anyone who has access to a credit card can pay you, it doesn’t mean they are 18+.\n\nAlso Wishtender (cause it was mentioned in the other topics related to this subject), as far as I could find on their FAQ will require people who want to withdraw money to age verify so, again, not a method to age verify a sub because it’s the same situation as it is with LF and OF.\n\nI think being safe in this community is very important and everyone participating must be 18+, but the way the world is right now I for one cannot go based on trust. I want to protect myself and my potential subs and I am not willing to bend the rules for some money when so much more is at stake here. I had people drop out of conversations that were going fine when I brought up this aspect, I was even told they were not required to do this before… so clearly not all dommes care enough to make sure they are not sending nudes or sexting or joi to a potential 15-16 year old boy… and to me this is not ok.\n\nTo round it up, from the subs I wanna know how you guys see these requests and why would you refuse to do it without any risk to you, especially if you are serious about this kink. I am also hoping to find other valid methods to request age verification that may seem more do-able to the subs.\n\nThank you in advance and sorry for the long post, but it keep bugging me so I thought to finally address it 🫶🏻",
  "author": "Humble-Wrongdoer2551",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I guess it kinda is, you are right, but the idea behind it is to genuinely try and keep all of this community safe (or safer) including both dommes and subs… so thank you for not deleting it, maybe something good will come out of it :)"
    },
    {
      "author": "QueenLunaCelestine",
      "timestamp": "",
      "body": "I guess it kinda is, you are right, but the idea behind it is to genuinely try and keep all of this community safe (or safer) including both dommes and subs… so thank you for not deleting it, maybe something good will come out of it :)"
    },
    {
      "author": "Huge_Wash1805",
      "timestamp": "",
      "body": "I used a LF account and verify that way now! It’s easier for me than showing my ID especially since I’m trans my ID doesn’t look like me so much anymore"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Me waiting for the responses because the amount of subs I’ve had recently say they’ve never been age verified …"
    },
    {
      "author": "Apprehensive-Fox6143",
      "timestamp": "",
      "body": "I've been ghosted by so many for asking them to age verify, it's genuinely so annoying.Age verification should be the norm!"
    },
    {
      "author": "SarahOwnsYou_",
      "timestamp": "",
      "body": "Literally had 3 people in my dm right now saying WHY do you need me to age verify"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "u/GoddessLunaRaeexplained to me recently that having them interact with you (payment, subcsribe, message, etc.) through a third party site (regardless of creator or fan account status) requires clicking a  \"I am over the age of 18\" in order to participate and therefore puts the liability back on the user and the third party site. (Luma if I am reiterating this wrong please correct me)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "u/GoddessLunaRaeexplained to me recently that having them interact with you (payment, subcsribe, message, etc.) through a third party site (regardless of creator or fan account status) requires clicking a  \"I am over the age of 18\" in order to participate and therefore puts the liability back on the user and the third party site. (Luma if I am reiterating this wrong please correct me)"
    },
    {
      "author": "BullfrogLong3070",
      "timestamp": "",
      "body": "FD: I am affiliated to yoti, but speaking in a personal capacity.If you choose to request or provide age verification using Yoti ID. There will be a \"Share\" button on the top of the screen. Asking a sub to use this approach they can send you a link that will reveal only their date of birth. You get to keep a record of the exchange, if you need proof in the future.They can use this to send a proof of age  by email, SMS, telegram, discord etc any platform that supports communication.This way there is no need for screenshots, no crazy photo editing, the result comes straight to you have a record that the age verification stored and if you decide to walk away from Yoti, you can still download your data and walk away."
    },
    {
      "author": "Humble-Wrongdoer2551",
      "timestamp": "",
      "body": "I'd never approach a Domme that wasn't age verified. That's trouble waiting to happen. My Domme asked me to verify my age by sending a picture of my redacted ID and in the same pic, my username in my own writing with the date on it. It wasn't hard. I don't understand why subs wouldn't be willing to age verify."
    }
  ]
}