{
  "subreddit": "AmongUs",
  "post_id": "mjg848",
  "title": "Age verification?",
  "body": "I have a problem confirming my age in Among Us. To verify your age you need to pay 50 cents via a payment method that isn't available to me. Visa, MasterCard or American Express aren't common payment methods in Europe (Germany). How am I going to confirm my age, if my payment method isn't available?",
  "author": "CST1230",
  "comments": [
    {
      "author": "rubixcube2007",
      "timestamp": "",
      "body": "I don’t think you need to pay I didn’t"
    },
    {
      "author": "Rescuteax",
      "timestamp": "",
      "body": "I get an E-Mail with a link to the parent portal where I have to pay 50 cents for them to confirm that I'm an adult. But the payment methods listed there aren't available to me."
    },
    {
      "author": "ItzPrestonHUT",
      "timestamp": "",
      "body": "u need to pay? that’s tuff."
    },
    {
      "author": "Rescuteax",
      "timestamp": "",
      "body": "yes, and the only payment methods listed there aren't available to me -.-"
    },
    {
      "author": "Rescuteax",
      "timestamp": "",
      "body": "Update: I got a friend to do it. Still, this system isn't very planned through.And for all your doubts: If you're under 16 or 18 (idk the law in Europe, because it definetly isn't 13), you have to pay 0,50€ via this parental site that you get emailed from the Innersloth support. You'll get the 50 cents refunded after 7 days and your credit card information isn't stored, so it's not a scam (but still stupid)."
    },
    {
      "author": "Training_Face_2806",
      "timestamp": "",
      "body": "Does anyone know why the email won't go through I tried in 2021 but emails won't go through"
    },
    {
      "author": "o0Little0o",
      "timestamp": "",
      "body": "What? This seems.. wrong"
    },
    {
      "author": "Nirhren",
      "timestamp": "",
      "body": "I doubt whatever is asking you to pay is legit. Whatever it is, it’s practically screaming “scam”."
    },
    {
      "author": "Ohms_GameBone",
      "timestamp": "",
      "body": "It's just a way of verifying age on the site.It'll ask you to pay 50c but it'll take nothing"
    },
    {
      "author": "CST1230",
      "timestamp": "",
      "body": "That's not normal.Maybe that's something on Apple devices, but on PC or Android you certainly don't need to pay."
    }
  ]
}