{
  "subreddit": "CamGirlProblems",
  "post_id": "1auhfxv",
  "title": "Member age verification on SM",
  "body": "Hi, sorry it's been discussed before but I'm too freaked out to have a look.\n\nDo members get age verified properly on SM?\n\nThe reason I'm asking is because since I'm a MILF, I get a lot of younger customers and if someone asks me stuff like \"do u like young cock bb?\", I always ask how young we are talking?\n\nToday I had a guy with a name like youngcock and as soon as he opens his cam in pvt, I panic blocked him because he looked awfully young. Freaked me out so bad that now I wanna bleach my eyeballs.\n\nI reported him to SM but now I'm thinking maybe I should've asked his age, too? But is that really my responsibility to ID check these bastards? FML.",
  "author": "MissFitAmy",
  "comments": [
    {
      "author": "Jade_Next_Door",
      "timestamp": "",
      "body": "A lot of adult sites don't age verify via ID like models/creators do. That's why these new laws are a pain in the ass. There is nothing wrong with age verification, but not at the expense of privacy and untested risk of security issues. Internet usage and monitoring is a parent's job.That said, it's not your responsibility to verify everyone. It's the responsibility of the platform. Most platforms have the \"I agree\" terms and consider a saved or use of a credit card as a method to help ensure the likelihood of a member being 18yo. So if members are spending, it's not as likely that they're underage. This is a risk reduction high-risk business, so it's still possible but lower likelihood. Of course, report if there are concerns of an underage user.You'll come across usernames like that and members asking that question. Young doesn't mean underage. These late teens or early 20s members would see models in their late 20s and older, especially 30+, as older. Therefore, them being young cocks since you're older. Of course, anyone in that age range will look younger than what you're used to, and some people just look younger than they are (just like many of us). I get asked this sometimes, and I just say, \"I like them legal\". Usually, they just volunteer their age afterwards and only asked in the first place to open the doorway for play. All you can do is ask their age and either believe the answer or not, and if not, then report."
    },
    {
      "author": "GoddessTeas",
      "timestamp": "",
      "body": "I tell everyone I like 25+ because under that age grosses me out and I don’t want to play with them.Ultimately though by the law, I believe it would be on us not the website should a minor interact with us while streaming. We would be on the hook legally."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Ok-Carrot-8540",
      "timestamp": "",
      "body": "It’s not your responsibility imo I mean they take a 65% cut so that should be sufficient to pay for them doing THEIR jobs- we do ours. If he looks under and makes you uncomfortable yes, block ofc. I just say as long as your legal baby- 🤷🏻‍♀️"
    },
    {
      "author": "MissFitAmy",
      "timestamp": "",
      "body": "Thanks for this, that’s a good point that at 30+ i’m not used to guys this young anymore and with his clean shaven face his appearance completely threw me off."
    }
  ]
}