{
  "subreddit": "Banking",
  "post_id": "1csl00q",
  "title": "Any banks that don't require ID verification?",
  "body": "I'm helping my elderly uncle make a bank account. I have pictures of his ID but not the physical ID because he's out of state. Every bank I try to help him apply for wants a selfie and to take a picture of the ID with their own camera. Any getting around this?\n\nBasically I have his social security # and his ID number as well as a picture of his ID but I don't physically have it.\n\nEdit: I successfully made the account. Thank you to the very few of you who actually tried to help me",
  "author": "iamzero630",
  "comments": [
    {
      "author": "Maximum-Relative-234",
      "timestamp": "",
      "body": "These are anti-fraud and AML policies at work. Banking is highly regulated as an industry. Your uncle needs to make the journey to a local branch to do it in person. Otherwise, a Trust may be a more appropriate workaround."
    },
    {
      "author": "wrldruler21",
      "timestamp": "",
      "body": "A little thing called the Patriot Act also helped encourage banks to collect customer identification."
    },
    {
      "author": "GapAFool",
      "timestamp": "",
      "body": "This is how fraud is committed. Zero legitimate banks will let you open an account without identification. It’s to combat money laundering and extensive fraud that has been plaguing the banking industry.get him to go in person to a local bank or credit union. Anything else, including you “helping” sets off red flags. being elderly and not having any account is already a red flag."
    },
    {
      "author": "elderberrytea",
      "timestamp": "",
      "body": "He doesn't have a bank account because he was incarcerated. I'll look into that thank u"
    },
    {
      "author": "Daleaturner",
      "timestamp": "",
      "body": "In essence, no.Too much fraud likely.Know Your Customer (KYC) is a process that helps organizations understand their customers, their financial dealings, and personal financial requirements. KYC compliance processes vary around the world, but common requirements include: Customer identification processes, Identity verification, Risk profile maintenance, AML compliance measures, and Enhanced due diligence."
    },
    {
      "author": "elderberrytea",
      "timestamp": "",
      "body": "I got it resolved thank you"
    },
    {
      "author": "throwawaykfhelp",
      "timestamp": "",
      "body": "Glad to hear it OP. Congratulations to your grandfather on his release and good on you for helping him get on his feet!"
    },
    {
      "author": "nrquig",
      "timestamp": "",
      "body": "Even if you physically had his ID it wouldn't make any difference.   You can't open a bank account for someone else.    They have to open their own accounts with proper identification"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Can your uncle just get a new ID card? They’re usually between $20-$40"
    },
    {
      "author": "iamzero630",
      "timestamp": "",
      "body": "Letting people know i was able to open a Chime account, under  across the board security freezes, opt outs and everything. Zero id check, they do have a nifty policy where if you close an account you can never open another one."
    }
  ]
}