{
  "subreddit": "technology",
  "post_id": "1i2rihd",
  "title": "UK demands adult content sites introduce 'effective' age verification methods",
  "body": "",
  "author": "PainInTheRhine",
  "comments": [
    {
      "author": "ButteredPizza69420",
      "timestamp": "",
      "body": "How about parents start effectively parenting and keeping an eye on their kids? Why should the whole internet be censored and catered to them? Its far easier to simply keep a child off of devices unsupervised. The internet should be for adults only in my opinion - as a kid who had too much freedom online, parents should be more responsible."
    },
    {
      "author": "MarioLuigiDinoYoshi",
      "timestamp": "",
      "body": "They got you. This is a distraction from bigger UK issues. That’s the only reason why they are even talking about this."
    },
    {
      "author": "marmatag",
      "timestamp": "",
      "body": "Identify which sound is the modem"
    },
    {
      "author": "Error_404_403",
      "timestamp": "",
      "body": "Except effective, or actually any, age verification on internet is impossible."
    },
    {
      "author": "Starfox-sf",
      "timestamp": "",
      "body": "Enter your birthdate: Jan 01 2000"
    },
    {
      "author": "Cartina",
      "timestamp": "",
      "body": "But you identify yourself to your bank or government online and they know your age.It probably would be more accurate to say you cannot verify age and also maintain privacy.Also you could for example require credit card which in many countries is restricted to 18+. So there definitely is methods, but they all require you to identify yourself."
    },
    {
      "author": "barometer_barry",
      "timestamp": "",
      "body": "Yes officer I was of legal age 20 years ago when I searched for them vids on the internet"
    },
    {
      "author": "jcunews1",
      "timestamp": "",
      "body": "No such thing, unless it violates visitors' privacy."
    },
    {
      "author": "TacticalDestroyer209",
      "timestamp": "",
      "body": "Wouldn’t surprise me if the adult sites geoblock the UK instead of complying with the Online Safety Act.Britain is really trying to spread their “think of the children” bullshit on not just their country but others like the United States as well.I’m betting that Britain’s Online Safety Act is going to backfire spectacularly in the months to come too."
    },
    {
      "author": "PainInTheRhine",
      "timestamp": "",
      "body": "Or just don’t geoblock UK and ignore the whole thing. Our servers are in US/Germany/NZ/whatever, we don’t do business in UK and we don’t give a flying fuck if some UK residents visit us."
    }
  ]
}