{
  "subreddit": "personalfinance",
  "post_id": "tw58sf",
  "title": "How long does it take to get to +750 credit score?",
  "body": "Im living outside the US and Im seeing theres no option available for me to start building credit before I get to the country. My main concern is to get excellent score before I purchase a home or leasing a car. From no history to +750 points or more... is it feasible in 6 months or less??",
  "author": "TywinShitsGold",
  "comments": [
    {
      "author": "DeluxeXL",
      "timestamp": "",
      "body": "It is not possible within 6 months unless you are added as an authorized user, because your first credit account is not scorable for 6 months.A 6 month 750 would still be quite insubstantial for large ticket financing."
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "You may find these links helpful:Credit BuildingCredit ReportsCredit ScoresCredit CardsI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "juggarjew",
      "timestamp": "",
      "body": "Nah, more like a year needed. But I think you could do it in 12-18 months paying on time on credit cards.But remember that a credit score is just a number and means little when it comes to financing something like a mortgage, you need years of job history showing stable income, the amount of verification is insane and a credit score is only one little piece of that pie.Its more about how thick your credit file is and the weight behind it, 6 months of paying a single credit card on time is nothing really, whatever score you'd have would carry little weight. If you want to lease a car in the next 6 months, you should be prepared to pay a security deposit upfront, usually a couple thousand dollars. leasing a car would be good for your credit though, the FICO Scoring models and lenders like to see debt obligations like a lease paid on time, it would help your score go up faster than just having credit cards."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I am at 670 out of 705 (in my country it goes to 705) it took me almost 3 years. Be smart about your debt! It isn't about how much credit you have but how well you maintain the repayment.This is what I did to get to 670:Took out a small personal loan, more than three months after starting my new permanent job.took out a credit card for the equivalent of one months' salary about a year after settling the personal loan (if I remember correctly)when my score hit 675 my brother and I bought our first investment property togetherabout a year later I took another peraonal loan for a car and now, about 6 months later it is back at 670.(your score goes down as you take on debt)Edit: I think that my credit history might have carried over from my first job out of school though so I might've had a head start."
    },
    {
      "author": "TheSoftwareGeek",
      "timestamp": "",
      "body": "I would say likely not within 6 months.My oldest card is 7 months and my score is at around 730. Here are some of the things you can do to boost it faster as a newcomer:Use an international credit card company that can pull your credit history from other countries to fast track approvals and get higher limits. I used American Express (for Canadian history) but you can check outNova Creditto see what's available based on your country of emmigration.Try to minimize the amount of hard credit checks on your card. It does lower your credit and it's hard to escape when you're a new immigrant and need to fill out rental, utility and phone applications. I later learned that some places will accept a larger deposit in lieu of a credit check.Similar to credit cards, some mortgage lenders will look at rental history and international credit bureaus (for a fee) to manually underwrite a mortgage for you."
    },
    {
      "author": "Triscuitmeniscus",
      "timestamp": "",
      "body": "For something like a mortgage or auto loan having a short credit history would be an issue no matter what your score is: someone who expects to be paid back over many years or decades will be unimpressed that you were able to make it 6 months without screwing up your credit score.I would assume it will take a year or more to build your credit to a level that would qualify you for a decent home or auto loan, and likely 2 years or more for your income/work history to qualify you for a decent home loan.This isn't as much of a problem as you might think. I think it would be foolhardy to buy a home as soon as you move to the US: I wouldn't buy a home anywhere without living there for a year first to get a feel for the area. Save up money now to buy a cheap vehicle when you get here, and don't worry about upgrading until you get settled in."
    },
    {
      "author": "TywinShitsGold",
      "timestamp": "",
      "body": "2 years to go from no credit to more mature credit."
    }
  ]
}