{
  "subreddit": "australia",
  "post_id": "1h4o7zy",
  "title": "Social media ban: How Australia will implement age-assessment technology",
  "body": "",
  "author": "dinkydipigscanfly",
  "comments": [
    {
      "author": "Blitzende",
      "timestamp": "",
      "body": "So social media is going to get age verification, porn is almost certain to get age verification...but there are \"question marks\" over gambling getting age verification? After also not passing the promised gambling adverts legislation? This does not pass the pub test"
    },
    {
      "author": "Important_Cookie_763",
      "timestamp": "",
      "body": "They don't give a shit about the pub test, we need to start actually protesting and doing something"
    },
    {
      "author": "Important_Cookie_763",
      "timestamp": "",
      "body": "It won't work, albo just trying his hardest to kill his political career atm"
    },
    {
      "author": "BruceyC",
      "timestamp": "",
      "body": "Imagine committing political suicide and sending Labor back into opposition over something no one really asked for."
    },
    {
      "author": "StaticzAvenger",
      "timestamp": "",
      "body": "He's done a great job of killing the chances of anyone under 20 wanting to vote for Labor in the near future, especially an entire future generation of voters.People can hold grudges for a long ass time."
    },
    {
      "author": "LaughIntrepid5438",
      "timestamp": "",
      "body": "Well nothing technically. The only country where it has worked is China and it's not due to the technology, but rather socially through extreme punative actionsIt's worked because if you defy them you can get denied government services, sacked, your child can be expelled from school.They can parade you on national tele as an example for others what not to do, or just disappear you entirelyThey use absolute fear to get people to self censor - most of the time you'll get away with it but if you're the unlucky one they can absolutely ruin your life.We definitely don't want to be heading down that path."
    },
    {
      "author": "Incorrigibleness",
      "timestamp": "",
      "body": "Since Prime Minister Anthony Albanese said he would pursue a world-leading social media ban for under-16s, one question has dogged his government: how will it work?The answer! It won't!It was a colossal waste of time by the government."
    },
    {
      "author": "FreakySpook",
      "timestamp": "",
      "body": "It was a colossal waste of time by the government.I mean we're spending more time talking about this than the fact the government completely capitulated to the sports betting lobby and we're not likely going to get any reforms on that at all now considering next year is an election year. We're also not talking nearly enough about the government not progressing with the misinformation bill either. So we can't call it a colossal waste of time, it did do something the government & coalition wanted."
    },
    {
      "author": "asteroidorion",
      "timestamp": "",
      "body": "They'll give a massive contract to a consulting firm to find out"
    },
    {
      "author": "dinkydipigscanfly",
      "timestamp": "",
      "body": "Sound like multiple ways of invading privacy.  Not to mention who else can steal and then manipulate your information.  The government doesn't have the greatest record of keeping people's information private."
    }
  ]
}