{
  "subreddit": "mcytsnark",
  "post_id": "1gff9z5",
  "title": "Ranboo’s Shift to 18+ Content",
  "body": "Apologies for any issues, I haven’t watched Ranboo in a couple years.\n\nIs anyone else deeply confused by Ranboo’s switch to this really suggestive adult stuff? I haven’t caught up with them in a few years - but their audience still seems to be primarily composed of young teenagers. I understand they want to switch to an 18+ ID verified stream, but like… why?\n\nObviously switching to Vtubing would make a lot of sense for them, because they are faceless. That aspect I completely understand. But - and I mean this with no accusatory tone - why would they switch to promoting this very obviously sexual content to their fanbase composed primarily of minors on main? For a person who apologises over quite literally everything the idea to start showing minors soft porn seems really strange and lowkey creepy.\n\nThat’s just my thoughts. Let me know what you think, sorry for the long rant.",
  "author": "Independent-Pin-8178",
  "comments": [
    {
      "author": "miffyolo",
      "timestamp": "",
      "body": "Ranboo’s operating under a lot of flawed assumptions with the VTuber bans—a lot of them are being banned for purposefully being suggestive in ways that other VTubers have noted as being fair, and also applies to IRL streamers. VTubers just have a habit of pretending otherwise for twitter.I’m sure it’s a part of the ‘child star’ phenomenon and trying to force themselves into being seen as mature and shedding their old content. They just haven’t actually put in the work to make that happen. Their humor remains the same, their content is basically the same, and their fanbase is just DSMPers who stuck around.There’s been no evolving, similar to others in the space like TommyInnit, so trying to force it will endlessly come of as both uncanny and entitled."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "the most i've seen is ppl pointing out the weird double standard's with twitch since they allow waaaay to many things on their platform but considering ranboo's audience of chronically online tumblr kids they'll fall for it"
    },
    {
      "author": "AccomplishedToday493",
      "timestamp": "",
      "body": "the most i've seen is ppl pointing out the weird double standard's with twitch since they allow waaaay to many things on their platform but considering ranboo's audience of chronically online tumblr kids they'll fall for it"
    },
    {
      "author": "qwertypopstar",
      "timestamp": "",
      "body": "he's going through a phase every child celebrity goes through, where they want to stop going viewed as a child star so they start sexualizing themselves in hopes that the kids leave, it never worksif he hadn't fallen off, he would've gotten canceled for this, child celebrities who do this usually do, but nobody cares about him so he still has his career (or whatever is left of it)"
    },
    {
      "author": "AccomplishedToday493",
      "timestamp": "",
      "body": "Honestly if Ranboo want's to start appealing to the 18+ crowd, he has to be careful as like mentioned before some of their fans are minors (bc lets be honest who the hell gonna be in their 20's and actually watch this trash)"
    },
    {
      "author": "itwillbeclear",
      "timestamp": "",
      "body": "Does ranboo have a reason for not making an onlyfans or fansly where he could post 18+ content without requesting platform-wide changes in content moderation?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "AssistantGoe",
      "timestamp": "",
      "body": "maybe if they had good content their audience wouldn’t just be edgy tumblr teens that they so clearly are starting to despise but they made this bed themselves. now they have to lay in it"
    },
    {
      "author": "Independent-Pin-8178",
      "timestamp": "",
      "body": "I’m trying to see how VTubers have a specific set of rules…they really don’t, they’re just willing to play with fire a lot more because their models aren’treal. IRL streamers who play up the suggestive content are also getting banned for not following these rules—which I believe is showing thighs/hips uncovered, show casing clothed body in a sexualized way, and the like.It definitely sucks for the VTubers who actuallyaren’tbreaking the TOS, but for every 5 who aren’t, they are 5 that are.My only suggestion is that if you want more suggestive content, an 18+ Patreon or an OnlyFans is most definitely available!"
    }
  ]
}