{
  "subreddit": "Living_in_Korea",
  "post_id": "13l1f4l",
  "title": "Age Verification on Google/Youtube",
  "body": "Has anyone ever successfully entered their information?  It keeps saying mine is wrong.  I have the dreaded hyphenated middle name, but I've tried every variation imaginable and it still hasn't gone through.",
  "author": "ChessIsAwesome",
  "comments": [
    {
      "author": "Pessimistic_cynical",
      "timestamp": "",
      "body": "I’ve done it, but I don’t have a hyphenated name. I think whatever name you’re putting in has to match exactly what’s on your phone contract and ARC. If one of those are off, you might have to fix it and then try verifying again."
    },
    {
      "author": "DickMars",
      "timestamp": "",
      "body": "Great.  It's all good now.  I needed to enter it in all caps."
    },
    {
      "author": "WJROK",
      "timestamp": "",
      "body": "Ok here's one for you: i've been able to verify my age for Google, but for some reason I can't do so for Netflix.I've tried all the obvious routes: confirmed with telecom provider the exact spelling of my name, tried all capital/lowercase/no-space permutations. Spoke with Netflix, they said it's the telecom's fault; spoke with telecom, they said dunno. I know I can get a VPN; but it's the principle, man.Has anyone unlocked this level of Korea life?"
    },
    {
      "author": "abcueb25141",
      "timestamp": "",
      "body": "I recommend VPN to avoid this"
    },
    {
      "author": "DickMars",
      "timestamp": "",
      "body": "What's your favorite VPN?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I was capitalizing the first letter in each name and hyphenating it where they did.  But I had to use all caps just like it is on my ARC.  Now to try that on Naver.  That may be why I wasn't able to get signed up on there too."
    },
    {
      "author": "DickMars",
      "timestamp": "",
      "body": "I was capitalizing the first letter in each name and hyphenating it where they did.  But I had to use all caps just like it is on my ARC.  Now to try that on Naver.  That may be why I wasn't able to get signed up on there too."
    },
    {
      "author": "NoteworthyBeetroot",
      "timestamp": "",
      "body": "I use so many online apps/services and verify my identity in them no problem, but this is the one thing i've never been able to get to work. I always get some error from it."
    },
    {
      "author": "oddemarspiguet",
      "timestamp": "",
      "body": "For foreigners or English names sometimes you need to have no spaces and everything has to be in caps"
    },
    {
      "author": "ChessIsAwesome",
      "timestamp": "",
      "body": "Get the new pipe app"
    }
  ]
}