{
  "subreddit": "Showerthoughts",
  "post_id": "7ngaxv",
  "title": "January 1st 2000 is now the fake DOB used to get past age verification sites.",
  "body": "EDIT: Now I know what it feels like to lose an inbox....",
  "author": "GunslingerBill",
  "comments": [
    {
      "author": "UNIPanther043",
      "timestamp": "",
      "body": "So this yearr/gonewildwill be filled with girls born in 2000. Feels wrong to even think about"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Or just randomly select something starting with 19... Its easier to click. You can even press 1 in the field to have the dropdown select one for you"
    },
    {
      "author": "rimjeilly",
      "timestamp": "",
      "body": "i always use the oldest they have - i have been old.... a long time"
    },
    {
      "author": "henucu",
      "timestamp": "",
      "body": "I use 1/1/1920. Very few advertisers are interested in this age group."
    },
    {
      "author": "goatcoat",
      "timestamp": "",
      "body": "I was born in the early 80s, and I first started getting asked my age when I visited porn sites as a teenager, so I developed a habit of selecting 1975 as my birth year, which I maintain out of habit to this day even though I'm an adult.My theory is that the fake birth year entered varies by person, and the formula is approximately:Actual birth year - (age at which it is legal to access pornography - age at which the person becomes interested in accessing pornography) + CWhere \"C\" is a small safety factor so the web site assumes you are for sure an adult and doesn't call up your ISP to call up your mom to make sure. (I was a paranoid teenager.)"
    },
    {
      "author": "epicfailphx",
      "timestamp": "",
      "body": "I think that would be a tough birthday but I also feel sorry for someone born on 01/01/01."
    },
    {
      "author": "Megaman1981",
      "timestamp": "",
      "body": "It's going to be a lot easier to choose a fake date. Just choose anything starting with 19."
    },
    {
      "author": "LobbyDangle",
      "timestamp": "",
      "body": "YouTube thinks I'm 117 years old"
    },
    {
      "author": "yourmumsaman",
      "timestamp": "",
      "body": "This is the \"when I last saw you, you were this big\" of the Internet."
    },
    {
      "author": "GunslingerBill",
      "timestamp": "",
      "body": "I always used my dad's birthday as a kid/teen and it's just habit to me. I'm 21 but all the sites I signed up to before I hit 18 think I was born I'm '72."
    }
  ]
}