{
  "subreddit": "privacy",
  "post_id": "qisu6s",
  "title": "What is a way to confirm age without violating your privacy?",
  "body": "With the senate hearings this week and the increased awareness around children being negatively impacted by using social media it seems likely that a lot of services will start to ask you to confirm and even authenticate your age beyond simply typing in a birth date.\n\nI know a lot of us are uncomfortable with things like scanning a driver's license or sharing our credit card info.\n\nSo what would this community suggest as a way to be in compliance with such age restrictions without violating our privacy?",
  "author": "DamionDreggs",
  "comments": [
    {
      "author": "DiligentGarbage",
      "timestamp": "",
      "body": "Many similar proposals have been shutdown in court for being unconstitutional. Hopefully, the same will be the case for this one.I don't think there would be a privacy-friendly way to authenticate age, at the very least I can't think of one at the moment."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What you’re looking for is another YouTube client."
    },
    {
      "author": "throwdownpound",
      "timestamp": "",
      "body": "Register your account in a country without such laws."
    },
    {
      "author": "martinpagh",
      "timestamp": "",
      "body": "There are many solutions for the individual, sure. Some violate the terms of service, some may even be illegal. I'm hoping there is a solution that works for everyone.I don't mind breaching terms of service when I access a service as a consumer, but what if I have to a access a service through my job? That would be too risky."
    },
    {
      "author": "DamionDreggs",
      "timestamp": "",
      "body": "It's impossible. Age itself is an aspect of identity that cannot be verified without cross checking other identity bound information.You and a third party may be able to pick who gets to see your personal records to conduct a trusted two party verification (think OAuth-- sign in with google on non-google websites), but you're still going to have to reveal those details to someone thoroughly enough to be accepted as proof of age."
    }
  ]
}