{
  "subreddit": "australian",
  "post_id": "1goe918",
  "title": "Please write your emails and get into the streets. This ID verification law CANNOT be passed.",
  "body": "",
  "author": "Red-Engineer",
  "comments": [
    {
      "author": "FrogsMakePoorSoup",
      "timestamp": "",
      "body": "Very very ironic that you have to give all your details to be able to use the contact the PM page."
    },
    {
      "author": "SirBhavzzz",
      "timestamp": "",
      "body": "Well those details would be very useful to know if someone makes a death threat."
    },
    {
      "author": "snrub742",
      "timestamp": "",
      "body": "Talking to your local member is a much more useful use of your time.Remember, both sides of the house are supporting this bill"
    },
    {
      "author": "SeaDivide1751",
      "timestamp": "",
      "body": "“Anthony, we are going to have to dump the bill, I had dazza come into my MP office and said it’s bad.”"
    },
    {
      "author": "rdqsr",
      "timestamp": "",
      "body": "It's supported by both major parties. Same with things like ASS Access, and that bill that lets the AFP/ASIO plant illegal content on whatever device they seize from you. We're fucked either way."
    },
    {
      "author": "MicksysPCGaming",
      "timestamp": "",
      "body": "Hmmm, yes Ass Access. Very important."
    },
    {
      "author": "Redpenguin082",
      "timestamp": "",
      "body": "Everyone knows that the PM doesn't actually read these right?. It's probably read by some intern in the PM's office who has to go through 600 emails a day from random people talking about how the government controls the weather and our elected leaders are reptiles and they're going to expose everything."
    },
    {
      "author": "Inspection-Opening",
      "timestamp": "",
      "body": "What about thr new misinformation and disinformation laws they are worse"
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Contact your Senators and Members here and tell them not to vote for this.https://www.aph.gov.au/Senators_and_Members/Contacting_Senators_and_Members"
    },
    {
      "author": "Red-Engineer",
      "timestamp": "",
      "body": "And if it does get passed, plenty of us will just go \"meh\" and stop using socials rather than go through the process.  Which might be good for us anyway."
    }
  ]
}