{
  "subreddit": "Ebay",
  "post_id": "15qy3nh",
  "title": "Why does it seem age verification is… not a thing?",
  "body": "My 14 year old purchased a vape on ebay, and he just purchased it without a hitch???\n\nAnyone know anything about these age verification processes?",
  "author": "DenaBee3333",
  "comments": [
    {
      "author": "Environmental-Sock52",
      "timestamp": "",
      "body": "Online if children are willing to lie about age they can do all sorts of things that are actually forbidden to them. Access porn, order and sell things online, even criminal hacking, sell illegal drugs. Near me years ago a kid your child's age was selling illegal fireworks out of a shed through Facebook Marketplace."
    },
    {
      "author": "Duke-Phillips",
      "timestamp": "",
      "body": "vapes aren't allowed on ebay, report the seller"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yes, there should be better age verification on eBay, for the sake of everyone involved. Wold you like to be a seller who has to accept a return because some kid was a sneak?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yes, there should be better age verification on eBay, for the sake of everyone involved. Wold you like to be a seller who has to accept a return because some kid was a sneak?"
    },
    {
      "author": "LTpicklepants",
      "timestamp": "",
      "body": "How about instead of complaining about the age verification of eBay you watch what your kid is doing online?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Kids are sneaky. You can have an eagle eye on them and they'll still manage to do some pretty crafty things."
    },
    {
      "author": "TheBostonCorgi",
      "timestamp": "",
      "body": "How did he pay for it? eBay gift card?He probably had to lie to get that far with an account."
    },
    {
      "author": "ZzyzxFox",
      "timestamp": "",
      "body": "We do not need more ID/Age verification on online platforms... The government already demands enough from payment platforms. Take accountability for your kid."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "When I buy vape products online. The courier always asks for valid ID upon delivery."
    },
    {
      "author": "DenaBee3333",
      "timestamp": "",
      "body": "Vapes are not allowed to be sold on eBay. You should immediately call the police and notify eBay that they need to remove the seller.  It is illegal to sell a vape to a minor. The seller has committed a crime.  In fact, you can't even purchase and receive a vape through the mail without an adult signature upon delivery.Now, if what your so n actually purchased was an oxygen inhaler that looks like a vape, which is what I see for sale on eBay, that is legal and is not a vape and cannot be used to vape anything."
    }
  ]
}