{
  "subreddit": "Tiktokhelp",
  "post_id": "1hwc2oc",
  "title": "Randomly Age Restricted",
  "body": "My account just randomly got age restricted after 7 years, I am well above the 16 age limit and now I’ve lost all my messages with my friends and they can’t message me either, keeps asking for me to provide a selfie with photo id, should I trust this? Or does anyone have any tips to get rid of this?\n\nEdit: I’ve just decided to make a new account (still keeping my old one in hopes I can fix it without giving a picture of my ID) because I really don’t trust giving away a picture of my id especially considering the potential ban that is happening, just seems too weird to me.",
  "author": "Beginning-Craft218",
  "comments": [
    {
      "author": "broombear",
      "timestamp": "",
      "body": "The exact same thing happened to me, too! I'm so sad all my messages from my friends are gone. I wonder if it's all of TikTok or just some people. I agree that their verification methods seem sketchy. I'm looking forward to more people commenting on your post because I dont like this at all. I'm also surprised I haven't seen anyone on TikTok itself talking about it yet."
    },
    {
      "author": "Master_Name_7184",
      "timestamp": "",
      "body": "What’s sketchier is that another way to verify age is by a credit card validation, that one I don’t trust for sure"
    },
    {
      "author": "animalover21",
      "timestamp": "",
      "body": "Same thing happened to me. I uploaded my ID and covered all my info other than birthdate with my finger. Lets see if it works."
    },
    {
      "author": "MickeyLau08",
      "timestamp": "",
      "body": "I’m 35 and it happened to me today too"
    },
    {
      "author": "haileighj",
      "timestamp": "",
      "body": "This happened to me today. Submitted my id and selfie 9 hours ago and still don't have my account fixed yet. Felt weird doing it but I just want my account back. Fucking dumb."
    },
    {
      "author": "mmitten",
      "timestamp": "",
      "body": "This happened to me, too. I uploaded my selfie and ID with barcode and address removed, and they denied my appeal.I submitted a ticket through chat and they said:• TikTok’s replyHi there, We have carefully considered your situation involving your account and recognize how challenging this has been for you. After summarizing the key points and providing our comprehensive support. We must inform you that this will be our final communication on this subject. While we empathize with your circumstances, further inquiries will not yield a different outcome. It you do have questions regarding a different matter, please do not hesitate to ask. Best, The TikTok TeamI really don’t want to give them my full ID or cc. I’m so sad. I’ve had my account for 5 years."
    },
    {
      "author": "Actual-Pilot-1664",
      "timestamp": "",
      "body": "i’m exactly 16 years old, but i don’t have an ID. literally what am i supposed to dooooo"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "This is a community ran subreddit - We are not affiliated with TikTok. If this is a question about the algorithm or why you're getting a certain amount of views, please attach screenshots of both your engagement metrics, and the retentiongraph. Attaching a link to your account will also make it easier for people to help you  Thank you for posting, please be sure to checkFaQPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "gmsunshinebby",
      "timestamp": "",
      "body": "This also happened to me today!!"
    },
    {
      "author": "Beginning-Craft218",
      "timestamp": "",
      "body": "Happened to me today too!"
    }
  ]
}