{
  "subreddit": "paypigsupportgroup",
  "post_id": "1jabznc",
  "title": "To the dommes that want to make it far in findom",
  "body": "This isn't a quick cash grab nor is it an easy access to people's wallets so you can order your 8 pc wingstop meal and your $300 shein cart, this is a lifestyle, you can change how you live any time but if you're committed to the life of a dominatrix, then you should know that there are limits, there are boundaries, and the subs are human just like you. We aren't stupid and we know when you message us from this support group, your intentions aren't coming from a place of concern and honesty, but rather a place of \"how far can I go, how could I get this loser to be my sub?\"\n\nI'm not biased, I treat everyone fairly, but when anyone enters my DMs shaming me, calling me pathetic, saying I'm a loser, full on degrading me when you haven't even gotten to know me, do you think that's attractive? Do you think WE think that's attractive? not every sub is a monolith nor are we all going to be sexually intrigued by the same things you are/your previous subs were into. Stuff like that warrants hate fueled responses, and rightfully so. But before you come on here crying about it or go on findom support group crying about it, think about what you did that maybe warranted that response, and don't make that mistake again.\n\nAlso, stop saying you're new, people will either know you're lying or you'll get taken advantage of. And another thing, don't get into this fetish without knowing what lies ahead of you. This could be life changing, and could potentially be dangerous for both subs and dommes, practice having a safe space with your sub so that they don't have to worry and you don't have to as well, get to know them before you make them tribute, and stop putting tributes on your page without age verification, no posts, and no karma, it's suspicious and could make people not want to interact with you/avoid you.\n\nAnd please, stop lurking on this subreddit and contacting subs through here when they've made a post about being abused, scammed, manipulated, blackmailed, etc.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "urgirlfromnextdoor",
      "timestamp": "",
      "body": "This is such solid advice which unfortunately won’t  reach those who need it the most. Awful dommes appear exactly because they haven’t (and will not) read or do research. They’ve only watched a few videos."
    },
    {
      "author": "Pitiful_Stress9042",
      "timestamp": "",
      "body": "LOL you're right on, most of the dommes that engage on here lack comprehension skills too"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": ",,they've only watched a few videos\"is already a compliment :))) not even that in most cases"
    },
    {
      "author": "Babycakesthecutest",
      "timestamp": "",
      "body": "Conversations like this are the only reasons “dommes” should be in here at all. The group isn’t called paypighuntinggrounds"
    },
    {
      "author": "ArcaneMxDirect1",
      "timestamp": "",
      "body": "Funnily enough that's exactly why I'm here, I feel it's probably easier to learn hearing from sub's experiences what are some do's and dont's. Most domme subreddits I came across made it seem like we should be mean and demanding all the time, it didn't feel like an authentic representation of how wide the demographic of subs are. edit: This isn't advertising, I should preface, I'm still in my I guess \"study\" phase so I can see if this is for me or not"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "FairyTiddy",
      "timestamp": "",
      "body": "I never dm first 😬 and this is one of the reasons why.  Yeah. It probably will take longer time for subs to notice my profile but atleast I will attract the right ones not abuse them out of nowhere"
    },
    {
      "author": "moneyman4u2",
      "timestamp": "",
      "body": "Repost this every 2 months so the new crop if fake dommes can see it in the next rotation."
    },
    {
      "author": "MaeYouPayMe",
      "timestamp": "",
      "body": ""
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "That's the point, I've been on both sides and had a domme that really cared and gave more than enough attention, this was something beautiful and I really liked making her happy with gifts! We really shared a lot and talked a about the small things, we spend a lot of time together tho it was juts online but still I think back to that as an wonderful time!I lost interest in the bad ones so quickly, the block button appeared brighter everytime haha.Build a real connection, get to know each other and then have your fun guys. Don't send anything too soon!"
    }
  ]
}