{
  "subreddit": "ATT",
  "post_id": "18zvnbb",
  "title": "How to resolve ID verification requirement online, rather than driving to AT&T store location?",
  "body": "Somehow our AARP benefits for AT&T signature assigned a different account number than our long standing wireless account/billing number.\n\nI don’t know if that has anything to do with this recurring issue, but anything we try to order cancels after submitting photo ID per the website or app request.\n\nThe online upgrade order for two line numbers for example said, “we’ve cancelled the order at your request”, but we never requested cancellation.\n\nThis would my 3rd attempt at trying to order my upgrade device whilst promotions are still going for iPhone trade ins.\n\nI understand ID verified process keeps accounts safer, but why is it not able to be done online successfully and what originally triggered its requirement for our wireless account?",
  "author": "ATTHelp",
  "comments": [
    {
      "author": "BreakingData",
      "timestamp": "",
      "body": "They did my verification for an add a line online.https://imgur.com/a/txLOF4g"
    },
    {
      "author": "jimmut",
      "timestamp": "",
      "body": "I think they do that to every online order.  They want you to come into the store so they can screw you.   Sad but true….."
    },
    {
      "author": "ATTHelp",
      "timestamp": "",
      "body": "Hellou/AllPeanutButter, allow us to help with getting your identification scanned to finalize your device order.After you place an order with us, we'll send you a link in an email and a text message. Open the link from a smartphone or tablet, so you can use the devices' camera to take pictures of your ID and complete the process.Please be advised, you'll need to have enabled camera and video permissions to allow the image capture app to launch and take pictures of your ID.You can click on the link for ID verificationhttp://sm.att.com/9131c28fNote: Please capture the ID from the camera.Let us know this information helped!Thank you, SS"
    }
  ]
}