{
  "subreddit": "AskIndia",
  "post_id": "1h0zxao",
  "title": "Australia Bans Social Media for Kids Under 16 – Bold Move or Overreach?",
  "body": "Australia has passed a new law banning children under 16 from using social media platforms like TikTok, Instagram, and Facebook. Platforms will face fines of up to AUD 50 million for failing to comply.\n\nThis law aims to protect minors but has sparked debate, with critics warning about isolation, limited reporting of online harms, and privacy concerns. Enforcement begins in a year, and companies can't demand government IDs for age verification.\n\nWhat do you think – a necessary step or overregulation?​\n\nYes, it might not be a perfect solution, but it’s a step in the right direction. Protecting kids from harmful content and excessive screen time outweighs the critics' concerns, IMO. What’s your take?\n\nWhat are your thought about India adopting a similar policy?",
  "author": "Unhappy-Change-2483",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »r/AskIndiais looking for new moderators,please apply here if you are interested.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Traditional-Pen2612",
      "timestamp": "",
      "body": "great initiative and must happen worldwide"
    },
    {
      "author": "Fuzzy_Inspector5675",
      "timestamp": "",
      "body": "Agree"
    },
    {
      "author": "Njoymadi",
      "timestamp": "",
      "body": "critics warning about isolation, limited reporting of online harms, and privacy concerns.Wtf!!Social media was very limited till the last decade. Has the condition been so bad in a decade that kids face these serious issues because they can't use social media?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Great....but I hope the kids won't fake their age and still use it"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Most will lol, there is no proper method to verify age on these platforms, if they want to enforce age verification they'll need to ask for govt issued ID from every user and that will be a huge privacy issue. It's like porn sites warning you it's 18+ before access, this will not really prevent teens from accessing SM."
    },
    {
      "author": "W0yd69",
      "timestamp": "",
      "body": "How will they implement this if companies can't ask for government ID?"
    },
    {
      "author": "FunnyRun6294",
      "timestamp": "",
      "body": "Great move."
    },
    {
      "author": "Unhappy-Change-2483",
      "timestamp": "",
      "body": "Fully agree"
    }
  ]
}