{
  "subreddit": "lacrosse",
  "post_id": "1e4bfim",
  "title": "Age limit BS",
  "body": "My sons 2031 (2013 birth year) team just played in a very competitive tournament in Maryland this past weekend. His team was 4-0 and made it to the championship game. The opposing team had several older kids, one even drove away in his own car. They were physically beating up on our guys, it was pretty bad. Are there any tournaments out there that actually verify ages to prevent this kind of crap?",
  "author": "Sheep4732",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "There is zero chance your 11 year old son played against a 16 year old. Why are you lying?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Thats some shit the dramatic mom would make up and tell the other parents and whine to me when their kids got beat."
    },
    {
      "author": "Ironman_2678",
      "timestamp": "",
      "body": "Correct.  Lol."
    },
    {
      "author": "Upbeat_Call4935",
      "timestamp": "",
      "body": "Hand to God…I was at a 10U tournament last weekend and a kid drove up in a 2008 Dodge Caravan with his two kids in car seats in the back, shotgunned two Natty Lites in the parking lot, went out and scored 7 goals. Chainsmoked Newports at halftime. Had a mustache like Stalin."
    },
    {
      "author": "sir_PepsiTot",
      "timestamp": "",
      "body": "Look at their account, not even 2 comment karma"
    },
    {
      "author": "SouthSideCountryClub",
      "timestamp": "",
      "body": "Was there a teen wolf?Sounds like that episode of How I Met Your Mother where Marshall is a basketball coach"
    },
    {
      "author": "QuantumMothersLove",
      "timestamp": "",
      "body": "We just played in a 2031 tourney about 13 hours away and this one guy, a defensive mid… well he brought his wife and kids annnnnd his AARP agent… then flew his own helicopter off the field.  When will they start checking id’s. 👀"
    },
    {
      "author": "Upbeat_Call4935",
      "timestamp": "",
      "body": "Nicely done. 🤣🤣"
    },
    {
      "author": "sentientcruising",
      "timestamp": "",
      "body": "Although I agree with the sentiment... there was no one in the 2031 player pool driving away in their own car. Lose the drama and hyperbole."
    },
    {
      "author": "Sheep4732",
      "timestamp": "",
      "body": "Me when I lie"
    }
  ]
}