{
  "subreddit": "beatsaber",
  "post_id": "1bh96ff",
  "title": "How the FUCK do I get a A SS RANK FOR THE FLAWLESS TROPHY",
  "body": "ITS TOO FUCKING HARD",
  "author": "ZYHunters",
  "comments": [
    {
      "author": "Jikhre",
      "timestamp": "",
      "body": "The way scoring works in Beat Saber is that 70 points are awarded for 100° of pre-swing, 30 points are awarded for 60° of post-swing, and 15 comes from how close to the center of the note you hit. For an SS, you need an average of 103.5 points per swing. So, as long as you're making full swings and hitting the majority of the notes, you should be able to get it. By the way, this doesn't mean you should swing hard, just in a decently sized arc."
    },
    {
      "author": "kinsi55",
      "timestamp": "",
      "body": "dont tap the blocks but cut them."
    },
    {
      "author": "QTpopOfficial",
      "timestamp": "",
      "body": "Git Gud."
    },
    {
      "author": "PresenceSpirited",
      "timestamp": "",
      "body": "This. Tons of resources online to help “git gud” if you know what to look for. Complaining isn’t too useful for results if hard work can get you there"
    },
    {
      "author": "LBHJ1707",
      "timestamp": "",
      "body": "swing big with wrist and arm and in the middle of the notedon't miss either"
    },
    {
      "author": "SokkaHaikuBot",
      "timestamp": "",
      "body": "Sokka-HaikubyLBHJ1707:Swing big with wrist andArm and in the middle ofThe note don't miss eitherRememberthatonetimeSokkaaccidentallyusedanextrasyllableinthatHaikuBattleinBaSingSe?ThatwasaSokkaHaikuandyoujustmadeone."
    },
    {
      "author": "PresenceSpirited",
      "timestamp": "",
      "body": "Consistent wide cuts and accuracy. Only thing in your way is you. (In an encouraging tone)"
    },
    {
      "author": "earBLind69",
      "timestamp": "",
      "body": "Full swings and a whole shit ton of 115s"
    },
    {
      "author": "levistadYT",
      "timestamp": "",
      "body": "90% accuracy or higher, so swing fully and as accurate as possible for 115's"
    },
    {
      "author": "ZYHunters",
      "timestamp": "",
      "body": "if you act like you’re literally decapitating someone eventually it should work"
    }
  ]
}