{
  "subreddit": "PrivacyGuides",
  "post_id": "u8q4ib",
  "title": "Help! Google wants to \"verify\" my age that I'm 18 or older in order to install a dating app from Play Market, but I absolutely don't want to send my ID nor my credit card. How can I bypass it?",
  "body": "Has anyone done that?\n\nWill using a VPN help to bypass it? If so, what country should be selected? Which countries are exempt from this \"age verification\" thing?\n\nDoes Google Play Store change your country in its settings based on where you're located?\n\nBTW I am older than 18, but f*ck Google.",
  "author": "HoustonBOFH",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "aurora store"
    },
    {
      "author": "DrHeywoodRFloyd",
      "timestamp": "",
      "body": "This! Install Aurora Store from F-Droid and use it to log in to the PlayStore with a random account. This would be my first choice before downloading an APK from the web."
    },
    {
      "author": "infinity-plus",
      "timestamp": "",
      "body": "Use apk mirror?"
    },
    {
      "author": "moneroTrident",
      "timestamp": "",
      "body": "Never experienced that. I just register a new account and set my birthday, and Google never bothers me for age. Does it requires you to provide a credit card? If it is true, buy a burner virtual credit card from black hat world forum, there are a lot of vendors selling it for verification purpose. You can search vcc and find a cheap burner card and buy with crypto. If you are in a hurry I personally recommend vccbaba.com, their credit card quality is good and supports direct monero paymentIf a credit card is not required just find a way to register your account in a country without those age verification restriction bullshit and set you birthday. You might need a clean ip to avoid phone verification, so it is better to have residential proxy than VPN"
    },
    {
      "author": "HoustonBOFH",
      "timestamp": "",
      "body": "Several have been mentioned but apkpure is what I use when \"the man\" is being difficult."
    }
  ]
}