{
  "subreddit": "privacy",
  "post_id": "1i3ru1k",
  "title": "VPNs Are Not a Solution to Age Verification Laws",
  "body": "",
  "author": "YT_Brian",
  "comments": [
    {
      "author": "2sec4u",
      "timestamp": "",
      "body": "This should never have been made a law. And screw everyone that thought this was a good idea.Look. I'm all for stopping kids from getting their hands on porn, but NOT by giving the government power to decide what's good for our kids. The solution is to gee golly BE A PARENT and NOT have the government do the hard part.Mark my damn words. If the laws for 'age verification' are upheld they will be used to give the government more power. They don't give a shit about you or your kids. PARENT YOUR CHILD. Don't give government permission to do it for you. The solution isn't VPNs or new laws.The solution will almost never be more laws. Hell, I wouldn't be surprised if this shit turns into something that ends up banning VPNs so age verification can't be bypassed.FUCK/rant"
    },
    {
      "author": "d1722825",
      "timestamp": "",
      "body": "I'm all for stopping kids from getting their hands on pornThe thing is, it wouldn't even stop them. As the article says: VPN services are available, torrent and other things still exists, or \"as a last resort\" it would just be exchanged on offline media."
    },
    {
      "author": "Id1otbox",
      "timestamp": "",
      "body": "Planned first phase to go after VPNs and online anonymity."
    },
    {
      "author": "ManicParroT",
      "timestamp": "",
      "body": "This is all as a result of an anti-porn campaign led by the Christian right. A lot of this NoFap, millennials don't want sex in move,  \"My husband is addicted to porn and killed the dog AIO?\" stuff is downstream of it. It's actually very impressive how they've managed to shift the zeitgeist on this."
    },
    {
      "author": "Fred_Oner",
      "timestamp": "",
      "body": "Yet another freedom of ours has been stripped with little to no resistance... Don't let them take more of them away, because first they'll come for my rights and freedom; then they've take your neighbors', and then they'll come for yours."
    },
    {
      "author": "SootyFreak666",
      "timestamp": "",
      "body": "Age verification laws should be seen and treated as crimes, it’s essentially no different to someone installing a spy camera into a bedroom or bathroom and they enable all sorts of crimes, including crimes against children and violence against women and girls.There is simply nothing ethical, safe or even necessary with these laws, they simply exist to line the pockets of the predatory age verification industry.VPNs might save people, but the long term goal should be demanding that the government removes these laws or at-least hold those pushing them accountable.Politicians should see jail time when these laws inevitably go wrong. It’s state enforced sex crimes."
    },
    {
      "author": "Stunning_Repair_7483",
      "timestamp": "",
      "body": "Kids die from poverty, mass shootings, homelessness, medical issues, child abuse, neglect, violence, and are sexually assaulted and abducted in high numbers but the government claims that doing this is going to \"protect kids\" Because it's not like the government ever lies about anything right? It's always honest. And clearly kids seeing sexual content is the most harmful thing to them right? Nothing else right? And as usual, the majority of people will just tolerate it, because that happens all the time."
    },
    {
      "author": "aksdb",
      "timestamp": "",
      "body": "VPNs are really a bad solution here. How could the websites recommend me MILFs in my neighborhood, if they think I am halfway across the world?! /s"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "These laws don’t stop jack shit. Torrents don’t give two fucks about your age."
    },
    {
      "author": "YT_Brian",
      "timestamp": "",
      "body": "Summary?Because VPN to non-verification, sign up, don't give real information, always use VPN for site/app, profit.Sure, real solution is to try to get those laws remove. And actually bother being in your kids life and monitor their intake from the internet on a daily basis.But how likely is that for most of current and next generation? Might be able to get the laws revoked though in court."
    }
  ]
}