{
  "subreddit": "privacy",
  "post_id": "1fl6vgy",
  "title": "Canada’s Leaders Must Reject Overbroad Age Verification Bill",
  "body": "",
  "author": "vriska1",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Or there's an age verification company with a hell of a sales team!"
    },
    {
      "author": "travistravis",
      "timestamp": "",
      "body": "Or there's an age verification company with a hell of a sales team!"
    },
    {
      "author": "RealBiggly",
      "timestamp": "",
      "body": "WEF has entered the chat...."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Tho AV has been a mess and has falled apart over and over again."
    },
    {
      "author": "a_Ninja_b0y",
      "timestamp": "",
      "body": "From the article :-''First introduced in 2023, S-210 seeks to prevent young people from encountering sexually explicit material by requiring all commercial internet services that “make available” explicit content to adopt age verification services. Typically, these services will require people to show government-issued ID to get on the internet. According to bill authors, this is needed to prevent harms like the “development of pornography addiction” and “the reinforcement of gender stereotypes and the development of attitudes favorable to harassment and violence…particularly against women.”The motivation is laudable, but requiring people of all ages to show ID to get online won’t help women or young people. If S-210 isn't stopped before it reaches the third reading and final vote in the House of Commons, Canadians will be forced to a repressive and unworkable age verification regulation.''"
    },
    {
      "author": "Android_security",
      "timestamp": "",
      "body": "Not to mention the risk of identity theft by porn site operators, who will be amassing millions of 18-year-olds’ ID information, all with solid credit ratings. It’s a dubious setup that seems poised to fuel crime in Canada."
    },
    {
      "author": "RealBiggly",
      "timestamp": "",
      "body": "What's laudable about it?"
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Do we know when they will vote on this?"
    },
    {
      "author": "RealBiggly",
      "timestamp": "",
      "body": "Over-broad is the entire point of it."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Atleast there a silver lining if it was to passhttps://www.parl.ca/DocumentViewer/en/44-1/bill/S-210/third-readingComing into Force One year after royal assent12 This Act comes into force on the first anniversary of the day on which it receives royal assent.It will likely be taken down in court."
    }
  ]
}