{
  "subreddit": "MetaQuestVR",
  "post_id": "1fkwkwj",
  "title": "Son was asked to verify his age to contine using account but device wasn't handy to complete...",
  "body": "I received an email to my son telling him to verify that he was old enough to use his teen Meta account.\n\nI followed the link to verify his age and used a Credit Card and then it asked me for a cod that would display on the screen.  The device wasn't available at the time so I never was able to complete this step.\n\nNow when I go back to that same Verify link on his account there is no place to complete the verification.  I've been charged $1 but I can't tell if he's really verified.\n\nThey've threatened to disable the account by Sep 29 if not verified but I can't figure out a way to complete the verification based on a code on his device because there is no longer a place that asks me for the code.",
  "author": "True_Cryptographer76",
  "comments": [
    {
      "author": "size12shoebacca",
      "timestamp": "",
      "body": "This is a question for Meta Support, not us.https://www.meta.com/help/support/"
    },
    {
      "author": "PuritanMarine",
      "timestamp": "",
      "body": "Thanks.  I tried that earlier, but realized I need to request account support for the specific device or it sends me to an FAQ about Meta.  I was finally able to figure out how to send a support request."
    },
    {
      "author": "MathiasReborn",
      "timestamp": "",
      "body": "Do you have pics of the emails? From my memory when I was asked to verify age it was through my headset not an email and I’m confident meta doesn’t verify using a credit card charge and you may need to cancel that card because it sounds like a phishing email"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "ok"
    },
    {
      "author": "jeweliegb",
      "timestamp": "",
      "body": "?"
    },
    {
      "author": "rileyrgham",
      "timestamp": "",
      "body": "Asking your son to verify his age with a credit card sounds... weird. Do \"sons\" have credit cards?"
    },
    {
      "author": "Curious_Delay774",
      "timestamp": "",
      "body": "Reset n do again"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Class action suit future."
    },
    {
      "author": "Curious_Delay774",
      "timestamp": "",
      "body": "Sorry hope u get it sorted could I Google it"
    },
    {
      "author": "True_Cryptographer76",
      "timestamp": "",
      "body": "Seems it is happenning with alot of companies all of a sudden at the same time  .To me I feel its a data harvest thats all feeding into D-Waves Qtm Ai, building complete new Identity data base. And then some !!"
    }
  ]
}