{
  "subreddit": "paypigsupportgroup",
  "post_id": "1e9g06l",
  "title": "Age verification",
  "body": "I asked this in the FinDom support group too but I wanted a sub’s perspective.\n\nDo you age verify? If yes, how do you verify in a way that doesn’t feel like an invasion of privacy? (I understand sending an ID can be scary, so I try to offer options like having an account on LF)\n\nIf no, is privacy the main concern? Do you have trouble finding a domme to interact with that doesn’t require AV?",
  "author": "RieCries",
  "comments": [
    {
      "author": "moneyman4u2",
      "timestamp": "",
      "body": "No joke.  I was bored one day and responded to a dm. I  askes for age verification link and a photo.Idiot sent me her drivers license with her name blocked out..and nothing else and a photoI decided not to be an ass and told them nicely how dumb they were and about ways to verify online...safety first.To boot, they are in my home state so if i was some stalker it would have been an easy one."
    },
    {
      "author": "PrincessPetal333",
      "timestamp": "",
      "body": "I had a sub send me their ID with nothing blacked out (despite specific instructions)! Full name, picture, address. Same as you we were in the same state, Nearly the same city even 💀 luckily for him I have no ill-intent but damn, there’s just no precaution."
    },
    {
      "author": "MissPeachGoddess",
      "timestamp": "",
      "body": "How do you age verify ? Dommes have adult sites , ideally subs could but they don’t , so I ask for ID"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "All they have to do is talk to me and hear me reference Wild Things on VHS,  obscure 80s new wave bands and Xena Warrior Princess on cable and nobody has ever asked me about my age."
    },
    {
      "author": "GoddessLunaRae",
      "timestamp": "",
      "body": "......... you are really old."
    },
    {
      "author": "Goddess_Rayne",
      "timestamp": "",
      "body": "Quick - what grade were you in when spice girls blew up?! (US based question lol)"
    },
    {
      "author": "littlemisscannabisx",
      "timestamp": "",
      "body": "And here I was thinking I was the only one who loved Xena : Warrior Princess 😅"
    },
    {
      "author": "Humble-Wrongdoer2551",
      "timestamp": "",
      "body": "I will, if I'm asked to. It shouldn't be a big issue for subs to verify, too."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I always ask my subs for age verification. But I get the ID thing can seem odd . But I also offer sites like loyal fans and Onlyfans to verify. I simply want to know you’re not a minor"
    },
    {
      "author": "RieCries",
      "timestamp": "",
      "body": "Yoti.com is a good way to age verify."
    }
  ]
}