{
  "subreddit": "technology",
  "post_id": "1j737nl",
  "title": "First Porn, Now Skin Cream? ‘Age Verification’ Bills Are Out of Control",
  "body": "",
  "author": "BlueHym",
  "comments": [
    {
      "author": "Fecal-Facts",
      "timestamp": "",
      "body": "We told you so.Next is requiring a ID card to just browse the Internet.It's coming"
    },
    {
      "author": "MargretTatchersParty",
      "timestamp": "",
      "body": "That was the point with KOSA and EARNIT bills. They're trying to tag individual identity to internet traffic."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "nobodyspecial767r",
      "timestamp": "",
      "body": "Just figuring it out that it was never about porn?"
    },
    {
      "author": "Exact-Event-5772",
      "timestamp": "",
      "body": "We've only been warning about this foryears!"
    },
    {
      "author": "BeeWeird7940",
      "timestamp": "",
      "body": "I get the impression we’re headed toward a new internet. It won’t replace the one we all use, but it will be a different one. The one we use today will be entirely filled with scams, bots arguing among themselves, AI generated fake news and porn.The second internet will require your identification to participate. Your actions will be traceable back to you. If you post slander, or AI-generated lies, or simply pretend to be a Nigerian prince with a million dollars, this internet will be able to find you.The first internet will still exist, but businesses will want to invest in the second one. Your bank will be on the second one. Google will move to the second one. Slowly, the anonymous internet will lose investment. It will still exist, but it will be so loaded with spam, scams and bots that it won’t really be worth going to.For all any of you know, I could be ChatGPT running off a script to get me posting comments on Reddit.For all I know I’m just commenting to a bunch of other bots. This system will soon have no value to actual people. Something else will have to exist."
    },
    {
      "author": "frosted1030",
      "timestamp": "",
      "body": "It's not about age, it's about selling your information, always has been."
    },
    {
      "author": "wiseduckling",
      "timestamp": "",
      "body": "I don't know if skin cream should have age verification, but also brands and influencers convincing pre teens that they need to put a shit ton of random chemicals on their face is highly unethical to me."
    },
    {
      "author": "fellipec",
      "timestamp": "",
      "body": "Agree, so go after the influencers and brands, not after the users and costumers"
    },
    {
      "author": "BlueHym",
      "timestamp": "",
      "body": "For all intents and purposes, this trend is utterly stupid and benefits no one but those who wants to take your privacy data for malicious use."
    }
  ]
}