{
  "subreddit": "royalcaribbean",
  "post_id": "183py3j",
  "title": "Escape Room Age",
  "body": "Does anyone know if you can bring a younger ( 11 year old) to an escape Room experience if they are with parents and older siblings?\n\nThe age limit is listed as 12.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "nygrl811",
      "timestamp": "",
      "body": "If the minimum age is 12, probably not."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Exactly.  Rules for thee not for me."
    },
    {
      "author": "Displacedhome",
      "timestamp": "",
      "body": "I emailed the company and they said we can ask once we’re on board at guest relations. It makes me think we might be able to, if they aren’t full or they want to fill slots."
    },
    {
      "author": "Caranath128",
      "timestamp": "",
      "body": "Hard limit."
    },
    {
      "author": "Joshwa52",
      "timestamp": "",
      "body": "Yes, because there isn't a safety risk the age is just a recommendation. Do however keep in mind there are puzzles and challenges they may be deemed too difficult for those under 12. We did it and it was a ton of fun. A huge team effort. Hope you guys have an amazing cruise!"
    },
    {
      "author": "dodgeballking",
      "timestamp": "",
      "body": "Thank you"
    },
    {
      "author": "Starbuck522",
      "timestamp": "",
      "body": "If it's a reccomendation, I think 11 would be ok if 12 is reccomended, but I sure hope people wouldn't drag along someone under 10 who would be bored and thus likely disruptive.It's designed to need the number of people stated.  It's designed to be for the age stated.  (Sure, one year younger is fine)"
    },
    {
      "author": "dodgeballking",
      "timestamp": "",
      "body": "Thank for the responses. I will inquire at the desk when we get onboard."
    },
    {
      "author": "HoodratHoochiemama",
      "timestamp": "",
      "body": "Hi! Just checking to see if you were able to have your 11 year old do the escape room. I’m in the same situation with an 11 year old who wants to participate. Thanks!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}