{
  "subreddit": "Visible",
  "post_id": "exbw0n",
  "title": "Problems Verifying My Identity With Phone Number",
  "body": "I just ported over to Visible early last week. $25/mo for unlimited everything is a killer deal and I've been liking the service.\n\nHowever, I'm trying to use my phone number to verify my identity online with banks and the IRS. Every website is telling me the same thing; that my name is not registered to my number. This was a big reason I left my parents family plan. So that I can easily verify my identity with financial institutions. Visible help chat seems clueless about this and I've been told I will get a response in 48 hours over 4 days ago. I haven't gotten an email.\n\nAnyone else having this issue?",
  "author": "dcendum",
  "comments": [
    {
      "author": "thiagosantiro",
      "timestamp": "",
      "body": "Prepaid providers can include your phone number, name, address and email address depends on the provider of the service. Metropcs, Boost Mobile, T-Mobile prepaid all provide those identity services. Visible should do the same with a \"profile\" page that allows you to input that information."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It's a prepaid service. I'm pretty sure you can'tverifyidentity that way since anyone can just sign up under any name."
    },
    {
      "author": "Prudent_Geologist",
      "timestamp": "",
      "body": "IRS doesn't accept prepaid numbers to verify identity because we'll, the prepaid carrier doesn't verify identity. They only take postpaid where the company has collected SS# and verified identity."
    },
    {
      "author": "Decaffeinated_Sloth",
      "timestamp": "",
      "body": "This may be a deal breaker. Still testing out the service this month. Love it so far... But this may be an issue in the long run"
    },
    {
      "author": "cellguru99",
      "timestamp": "",
      "body": "I had this problem with Capitol One. Their answer (after several calls to CS and Tech Support) was to wait 30 days while they did some sort of manual check and there was no alternative.  It was a royal pain. Sure enough I was verified on day 31."
    },
    {
      "author": "dcendum",
      "timestamp": "",
      "body": "Bummer. Running into this same issue with banks. I thought it was because I chose to not share CPNI but it seems it's another issue? I've been super happy with the service, but this may actually be a deal-breaker since so many of the other services I use verify via phone."
    }
  ]
}