{
  "subreddit": "LowStakesConspiracies",
  "post_id": "1gwry0y",
  "title": "Age verification measures for social media is probably intended to identify adults not children",
  "body": "Australia and possibly the UK are  considering banning young people from using social media (youtube, tiktok, reddit, facebook).To do this they will likely force the platform to request age verification from all users from the country; probably by asking users for a photo of their ID or a live photo of their face.\n\n(are* not is, I'm sleep deprived :P )",
  "author": "Procedure-Minimum",
  "comments": [
    {
      "author": "VFiddly",
      "timestamp": "",
      "body": "Previous UK governments have tried to ban certain parts of the internet and it has never actually worked. I expect if they even get that far, it won't work. Most likely all it would actually do is require social media sites to ask for your ages like porn sites do. They don't actually check.In any case, if you have a photo ID, the government already has your name, face, and date of birth, so this wouldn't tell them anything they don't already know."
    },
    {
      "author": "Hellonstrikers",
      "timestamp": "",
      "body": "They could be used to track internet habits."
    },
    {
      "author": "wrighty2009",
      "timestamp": "",
      "body": "The teens will just use free vpn plans or otherwise find ways around it. All it'll do is push kids social media usage into the underground, making them even less safe online. The schools and people who did educate their kids about social media and being safe online think they won't have to do it as their kids can't access social media anymore, and the social media will be overrun with teens who havent been told that Instagram isn't real, and that there's predators pretending to be 14, and that Russian bots try to destabilise other countries democracy.Sure, some clever parents will still educate about the risks of social media, but similar to my in laws family who thought their 14 year old wasn't going to get smashed at a news years party as \"she's 14,\" others who usually would educate their kids, will not bother telling them a fucking thing."
    },
    {
      "author": "TheMissingThink",
      "timestamp": "",
      "body": "Governments have been trying to regulate internet access almost since it first appeared.  Even China's 'great firewall' has proved ineffective.Child safety is just the wedge that's currently being used to drive the legislation - after all, who doesn't want to protect children?Of course, the children will be among the first to bypass any safety measures that are brought in. The solution is to push responsibility back onto the parents. Most parents these days grew up with the internet,  so ignorance is not an excuse."
    },
    {
      "author": "Katwazere",
      "timestamp": "",
      "body": "Early unsupervised Internet access has caused severe psychological issues in the young generations. Also governments already have access to all that data"
    },
    {
      "author": "Spiderinthecornerr",
      "timestamp": "",
      "body": "Gov yes, these companies, no"
    },
    {
      "author": "IAmTaka_VG",
      "timestamp": "",
      "body": "I used to think this. But I’m at the point where it’s impossible to stop your kids from using social media.Despite, talks, bans, parental controls, restrictions. Even the “main” social media apps are so dangerous and bad for their wellbeing.Social media IMO should require age verification if you have over X million users.Keep forums and small chats private but tiktok, meta, and shit need to be regulated or down right banned for people under 16."
    },
    {
      "author": "AdvancedSandwiches",
      "timestamp": "",
      "body": "Older people don't seem to be doing any better with it.  Just ban all ages. None of us are better off with this shit."
    },
    {
      "author": "Freecelebritypics",
      "timestamp": "",
      "body": "ngl they should ban social media for everyone. It has no value"
    },
    {
      "author": "Procedure-Minimum",
      "timestamp": "",
      "body": "This isn't even a conspiracy it's all there in the documents"
    }
  ]
}