{
  "subreddit": "SwagBucks",
  "post_id": "17o9suj",
  "title": "age question",
  "body": "So I just downloaded swagbucks today, and after some research on this subreddit, I saw that they can ask for id verification? I’m 16 and i already put a fake age in, and answered questions such as having gone to college. What will happen if this happens to me? Do i get banned?",
  "author": "Anantasesa",
  "comments": [
    {
      "author": "FightmeLuigibestgirl",
      "timestamp": "",
      "body": "You can get surveys for teenagers. You should have used your actual age. You might get banned via surveys and unable to cash out if you use different information."
    },
    {
      "author": "MadAsianDood",
      "timestamp": "",
      "body": "I didn’t know. I used Eureka before this, and you the requirement was 18. I thought it would be same for swagbucks aswell."
    },
    {
      "author": "Mommabroyles",
      "timestamp": "",
      "body": "You only have to be 13 for swagbucks. No reason to have lied."
    },
    {
      "author": "buppywins",
      "timestamp": "",
      "body": "Jail.Jk, no, you might lose the ability to continue doing surveys though.Not condoning rule breaking, but If a teen was gonna lie about their age, they could at least pretend to be their own parent, and be able to qualify for all the surveys which ask if there’s kids in the home. Theoretically speaking of course."
    },
    {
      "author": "MadAsianDood",
      "timestamp": "",
      "body": "How about game offers? I hear that they usually send the ID verification email when you send a support request, usually for pending issues. THEN what do I do? Also, then, is there a way I can change my age or is it too late?"
    },
    {
      "author": "blinkdmb",
      "timestamp": "",
      "body": "When you cash out your points just make sure you put the birthday that you put to sign up my son did it before he was 18 and when he went to cash out he used his birthday and they banned him and didn't give him his points"
    },
    {
      "author": "KraZiBitXh",
      "timestamp": "",
      "body": "the age to sign up is 13 and older. i signed up at 13 and put 19 until i realized i could get surveys for teenagers and just made new email and account."
    },
    {
      "author": "Anantasesa",
      "timestamp": "",
      "body": "Just be consistent with your age. I alternated between 2 zip codes I move back and forth between IRL and had a warning pop up that I've given some inconsistent answers and might lose access to surveys. My points banned me several years ago from doing surveys and only last year they repealed the ban as a courtesy. Back when the ban was givem, I had argued against the ban being based on a vague pair of questions that I answered with conflicting answers bc both were true."
    }
  ]
}