{
  "subreddit": "MetaQuestVR",
  "post_id": "1fkxf9h",
  "title": "the age verification prompt",
  "body": "It showed up a few days ago and i read that in order to keep using my account i have to verify my age within 30 days well i accidentally put the wrong year, will the prompt show back up? and if not will this be an issue?",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "is this topic 90% of the posts on this subreddit at this point"
    },
    {
      "author": "AlexCivitello",
      "timestamp": "",
      "body": "Probably because people don't put in their really birthday and as a result, put in a different birthday when they get prompted to verify."
    },
    {
      "author": "Markgulfcoast",
      "timestamp": "",
      "body": "you should be contacting Meta support, as no one here will have the answer."
    },
    {
      "author": "ztoned_and_cold",
      "timestamp": "",
      "body": "Do you play a specific game a lot? I have been wondering what could trigger that notification. For example if you hung aroung in horizon worlds a lot and got spotted by a community mod."
    },
    {
      "author": "chompboy84",
      "timestamp": "",
      "body": "i played nightclub sim for like 4 days"
    },
    {
      "author": "Automaticman01",
      "timestamp": "",
      "body": "I got a notification the other day and have never been in an online game like horizon or multiplayer lobby so who knows?  It didn't need any special verification, it just asked for my birthday and said ok.  I figured they might just be rolling them out to everyone to cover the bases."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Just put in the same birthday you used on facebook, if you have, or given Meta before.  Put something close to your real age and write it down.  I think it's a child-proofing thing.  Useless but maybe some law put on Meta.In any case, nobody needs to know my real birthday.  That is 50% of stealing your identity."
    }
  ]
}