{
  "subreddit": "roblox",
  "post_id": "psnukf",
  "title": "Ok... about the age verification.",
  "body": "Now that Roblox confirmed it is bringing in age verification for Spatial Voice and potentially other features, this leaves the obvious question. \"Why?\"\n\nHere's the situation. No other platform that I'm aware of requires age verification with government-issued ID to access voice chat. Specifically, the main gaming platforms (Xbox Live, PSN and Switch Online if anyone even bought that), and the main dedicated voice services. So hear me out. If someone under the age of 13 can easily fake their way into getting a Microsoft account, a Gold subscription and a copy of whatever their favourite M/18 rated game is with barely any consequence, why should Roblox require actual identification to use this feature?\n\nLook, I get it, there's parts of the community that will use voice chat for literally nothing but hurling racial slurs at people. But we all know. If there's a block on something, all it takes is one person to know how to beat the system for the rest of the world to know.\n\nTL;DR: Roblox's age verification barely makes sense and actually seems quite easily avoidable.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I think because in roblox you don't need to use a E-mail mandatory, and people could create accounts for stalking people, threatening, etc..."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I wonder if I will still be able to troll in VC, since they would have my ID stored...Wondering if all accounts I made will get banned."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "_SolarCloud",
      "timestamp": "",
      "body": "Alright how many people that are not 18+ has their own passport or other ID's? I don't know any in my country."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}