{
  "subreddit": "technology",
  "post_id": "1i9khhw",
  "title": "The Impact of Age Verification Measures Goes Beyond Porn Sites",
  "body": "",
  "author": "EnoughDatabase5382",
  "comments": [
    {
      "author": "Fecal-Facts",
      "timestamp": "",
      "body": "The end goal is to have IDs to even access the Internet and take a wild guess why and why that's a horrible idea.This isn't some tinfoil hat conspiracy either.And if you need example of why this is bad idea look at who is in charge now and what he would do if he knew who posted what.This isn't even touching on how bad of a security threat this is financially alone."
    },
    {
      "author": "BufferUnderpants",
      "timestamp": "",
      "body": "Buddy sure would like to know what every federal employee personally thinks, as he MAGAfies public servicesWe don’t even need to speculate on what that will mean for other groups or the general population, because this isn’t a slippery slope scenario, it’s already bad, pretty damned bad"
    },
    {
      "author": "TWFH",
      "timestamp": "",
      "body": "But wouldn't the children just be safer if we kept them all in cages? No one could harm them there.Think of them... the children."
    },
    {
      "author": "Jumping-Gazelle",
      "timestamp": "",
      "body": "The Court is now considering how government-mandated age verification impacts adults’ free speech rights online.These challenges keep arising because this isn’t just about safety—it’s censorship.Somehow the internet needs to be treated like power tools, electric wiring, large magnets, or basically any other potentially dangerous household item.... You don't need a license, yet you don't let your kid play with it. Or at least under heavy supervision.Somehow."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Teffisk",
      "timestamp": "",
      "body": "I agree with you. I'm only worried that my kid's friends can bring those power tools to school in his pocket."
    },
    {
      "author": "Psipher2897",
      "timestamp": "",
      "body": "Oklahoma legislation is a crimson red flag of what’s to come.  I think the state GOP there realized the bans they got in some of the other states aren’t working, so they wannastep up their game.And here’s the thing, even if you’re like “Well I don’t look at that stuff so this doesn’t affect me” in all honesty, whether you do you you don’t is none of anyone’s business, but this is EXACTLY how they start censoring anything they don’t like.  It’s straight out of an authoritarian playbook to criminalize anything they deem inappropriate."
    },
    {
      "author": "youngestmillennial",
      "timestamp": "",
      "body": "As an Oklahoma, the porn situation has me looking over at the box of 60s porn I inherited"
    },
    {
      "author": "Thick_Yak_2581",
      "timestamp": "",
      "body": "Sadly true - these laws target LGBTQ+ content as well. When platforms have to verify ages to avoid legal issues, they often over-censor anything remotely LGBTQ+ related. Even resources about health and identity get blocked. It's not about protecting kids, it's about controlling what people can see online"
    },
    {
      "author": "EnoughDatabase5382",
      "timestamp": "",
      "body": "Personally, I believe it's more important to give users the freedom to fine-tune control over the content they want to view, rather than relying on legal regulations. Currently, search engines often rank websites that I personally consider to be low-quality at the top, and platforms are pushing content on users too aggressively. By the way, in South Korea, age verification via mobile phone is used for adult content such as safe search, and it doesn't seem to be a major problem. However, as there is a story that the president was addicted to a far-right YouTuber, the problem seems to lie beyond adult content."
    }
  ]
}