{
  "subreddit": "SwipeHelper",
  "post_id": "rihdol",
  "title": "Profile verification required - Banned on tinder",
  "body": "I need some help guys. My tinder profile got banned a month ago. Some reported me for it being fake because i had model pictures i guess. Anyways. I have created a new one but i dont use my own pics. I just use picture of nature etc.\n\nSo today, 5-6 days after i created a new one i get a message \"Proifle verification required.  Recent acitivy has caused us to lock your account. To continue swping, please verify your profile photos\". Then there is this posture i have to do (my hand over my head). I cant bypass it.\n\nHad anyone had success here on what to do to trick the bot? I have read many posts here about NOT to verify because then they have your biometical face data etc. How about cloaking a pic of oneself? or make myself different looking? Or any other soluton that you guys had success with?\n\nI was may be asking my brother to help but i am not sure neither. Anyone been in the same situation where they were prompted the same?",
  "author": "Nvidos",
  "comments": [
    {
      "author": "CeaselessDuchess",
      "timestamp": "",
      "body": "You need to create new account. Use DatingZest Tinder service to get back again on it. It worked for me"
    },
    {
      "author": "corsega",
      "timestamp": "",
      "body": "Likely you didn't do a hard reset, so they were able to link your old account."
    },
    {
      "author": "justareddituser2021",
      "timestamp": "",
      "body": "It's also entirely possible that either 1) people reported a profile with no photos of a person or 2) Tinder uses some sort of very simple AI to periodically flag accounts that don't seem to have any photos of people."
    },
    {
      "author": "Nvidos",
      "timestamp": "",
      "body": "Just wanted to give some update for those who need it. So I waited like 12 hours or less and was able to use my account for 15 minutes before It got locked again and it force me to verify. So I logged in through Firefox and was able to manage and delete my account.And no.. I didn't catfish or anything bad. But I guess I got flagged out on this verification because this verification happened after I created a new second identity browser through the sphere browser.. Which changed my ip to another location. It was right after that I got this issue to be forced to verify. I have read read threads here from people moving to another city and then the same thing happens to theme.I don't want to verify based on what I have read. But I am not sure if things have changed today . Is a verification only to state that you are a human these days or does it also store other info which makes it even more difficult to banned users to use it after you verified? Any verified banned user's here who have experimented?"
    }
  ]
}