{
  "subreddit": "Twitter",
  "post_id": "1chcsr1",
  "title": "May 2024 - /r/Twitter Mega Open Thread for everything else - UN/SUSPENDED, LOCKED OR AGE-LOCKED ACCOUNT PROBLEMS & QUESTIONS GO IN THIS THREAD ONLY",
  "body": "\n\nThis is the monthly \"Open Discussion\" thread, where you're free to ask questions, start a discussion, promote your Twitter account, give ideas on how to improve this subreddit, or provide feedback on how this subreddit is moderated.\n\n\n\nThis thread is for your support questions, discussions, self-promotion, subreddit feedback, or anything else.\n\n\n\nIF YOU ARE POSTING ABOUT UN/SUSPENDED, LOCKED OR AGE-LOCKED ACCOUNTS (PROBLEMS & QUESTIONS), THIS IS TO BE DONE IN THIS THREAD ONLY.\n\n\n\nStand-alone threads about Twitter Account Suspensions or Twitter Account Locks are unwelcome anywhere else in this subreddit. They *Will Be Removed* and Locked.\n\n\n\nIf you're looking for more guidance on How To Get Your Suspended Account Back,read here.\n\n\n\nDon't forget to read ourFAQ, and if you have information to add to it or something that needs updating, please feel free to make those changes!\n\n\n\n\n\n\n\nWhiler/Twitteraims to be a community to help other Twitter users solve problems with the service, this also isn't the ideal place to ask support questions.\n\n\n\nSupport questions are preferably asked in this \"Open Discussion\" thread. If you've posted a thread asking for help and no one has responded, you may have better luck asking your question here instead.\n\n\n\nIf you do have a functional (meaning: not locked or suspended) Twitter account, it can't hurt to let @ TwitterSupport know of your problem directly on Twitter dot com.\n\n\n\nIf you are looking to promote your Twitter account to others, ask for followers, or any type of self-promotion, you can do so in this thread only.\n\n\n\nThe volunteer moderators who guide the direction of this subreddit rely upon the feedback of the community in order to make it a more perfect place on Reddit.\n\n\n\nFeel free to give that feedback in this thread, or if you'd prefer to give your feedback in private, [send a private message to the subredditmodmail.\n\n\n\nIf for some unholy reason you need to see  past open discussion threads, they are availablehere",
  "author": "rivercardgod",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »This is an automated message that is applied to every post.  Please take note of the following:Due to the influx of new users, this subreddit is currently under strict'Crowd Control'moderation.Your post may be filtered, and require manual approval.  Please be patient.Please check in with theMega Open Threadwhich is pinned to the top of the subreddit.  This thread may already be collapsed for our more frequent visitors.  TheMega Open Threadwill have a pinned comment containing a collection of the month's most common reposts. Your post may be removed and directed to continue the conversation in one of these threads.  This is to better facilitate these discussions.If at any time you're left wondering why some random change was made at Twitter, just remember:Elon is a fucking idiotSubmissionBy:u/AutoModeratorI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "luneskeine",
      "timestamp": "",
      "body": "hello, i help run a number of twitter accounts for work, and was recently forced to add a birthday for all of these.i thought all i had to do was to put in the year that the organisation was founded, but didn't realise that twitter is now imposing this 13 years of age policy at the time of creation. i am obviously above the age of 13, but not all these organisations are, so i thought i would use my year of birth instead. while this worked on one account, it didn't on another because i wasn't 13 when the account was created and as a result i got locked out. i've looked through all the relevant guides as well as the email i was sent about the lock and all that's done is led me to a bunch of dead links. i really need this account running again because it's a work account and all this has done is made today a lot harder than it has to be.any advice or any similar experiences you may have had with this would be greatly appreciated, thank you!"
    },
    {
      "author": "Catbugforever7",
      "timestamp": "",
      "body": "my account was suspended for about 2 months now and sent multiple appeals. today i tried to send more but it says my account isn't suspended, but whenever i log into it it still says im permanently suspended :/"
    },
    {
      "author": "CBGames03",
      "timestamp": "",
      "body": "remember that problem where if you lied about your age when you created ur twitter account, (I made it when I was 12) then put your birthdate in 5 years later it would ban your account? Because it meant you created the account before you were of the allowed age?Well I had that problem and fixed it by using a family members ID (apparently thats what you're supposed to do).Though now, 4 years after the issue got fixed, my birthdate has now reset/is no longer there. X keeps telling me I need to “put a birthdate to avoid losing access to my account”. Should I put my own, or my family members?Thanks"
    },
    {
      "author": "lexisweird",
      "timestamp": "",
      "body": "i got a notification of suspicious log-in on my old account that i keep as an archive, i changed my password successfully, but when i was logged out on the app and tried to log in it said an error has occurred. weird thing is that happened to my other acount as well that i use just to follow and read posts. one time would've been okay i guess but twice in one month is weird :/"
    },
    {
      "author": "rivercardgod",
      "timestamp": "",
      "body": "Seems I’ve joined the crew of people getting suspended despite not really posting anything. I follow FinTwit so I’m at a loss for what could have caused my account to be permanently suspended.All I get is an automated response I violated the rules and my account won’t be reinstated. Bummer."
    }
  ]
}