{
  "subreddit": "NintendoSwitch",
  "post_id": "1icvl5h",
  "title": "AMA - I’m Gareth Damian Martin / Jump Over the Age, developer of the dice-driven RPG Citizen Sleeper 2: Starward Vector, launching this Friday! Ask Me Anything!",
  "body": "Hello! I’m Gareth of Jump Over the Age, a one-person game development studio. I’ve previously developed Citizen Sleeper and In Other Waters, and my new game Citizen Sleeper 2: Starward Vector will be out this Friday the 31st of January!\n\nCitizen Sleeper 2 is a dice-driven RPG, where you play as an escaped android. With your ship and crew, you take on contracts to survive while you navigate across the Starward Belt.\n\nVerification:Jump Over the Age Bluesky Post!\n\n——EDIT: CLOSED!——\n\nThanks for all the lovely comments and insightful questions, I really enjoyed this!\n\nIf you want to know more about Citizen Sleeper or what I am up to generally, you can sign up to theJump Over the Age Substacknewsletter or follow me directly onBluesky.\n\nCitizen Sleeper 2 is out in 2 days (!!!) on the 31st of Jan. I hope you enjoy it if you give it a shot :)\n\neShop Preorder Links:\n\n💫Nintendo Switch (US):https://bit.ly/CS2NOA\n\n💫Nintendo Switch (EU):https://bit.ly/CS2NOE",
  "author": "Jumpovertheage",
  "comments": [
    {
      "author": "sieraparagon",
      "timestamp": "",
      "body": "Just wanted to express how much I love Citizen Sleeper. It was a 3-day binge for me during Christmas holidays and it filled me with hope and love, even if at times they were intertwined with sadness and grief.I was curious about a specific design dynamic. In the first game, at a certain point the player could snowball their dice rolls, as well as eliminate any of the early game threats which provided so much of the initial sense of pressure, anxiety and \"scrapping by\" feel. In my first playthrough, by the time I reached the Refugee Ships DLCs, none of the time-gated checks felt immediate or high-stakes, because I could so easily complete them.Is there a system to balance for that in Citizen Sleeper 2?"
    },
    {
      "author": "Jumpovertheage",
      "timestamp": "",
      "body": "Hi! Yes, there 100% is. In fact there are multiple ways in which the sequel differs in this regard.First of all the contract structure means you go on high-intensity jobs, and then have downtime at hubs after, this means the game goes from tense/difficult, to calm and back again with a more regular pace.Then, when you are on contracts, there are many ways to succeed or fail: There are optional resources to gather, there is the possibility of limiting the damage you take, and there is the speed at which you complete the contract, as well as the overall pass/fail stakes of the contract. So \"success\" is more of a wide range of outcomes, that in some cases will relate to the players goals. So skilled players can aim for more than just scraping by.Upgrades are also different now, and focus on \"active\" rather than \"passive\" upgrades, where you build out your \"push\" ability and configure it for your playstyle. The push ability differs between classes, and has a strong tactical element, where you trade stress for a boost to you or your crews dice. It can be very powerful if yused effectively, but also a hindrance if not!Finally the game has variable difficulty settings, the base difficulty of which is harder than CS 1 (as there is a SAFE option for narrative focused players). Strong players who pursue every drive will still be able to become powerful through knowledge and upgrades, but its not an inevitability and the game is much more consistently higher pressure than the first one!"
    },
    {
      "author": "mareek",
      "timestamp": "",
      "body": "Hi Gareth, I love Citizen Sleeper 1 and I describe it as the best cyberpunk novel I've ever read. The characters, the station, the universe... everything is perfect.My question is the following : Have you ever considered writing novels instead of/in addition to creating video games ?"
    },
    {
      "author": "Jumpovertheage",
      "timestamp": "",
      "body": "I answered this one up above:https://www.reddit.com/r/NintendoSwitch/comments/1icvl5h/comment/m9u2zqu/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_buttonBut I would also say that I love game design, and games, and I think I enjoy having people read in games, more than reading outside them. There's so many things you can do with game storytelling, and I love the way it invites/implicates the player in the story! I don't know if novels would satisfy my interest in that."
    },
    {
      "author": "anhedonis539",
      "timestamp": "",
      "body": "Hi Gareth! Could you speak to your inspiration for the dice mechanics - specifically, how they’re rolled at the start of each cycle? As someone living with depression, it really spoke to the idea of never being 100% certain what you’d be able to do/ what you would have energy for in the future, and having to just take things one day at a time. Or maybe it truly was just a reworked TTRPG mechanic and I’m imposing my own experiences onto it 😂best of luck with the launch this week!!"
    },
    {
      "author": "Jumpovertheage",
      "timestamp": "",
      "body": "Oh it certainly was inspired by my own struggles with depression and the feeling of waking up and having very little energy to face the day, but knowing I had to. I'm glad that aspect of it came through. It was also influenced by the tabletop game Blades in the Dark, and the dice/board game Pandemic: The Cure, but I'd say that mostly I was looking for a way to represent how I felt back when I was working random gig work, struggling with depression and barely meeting rent. Dice just ended up being the most effective way to do that!"
    },
    {
      "author": "DragonHorcrux",
      "timestamp": "",
      "body": "Hi Gareth! Citizen Sleeper has quickly grown to become one of my all-time favorite games, it especially excited me when I realized you took inspiration from The Mushroom at the End of the World, which I was reading at the time of playing your game!I want to ask: How do you translate that dense theoretical research into informing your writing and game design, is there a specific process behind it for you or does it happen organically?Much love and good luck with the launch!"
    },
    {
      "author": "Jumpovertheage",
      "timestamp": "",
      "body": "Thanks so much, its very cool that you were reading Tsing's book while playing!I'd say that the way I use research is as a way of creating a kind of mulch or compost for the game to grow from (if you will pardon the plant metaphor). I tend to try to take in as much about a subject that I can, following my curiosity. I especially spend time with texts or media that feel like they \"rhyme\" with my ideas, where I feel there's something that connects them to me, or some of the things I plan to explore. But then, once I have read them, I let them inform my work more organically, rather than go back to them or reference them. I always likes the Francis Bacon quote where he described himself as a \"pulverizing machine\" which process everything he looks at or feels, and uses that as raw material for his work. That's my process really, a broad and obsessive research phase that then feeds my own organic process of building ideas into the games!"
    },
    {
      "author": "TofrPilgrim",
      "timestamp": "",
      "body": "Thank you for creatint this wonderful universe. It's so refreshing to play something dystopian yet hopeful. While the art by Guillaume and the music by Amos are phenonenal, it's the writing that sees me keep on coming back to the CS universe (still eagerly awaiting my Lost in Cult package 😅). Where did you get such awareness on the human psyche, and on the reverberations of small actions that create such far-fetching consequences?Thank you once again. Your games give me hope when the world feels darker. They encourage us to keep looking up, and to give that trust to someone."
    },
    {
      "author": "Jumpovertheage",
      "timestamp": "",
      "body": "Ah, thank you so much, I don't know if i can answer such a complimentary question! I guess I am very curious about people and have spent a lot of time in different jobs and contexts, so I feel like I have learnt about a lot of different ways of being a person. Empathy and curiosity are the greatest tools for a writer. Meanwhile, on plotting, I usually just work on instinct and feeling, so I guess my stories often grow out of small human-scale moments into bigger shifts. It's a kind of story I really enjoy to read myself :)"
    }
  ]
}