{
  "subreddit": "japanlife",
  "post_id": "9wcwk8",
  "title": "Still no workaround for LINE Age Verification on MVNOs?",
  "body": "I have a UQ Mobile number and LINE is only giving me the option to verify my age (to allow people to add me by LINE ID) with an auID, which I don't have/can't create (as far as I can tell anyway?). I saw some threads about this on here but they're all from a year+ ago. I know about being able to circumvent it on LINE desktop, but I never use it on my PC, so I was wondering if anyone had found any more convenient workarounds for this or if I'm missing something? I can use my phone number to add people so it's not a huge deal, just really annoying, especially when adding friends from back home. Thanks!",
  "author": "donarudotorampu69",
  "comments": [
    {
      "author": "nemuri_no_kogoro",
      "timestamp": "",
      "body": "I know about being able to circumvent it on LINE desktop, but I never use it on my PC, so I was wondering if anyone had found any more convenient workarounds for this or if I'm missing something?Age verification must not be that big of a problem if you are unwilling to install it on your desktop once to get around it..."
    },
    {
      "author": "JanneJM",
      "timestamp": "",
      "body": "For what it's worth, I've yet to run into any problems using line without age verification. I think the only thing I can't do is add people remotely; and I've never needed that."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "helpfuljap",
      "timestamp": "",
      "body": "As far as I know, there isn't any workaround.Getting the LINE simcard let's you age verify."
    },
    {
      "author": "sy029",
      "timestamp": "",
      "body": "Don't know if it works anymore, but at one point you could delete the data, then activate your account with your sim card removed. Feed it a non-japanese phone number, and it would skip the age verification."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "There used to be a way to swap your SIM into another phone during the verification, swap back and be permanently verified, but I don't think that works any more.They do it to make people switch to the LINE MVNO, which does let you verify."
    },
    {
      "author": "FogDucker",
      "timestamp": "",
      "body": "If you were really dead-set on it, you might be able to just cough up the ¥4000 or so to get a LINE SIM card for a month (¥3400 for the SIM, ¥500 for a month of service), age-verify your account, and then before the first month is out, cancel the service.LINE Mobile is pretty competitive with other MVNOs, though, so at that point you may as well just switch. That may be a reason they make it impossible for someone on another MVNO to get verified."
    },
    {
      "author": "Taro8383",
      "timestamp": "",
      "body": "If you have a Jailbroken Iphone  its easy to fix it, I guess that would be the same if your device is a rooted Android"
    },
    {
      "author": "blosphere",
      "timestamp": "",
      "body": "I think I've never added anybody with ID, and I've disabled the ability for people add me via ID because the spammage that happened.It's always been in the moment when hanging out with people so shaka-shaka or QR."
    },
    {
      "author": "donarudotorampu69",
      "timestamp": "",
      "body": "What if you already have an Age-verified account on a cell phone with a Big 3 carrier, then switch to an MVNO with a new device? If I transfer my account to the new device will I lose my age verification?"
    }
  ]
}