{
  "subreddit": "ModSupport",
  "post_id": "qnca3y",
  "title": "Age Verification",
  "body": "I've got a bit of an issue.\n\nOur subreddit doesnot ask for age verification upon joining our community, because we do not want to create any more work than needed and we want to instill that part of trust into our community.\n\nHowever - if we're ever notified that someone is or possibly is underaged, we don't moderate immediately. We've been going to those assumed to be underaged and asking them to verify themselves, showing us their date of birth on a government-issued ID and in the same picture, a piece of a paper with their Reddit name written.\n\nWe don't ask for anything else but that. And we discard photos given to us once we've gotten what we asked for.\n\nBut, something in the back of my head is telling me it's wrong to ask for a user to verify their age, and if someone was assumed to be underaged, it's better to avoid the risk and just ban immediately.\n\nThat's not how I wanna go.\n\nBut I also am unsure if it's ethical as a moderator to do that. I mean, weareasking for sensitive information.\n\nSo... do we reserve the right to do that? Or...",
  "author": "born_lever_puller",
  "comments": [
    {
      "author": "criticalmodsnotgods",
      "timestamp": "",
      "body": "I would assume you can ASK for whatever you want they can make the choice to provide it or not join, i mean some subs make you send a series of nudes to verify your account i don't see how thats much different.I think the only issue is your asking individuals instead of just having it a rule that you have to do it in general, thats singling out users IMO"
    },
    {
      "author": "pointy_bois",
      "timestamp": "",
      "body": "that sounds fair. i've actually thought about allowing users to verify themselves so that other people know that they were 18 years old or older. if they choose not to, that'd be fine as well."
    },
    {
      "author": "born_lever_puller",
      "timestamp": "",
      "body": "some subs make you send a series of nudes to verify your accountSir, this isr/Wendys."
    }
  ]
}