{
  "subreddit": "VRchat",
  "post_id": "1hho8z9",
  "title": "18+ Verification & ToS clarification",
  "body": "I belirve the Age Verification is a good thing, but after discussing with some friends, we also assumed that this DOES NOT override ToS when it comes to nafw content because there was no clarification from the devs on this that we had heard about.",
  "author": "llagroozll",
  "comments": [
    {
      "author": "Cute-Plantain2865",
      "timestamp": "",
      "body": "Nsfw is still against tos but is unlikely to get reported in private and now adult spaces.There is a bit of a trust factor in adult spaces. Hopefully, age verified instances will allow for changes in ToS but if you are reported it will be handled just like before.NSFW assets will be removed. So just don't upload PP and run around with it and you will probably be fine."
    },
    {
      "author": "StoragePotential6352",
      "timestamp": "",
      "body": "Ohhh so that's why most of my avatars have been removed! I didn't know they were against TOS"
    },
    {
      "author": "NOINSEVUNT",
      "timestamp": "",
      "body": "Yeah no NSFW content is still in the same spot: Technically banned but only enforcable if you're reported"
    },
    {
      "author": "Embarrassed-Touch-62",
      "timestamp": "",
      "body": "Nobody said NSFW activity will be ok with ToS after adding verification.But honestly they don't care as long as you keep your fun in private."
    },
    {
      "author": "Breaker1ove",
      "timestamp": "",
      "body": "Simple answer:Public world report - You getting banned.Private world report - meh.\"Remember, Keep private things private\""
    },
    {
      "author": "Shadowraid5",
      "timestamp": "",
      "body": "I know in private it takes a report for them to step in on a ToS ruling, but I heard somewhere where that there is a limit to what's considered \"Private\"Like Friends only is Private, of course, but a Friends+ isn't because friends of the people in it can join without even knowing that it's an 18+ conversation.Just what I've heard around the grapevine, not sure if the Devs see it that way."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "In the first video they released talking about it they said it's something they're looking into for the future but for now just want the feature out for everyone to make more comfortable and safe spaces for adults and minors in their chosen instances."
    },
    {
      "author": "lilfox3372",
      "timestamp": "",
      "body": "18+ doesn't give permission to be anymore sexual or weird. Keep it to private places that permit it. This verification doesn't change how the game operates"
    },
    {
      "author": "XxXlolgamerXxX",
      "timestamp": "",
      "body": "Yup, the TOS don't change. Is the same rules. You cannot do nsfw stuffs in public instances. (Technically Neither in private but it would require that somebody report you). NSFW include a lot of stuffs. For example a +18 instance that have a party where people drink alcohol is okay, but is still a nsfw stuff.Having a nsfw avatar and do stuffs and record that stuffs and publish the video even if is a +18 instance is still against the TOS.They also say that in the future content filter can be used by the verification so maybe the TOS can change in the future."
    },
    {
      "author": "llagroozll",
      "timestamp": "",
      "body": "I hope u can implement the age verification in worlds.. so that we can have full Adault Drinking night's"
    }
  ]
}