{
  "subreddit": "privacy",
  "post_id": "1k1vt7p",
  "title": "Discord's face scanning age checks 'start of a bigger shift'",
  "body": "",
  "author": "Darkwolf1515",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hellou/redditissahasbaraop, please make sure you read the sub rules if you haven't already. (This is an automatic reminder left on all new posts.)Check out the r/privacy FAQI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "kiliandj",
      "timestamp": "",
      "body": "The day discord asks me to upload my face or ID for age verification is the day im deleting my data from their servers. Their security and privacy policy are weak AF like it is. Im not trusting them with that shit."
    },
    {
      "author": "PinkAxolotl85",
      "timestamp": "",
      "body": "Yeah sure I'll trust my face and ID with the 'we're never adding E2EE because it's only used by criminals and we need to be able to read all your messages' company /s"
    },
    {
      "author": "CarbonizedOxygen",
      "timestamp": "",
      "body": "Should already be deleting the account from them."
    },
    {
      "author": "Dan_85",
      "timestamp": "",
      "body": "This shit has basically rendered Discord unusable for me within the space of a week. Ain't no way they're getting my face scan or ID."
    },
    {
      "author": "TheStormIsComming",
      "timestamp": "",
      "body": "There's always IRC."
    },
    {
      "author": "cellularesc",
      "timestamp": "",
      "body": "Teamspeak 6 can’t come fast enough"
    },
    {
      "author": "Odd_Science5770",
      "timestamp": "",
      "body": "Of course the UK and Australia... Those regions have proven themselves to be accepting of surveillance totalitarianism."
    },
    {
      "author": "nondescriptzombie",
      "timestamp": "",
      "body": "I don't know how this shitty app supplanted voice chat, messenger, forums, chat rooms, file sharing, and game matchmaking.Are people really so fucking lazy as to not install more than one app?"
    },
    {
      "author": "Darkwolf1515",
      "timestamp": "",
      "body": "Because it's free and at the time was (and in a lot of ways, still is) genuinely better. Skype had the voice quality of two cans with a string, and Teamspeak and Mumble presented significant hurdles for those not technically inclined.Discord sounded way better and even the most doesn't understand a file browser user could get a server hosted for them and their friends for free.Forums? Well you have to spend a lot of money maintaining those and know how to host a website, so that was an easy replace.Fileshare? Easier to drop a file onto the discord app and have everyone in the server have access compared to other cloud solutions that require access perms and cut off access to popular files.Matchmaking? Well when you can join a server that's full of users that's not limited to one specific game or platform and has better \"discovery\" yeah. That's getting replaced.So yes, it replaced everything by being so easy (and free) to use that it's shortcomings are completely overlooked."
    }
  ]
}