{
  "subreddit": "unitedkingdom",
  "post_id": "1k0gzve",
  "title": "Discord rolling out Face and ID verification for UK users",
  "body": "",
  "author": "TheObviousPie",
  "comments": [
    {
      "author": "NonagoonInfinity",
      "timestamp": "",
      "body": "Can't wait to have to give my ID to every American tech company ever. Surely there's no way this could backfire."
    },
    {
      "author": "NateShaw92",
      "timestamp": "",
      "body": "I can't see what could possibly go right"
    },
    {
      "author": "Substantial-Newt7809",
      "timestamp": "",
      "body": "Just to be clear, this is an optional Discord thing to \"verify\" your account as belonging to an adult. If you don't care about it, you can ignore it. I certainly will be."
    },
    {
      "author": "WebDevWarrior",
      "timestamp": "",
      "body": "I was involved in digital policy at the drafting of the Online Safety Act and had a lot of harsh words with individuals regarding the bill and the gaping holes with it and the dangers it posted to peoples safety and rights (which lead to me getting toxic abuse from people in childrens charities like Save the Children, Barnardos and civil servants working for both Labour and the tories).This is what will enevitably happen (based on my 20+ years experience in the tech sector)...Online Privacy Act mandates all businesses with interactions (example Discord) have to have your government mandated ID to prove you're \"of age\" to view potentually adult material (to cover themselves legally) - assuming they don't use a third-party platform (which has its own massive list of compliance risks eg GDPR, etc).At some stage, one of the platforms hosting your government ID will be breached (no system is unhackable), see 23&Me as a precautionary tale where they got breached, their business failed, and everyones DNA is now at risk of public exposure or resale for bad purposes. Or a rogue employee with high level access could make off with the data (corporate theft).Criminals will use this information to go on an international spree of impersonation scams (possibly using AI where it can be used to deepfake) as people aren't sacred with their privacy and incidents of identity theft (and the inevitable hijacked bank accounts, loans taken out in peoples names, possibly even transfer of home ownership etc) are both possible and on the rise.There will be a lot of finger pointing from politicians blaming each other. Police won't be able todo fuck all because it will mostly be triggered from outside UK borders (where they can't be prosecuted) - like those annoying scam emails, texts, and phone calls. And the charities who fucked everyone over by bankrolling the law to make everyone hand their data over to foreign billionaires \"cause children\" will disclaim any liability as they will say its not up to them to fix problems, just point them out (which is a cop out and BS)."
    },
    {
      "author": "hammer_of_grabthar",
      "timestamp": "",
      "body": "To add to this list of very valid criticisms, another very serious one is conditioning the UK population to share their photo ID with online services. As this becomes more routine, phishing attacks become even more likely to succeed, and even more dangerous.Giving your photo ID to a fucking chat app is insane."
    },
    {
      "author": "wkavinsky",
      "timestamp": "",
      "body": "That's a nope from me.There's 0 chance I'm handing some American corporation my ID and facial likeness, especially when you read there T&C which generally mention that they can do whatever they want with them.Especially not when that corporation is hosted in the Fascist States of America."
    },
    {
      "author": "FearDeniesFaith",
      "timestamp": "",
      "body": "Urgh this is just going to be such a faff.People are just going to post that content in non-flagged channels anyway."
    },
    {
      "author": "Overstaying_579",
      "timestamp": "",
      "body": "Let’s see how long it takes before everyone’s data from the United Kingdom who uses discord gets leaked.Presuming if they’re not using a VPN that is."
    },
    {
      "author": "Darkone539",
      "timestamp": "",
      "body": "Why do the uk always get used as a test country, at least psn just accepts a paid for phone number. You're insane to give discord your id.Whatever is blocked can stay blocked for me."
    },
    {
      "author": "TheObviousPie",
      "timestamp": "",
      "body": "I guess this is another consequence of the poorly thought out online protection law parliament spaffed up the wall."
    }
  ]
}