{
  "subreddit": "caf",
  "post_id": "1hnj1xx",
  "title": "Background check problems",
  "body": "I am currently undergoing a background check for the Canadian Armed Forces. I received an automatic form from Gambit ID Check on behalf of the Canadian Armed Forces. All of my references have written in, and there were no issues. However, under the employment check section, Uber was listed, and this became a problem. While still in the process of filling out my file, I mentioned that I had worked for a time as an Uber driver but didn't want to include it. I was told it was necessary to list it. I explained that Uber probably doesn't have an email or phone number to contact, as I suspected they are a rather closed organization. Nevertheless, Uber was included in the employment check section.\n\nI logged into my Uber profile and contacted a representative to explain that I needed an email and phone number for the employment check. After long waiting and being redirected, I was confirmed in my assumption that there is no email address, only the online resourcehelp.uber.com, and I was given the phone number +18081897190. However, in the form, I cannot add a phone number without also providing an email address. I wrote about the situation to the recruitment center, but there was no response, as it was the week before Christmas, and I assume everyone had already left to celebrate.\n\nOver the course of the week, I received automatic emails from Gambit ID Check on behalf of the Canadian Armed Forces requesting me to update my Uber email and phone number. I understood that this was an issue and decided to request at least a Proof of Partnership letter and an achievement summary from Uber to prove my work with Uber in the future. However, since I haven't worked for Uber in over three years, such requests were not possible. The final deadline for updating the information was Dec 24, 2024, 10:48.\n\nHas anyone been in this situation? What can I expect—rejection or something else? Or does anyone know how to resolve this situation?\"",
  "author": "gambit_id_support",
  "comments": [
    {
      "author": "Aydin21",
      "timestamp": "",
      "body": "Oh wow, I filled my application not a while ago and completely left Uber and skip in the dark, i havnt done security screening or anything so i might be able to fix this before its too late"
    },
    {
      "author": "DishonestRaven",
      "timestamp": "",
      "body": "Are you not an employee when working for Uber, you're a contractor? So you're your own boss?"
    },
    {
      "author": "Direct_Inflation3808",
      "timestamp": "",
      "body": "Yes, I was a contractor, but what should I do now..."
    },
    {
      "author": "Accomplished_Put_621",
      "timestamp": "",
      "body": "Have you found any solutions yet?"
    },
    {
      "author": "Direct_Inflation3808",
      "timestamp": "",
      "body": "Nope, waiting for the holidays to end."
    },
    {
      "author": "gambit_id_support",
      "timestamp": "",
      "body": "If anyone encounters this issue in the future, you need to put Uber as an employer because it was somewhere you worked, however Uber treats their drivers as independent contractors and they will not complete the questionnaire. CAF is aware of this. As a result, we (Gambit ID) cancel them when someone contacts us asking this question. A recent system upgrade now auto-cancels the verifications for Uber. If any slip through the cracks, though, you just need to go to support.gambitid.com, open a ticket, and we will cancel the verification for you.  This is also the case for other services like this such as Door Dash."
    }
  ]
}