{
  "subreddit": "VRchat",
  "post_id": "1j3bc4a",
  "title": "18+ Rated Avatars",
  "body": "I think this should be the next natural step in VRCs security measures involving users who are minors.  There's already tags for suggestive, violent or disturbing avatars, but it doesn't prevent minors from using or seeing them.  I've seen kids that sound like they're ten years old running around in thick e-girl avatars with their boobs out before.  A simple system should be in place that takes advantage of the safety tag system that's already in place and the 18+ verification and make it mandatory that 18+ tagged avatars are not viewable by anyone not 18+ verified.",
  "author": "CoxTH",
  "comments": [
    {
      "author": "Sitto78",
      "timestamp": "",
      "body": "While I agree this would be amazing for the game. They need to make it age verification available for everyone first"
    },
    {
      "author": "RamJamR",
      "timestamp": "",
      "body": "True.  Whenever it's possible."
    },
    {
      "author": "littlegarden_spider",
      "timestamp": "",
      "body": "i watched a 13 year old, trying to make the adults laugh i guess, switch into a practically naked egirl avatar with \"I <3 dick\" tattooed on the ass - i am BEGGING the vrchat team to bar kids from using these. it is so wildly uncomfortable and upsetting."
    },
    {
      "author": "Rough_Community_1439",
      "timestamp": "",
      "body": "Sounds like the perfect target for my favorite line. \"I see you are using a meta quest headset, which has to be registered to a Facebook account. I can see what that account is and I am gonna send your mom a video of what your doing\" They 90% of the time freak out and get off the headset.Edit:thank you so much spider queen for the award. It's my first award!"
    },
    {
      "author": "ToriAndPancakes",
      "timestamp": "",
      "body": "Iirc there were plans to tie the content gate with the age verification system once it hits full release. That however would also require the uploader to properly tag everything"
    },
    {
      "author": "Snowarc72",
      "timestamp": "",
      "body": "and if the uploader does notreport incorrect tags! its a report optionbam  working as they intend to eventuallly once age system gets linked to the content toggles"
    },
    {
      "author": "LakesRed",
      "timestamp": "",
      "body": "Isn't that... the whole point of having the nsfw tags on avatars?   I thought it was always planned to make them invisible (robot or whatever) to non verified once the verification system was rolled out.  Maybe I misunderstood something."
    },
    {
      "author": "spark981",
      "timestamp": "",
      "body": "Sort of counter point in a way: this game should be 16+ at minimum. Young kids shouldn’t be on there in the first place"
    },
    {
      "author": "zig131",
      "timestamp": "",
      "body": "Platforms/Sites that are explicitly \"adult\" can scare off people looking for a SFW experience, and they can also have problems with payment providers.The few Payment processors that will support an \"adult\" site at all can have pretty arbitrary problems with particular kinks/fetishes, and they have the power of life and death over the platform/site.For example on FetLife, you arbitrarily cannot find any kind of Hypnotism kink through the search function.VRChat explicitly embracing, and officially allowing stuff that is currently against TOS, would be a massive change with huge ramifications.The status quo is /probably/ the best for everyone."
    },
    {
      "author": "CoxTH",
      "timestamp": "",
      "body": "If you watch their developer updates, they are planning to integrate the avatar/world content tags with the Age Verification system eventually.But first Age Verification needs to be available to everyone."
    }
  ]
}