{
  "subreddit": "VRchat",
  "post_id": "1h7tcmi",
  "title": "where can i go to get age verified, and if it's not out yet when will it be?",
  "body": "i can't find it anywhere",
  "author": "shirimpu",
  "comments": [
    {
      "author": "Docteh",
      "timestamp": "",
      "body": "I feel bad for VRChat, they really like hey we're going to take our time and work on something over the next while (months) and get it done properly, and they've got two kinds of feedback.Persona is the devil (specifics are available on their forums or in other posts here. go look!)when can I do this thing, its been a whole 2 days or whatever"
    },
    {
      "author": "MuuToo",
      "timestamp": "",
      "body": "First, not out yet. Second, ask a genie lamp. Cuz short of that, nobody knows."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Scratch that, it’s still in testing, but slowly being drip fed in."
    },
    {
      "author": "MessyD557",
      "timestamp": "",
      "body": "Scratch that, it’s still in testing, but slowly being drip fed in."
    },
    {
      "author": "shiro_tomo",
      "timestamp": "",
      "body": "Why do people downvote comments for no reason here XD"
    },
    {
      "author": "Raitil",
      "timestamp": "",
      "body": "Before you verify:https://cookcountyrecord.com/stories/665658052-plaintiffs-accuse-persona-identities-inc-an-identity-verification-service-provider-of-illegally-using-personal-dataYour data almost certainlywillbe sold and/or used to train AI. Do not verify with Persona unless you're willing to give away your ID for free."
    },
    {
      "author": "sargrvb",
      "timestamp": "",
      "body": "I am extremely pro-privacy. That being said, if you carry around a cell phone and do any transaction on it at all, you've been compromised. Look up 'Salt Typhoon'. The only people who are worried about age verification are all suddenly pro-privacy, but they have Amazon echo installed and most of us statistically play on Meta hardware which quite literally scans your entire room for data mining. They also sell your data and have been hacked in the past. VRChat is the least of your worries and I think getting rid of predditors is a much bigger issue."
    },
    {
      "author": "TheAssassinbatosai",
      "timestamp": "",
      "body": "People honestly think they areTHATimportant that literally everyone wants their data. If you own any electronic device with internet access you're already being farmed, no exceptions. When that data gets sold it's along with thousands of other nameless people into a huge conglomerate of data points.Not only that what do you think having your data \"used to train AI\" means? You think they're gonna build some terminator to come and take you out? People need to relax and stop spouting nonsense about things they don't understand."
    },
    {
      "author": "Bavragor_Eisenfaust",
      "timestamp": "",
      "body": "Thats quite the reaching. First of all this only a suit. Everybody can sue no matter how good the chances of success are or if they have not a lot of evidence. So as long as there is no conviction and therefore enough evidence it is bullshit to make the claim that persona is selling data. Second it‘s as far as i can see only 2 people suing so it‘s not like there is a mass of people attached to this.Please dont spread misinformation just because you don‘t like age verification"
    },
    {
      "author": "shirimpu",
      "timestamp": "",
      "body": "VRChat's implementation of Persona is a solution looking for a problem. A distraction from what is the myriad of problems and issues that plague the platform that VRChat wants to put under the rug."
    }
  ]
}