{
  "subreddit": "technology",
  "post_id": "1czoo9v",
  "title": "California Advances Bill for Porn Site Age Verification | That last state you'd think to pass a porn site age verification law is getting close to doing just that.",
  "body": "",
  "author": "NottDisgruntled",
  "comments": [
    {
      "author": "Sad-Set-5817",
      "timestamp": "",
      "body": "All this will do is ban mainstream porn sites and drive people to sites that don't care about following the rules. I am an adult and there is a 0% chance i will be giving my fucking government identification to a porn website. At that point i'll do it the old fashoned way to my own delusions"
    },
    {
      "author": "rgbhfg",
      "timestamp": "",
      "body": "Or increase the purchasing of VPNs"
    },
    {
      "author": "FruitStripesOfficial",
      "timestamp": "",
      "body": "Already the case. Here in Texas Pornhub and Xhamster are blocked (w/o VPN) but literally thousands of other sites are open, many of which are filled with fishing spam and malicious scripts. At least with Pornhub you can be reasonably assured they've made some effort to weed out CP and shit, or at least respond if you report it, cooperate with law enforcement. These other sketchy sites that will now become the norm who knows?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "wizardstrikes2",
      "timestamp": "",
      "body": "VPN software sales are going to skyrocket in California lol.Simply amazing how stupid, and out of touch with technology, our elected leaders are……"
    },
    {
      "author": "tictacenthusiast",
      "timestamp": "",
      "body": "They go fuck kids on islands not jerking off to their phone like some poor"
    },
    {
      "author": "LigerXT5",
      "timestamp": "",
      "body": "Before you know it, you'll have to prove yourself with these various identification and tracking methods, just because a service or site you use, happens to have Adult Only content somewhere. lol"
    },
    {
      "author": "apple-pie2020",
      "timestamp": "",
      "body": "The loss of anonymity is staggering.  Even more worrisome is the younger gen Z and Alpha that don’t know the level of privacy we use to have and don’t question most tracking metrics or understand how much data is stored, mines, and correlated"
    },
    {
      "author": "Limp_Distribution",
      "timestamp": "",
      "body": "Isn’t it the parent’s responsibility to raise a child and not the States responsibility to censor?"
    },
    {
      "author": "NottDisgruntled",
      "timestamp": "",
      "body": "I’m sure the unmoderated Russian porn sites will surely obey this law"
    }
  ]
}