{
  "subreddit": "japanlife",
  "post_id": "x0i86f",
  "title": "Validating your age with LINE of your provider doesn’t support it",
  "body": "Been going in circles for a while with this one.. LiNE only allows one to scan QR codes to join a group if you’ve validated your age. You can only validate your age if you have a mobile provider that offers the service. My mobile provider is Sakura (running on NTT) which doesn’t offer a service.\n\nYou can get round individual hurdles by finding someone who can be friends with then invite, but I keep coming up against the problem / hurdle.\n\nI’ve asked a Japanese friend who says there’s no other way.. but I thought I’d ask here.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Avedas",
      "timestamp": "",
      "body": "This policy has been in place for at least half a decade now, probably longer. There's no way around it. Line is ever a pain in the dick."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "bloggie2",
      "timestamp": "",
      "body": "Is there any reason a resident of Japan would use a foreigner/tourist-oriented mobile service provider?The only answer (which I'm sure you're already aware of) is switch to a MVNO which allows line age verification. IIJMio is one such provider, but there are others."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "yankiigurl",
      "timestamp": "",
      "body": "Just send people url link. If you go to invite friends and email and pick a random person the email will pop up with a url link. Copy and close out the fake email and send to people you want add"
    },
    {
      "author": "kom0rebi",
      "timestamp": "",
      "body": "Wow! That worked!!! You're a lifesaver!"
    },
    {
      "author": "taigarawrr",
      "timestamp": "",
      "body": "If you use line via the American app (or maybe whatever country is your native equivalent) you can bypass a lot of the things, I think. I use the Japanese version now for other reasons, but it seems the rules/customs are different depending on the region. Basically I used the American version of LINE when coming to Japan and the better part of 3 years I never had that issue. To download the US version of LINE, you need a US based iCloud account (for apple) and download from the us Apple App Store, directly. You can use the same account for your Japanese version of Line in the American version of Line. Note that you do risk losing your data if you cannot end up transferring properly (like if you forgot your password or something), so please do this at your own risk, and also backup your messages in your settings before attempting."
    },
    {
      "author": "biwook",
      "timestamp": "",
      "body": "That's exactly why I stopped using Line.It feels like the whole app has been designed by 65 years old salarymen. It's so user hostile and there are such better alternatives, I don't understand why Line is even still a thing."
    },
    {
      "author": "Simbeliine",
      "timestamp": "",
      "body": "Stickers tbh."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I had that problem with AU for a long time and when I switched to Rakuten it worked!"
    }
  ]
}