{
  "subreddit": "IRS",
  "post_id": "lzb2wl",
  "title": "IF YOU NEED ID VERIFICATION - READ THIS!!",
  "body": "Hey all,\n\nSo a few of you saw my previous post regarding my experience with the current state of things.\n\nWhere I left off, isI was waiting for a letter regarding ID Verification.\n\nNow, today,I received that letter, and I have some good news.\n\nIf you've be selected for that ID verification process,and you have an IRS account that has already been created, you can use that to bootstrap the verification process, even if you don't have the letter.\n\nTo verify using your IRS account:\n\nGo toIDverify.irs.gov\n\nClick \"Verify your identity now\"\n\nLog in to your account,HAVE YOUR CURRENT RETURN ON HAND\n\nAnswer the security questions regarding your current return. NO CONTROL NUMBER OR LETTER REQUIRED.\n\nYou will see that you've been verified, and you should be good to go forward waiting for your refund.\n\nI hope this helps anyone who hasn't heard anything. I'll be keeping tabs on how long it will take from ID verification to a DDD.\n\nWishing you all a speedy refund <3",
  "author": "iTootMyOwnHorn_",
  "comments": [
    {
      "author": "Orion-1111",
      "timestamp": "",
      "body": "After logging in it gives me a message saying I can’t use the tool lol sooo hopefully that means I don’t need to."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Willing-Fault-9673",
      "timestamp": "",
      "body": "Today is 5/21/21 - My return was e-filed and accepted 4/21/21. On WMR it said it was being processed. Then about 10 days ago WMR changed to \"We cannot provide any information about your refund.\" Then I received the 5071c letter on 5/14 asking me to verify my identity. Thewww.idverify.irs.govtool did not work. I had an IRS account set up before all of this. Tool said it could not process my verification. Called number about 40 times and it wouldn't let me through. Called to make an appointment to verify in person. There were no appointments available within a 50 mile radius through July 30th. They couldn't look any further out. On the 5071c letter there is a number for a Tax Advocate (TAS). Called on 5/20 and waited on hold 30 mins for TAS. He was very nice and put me through to the Verification Hotline directly so that I would not get the \"cannot take your call due to high call volume\" hang up. Waited on hold another 40 mins and spoke to the dept. that verifies ID. He asked me details about my 2020 and 2019 tax returns, my parents names moms maiden name, details on a W-2 and the usual personal ID info. He cleared the hold on my return. I will update when I get my DD or DDD.UPDATE: Got my DDD 8 days after ID verify.  My DDD is 14 days after ID Verify. Before yesterday 5/20/21, the WMR tool did not recognize me, then today it recognized me and gave me a DDD"
    },
    {
      "author": "Gabii1",
      "timestamp": "",
      "body": "Lmfao I can’t even make an account"
    },
    {
      "author": "Brizzlefrizzle8585",
      "timestamp": "",
      "body": "Same can’t use the tool"
    },
    {
      "author": "SeatSoggy946",
      "timestamp": "",
      "body": "It takes 9 weeks to get your refund after you have verified your identity, I experienced that myself first hand last year... one may get it sooner but thats what the IRS tells you"
    },
    {
      "author": "Erininthisbit",
      "timestamp": "",
      "body": "I got it in less than 2 weeks after verifying online with the code from the letter. But I called too. Just to make sure. Some people say calling and verifying with an actual agent will speed up the process, as they can update the account immediately. But I dont know if thats entirely true, so, i did it both ways, last year tho."
    },
    {
      "author": "Frosty-Sherbert",
      "timestamp": "",
      "body": "I didn't know that this existed.  I was able to verify my account.  Thanks OP! Most helpful post I have seen in a while."
    },
    {
      "author": "iTootMyOwnHorn_",
      "timestamp": "",
      "body": "Omg thank you!! I never got a letter but I just tried to do the verification and it let me do it! It says “congratulations! You have completed the ID verification process”. I swear I hope that moves things along"
    }
  ]
}