{
  "subreddit": "JurassicWorldAlive",
  "post_id": "1g0vjht",
  "title": "Caution about age verification",
  "body": "I let my son play my account and when it booted up, it asked him for his age.  He put 8 in..  so now my account is locked to a child’s restrictions.\n\nNo more ability to use the map and walk around our neighborhood.  He loved playing this game with me, now I’ll probably just delete the game.\n\nJam City says it’s permanent and irreversible.\n\nEdit: If this happens, delete and reinstall the app.  This won’t wipe progress, but will reset the age settings.",
  "author": "berserk987",
  "comments": [
    {
      "author": "Any-Flounder-4978",
      "timestamp": "",
      "body": "Why did it ask for his age if the account is already created?"
    },
    {
      "author": "kpurintun",
      "timestamp": "",
      "body": "It’s a new thing they are doing..  with significant importance and consequences and zero initial explanation."
    },
    {
      "author": "shakes1983",
      "timestamp": "",
      "body": "It asked me first login after the update. I think it’s a stupid thing to restrict considering the game literally requires you to move to play right."
    },
    {
      "author": "garyfugazigary",
      "timestamp": "",
      "body": "My son put in 14 for his account and now gets ads for a game which is basically soft porn, the one with the Japanese females in lots of very skimpy outfits"
    },
    {
      "author": "Deinonycon",
      "timestamp": "",
      "body": "Well damn…I put in 47 and am getting the same crap ads as always.  Where’s my softcore?"
    },
    {
      "author": "kpurintun",
      "timestamp": "",
      "body": "Man, that’s awful.."
    },
    {
      "author": "xtremecold_101",
      "timestamp": "",
      "body": "My son just hit this too, thought they could fix. Sucks it's permanent...."
    },
    {
      "author": "SandhuG",
      "timestamp": "",
      "body": "Try to uninstall and install again, it should ask for age input again in new install. Put desired age there"
    },
    {
      "author": "SandhuG",
      "timestamp": "",
      "body": "Try to uninstall and install again, it should ask for age input again in new install. Put desired age there"
    },
    {
      "author": "berserk987",
      "timestamp": "",
      "body": "I'm not sure if this can help you out of the situation, but I use two different phones in order to play this game (I don't want to ruin the batteries of my new phone ) and I noticed that despite I only have a single account, the game asked for my age on both of the devices. In short, there may be a chance that the lock is tied to the phone, rather than the account itself."
    }
  ]
}