{
  "subreddit": "anime_titties",
  "post_id": "1k2dw5j",
  "title": "Discord's New Age Verification Requires ID Or Face Scans For Some Users",
  "body": "",
  "author": "Somepotato",
  "comments": [
    {
      "author": "empleadoEstatalBot",
      "timestamp": "",
      "body": "Discord's New Age Verification Requires ID Or Face Scans For Some UsersGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.Discord is experimenting with a new age-verification policy that would require users to prove their age to see material Discord considers harmful. The verification process is currently undergoing trial in the United Kingdom and Australia, though Discord didn't say how long the test period will last or when--or if--it will roll out in other countries.The age verification process applies to all devices, includingDiscord on XboxandPlayStation 5.When a user tries to interact with material that Discord flags with its sensitive media filter, such as potentially explicit images, or tries to change their sensitive media filter settings, a pop-up appears that tells them to verify their age before they can continue. Discord provides two ways to verify: a face scan using your device's camera or using a mobile device to scan an ID card, such as a driver's license. The process reportedly takes just a few minutes, and you receive a direct message from Discord once it's finished that tells you which age group you're in.This system invites privacy concerns, though Discord said in anFAQ sectionabout the new requirement that the data users provide for verification is not stored by Discord or its face-scan vendor. The face scan option is \"on-device,\" which means the vendor doesn't collect or store biometric data. Age verification for Discord is a one-time thing. After the system places a user in a specific age group, that's where they stay until they choose to re-verify. Discord said users can choose to re-verify their age at any time if they believe the system placed them in the incorrect category or, presumably, once they get older and the category no longer applies.If the verification process decides your age category is below the minimum required to have a Discord account, it'll automatically ban you. Banned users will have to file an appeal using Discord's underage appeals process to try reversing the ban.Got a news tip or want to contact us directly? Emailnews at gamespot.comMaintainer|Creator|Source CodeSummoningu/CoverageAnalysisBot"
    },
    {
      "author": "Intense_Judgement",
      "timestamp": "",
      "body": "Yeah I'm not a fan of this one to be honest. Discord shouldn't need to record data about its users even temporarily, it's a chat program.Also, getting automatic banned because the face scanner decides you look too young would be infuriating."
    },
    {
      "author": "Weenaru",
      "timestamp": "",
      "body": "I miss the times when you didn’t even need to register an account to use discord."
    },
    {
      "author": "Boner-Salad728",
      "timestamp": "",
      "body": "It should scan the bold tip of your head instead of face. I always think of that idea when self-service cashier calls for personnel to confirm my age when I buy alcholol."
    },
    {
      "author": "Miner_239",
      "timestamp": "",
      "body": "And what stops me from scanning my ma's face or ID instead of mine? Will it correctly determine the age of all kinds of people? If it's all in-device, then there's no human review. Better than the privacy hit from actually sending more of your data, but still, this sounds like such a badly implemented idea."
    },
    {
      "author": "jadedflames",
      "timestamp": "",
      "body": "Absolutely nothing. But now it’s your fault, not Discord’s fault.This is an ass-covering move."
    },
    {
      "author": "Unable_Duck9588",
      "timestamp": "",
      "body": "Discord is in danger of getting banned in many places and is already banned in some countries.I imagine they want to avoid that sort of thing. I don’t agree with it either but I’m just saying this is what’s up.I imagine it also opens up possibilities to be prosecuted if you do anything illegal on it, which is rife for abuse."
    },
    {
      "author": "Soepkip43",
      "timestamp": "",
      "body": "I hope discord dies! It's cancer for the internet. It gobbles up everything its users feed it to never be seen again.Processing sensitive PII for this is horseshit and they need to find better ways that do not involve collecting sensitive and biometric data."
    },
    {
      "author": "Somepotato",
      "timestamp": "",
      "body": "I can't even verify my account because discord won't accept my cell number, and they removed the option for servers to manually verify users on the highest verify mode. Can't wait for this to get worse"
    }
  ]
}