{
  "subreddit": "personalfinance",
  "post_id": "oo82mx",
  "title": "One of two things is happening now: I am being scammed, or someone is trying to collect a 15+ year old debt - want to make sure I handle this correctly.",
  "body": "When I was 18 I overdrafted my bank account, left for college, opened a new account with the school credit union and then forgot about the original account.\n\nToday, 15 years later, I received a call from a \"legal paperwork delivery service\" saying I would be served paperwork to appear in civil court, and to confirm my address and that I would be home tomorrow morning. They gave me the name of the group filing the suit, and a case number. When I called them, they provided me with the last 4 of my social, my current address and the actual bank account number for this old account. They also told me that \"because this bank is FDIC insured, there is no statue of limitation on this debt\" which does not appear to be true. I later found that a different number called members of my family around the same time as my first call, providing the same call back number.\n\nThe person on the phone offered a resolution: the debt is now around $4500, however, they are willing to discharge it for $2500 (their numbers were not rounded like these). She sent me a docusign letter with the resolution written out. I (obviously did/will not sign it). Googling around, I found that there is basically no information about this company - the BBB listing says it is not verified, has 2 complaints and is rated as D-.\n\nTo my knowledge, there is no way I actually owe this money. I called the bank, they said they charged it off in 2008 and was not sold to any creditors (and are sending me a letter in the mail to this affect). If someone actually does serve me tomorrow, I feel pretty prepared (will likely research whether I need a lawyer or if I can just ask for proof and provide my own documentation about the age of the debt).\n\nIf they do not serve me paperwork tomorrow, I will be calling back the agency to ask for an address for which to send certified mail, and send a request for debt verification. I figure, it may be better to be proactive now and avoid a headache later.\n\nAm I overlooking anything?",
  "author": "Flat_Shower",
  "comments": [
    {
      "author": "Some_Nibblonian",
      "timestamp": "",
      "body": "Don't answer any of their questions. And sounds like you have the right idea. \"Show me the proof.\""
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yep. The collection agency has to prove you owe this debt. Chances are good that they can't given the alleged age of the debt."
    },
    {
      "author": "Annabel398",
      "timestamp": "",
      "body": "If the SOL is expired, they can’t recover in court. <shrug> Keep an eye on your credit report."
    },
    {
      "author": "sockalicious",
      "timestamp": "",
      "body": "You are being scammed.  Accept the papers into your hand if offered, but under no circumstances sign for them.  Do not sign anything.  The way this works is this:Schlub at your door:  \"You MUST sign this.  You NEED to sign it.  I CAN'T DELIVER THESE IMPORTANT PAPERS until you sign it.\"You:  \"No, I won't sign anything.  You may deliver the papers or leave, your choice.\"  If they continue to harass or badger you, just get your phone out and start filming as you dial 911.  Don't bluff; ask dispatch for police to be sent to you to deal with harassment.Whether you end up taking the papers or not, you're done with the guy at the door. Close your door in his face.  Don't conduct business with him.  Conduct all further interaction with these people in writing, and in my opinion that should be limited to a brief signed and dated letter indicating that, one, you do not believe you are responsible for this debt, and two, all further correspondence on this matter should be done via regular mail at such-and-such an address.  Send that letter off at your local post-office, as certified mail return receipt requested."
    },
    {
      "author": "Flat_Shower",
      "timestamp": "",
      "body": "If it makes you feel any better, I have an identical story with a medical debt. It was 10+ years old. They said they were suing me and this was my last chance to pay before I would be forced to pay the full debt plus legal fees. I told them I would pay in full if they can show me proof that I owed the money. They gave me a cheeky answer like “Hey man, I was just trying to do you a favor, we’ll win in court anyway.”They also called my family.This was 2 years ago. No name company. No online presence. Never heard from them again.Don’t pay."
    }
  ]
}