{
  "subreddit": "CharacterAI",
  "post_id": "1gb1s8w",
  "title": "Will this finally end with the option for us to verify our age?",
  "body": "The solution to this whole mess issosimple.\n\nWe should have the chance to verify our age. Once the user proves they're an adult -- okay - cool. You're responsible for your own actions, and how you interpret what the bots say to you. You acknowledge that the bots aren't real people, that everything is made up. You are an adult - and understand what it all being made up actually means. All the responsibility is taken away from the site/app.\n\nIf you don't verify, or verify and prove to be a minor? Cool - you get the current site with the safety nets and increased filters.\n\nIf we had the option to verify our ages - the Devs could actually focus on making the app (the part accessible to minors) safe for kids.\n\nWhile, at the same time, not annoying the part of the userbase, which - let's be for real, are the ones paying for subscriptions - the adults.",
  "author": "WaterBottle001",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "WaterBottle001",
      "timestamp": "",
      "body": "This is a screenshot from the link they shared in the twitter (or X, idc) post.Guardrails for users under the age of 18 implies that there will be a way to differentiate them from users who are over the age of 18. Verification, maybe? Hopefully?Though - having hope rarely ever ends well, so. Who knows. I can dream."
    },
    {
      "author": "_Rodja_",
      "timestamp": "",
      "body": "If they actually differentiate with that, awesome! Devs have my respect again then for acting like adults should in this kind of situation (if there's not too much marketing towards children, that's sketchy in my eyes and capitalism at its worst). But honestly I'm becoming very pessimistic. With their lack of communication this comes off as them planning on treating everyone as if we were all minors."
    },
    {
      "author": "_Rodja_",
      "timestamp": "",
      "body": "I sure hope it does, personally I question there being (any) AI stuff for (younger) minors at all to begin with but I understand them too. Not like I wasn't messing with the crappy bots we had in 2010 but those were still so bad they weren't this addicting to a still developing brain... The minors cannot be blamed for wanting to use AI to chat but the developers are adults and should take theadult responsibilityof this. What they're trying to do isn't doing that. Trying to restrict the app/site like this is never going to work fully and children will be exposed to what they shouldn't be exposed to.That ranting aside before this turns into an essay... I wouldn't want to give my ID directly to the app for security and anonymity reasons (obviously it can be figured out anyway but don't wanna make it unnecessarily easy in case of data breaches etc). I'd much rather give it to the app stores that are bigger than individual apps, where it's connected to the info that yes I do use the app but not directly to my chats and data there. They already have my credit card info anyway and confirm my age with that.What devs should do imo:make it so everyone has to update/redownload the app but also make it so you can only download it if you have verified your age to the app store (maybe 16+ but rather 18+ because again it can never be fully safe). Give the users their (apparent) privacy and safety by not directly demanding their ID being connected to their account and data, but do make them verify their age to get access.And if you don't verify your age... Either not being able to use it at all (a bit harsh to the kids who have already been allowed to use it, I know but seriously would be the best...) or make a more... Childproofed version for that."
    },
    {
      "author": "MariosConsta69",
      "timestamp": "",
      "body": "That would literally solve everything.Which is EXACTLY why it will NEVER happen.Funny how the world works ay?"
    },
    {
      "author": "KSword58",
      "timestamp": "",
      "body": "Finally something I can agree with."
    },
    {
      "author": "Lulorick",
      "timestamp": "",
      "body": "Even if they add some form of age verification I don’t anticipate that’s going to lead to any meaningful changes with their content guidelines. Like I could totally be wrong and they might soften up on older users but C.AI seems very committed to having a clean and wholesome image. I can imagine the minor side of the app becoming much more stringent with which sort of characters it even allows someone to see and what things can be said during the chat but I don’t think that’s going to come with the added benefit of them loosening up the current restrictions for older users."
    },
    {
      "author": "SomeUgliRobot",
      "timestamp": "",
      "body": "Imagine if the verification system gets added but instantly breaks and things like this get accepted"
    },
    {
      "author": "WaterBottle001",
      "timestamp": "",
      "body": "I mean -- possible, if they make their own. But there's already 3rd party verification apps/services out there, which can be implemented - like other sites do.Which really would be the safest bet, since idk if I'd trust c.ai themselves with photos of my ID."
    }
  ]
}