{
  "subreddit": "beatsaber",
  "post_id": "16dcchh",
  "title": "Is the leaderboard glitched?",
  "body": "I'm on PS4 and just don't think the 6th place is accurate bc I didn't even full combo :P (Sorry for the bad picture)",
  "author": "Topar999",
  "comments": [
    {
      "author": "GangbossSHAQ",
      "timestamp": "",
      "body": "If you’re playing on a beta that could explain it"
    },
    {
      "author": "SuperSteve35",
      "timestamp": "",
      "body": "Idk how to check if I am but I don't think so bc I paid the game and played with random ppl (when I had ps4 online thing)"
    },
    {
      "author": "PixelmonMasterYT",
      "timestamp": "",
      "body": "It might also be that ps4 just isn’t that active, most high scoring players use pcvr/quest. Still doesn’t seem right but that at least could be contributing."
    },
    {
      "author": "SuperSteve35",
      "timestamp": "",
      "body": "Ye ig, ty for the response!"
    },
    {
      "author": "SuperSteve35",
      "timestamp": "",
      "body": "I FORGOT TO MENTION: The song is Escape Remix on expert; Also don't have PS4 online although I used to idk"
    },
    {
      "author": "Erigu",
      "timestamp": "",
      "body": "Pretty sure new tracks stopped getting working leaderboards a bit over a year ago, and that was only fixed with the latest patch, around 10 days ago (talking about the PlayStation 4 version specifically, here, obviously).Ithinkthat track was among those affected, meaning any highscore you achieved before the recent patch is considered \"local / offline\" (i.e. it will only show up at the bottom of the screen), and only recent scores go on the leaderboards. That would explain why it's relatively easy to get good ranks on those leaderboards at the moment: they've only been around for 10 days or so. Plus, the best players on the platformmay or may notgive those tracks another try in the future. Maybe some (a lot?) of them have migrated to another platform since then, for instance."
    },
    {
      "author": "Self_Blumpkin",
      "timestamp": "",
      "body": "All platforms have their own leaderboards unfortunately.I get #1 scores when playing on my oculus Rift (OG) and those translate to like ~250 on the quest 2. Partly because I’m MUCH WORSE on the quest 2 and partly because they have at LEAST 10-20x the players"
    },
    {
      "author": "Topar999",
      "timestamp": "",
      "body": "I didn’t even know the scoreboard worked because it never shows any scores apart from my own (quest 2)"
    }
  ]
}