{
  "subreddit": "MetroPCS",
  "post_id": "1jwcxvo",
  "title": "These guys really f#@&$ me so far...",
  "body": "I had Cricket. Moved to a new area and Cricket's service went from poor to abysmal. I saw that I could get a better phone while switching to a presumably better service by moving my number to Metro.\n\nFirst, I went into a store straight from work(mechanic), so I was dirty. The two employees sitting at a table and on their phones while chatting to each other did not want to assist me whatsoever.\n\nThe one who did most of the talking began by insinuating I couldn't afford a new phone. Like I said, I had been under a semi for most of the day and I was pretty dirty.\n\nI explained about the ad on their website and they told me that I had probably been on a different carriers website. Apparently, I was not only poor but dumb as well.\n\nI showed them the ad from their website on my phone and she straight told me that if I wanted that phone it would be several hundred dollars which was likely out of my price range. I had taken enough abuse from her at that point and I left.\n\nI called metro, told the man about the ad and asked if it was only available online or if I could get it in a store. He said I definitely could get the deal and phone in a store but may have to pay a $30 activation fee. He seemed very eager to assist me and I didn't want to have to deal with the woman in the store again, so I agreed to just have the phone shipped.\n\nI stated MULTIPLE times that I did not want to switch and be without phone service until the phone arrived in the mail and each time he assured me that I would not experience any loss of service.\n\nThe moment my card was charged, the call abruptly ended and I no longer had any cell phone service. I only received two emails; one to confirm my email address and one confirming my payment.\n\nThat was Monday evening. It is now Thursday. I've spent way too much time using my boss's phone while metro reps keep me endlessly on hold until suddenly I'm talking to a new rep as though I have just initiated the phone call.\n\nI can't login to the website for support because it wants to send me a verification text. Same thing with you know NINETY PERCENT of everything else online, like my banking, etc. I can't find any support email address.\n\nI did find one place to submit a support request. I could only enter a short synopsis but provided all of the relevant info (email, name, number) etc. Two days later, I got a reply saying Metro doesn't have any info on me or know anything a phone being shipped, etc.\n\nI'm really hoping they just didn't GAF to actually check and there is a phone on the way at some point eventually. I mean, I know my number was moved to Metro and I know I my bank account was charged, but so far, not a single employee has been able to give me any idea of when it might arrive so that I can escape the freaking dark ages I'm stuck in currently.\n\nI sincerely hope my experiences so far are anomalies and not actually representative of them and their services.\n\nSo, I'm going to leave wifi now and endure some more mind numbing waiting and hoping. SMH",
  "author": "Prior_Ad5495",
  "comments": [
    {
      "author": "PsychologicalCat6537",
      "timestamp": "",
      "body": "I mean, during the checkout you go through the whole process of putting your account number and transfer pin so I don’t see how anyone would think the port would not happen immediately…."
    },
    {
      "author": "Cashyonutz",
      "timestamp": "",
      "body": "This sounds so fake…"
    },
    {
      "author": "Ethrem",
      "timestamp": "",
      "body": "Yet it's a story that's been repeated multiple times about Metro. Even people signing up on the website found their phone number was ported instantly and they were left with no service."
    },
    {
      "author": "Lunna9279",
      "timestamp": "",
      "body": "for porting i highly recommend doing it in store if the port doesn’t go through we can see it in real time and fix it reps on the phone dont care they wont have to deal with you again so they want to be quick"
    },
    {
      "author": "BusinessAd851",
      "timestamp": "",
      "body": "Bro are u ok? How did you think you’d still have service with cricket when you are creating a new account n everything with metro and having a phone shipped to you without cricket releasing your number 😵‍💫😵‍💫😵‍💫"
    },
    {
      "author": "MilkWithCookies_",
      "timestamp": "",
      "body": "That sucks. Prepaid carriers like Metro and Cricket unfortunately don't give temporary numbers for scenarios like this. The best thing to do if you do everything online, especially porting over, is to give the wrong account number or transfer pin. That way the transaction goes through, but you won't be out of service, and when you get your phone, you can call or go to a store to help correct the information"
    },
    {
      "author": "ExcellentGur4669",
      "timestamp": "",
      "body": "I've been a Metro T-Mobile customer for 10 months now and I really like the prices and the service.They definitely have the best plans for the best price nowadays.But I would definitely suggest that you do everything online and you'll actually save a little money that way too.Ive had some employees be somewhat rude to me and they seem a little annoyed by dealing with a flesh and blood customer.I even got charged a fee for paying in store with cash,lol,but it's great prices for great service, and even though the plan allows me to upgrade every 12 months I went in there the other day and upgraded after 10 months and had no problem doing it the employee was totally cool with it it only cost me $35 and I upgraded from the 2023 Moto g to the 2025 so I really can't complain but shave yourself the frustration and a little money and do everything online"
    },
    {
      "author": "AdAppropriate8772",
      "timestamp": "",
      "body": "I wish to f$&# I was making all this up and the woman in the store being rude blew my damn mind so I get why you might think it's BS but it happened and it made me feel like shit.As far as people saying I should have known  that my number would be imported right then, I definitely suspected it was and that's why I repeatedly told the guy that I didn't want to move the number that day because I didn't want to experience a loss of service. I must have said it seven or eight times and every time I mentioned it, the guy assured me that I was not going to lose service and the switch wouldn't happen until I got the new phone in my hand and activated it."
    },
    {
      "author": "AwayPoem7090",
      "timestamp": "",
      "body": "Oof and here i was considering switching to metro"
    },
    {
      "author": "Prior_Ad5495",
      "timestamp": "",
      "body": "Hi I have been with Metro PCS which is now Metro T-Mobile for 15 years. I have never had a problem with them every time I go in the store they are so courteous and helpful I couldn't ask for better service. I'm sorry that this happened to you. I'm sure you know that if you don't get your phone you just call your credit card company and dispute the entire thing and they will remove it from your account you won't have to pay for this if you don't get your phone. But it's very aggravating to have that happen to you. But like I said I've been with Metro for ages and their service is great and I've never had a problem with areas any place around the United States that I go there's service"
    }
  ]
}