{
  "subreddit": "google",
  "post_id": "rlfuqz",
  "title": "Google's asking me to verify my age by sending either creditcard details or my ID",
  "body": "So i turned 18 about 3 months ago. at the time i got a notification to verify my age but accidentally clicked it away. This resulted in me not being able to download any form of 18+ apps (think dating apps for example) but YouTube is now also complaining, at least the browser version.\n\nIs it safe to send my ID for verification? I don't have a creditcard but I'm not sure if it's something that I should really do? I live in Europe and I saw someone else say it's because of a new law. Just unsure of what to do",
  "author": "Rodo20",
  "comments": [
    {
      "author": "jmwint",
      "timestamp": "",
      "body": "The best way to update your Google Account profile is to go to your Google account direct (No links that have been sent to you).open your Gmail... in the upper right click your photo or the circle then click ...\"Manage your Google Account\" this will allow you to make changes to your profile"
    },
    {
      "author": "Raven-UwU",
      "timestamp": "",
      "body": "I've checked the manage google account thing so many times, but I'm unable to actually find anything regarding age verification on mobile. I was able to access it through YouTube's settings about ads and privacy on my laptop, so I'll try that next time"
    },
    {
      "author": "Maeggsi",
      "timestamp": "",
      "body": "I used my ID. You are able to cover your information (e.g. address) - basically information that you don't want to give to google - with a color that is similar to your ID's. If you're using white/black it doesn't work."
    },
    {
      "author": "Raven-UwU",
      "timestamp": "",
      "body": "ah alright neat, thanks for telling me that, that already makes it a bit less \"invading\" if that makes sense lol"
    },
    {
      "author": "brownsnoutspookfish",
      "timestamp": "",
      "body": "Which country has address in the ID?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "MrR0b0t90",
      "timestamp": "",
      "body": "I recently had to verify my age on YouTube to watch certain videos. I used my Id to verify"
    },
    {
      "author": "joshuahtree",
      "timestamp": "",
      "body": "As long as you're able to get to the page yourself without clicking the link, it's safe to use your ID to verify your age on YouTube"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "If you've ever used Google Pay our any subscription on YouTube, they have your card stored anyway and you can just click it and it'll verify it instantly"
    },
    {
      "author": "Rodo20",
      "timestamp": "",
      "body": "I used my debit card. I was not even 18 worked regardless. I assume it's faster than sending id."
    }
  ]
}