{
  "subreddit": "facebook",
  "post_id": "1gdrtwg",
  "title": "How do I verify my age to get back my access to marketplace? Please help",
  "body": "This stupid shit doesnt even fucking work. When I press the link, it brings me to the news feed. Facebook doesnt have a support email so I cant even fucking email them that they banned me from marketplace for no reason EVEN THOUGH IVE NEVER listed ANYTHING on it.",
  "author": "honeyz00",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Thank you for posting tor/facebook. Please read the following (this does not mean your post has been removed):SCAM WARNING: If you are having a problem with your account, beware of scammers who may comment or DM you claiming they know someone who can fix your account, or asking you for money or your login information. If you receive a message like this, block and report them.Here is an example of me making a fake hack post and all the scammers who flocked it it, lol.  THERE IS NO REASON FOR SOMEONE TO HAVE TO TELL YOU IN PRIVATE HOW TO GET YOUR ACCOUNT BACK.  If you check the sub there are PLENTY of high karma posts that gives some tips should your account be hacked/locked.r/facebookis an unofficial community and the moderators are not associated with Facebook or Meta.  DO NOT MESSAGE THE MODS ASKING FOR HELP WITH FACEBOOK.Please read the rules in the sidebar (or the 'about' tab if you're on mobile). If your post violates any of them, delete it.If you notice your post has multiple replies but you only see this post, the reason is due tobots and scammers already being removed trying to steal your info/moneyI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "CompetitionOld1047",
      "timestamp": "",
      "body": "Dude it’s so fucking annoying. Please let me know if you figure it out"
    },
    {
      "author": "Shineactuss",
      "timestamp": "",
      "body": "Hey, so I just randomly checked marketplace a few minutes ago and it asked me to verify my age. It gave me the option to verify my age by taking a video selfie!! Hopefully it will actually work."
    },
    {
      "author": "Mammoth-Note-6927",
      "timestamp": "",
      "body": "It’s bs and no one knows how to work it"
    },
    {
      "author": "Nitropower4242",
      "timestamp": "",
      "body": "Having the same problem right now, super frustrating to deal with cuz I'm wayy past 18..."
    },
    {
      "author": "bray345",
      "timestamp": "",
      "body": "so i just ran into the same issue, I have yet to upload my ID but I do not see why this won’t work.Confirm Your Identity"
    },
    {
      "author": "brattyfa3",
      "timestamp": "",
      "body": "Help, I'm having same problem."
    },
    {
      "author": "Outside-Practice6317",
      "timestamp": "",
      "body": "Thanks"
    },
    {
      "author": "PreferenceWeak9639",
      "timestamp": "",
      "body": "This same regarded shit is happening now to me. This is after fbm blocked my access out of the blue one day, for 10 months with no violations, no explanation, no ability to appeal or contact “tech support”. Worst platform ever. Does anyone have good ideas for an alternative?"
    },
    {
      "author": "honeyz00",
      "timestamp": "",
      "body": "Ok so I’ve been kicked off Facebook marketplace for 5 days now and everyday I’ve been reporting it and trying to gain my access back but it hasn’t worked. I reckon there is no solution on getting it back and had to make a new account to sell my items on the marketplace unfortunately"
    }
  ]
}