{
  "subreddit": "offmychest",
  "post_id": "14dvq0",
  "title": "As a father of 4, I have failed",
  "body": "As I sit here writing this I am half tempted to stop. Why? I ask myself, what is this going to solve? But for some reason typing this and facing this makes it hurt less.  I have four children ages 11, 7, and twin boys who are 3.  This year has been absolutely miserable.  After living with my girlfriends parents for years to get on our feet we did it at the beginning of this year.\n\nI was promised a promotion at work which would bring in MUCH more money and we could live comfortably, however that did not happen.  My brother was murdered in a Rite-Aid a few months ago, I suffered a broken leg and missed work for a month, and our bills fell behind and I fell into a deep depression.\n\nI have been paying rent, but late every month.  Often times not being paid until the 15th of the month.  I hate having to sacrifice paying either the power or water bill, or just not getting gas in the car for the week.  Christmas is now here, and my kids are asking me why we don't have a Christmas tree? How am I supposed to tell them that we can't afford one?\n\nI have sold all of my stuff worth of any value to be able to pay some bills and I have nothing left.  My power is due to be cut off on December 10 because of a $400.00 past due balance, my water is due to be cut off December 10th as well due to $120.00 past due.  And of course all this comes full circle in December.\n\nI just got off the phone with my landlord asking in a not so happy tone when the rest of Decembers rent would be paid.  I feel like a complete and utter failure.  It pains me to my core, and nothing hurts more than seeing my kids go without.  I honestly don't think I can bare to look into their eyes on Christmas morning, and what I will say.\n\nOr what I will say on Monday when we have no power or water.  I am working two minimum wage jobs, and their mother is working full time as well, yet we are barely scraping by and can't get caught up because of the month with no income.  If there was only a way to get caught up we would be ok.  But playing catch up with past due balances in coming full circle.\n\nI just wanted to vent, and perhaps cry a little, for the pain I feel for my kids.  I hate myself that I could of not done better, or I could have a better job with more income.  I am supposed to be a father and a provider and I can't even do that.  I am dreading Christmas morning, and wish I can just escape all of this.\n\nUPDATE: Power bill almost completely paid up, and water bill paid in full. (http://i.imgur.com/PIaxZ.jpg) you are all AMAZING GREAT PEOPLE!!!\n\nUPDATE 2: THANK YOU ALL!!!! The compassion is beyond amazing. Just a FYI almost all extra gifts, and some of the high priced items on the wish list will be going to my brothers family, my brother was murdered a couple months ago, as well as some of the money. I will also be paying all this extra generosity to others who need it around me as well. Pictures will be posted for proof. Your all amazing and many tears have been shed today\n\nUPDATE 3: Honestly everyone, this is beyond amazing. PLEASE PLEASE help others who are on here needing assistance with bills and toys.  AGAIN - ALL extra money and toys will be going to others so I can spread your love.  PLEASE PLEASE help others out here who need it now, let's make this a night amazing for others as well. Thank  You for everything.\n\nUPDATE 4: I see I am  getting a lot of hate now, but I am blown away by all of this. So PLEASE if you were one of the people posting on here about how you need help please PM your info and let me help you now.  I have lots of extra toys and money to help pay some bills. For the FINAL time all this extra compassion will be put to use to make this holiday just as good for somebody else, so please let me help now the best I can, PLEASE PLEASE DONATE TO OTHERS NOW!! We are beyond blessed at this point.  Let's make this an awesome one for others too!!\n\nUPDATE 5: FINAL UPDATE: Thank you all again. i honestly can't say that enough I hope I helped some other people out as well. I need to get home and go to bed as I got work at 5AM.  Please No more donations you have all done so much already.  I am eternally grateful to all of you.  Pictures will be posted of Christmas and the gifts I have helped others with.  Goodnight and thank you.\n\n**ONE LAST UPDATE: I am trying my best to go through all of the submissions for help.  As of this morning over $1,800 dollars has gone to helping others with power bills, toys, car repairs, food money, and etc. Donations are also being made to a local community outreach center that helps with utilities and other hardships.  To answer just a few questions. People are skimming my pasts posts regarding me purchasing turn tables, records, and etc.  99% percent of those items were purchased at thrift stores and yard sales for pennies on the dollar.  That money came from many of the side jobs I do for extra cash, and everything that was posted was sold well over 6-8 weeks ago.\n\nThe reason I kept adding to the wish list was for the benefit of others that I know from my place of employment, in the neighborhood, and others who are need that can benefit from the kindness of others. The higher priced items that were added was in part from my daughter sitting in during my phone calls as I told her \"add some stuff your brothers and other kids would like\", she is a kid she didn't know any better.\n\nI am at work on break but I am trying to fill as many Christmas wishes with verification as possible, if I don't respond or can't help out I am sorry, I am trying everything I can.  The IndieGoGo is in the process of being hidden.  Once opened they will not close it once donations have been made, but they can \"hide\" it so no more donations will be made.  I sent the request by e-mail last night and I am hoping it will be taken down. For those sending negative hate, threatening e-mails and messages, and even death threats, please put that negative energy into helping others.  For everybody that donated and contributed, and sending positive message and vibes I thank you from the bottom of my heart.  You are all wonderful people.  Pictures will be post once the holiday nears of others receiving goods, and etc.  Thank you and happy holidays to all of you**",
  "author": "BobSacramanto",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I would like to pay for your past due water bill. I am 100% serious. Please PM me to see how we can figure this out. There is no reason your children should have to do without; you are not a failure. So many of us don't realize how easy it is to get into a tough situation. We're all practically one paycheck away from it.Let me help you."
    },
    {
      "author": "FalconOne",
      "timestamp": "",
      "body": "I chipped in $50 20 minutes ago when it was still creeping around above $100 in donations. Come back after a bathroom break and reddit just gave a guy having a bad month and his kids a Christmas. This is why I reddit.OP. i hope my little bit helps, but I really hope that the lot of us can help you get back on your feet. At some point in everyone's life they may need someone to put their hand out and help a guy back on his feet so he can run again."
    },
    {
      "author": "mr_tofu",
      "timestamp": "",
      "body": "Please move to the top so people don't order multiples.From this Australian I am fortunate enough to be in a position that I can give more for the first time in my life.  The only thing I ask for in return, is you your family do something for someone this Christmas as a family unit.Xbox 360 4GB ConsoleLava Lite 2124 Classic 14.5-Inch 20-Ounce Silver Lava Lamp, Yellow Wax/Blue Liquid -Avengers Mighty Strike Thor 10\" FigurePower Ranger Samurai Samurai Ranger Forest Action Figure -Power Ranger Samurai Mega Ranger Light Action Figure -Xbox 360 Wireless Controller - Glossy BlackA photo on christmas day would be awesome.Enjoy your holidays and I hope one day you can return the love.Enjoy MateAndrew Perth, AustraliaPost Edit - After checking the indiegogo account and the with the wishlist sorted. I hope It was a mistake to see  more things still being added. I do hope that was has been given is more than enough to get you back on your feet and you family through the holiday period."
    },
    {
      "author": "reddittrunks",
      "timestamp": "",
      "body": "Not sure this is necessary to say, but saying it anyways:  please save most of the kick starter money for future rainy days. Merry Christmas."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I go to class hungry, come back to a cold house. I'm behind on patching my clothes (at least the carharts can handle it). Today was a day of self pity for me... then I logged onto reddit and saw this. It's really great to see the support you have, and for me to hear the frustration and pain of being in debt and poor... made me feel less lonely.When I grew up with a single father, we were dirt poor. The only presents we got were from a charity where this guy dressed as Santa and gave you one present. I never noticed it though. I had such a fun time with my dad that I never felt weird for wearing the same clothes sleeping on a futon. What I mean is, it looks like you're there for them and you care- don't sell yourself short on how much being a great dad just means so much. Good luck!"
    },
    {
      "author": "crapadoodledoo",
      "timestamp": "",
      "body": "If you can teach your kids that happiness is not something you buy but something you create, you will have given them the best Christmas present ever.You can have a fabulous Christmas with your kids if you focus on things that are priceless. Here's a few suggestions:Plan a family outing to a pretty natural place, make fire, roast marshmallows, have a picnic, sing songs and hike a bit.Make them great stuff that doesn't cost more than a few pennies like homemade quilts made from pieces of worn out clothing, or toys you make yourself with stuff lying around the house and in the yard a couple screws and some paint. Check out the awesome DIY videos on YouTube if you don't know what to make or how.For the 2 eldest kids, you can teach them each a fun skill that when combined makes something cool like a simple piece of furniture or something.With a deck of cards, you can teach the whole family fun games. Some of the funnest times I had as a kid was playing card games with my parents. My mom always cheated and we all ended up laughing like idiots.The youngest ones are the easiest because it doesn't take much to make 3 year old happy. Homemade toys are cool, yummy homemade treats are yummy and lots of the funnest, best stuff is free or close to it.We used to wait til late Christmas eve and then go \"liberate\" a tree from the leftovers of vendors near our house. This can be done Xmas day for even greater safety, but I've never run into any trouble. A tree that cost $80 a couple days before suddenly has no value and vendors will have to dispose of them so no one minds if you help yourself to leftovers. We'd put it up and decorate it with whatever we could find and maybe a dollar's worth of tinsel from the Dollar Store (or wherever). When your kids wake up, they'll be happier than if the tree had been there for weeks because it'll be such a great surprise.Be creative, dry your tears and cheer the fuck up dude. If you teach your kids that happiness comes from being together and loving each other and doing fun stuff together andnotfrom cheesey over-pricedcrapmade in China, you will be giving them something of inestimable value that will last them the rest of their lives."
    },
    {
      "author": "llem20",
      "timestamp": "",
      "body": "I am so sorry this is happening to you, I truly am. I wish I could help you in some ways, or even say something that would be some what comforting, but I can't.Although, I would suggest asking inr/Assistance, not  money but for christmas presents for the kids. People will be much more likely to help out the kids.  You could also ask for candles, blankets.  Things that mean you can 'make a game' out of a really bad situation.Again, I'm sorry this is happening, please don't give up.  Please keep going and stay true to your family.  Love them."
    },
    {
      "author": "someguynamedjohn13",
      "timestamp": "",
      "body": "call your utility companies. I know in New York they cant turn off the power, water or gas if you have small children or someone who is on any type of medical support. Other states should have similar laws."
    },
    {
      "author": "jmcrazy",
      "timestamp": "",
      "body": "My wife is wondering why I'm staring at my phone crying. I emptied my Paypal account, I hope your Christmas is beautiful."
    },
    {
      "author": "BobSacramanto",
      "timestamp": "",
      "body": "As a father of 3 I know the pressure you feel to provide for your family. I will tell you that YOU HAVE NOT FAILED! To be a failure as a parent one has to give up on their kids, which you obviously have not done. Working 2 jobs take guts man.As for your immediate problems, are there any services in your city to help people pay their utilities? I know in our town there area a few churches that will help people once or twice a year with electric bills or water bills. Also, there are many services that will help with Christmas presents too.I know you are hesitant to use these services because you will feel like even more of a failure but you are the type of person these services were designed to help. Please take advantage of any help you can;JUST DON'T ABUSE THEMGood Luck Bro!"
    }
  ]
}