{
  "subreddit": "VRchat",
  "post_id": "1iefs5f",
  "title": "Will my Age Verification stay if I only subscribe to VRC+ for 1-Month?",
  "body": "Basically what title says.\n\nI don't mind paint $10 to get Age Verified, as long as the verification will remain on my account by the time my VRC+ membership expires.",
  "author": "KeyboardHaver",
  "comments": [
    {
      "author": "Eternal_Ohm",
      "timestamp": "",
      "body": "Yes you keep it, this is stated on their blog.https://hello.vrchat.com/blog/age-verification"
    },
    {
      "author": "Darkstone_BluesR",
      "timestamp": "",
      "body": "Thanks!"
    },
    {
      "author": "AryaDRed",
      "timestamp": "",
      "body": "Yep, if you dont have vrc+ but got age verified from the group drop you also still have it"
    },
    {
      "author": "BlizzrdSnowMew",
      "timestamp": "",
      "body": "Yes but I used it as an excuse to finally actually use VRC+.  I'm not sure if I'll use any of the other features, but I spend so much time in VRC I think it's time I finally start supporting them lol"
    },
    {
      "author": "nesnalica",
      "timestamp": "",
      "body": "i dont understand why so many randomly assume itll disappear if you don't have vrc+lol"
    },
    {
      "author": "Darkstone_BluesR",
      "timestamp": "",
      "body": "Been on VRC for little over a month. It is completely normal to ask questions about things you do not know."
    },
    {
      "author": "PonyUpDaddy",
      "timestamp": "",
      "body": "Man, they really monetized 18+ content and I find it hilarious this question comes up a lot"
    },
    {
      "author": "tailslol",
      "timestamp": "",
      "body": "Yes ,they plan to release it to free users at a later date"
    },
    {
      "author": "KeyboardHaver",
      "timestamp": "",
      "body": "That is not guaranteed, actually. On their developer update they mention the following.How Age Verification works could change in the future. It might be tied to VRC+ forever… or maybe it isn’t tied to anything at all. We don’t know yet and so we’re leery about making any absolute statement.https://ask.vrchat.com/t/developer-update-30-january-2025/40905Their blogpost meanwhile seems to hint at this only being temporary.From what I gathered, theywantto make it free, but may not have the ability to do so due to it costing money for them."
    }
  ]
}