{
  "subreddit": "VRchat",
  "post_id": "1jhm6yx",
  "title": "Opinion : if you ask for age and date of birth at a club/bar even after seeing someone is 18+ verified you are a power tripping clown",
  "body": "I’m actually getting fed up with this even some age, gated bars and instances ill go to and they’ll still ask for age and date of birth. What the hell is the point of the verification system where you need an actual ID and face scan to be verified if people are just gonna go on a power trip and say that it’s not valid makes no sense they trust word-of-mouth, which is way easier to lie about than a more secure verification process. The main argument I’ve seen from people is that “some kids are taking their parents IDs” it’s a lot harder for a kid to get their parents ID then to just lie about your age these “bouncers” just want to feel power over you still like I shouldn’t have to give out my personal information still when it’s all been scanned already",
  "author": "Pokabrows",
  "comments": [
    {
      "author": "kwizyvr",
      "timestamp": "",
      "body": "My answer to that is: \"Thanks, I'm good. Bye.\"There are plenty of groups that don't act like this."
    },
    {
      "author": "Minxy57",
      "timestamp": "",
      "body": "This is the way; social darwinism will render them extinct in time."
    },
    {
      "author": "Sanquinity",
      "timestamp": "",
      "body": "\"But they could have taken their parents' ID!\" Do you even know what you're saying? That means a kid got their parent to not only give them their ID, but also take a selfie of themselves for verification! Do you know how hard that would be to actually do? And if a kid does manage to do that, that's on the parents at that point, for completely not paying attention to what their kid does at all. Besides, a proper age verification system is EXACTLY what everyone kept complaining about not being in the game. And now that we have it a large portion is like \"Nah, just their word is more reliable\"? What?It's all just excuses to keep getting that power trip fix they want. I refuse to enter any instance where they still ask me for age and date of birth after seeing I'm verified."
    },
    {
      "author": "anthemlog",
      "timestamp": "",
      "body": "They won't believe the age verification but they will believe what ever lie you tell them. Just lazyness."
    },
    {
      "author": "Bahamut1988",
      "timestamp": "",
      "body": "Agreed, these \"bouncers\" just don't want to relinquish that little bit of power they have, RP is one thing, but even there it's annoying and unnecessary"
    },
    {
      "author": "Chima_Lukas",
      "timestamp": "",
      "body": "As a fomer bouncer, I like brother other bouncer who don't believe the verified 18+ thing"
    },
    {
      "author": "MarineSgtBlake",
      "timestamp": "",
      "body": "I'm seeing stuff like this pop up a lot more frequently. I don't give people the satisfaction if I'm going to be dealing with a power hungry bouncer."
    },
    {
      "author": "Thiccxen",
      "timestamp": "",
      "body": "It's always some geek with a voice changer on the door making them sound masc af too"
    },
    {
      "author": "HydraSquid",
      "timestamp": "",
      "body": "Agree. Though this exact thing is posted here almost daily, which I guess says more about how much of a problem this is"
    },
    {
      "author": "Pokabrows",
      "timestamp": "",
      "body": "I'm kinda at the point where I want lists of which groups do and which groups do not respect the age verification so I know where to go vs not go. It'd be useful if they put it in their group description/ rules so we could check without even entering the world."
    }
  ]
}