{
  "subreddit": "TotalWireless",
  "post_id": "1d8795v",
  "title": "Veriff identity verification doesn't work for some reason. Any success stories?",
  "body": "I've been trying to verify my identity on the Total by Verizon website for a couple days and it won't work. I tried on multiple devices, both iPhone and Android, and on multiple browsers.. but it won't work.\n\nI provide all the documents and at the end it says \"thank you, your verification data has been successfully submitted\" and then when you hit \"continue\" it says \"please wait to get verified\" and has a loading circle for 30+ minutes until the page reloads.\n\nTotal by Verizon support says they can't help and I'm stuck.\n\nHas anyone ever got this to work? How long ago was that and what device and browser did you use?\n\nThx for the info!",
  "author": "Angelina1982",
  "comments": [
    {
      "author": "jatan1986",
      "timestamp": "",
      "body": "Use laptop/desktop to start the order then use phone (scan QR code using camera) to do verification -- return to laptop/desktop to finish order.You might be able to use another phone/tablet to start order (just set the browser to \"desktop mode\") -- make sure you have good lighting when doing verification photos"
    },
    {
      "author": "PartyRutabaga168",
      "timestamp": "",
      "body": "Thanks for your reply, I actually got it to work but ran into another issue 😭A few hours before your post I did almost exactly what you suggested, desktop to phone and return to desktop to finish. It gave me problems the first couple times when doing that but then I got it to work by doing the entire document submission and selfie in warp speed, like 10-15 seconds.BUT.. when I tried to purchase the phones it gives an error message on the final step of checkout \"Alert - We Apologize, but we cannot process your transaction at this time, please try again later or call us at 1-866-xxx-xxxx\"So it won't let me pay for the phones now.. even though the number check and identity verification were successful. I tried maybe 50 times with multiple payment methods and PayPal and got the same error regardless of device or browser, and support was of no help.So I'm giving up 😂.. I'm exhausted."
    },
    {
      "author": "XGempler",
      "timestamp": "",
      "body": "There was a thread about this a couple of weeks ago where someone said it worked, and others who said it didn’t…https://new.reddit.com/r/TotalWireless/comments/1cv28gb/not_receiving_verification_test_for/"
    },
    {
      "author": "PartyRutabaga168",
      "timestamp": "",
      "body": "Thx for the link. Hopefully someone replies back to me with a workaround.I don't know if you're familiar with the full porting/activation process but I have a quick question if you have a moment.Right now they have some deals where porting is required, but I was wondering how long after receiving the phone in the mail do you have to complete the porting/activation?I ask because I still have 25 days on my current carrier's plan but want to buy one of these phones before the deal expires. So I was hoping I could do the verification and buy the plan and phone now but not activate/port out for another 20 days. Is that possible?Thx again"
    },
    {
      "author": "nelson2011x",
      "timestamp": "",
      "body": "Worked for me and was able to order two a54's for family. First order was on May 16th and then I ordered a second on May 22nd. On the second order I didn't have to redo the verification, it just let check out."
    },
    {
      "author": "PartyRutabaga168",
      "timestamp": "",
      "body": "Thanks for the reply. I think you're allowed two phones per account.. so I'm thinking that's why you didn't have to verify again.What device and browser did you use to do the verification? I was able to get the verification to work but now it gives an error message at checkout 😂"
    },
    {
      "author": "Angelina1982",
      "timestamp": "",
      "body": "That’s why I like going in a retail store when buying phones.. I’m trying to find closest store for me.. I wished customer service can do it for u then online.. they say it bcz security ..,other carriers can do it.. good luck .."
    }
  ]
}