{
  "subreddit": "unitedkingdom",
  "post_id": "1hk72cl",
  "title": "Social media firms to be forced to ‘drive out’ under-age users",
  "body": "",
  "author": "TheFinalPieceOfPie",
  "comments": [
    {
      "author": "ukbot-nicolabot",
      "timestamp": "",
      "body": "This article may be paywalled. If you encounter difficulties reading the article, trythis linkfor an archived version.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.Alternate SourcesHere are some potential alternate sources for the same story:Social media firms could be made to use facial recognition technology to check children's ages, suggested by vriska1 - dailymail.co.ukTech bosses threatened with jail as government cracks down on children's access to social media- news.sky.com"
    },
    {
      "author": "Efficient_Sky5173",
      "timestamp": "",
      "body": "Because parents are too lazy to learn how to use parental control on their children’s phone."
    },
    {
      "author": "pajamakitten",
      "timestamp": "",
      "body": "Or think there is nothing wrong with kids being on social media because they all are."
    },
    {
      "author": "dowhileuntil787",
      "timestamp": "",
      "body": "Would that have stopped you when you were young?Even our school IT admins couldn’t stop us, let alone our parents."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Mysterious-Dust-9448",
      "timestamp": "",
      "body": "I've yet to see any benefits of children so young owning a smartphone at all. Sure, parents want to keep in touch with their kids but why wouldn't an old Nokia do that job? I assume that in the future giving your child a phone will be seen as taboo similar to giving them alcohol or cigarettes."
    },
    {
      "author": "K-Motorbike-12",
      "timestamp": "",
      "body": "The only good excuse I've heard is that it invites bullying from other kids. I know kids can be ruthless little S***s, so this would need most parents to get onboard - which is highly unlikely in our current society.Now, what I am not suggesting is that having kids with smartphones is still a good idea. I would ban them until at least 12."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Ofcom still refuses to talk about the privacy and legal issues of age verification, this is going to end up delayed at the last min."
    },
    {
      "author": "sickofsnails",
      "timestamp": "",
      "body": "Why, as a 31 year old woman, would I want to give the government or social media companies my face, along with in depth information on my views?"
    },
    {
      "author": "TheFinalPieceOfPie",
      "timestamp": "",
      "body": "The little privacy we have left is always being taken away by dumb motherfuckers who know nothing about the internet."
    }
  ]
}