{
  "subreddit": "texas",
  "post_id": "18zey7c",
  "title": "Ran into my first website that has blocked Texas, yesterday",
  "body": "Here's a link with some information related to the Bill that caused it.\n\n*edit: at some point in the past 24ish hours, the site unblocked Texas based ips.\n\nI tried to go to the siteand turned out we are blocked. So, a little background. Three years ago I was hit by a reckless driver and paralyzed from the chest down. As a result I've lost all sexual function and feeling. I am divorced, and live alone, and will probably stay that way, which I have come to terms with. I discovered VR porn, which isn't really much, but when you've lost as much as I have, it's something that's better than nothing.\n\nI'm aware that I can just use a VPN to get around this. But now I have to pay additional money because some non thought out legislation that will do nothing to protect children and just impact legitimate sites and people.  Even if these sites decided to implement systems where they accept ID cards, would you trust them with your ID? would anyone necessarily want that type of invasion of privacy?\n\nAnd then how long will it be before they go after VPN services? They are already on a roll, stripping away access to healthcare for women.\n\nHere's a link to the bill, so you can see the folks who have attached their name to this crap. Our freedom, our privacy, and our access to healthcare are being taken from us. These are the assholes doing it.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Tara_is_a_Potato",
      "timestamp": "",
      "body": "Texas Freedom! Oh, what's that, you want marijuana or alcohol sales on Sundays or porn or sex toys or abortions? Sorry we don't do that here, but you can buy another few guns today if you want."
    },
    {
      "author": "scottBIGG",
      "timestamp": "",
      "body": "My family was visiting me in Colorado for New Years and my dad was amazed that we could go to the liquor store on a Sunday. Also we can own guns and carry here. Other than a higher cost of living (in certain areas) it’s a more free place than Texas for sure. Source - Lived in Texas for the first 30 years of my life."
    },
    {
      "author": "GoldenFlicker",
      "timestamp": "",
      "body": "That basically sums it up.  Low government oversight of things that can and will kill you, high government oversight for the personal and private things you do in your own home or with a healthcare provider where HIPAA law should protect you, but doesn’t."
    },
    {
      "author": "noncongruent",
      "timestamp": "",
      "body": "I wouldn't submit any ID to these sites, because it's only a matter of time before Paxton et. al. subpoena those IDs from the providers in order to build a database of \"porn perverts\" to go after. What can they do with those names? Deny jobs, informally blacklist those names from all \"friendly\" job creators, fire people from state and government jobs, deny benefits, etc. It's basically the new \"Are you now, or have you ever been a Communist\" control and discredit tactic used so effectively by McCarthy against his party's political enemies and opponents."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I think people really do not understand how Christian nationalism will impact their lives. The goalposts will always move."
    },
    {
      "author": "yellowstickypad",
      "timestamp": "",
      "body": "I think people really do not understand how Christian nationalism will impact their lives. The goalposts will always move."
    },
    {
      "author": "spitefulcat",
      "timestamp": "",
      "body": "“Under his eye” (For those that don’t know the reference, Handmaid’s Tale). We’re headed in that direction. I can’t wait to get the hell out of Gilead!"
    },
    {
      "author": "EquipmentFormal2033",
      "timestamp": "",
      "body": "The bills sponsored by Paxton. That tell you everything you need to know. He’s pure evil."
    },
    {
      "author": "urk_the_red",
      "timestamp": "",
      "body": "I don’t know aboutpureevil. He’s at least 50% moron too."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}