{
  "subreddit": "VRchat",
  "post_id": "1fx9ay3",
  "title": "Does anyone else think opt in age verification would be useful if implemented on VRChat",
  "body": "I think the best way to implement it would be to have it as a flare value like it shows that you're on quest letting people know you haven't age verified for your age which you could show your age with or toggle off after verification and that value could be also used as a toggle when creating an instance that you could even limit to an age range to help meet people more around your age",
  "author": "DragonTamerWes",
  "comments": [
    {
      "author": "Volpe-Momo",
      "timestamp": "",
      "body": "I always thought an age verification system where once the devs or something verify you, you would receive a little badge (like when you have vrc+) this allowing you to make instances age verified only would be a great idea. Plus event and clubs would have an easier time, only having to look at a persons profile to see if they have the badge (plus a person wouldn’t have to verify every time a new club opens up). Honestly I don’t know why they haven’t done it yet unless they think they would be swapped with people wanting to verify, even so I would prefer waiting my turn and knowing that places would be safer, then have nothing at all."
    },
    {
      "author": "LakesRed",
      "timestamp": "",
      "body": "Definitely for bars, clubs and peace of mind around certain activities"
    },
    {
      "author": "Street_Estate_6121",
      "timestamp": "",
      "body": "Age verification is coming. When? Who knows, but VRChat is working on it."
    },
    {
      "author": "BunnyCreamPies",
      "timestamp": "",
      "body": "I would love this in a perfect world. This is what should have been thought of back when you were required to have a Facebook account attached to a Meta one to even use a quest.This idea would be great but implementing n age verification method would likely cut into Meta's bottom line. If VRChat, as an entity who receives funding from Meta, creates some sort of official age gating mechanism that messes with the flow of users (mainly children getting quests every damn Christmas) they might pull funding from VRC and it disappears.It's a difficult situation. Unless they can convince Meta somehow, we're kind of doomed to do our own shoddy age gating until something changes."
    },
    {
      "author": "DracoBorg",
      "timestamp": "",
      "body": "I agree that this would be a simple solution that would drastically increase safety comfort and usability in any platform if they left this is an optional opt-in option as well as an optional filter but if VRChat were to do it themselves I could actually see this increasing their profits being a great way to filter out trolls and crack down on multi account harassment from individual's by making it opt-in just like it's optional to make an account with them to begin with or just use your platforms account but most people make the main account so they can connect to it on any device"
    },
    {
      "author": "Technical_Disk6433",
      "timestamp": "",
      "body": "The only thing that would work are parental controls on the quest restricting certain games, there isnt really a way to age verify in vrchat unless you could only get into certain worlds by paying a small fee using your credit card or something in order to get access to visiting that world but a system like that would turn off a lot of players. Other than that the only thing you can do is have controlled group instances where people ask you how old you are and then choose to kick you from the instance or ask you to leave if you're not old enough to be part of the instances"
    },
    {
      "author": "BusungenTb",
      "timestamp": "",
      "body": "I think it's a good idea but I just feel like it would be hard to implement really well"
    },
    {
      "author": "Supersonicfan_6",
      "timestamp": "",
      "body": "One of my main groups does this:Verify their age. Then, give them an invite to the group, and in the future, if they're repping the banner when they join, they just get let in"
    },
    {
      "author": "Due-Ad-3631",
      "timestamp": "",
      "body": "Yeah they just ask for my age and date of birth then I'm in the club"
    },
    {
      "author": "DragonTamerWes",
      "timestamp": "",
      "body": "It would be used to allow others use content-gated worlds and avis. Those who don't or can't won't be able to use or join."
    }
  ]
}