{
  "subreddit": "PonyTown",
  "post_id": "18wf4wc",
  "title": "PonyTown NEEDS a System to Keep Minors/Underage Users OUT of the 18+ Server(s).",
  "body": "I know someone else will have posted the same thing but I just want to go out on a small rant here:PonyTown needs a system in place to prevent underage users from entering the 18+ servers.\n\nCurrently, there arezero systemsin place to keep minors out of the 18+ servers; the only way an underaged user can get removed from these servers is if their account gets reported and flagged for being under 18, whether it be they openly admitted to being under 18 in the game or through another app like Discord and is reported.As far as I'm told, those whose accounts get flagged for being underage will then have to email PonyTown with official identification to prove they are over 18, if not their accounts remains flagged until the user can officially obtain a legal ID to submit.\n\nThe thought of us coming across possible minors(and likely becoming friends with one whom we do not know of their actual age)honestly worries us, not because we do not like minors but because of the safety of these users; I get that they may want access to adult topics as well as the ability to curse in public chat(possibly the main reason), but these are not reasons that these users should be allowed access to 18+ servers.\n\nPersonally, I think PonyTown should implement a security measure where, when inputting their age/year of birth, it then asks for some form of legal ID to confirm that a user is over 18, kind of like how Roblox has that system to verify if users are eligible to use the in-game voice chat system. From there the ID can be accepted or declined, and if declined the account will be flagged as under 18(and possibly having a punishment for users who submit a forged ID in an attempt to have access to 18+ servers).\n\nIn the meantime, if you are on the 18+ server and come across a minor who admitted their age, be sure to gather screenshots to report the user and their account thenhide them permanentlyso the moderators can look back at who you hid/who the person is and then check that user's messages(if they admitted to being underage in the PonyTown chat).\n\nOther than what I've stated, what do you guys think?\n\n[ EDIT: ]I did not expect this to blow up. I've been reading some of your comments and I agree with the fact that the ID method is possibly dangerous and not the best as PT mods aren't the most reliable.If you guys can give any ideas for possible alternative security measures or some sort of verification system when it comes to age verification that'd be nice to hear about.",
  "author": "pepedeawolf",
  "comments": [
    {
      "author": "Larkspur13",
      "timestamp": "",
      "body": "tbh They should make a server for people ages 13-17 that allows thing like cursing but not sexual things."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yeah, I was gonna add that to the post but decided not to. Last I heard they were planning on one but did not say when (I might be wrong though)."
    },
    {
      "author": "GineCraft",
      "timestamp": "",
      "body": "The problem is that there would be no guarantee the kids are staying in their place. Kids these days love whatever it's prohibited to them, so they'll still sneak into the 18+ server anyway and we'd be back to ground zero."
    },
    {
      "author": "AkumasCherries",
      "timestamp": "",
      "body": "The ID idea is kinda dangerous, especially since PT mods aren't very reliable with answering any kind of contact and are known to have VERY questionable things about minors on their socials. The easiest solution, in all honesty, is to make a Teen Server. But even then, how many of them are actually gonna use Teen Server? And how many are gonna be adults looking to edate a child, like they are on Safe Server? It'd work, hopefully, but not for long. I hate to be a downer, but there's a terrifying amount of weirdos in this community, and while kids shouldn't be on 18+ server, they also shouldn't be on Safe Server at this point. I wish they just would go play a regular kids game, like Roblox or Minecraft that has a working report system."
    },
    {
      "author": "puzeh",
      "timestamp": "",
      "body": "Need the context for first part. Crazy"
    },
    {
      "author": "JustGingerStuff",
      "timestamp": "",
      "body": "Roblox does not have a working report system. There's so many sex roleplay accounts that even when reported, do not get taken down."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Looking at it now, yeah the ID idea might not be the best since ik there's been a lot of talk about some of the PT mods being questionable. I'm honestly not even sure if they'll ever implement a working report system rather than just emailing them...they honestly need to get better mods first."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "randomosityposts",
      "timestamp": "",
      "body": "I think implementing some sort of thing tumblr did back in the day which was hide everything 18+ so minors couldn't even SEE it. I know PT has a tiny team but the lack of moderation is really bad. the opposite should be true for folks like myself who are way over the age of 18. can't see each other, can't interact. sure its not as simple as that but its a pipe dream ig. And kiddos need to learn how to stay out of 18+ spaces, yes its a pony game but it has an 18+ server for a reason. Another thing I saw on another post is if you're caught being underage on the adult server you get permabanned which is well deserved and should NOT be lifted once you turn 18, you broke rules you have consequences. (sorry i'm kinda ranting)"
    },
    {
      "author": "pepedeawolf",
      "timestamp": "",
      "body": "no offense, but I highly disagree. I think you should have to input your age and the 18+ servers get hidden for minors, but definitely NOT having to show our IDs. this is the standard forliterally all social media platforms. for discord, you input your age when making an account and if you're a minor you're not allowed to view channels marked as nsfw. there is no verification required, no IDs need to be shown. there is no problem with this system, you input your age, you do or don't see nsfw.\"but minors will lie about their age\" that is their choice. in the age of the internet, cursing, gore, and especially sexual content are widely and freely available for everyone. i do not see a problem with a 16/17 year old lying about their age to discuss more mature topics online. sometimes this is a necessity, they might not have a place to discuss these things irl and need a space to do so online. however if they get into trouble, they can't pull the \"I'm a minor\" card. they relinquish that the second they lie about their age, and again when they join the 18+ server. you should assume everyone on the 18+ server is legally an adult, because, lets say, a minor on the 18+ server talks to an adult and the conversation turns sexual, it is entirely their fault for lying about their age.and also, this is pony town. if I was required to take a pic of my id to play on the 18+ server, you know what I would do? I would not play on the 18+ server, because that is utter bullshit."
    }
  ]
}