{
  "subreddit": "TikTokshop",
  "post_id": "1cc0jhw",
  "title": "ID verification keeps getting rejected",
  "body": "I am a new'ish seller on TTS. Received a violation notice and was instructed to go through ID verification via Juimo. I submitted both my driver's license and passport, made sure the pictures were clear. The page shows a blue checkmark with the word \"Verified\" after each upload, but TikTok keeps rejecting my qualification submission. I got in touch with Seller Support and they asked me to send the pictures toaddressverification-tts@tiktok.comfor manual processing.\n\nQuestion: has anyone done so and succeeded? I need some positivity...",
  "author": "hellowinddance",
  "comments": [
    {
      "author": "neoplexwrestling",
      "timestamp": "",
      "body": "AI is rejecting your pictures for some reason; we wouldn't have a way to figure it out without looking at the pictures (but don't send them to anyone here)"
    },
    {
      "author": "hellowinddance",
      "timestamp": "",
      "body": "But if that's the case, why did the page show a blue checkmark and the word \"Verified\"? Or do you mean it's TikTok's AI that's rejecting my submission?"
    },
    {
      "author": "Sedona_sedona",
      "timestamp": "",
      "body": "I keep getting rejected, too. I’m wondering if they’re not letting any new sellers into the platform cause they might be getting banned, just a thought."
    },
    {
      "author": "Designer_Eye5694",
      "timestamp": "",
      "body": "They aren’t getting banned and they are definitely increasing their seller accounts. They are getting rejected because the AI probably sees a discrepancy in the documents"
    },
    {
      "author": "shanknik",
      "timestamp": "",
      "body": "Yes, validated last week."
    },
    {
      "author": "hellowinddance",
      "timestamp": "",
      "body": "How long did TikTok get back to you after you emailed? thanks for sharing!"
    },
    {
      "author": "AnnualUnusual7532",
      "timestamp": "",
      "body": "I feel your pain. It is driving me nuts."
    },
    {
      "author": "hellowinddance",
      "timestamp": "",
      "body": "Have you tried the email option?"
    }
  ]
}