{
  "subreddit": "Constructedadventures",
  "post_id": "1hz6oj6",
  "title": "Escape room type game for a 6 year old",
  "body": "For backstory, for Christmas I made my partner an escape room type game styled after his favourite movie and they had such fun doing it (I had 9 puzzle parts with 3 or 4 suitable for kids that my daughter helped with) my daughter has requested one for her birthday, end of March.\n\nI'm in between themes at the moment of either a space adventure (she's a massive fan of the Catstonauts series) or candy land/Charlie and the chocolate factory theme (she's got a big sweet tooth). It will be mostly her doing it with assistance from mum and dad, she is a great reader and fairly academically intelligent for her age (although I know every parent likes to think this, it has been confirmed by teacher that she's reading and doing maths on par for 7/8 year old) but par for her age emotionally and don't want to make anything too hard that could prompt a meltdown.\n\nI feel a code cypher may be within her reach, she enjoyed doing a jigsaw puzzle part with her dad's one, a scavenger hunt with riddles leading to clues around the house and particularly a playdoh piece where there were Scrabble letters hidden inside she had to find. Thinking of a similar clue that's not playdoh as would give it away too quickly but something textured she has to search through to find the clues (slime is banned from our house in case anyone suggests).\n\nI think she would struggle with anagrams more than 3 or 4 letters but can do kids crosswords puzzles. She can do addition and substraction and knows shapes and currency but still learning multiplication and division for any maths based puzzles. She is learning how to use a computer including inputting URLs and how to navigate websites so could do the same as I did for her dad with a password protected Tumblr page revealing a clue.\n\nOpen to any and all ideas for either theme, I'm quite crafty and can make most things I set my mind to (I crafted a treasure chest, designed a Victorian puzzle purse and drew a treasure map for last one). I have a key lock box left over as well that requires a 4 digit pin that is easy to reset and she has spare make your own yoto cards I could use for audio messages.",
  "author": "emertonom",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hey There! Always happy to help! If you haven't already, please make sure you add in as many parameters as you can including but not limited to:Date, Starting/Ending Location, Potential stops, Number of players, Problem solving capability of players, Potential themes, etc.If you're just getting startedthis blog postis a great place to begin. You can also check out theYoutube channelfor ideas.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "ChrispyK",
      "timestamp": "",
      "body": "I've been getting my ideas together on this, and I have a few tips and puzzle ideas for you!Build the hunt Linear.  No branching paths, nothing to divide their attention.Minimize word puzzles, (literacy pending, you know your kid)Use things they're more familiar with (colors, people, foods, etc)If you have a puzzle with multiple parts, color code each part.  Do everything you can to avoid ambiguity.And here are some puzzles:Jigsaws are good, but consider taking an extra step and drawing a picture on the back of it to a recognizable place/object.Put this thing back where it came from (tidying up)https://www.youtube.com/watch?v=5-b7ZAfiuNsIf they know their ABCs, try a \"What letter comes next?\" puzzle, where they do a +1 Caesar cipher.  Warning, your message can't include the letter A.Emphasize cool moments, not everything has to be a puzzle! (Blacklight, freeze key in block of ice, hide a clue in a balloon, etc)Shapes can be used to clue a number lock, just tell them to count the sides.Opposite puzzle (Stop Above Day Dark -> Go Under Night Light)Dot to dot picture of a recognizable object/locationhttps://www2.tinkergarten.com/activitieshas a lot of activity suggestions, it can be a great jumping off point to browse through this site to see what you think your kid would enjoy."
    },
    {
      "author": "witchybitchy10",
      "timestamp": "",
      "body": "Sorry forgot to respond to this last night, thank you so much for all these ideas including the YouTube link (looks like loads of videos on that account as well will have to sit and sort through them to see if there's anything else from there and the tinkergarten site).Confident reader (she only struggles with bigger words like 'obscenities') but her spelling is a bit all over the place if she is given a non-phonetic sound but will be able to recognise and read it correctly (i.e. she couldn't spell 'language' correctly because of the hidden 'w' but if she saw it written down in a sentence she would know what how to read it). Crosswords or anagrams with phonetically spelled words is probably an option but finding phonetically spelled words is annoyingly difficult in the English language (think it's like 20% of all words).I like the idea of balloon one as she loves balloons and I could make it look like a sweet or lollipop but she doesn't like loud noises so would be reluctant to pop it, block of ice would be interesting if I can tie it in to the story and giving her warm water squirters to melt it. Definitely stealing the count the sides on the shape idea, that would be perfect for the storage key lock box one with a 4 digit pin.The jigsaw one we did in partners that she liked revealed a treasure map to the final treasure. Makes sense to do it in linear stages as suggested (write a story to follow a flowchart) rather than a bunch of different branches and will avoid adding any red herrings that could confuse her."
    },
    {
      "author": "chaoscontrived",
      "timestamp": "",
      "body": "I love that you're doing this! Regarding your playdough clue (love that, btw), one time I suspended a bunch of random keys in jello in a huge Ball jar. I did it in phases where I let a layer of jello get solid, placed a key, added more jello, another key, etc. I used gelatin with food coloring. They had to reach in to get all the keys out and then figure out which was the right key for their lock.I'm sure you could add something to make it opaque. I had mine in the fridge though right up to the discovery, and it was really cold for my partner to shift through. Next time I'd leave it out of the fridge once it's solidified.Another thing that might be fun is a blacklight and highlighters/blacklight markers. You can even put \"secret\" clues on their regular clues, let them find the blacklight later in the game,then let them discover the secrets on the clues they've had the whole time!I think I have some other tricks I've used that would be appropriate for a kiddo, I'll think on it."
    },
    {
      "author": "witchybitchy10",
      "timestamp": "",
      "body": "Love that, added jelly to my list (I've got a large glass jar in the back of the cupboard that would be perfect for this) and blacklight markers to my list! Blacklight markers has actually triggered a vague memory when I was younger of secret codes revealed by a liquid (lemon juice perhaps or something?) as part of some kind of spy game, if I do Charlie and chocolate factory themed I could even label it liquid sunshine like the book."
    },
    {
      "author": "MyPatronusisaPopple",
      "timestamp": "",
      "body": "Popcorn would be a fun alternative for a sensory search. Easier to clean up than rice. You could get tall sensory bottles and fill with popcorn. One has a clue the others don’t or pieces of clues that need to be put together. Especially if you do Willy Wonka themed. You could also have the storyline of finding a hidden recipe that Wonka hid in his factory. There are some easy ways to add a false bottom to a box. Attach a ribbon to help indicate to pull up to reveal the fake bottom. I’ve made some with dollar tree craft boxes."
    },
    {
      "author": "witchybitchy10",
      "timestamp": "",
      "body": "Have a 2 year old in house so can't have popcorn I'm afraid but could maybe do jelly beans or another kind of sweetie? First thought was cheese balls as an alternative as family loves them and can get a big tub at Costco but not really Charlie and Chocolate factory themed as more savoury.Definitely leaning towards Charlie and the Chocolate factory themed. We're going on caravan holiday in June and have found a place nearby that is a chocolate factory where they can make their own chocolate - thinking the end prize could be a golden ticket to the chocolate factory as her main birthday gift.Love the idea of a secret hidden recipe, will look up ways to add false bottoms to boxes, I think I have a spare shoe box in loft I could add a false bottom to."
    },
    {
      "author": "chaoscontrived",
      "timestamp": "",
      "body": "I noticed an old thread with some cool potion mixing kinda ideas for a 6 year old, maybe there are some things here you could use?https://www.reddit.com/r/Constructedadventures/s/4dgOtLku1Q"
    },
    {
      "author": "emertonom",
      "timestamp": "",
      "body": "I'm working on a similar kind of a thing, but I haven't got a lot of good puzzles yet. I've been brainstorming, though, so maybe one of these ideas might be useful to you.One idea is just things that can be physically combined. These don't necessarily need to have much of a puzzle aspect to them, because there's still a delight in the surprise of seeing the answer revealed.  So, a piece of paper with holes cut in it can go on top of a page of text and block out everything except a few letters or words, revealing a hidden message. Or a strip of paper can be wrapped diagonally around a cylinder of a specific diameter, making the letters line up into a message.I also thought about incorporating a box with a few assorted small objects in it, so that she would have to reach in and identify the objects by feel, and pull out a specific one. My parents made a game along these lines for me when I was young, and I have fond (if vague) memories of it. (There was also a commercial version available back then called Feeley Meeley, but I'm pretty sure ours was home made, or at least home augmented, and may have had more variety as a result.) The objects were things like a matchbox car, a spinning top, a spool, a thimble, a smalll fuzzy toy, a Fisher Price Little People figure, an eraser, a feather, etc. Small, safe to handle extensively and without seeing them, with a variety of textures and shapes. I don't know exactly how to turn it into a puzzle, but I think can offer novelty, which can be pretty valuable.Another unrelated design that sounded possibly interesting used images drawn on a sheet of transparency, but hidden by laying the transparency over a black background. The kid could then insert a triangle of white paper between the black and the transparency to represent the cone of a flashlight beam, and use it to shine the light around a drawn scene and spot the objects hidden on the transparency. Again, not sure how to use it, but think it sounds like it could appeal. Might be better suited to a puzzle in the form of a book, though.Another idea involved a maze drawn from walls on a grid. She'd find a path to solve the maze, and then have to relate that to a separate grid with letters or numbers or something on it. Maybe every third step in the path would highlight a letter, and this would spell a word.I do worry that I'm going a little too far into simplifying the puzzles--she's a very smart kid. But I'm hoping the excitement of the process will offset that.Sorry, this is pretty rambling. Hope there's something useful in it."
    }
  ]
}