{
  "subreddit": "discordapp",
  "post_id": "1iq2gyr",
  "title": "Are public servers allowed to ask to see government IDs for age verification?",
  "body": "I joined a server that was 29+ and due to not using Discord super often had my age in my bio set as 28. I was hassled and later booted within the first ten minutes of joining for not showing my government ID, regardless of using other methods of proof to prove my age. I've had Discord since 2016 and just started trying out public server, so all of this is still new to me.",
  "author": "Exact_Entertainer598",
  "comments": [
    {
      "author": "_Kozloff_",
      "timestamp": "",
      "body": "why is this server 29+ in the first place?"
    },
    {
      "author": "baltarius",
      "timestamp": "",
      "body": "My guess: they wanted a 30+ server but one of the gang was 29"
    },
    {
      "author": "EmperorNihilus44",
      "timestamp": "",
      "body": "Makes no sense to me. It’s full of 30 year olds acting like they are 12, so defeats the whole purpose of whatever they were trying to accomplish."
    },
    {
      "author": "Woofer210",
      "timestamp": "",
      "body": "They are allowed to ig technically, but I would never send my gov ID to some random joe on some random server."
    },
    {
      "author": "klok_kaos",
      "timestamp": "",
      "body": "Yeah this the thing, as a private club they can demand whatever they want for entry provided its not explicitly an illegal action that violates tos.Much like a night club can have a dress code, they can demand your ID or refise entry."
    },
    {
      "author": "DrTankHead",
      "timestamp": "",
      "body": "This is fairly common in 18+ or 21+ servers. They more often than not aren't storing ur personal info and u can block out things like addr and name.For example, if a server is for adult things like NSFW art, nobody wants to find out that someone put them at risk to interact with a minor. This is just the server owner doing their best to cover everyone's asses.Now, that said I've never heard of a 29+ year old server... Seems weird. Like at that point what's the extra 8 years gonna do? Unless it is some dating thing for folks over 30, but i mean kinda weird. I'm gonna be the same person 3 years from now so why would it matter?Honestly it would be better IMO if discord did this natively and it wasn't sending this info to some rando. I would sooner trust discord to verify my age than some rando in a server. They make tools that just validate legitimacy of the ID and age and dont store data. Discord should do that and simply let there be an 18+ and 21+ switch in the server panel to restrict age server wide, or additionally properly block NSFW flagged channels this way"
    },
    {
      "author": "crocs_r_valid_shoes",
      "timestamp": "",
      "body": "I used to have friends who helped run those 18+ and 21+ servers, and the majority of them 100% keep your ID saved in a private channel that normal users cannot see, and they will make fun of your appearance secretly too. Nobody should ever trust strangers with their ID, especially on discord."
    },
    {
      "author": "JaceTheSpaceNeko",
      "timestamp": "",
      "body": "A lot of servers follow similar rules, but the most common set is “Show date of birth, show color on the ID, and write your tag next to the ID. You can cover anything else up.”Nothing too too bad about it, but some servers need it when it revolves around being an 18+ server."
    },
    {
      "author": "Shemsu_Hor_9",
      "timestamp": "",
      "body": "It's not forbidden by Discord's Terms of Service but it's heavily discouraged. Personally, anyone asking for my ID can go fuck themselves. I don't trust random people in a shit-ass server."
    },
    {
      "author": "Exact_Entertainer598",
      "timestamp": "",
      "body": "Well, it's their server, so they can do it. The point is that this is obviously not safe, so I recommend you don't do it."
    }
  ]
}