{
  "subreddit": "airbnb_hosts",
  "post_id": "1hcvq0h",
  "title": "Successful 2-Star Review Removed",
  "body": "Sorry this is long-Hi all. I just wanted to put this out there for hosts. My husband is a the pro at handling Airbnb when difficult guests arrive. Or even before. We had these guests instant book with one review since 2019. We allowed it for we have a third party identity verification process and rental agreement and security deposit in place using Property Management System connected to Airbnb via API so we are allowed these requirements. Our House Rules are quite factual and spells our property limitations and that we allow horse tours/introductions and why we don’t allow children or pets except on a case by case basis. We are a no smoking anywhere listing but if guests send an inquiry to smoke we do have a locations away from the house with gravel decking that we will allow. These guests did none of that. What they did do was violate rules before they arrived and my husband called opened a ticket to let airbnb know. They noted the account. They did not register their grandchildren as they would not been able to book due to max capacity. They told us after the fact they were coming to visit. In the House Rules it states if children are allowed they must be supervised. Under no circumstances can they be left alone with wild animals and livestock it’s a safety concern.\n\nThe guest smoked non stop going outside every 35-45 minutes all day. Ok fine but when the kids arrived with their mother all three adults went inside leaving them outside and all 3 under the age of 11. They climbed down the railings of a 5 foot raised concrete deck. Very dangerous for all three did it together. If any of them were hurt we all know what they would have done, cried it wasn’t safe and those individuals were not in the reservation. Husband called Airbnb to tell them he was going over to discuss the safety issues regarding the 3 young children and called the guest to say he was coming because they didn’t communicate via the app. They kept calling him on his phone while he tried to keep communication in the app. He politely discussed the risks and rules. They called me over, via the app, twice to help with the smart tv they could not work it or the coffee maker (Keurig) and I took them extra pods as they complained that those provided weren’t enough. They wanted cable it’s not provided in our area. I would like cable too but we quite rural. They finally told me they were checking out early and wanted me to come over so they could checkout. I said you have nothing to do get all your things and the door even locks itself. Leave the fireplace on and trash inside we will take care of it. She said I want to smoke inside but cannot. No you cannot so they chose to leave that evening. Ok great. Today we got a 2 star review. The support rep was great polite and said oh you opened a ticket already in advance. Great. He went over the photos, the guest said they did not match the place. The guest said a lot of negative things about the property, which is all listed in the description, about the space, House Rules. The rep said your rules are great and very clear. It’s clear the guest did not read or ignored and broke at least 4 rules. He said he and his supervisor would review the review and see if it’s retaliation for enforcement of your rules. He called back and said we removed the review as it is retaliatory.\n\nI’d offer my husband’s method because it works. He has always been successful with this. He is polite firm and factual but his method of calling when rules are broken especially safety rules, I think it’s key. The guest mentioned her grandchildren weren’t allowed to be kids. However, they weren’t on the reservation. We said we did not mind but the House rules apply. The guest read them for she knew cameras where on the front porch as she mentioned them when she checkout and not being able to smoke inside.\n\nNext time you have situation whatever it is to many people, a pet not disclosed, smoking or whatever they try use my husband’s method. I am never as successful as he. He has always been successful!  Let me know if you try and it works. He never calls after hours if he can help it. Daytime workers are more helpful. Although he has had success with weekend personal as well.\n\nSo a positive post despite tricky guests.",
  "author": "yamakazee",
  "comments": [
    {
      "author": "ExpensiveAd4496",
      "timestamp": "",
      "body": "The most successful hosts are extremely professional like your husband. They quote the rules, their own and AirBnbs, back to customer service. They take steps from the start when there is an issue. There is so much you’ve described that we can all add to our playbook. Thank you."
    },
    {
      "author": "Particular-Try5584",
      "timestamp": "",
      "body": "And a total lack of emotional hand wringing! It’s a business, just get in there and do … business!"
    },
    {
      "author": "rhonda19",
      "timestamp": "",
      "body": "You are most welcome. I appreciate the feedback."
    },
    {
      "author": "LacyTing",
      "timestamp": "",
      "body": "In what world would any host let people smoke inside?  Was she raised in a barn?"
    },
    {
      "author": "ExpensiveAd4496",
      "timestamp": "",
      "body": "This is tough because it’s hard to prove smoking indoors. So many just open a window and smoke away no matter what the rules are. I live above my Airbnb and immediately know. So my rules have become very explicit. If you smoke I will know. Your reservation will be cancelled within the hour. No warnings, no discussion. So if you smoke, go elsewhere. Some read my rules and think the no smokers part is a tad excessive. Fine. Don’t book here. Others read it and book me over anyone else because they know they won’t walk into a place that smells like cigarettes. Win-win."
    },
    {
      "author": "rhonda19",
      "timestamp": "",
      "body": "I think she thinks she is rebel of sorts. She arrived in one of those smaller RVs. She could have smoked in it. Just a person who wings it I guess. She asked like 3 times about smoking inside. I stopped answering her messages in the app. Stating the rules show the property entirely smoke free means inside too. 🤦🏼‍♀️🤷🏼‍♀️I read here yesterday or the day before there are some countries where inside smoking is ok."
    },
    {
      "author": "alicat777777",
      "timestamp": "",
      "body": "Sounds like your husband handled it perfectly!"
    },
    {
      "author": "rhonda19",
      "timestamp": "",
      "body": "Thank you.  He does do well this type of thing."
    },
    {
      "author": "flaminghead",
      "timestamp": "",
      "body": "Can you share the name of your identity verification/PM API? Thank you!"
    },
    {
      "author": "yamakazee",
      "timestamp": "",
      "body": "Damn I caught a lot of shit for trying to enforce my rules when I brought it up here earlier this week. Good to hear Airbnb has some sense about this"
    }
  ]
}