{
  "subreddit": "asheville",
  "post_id": "18t904i",
  "title": "Pornhub disabled in NC due to age verification requirements",
  "body": "",
  "author": "The_Angry_Turtle",
  "comments": [
    {
      "author": "michaelh98",
      "timestamp": "",
      "body": "VPN usage skyrockets in NC..."
    },
    {
      "author": "effortfulcrumload",
      "timestamp": "",
      "body": "With the prices of streaming services going up, VPN are going to skyrocket everywhere"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "No see that’s where you need a curriculum like how to safely use a VPN, Sandboxed environments when opening sketchy files, how to avoid phishing, spam and ransomware.But put heavy emphasis on how to set your region/out country on a VPN lmao. Gotta beat them at their own game.I mean why do you think I initially got into IT? To push the boundaries similar to this lmao."
    },
    {
      "author": "mr_remy",
      "timestamp": "",
      "body": "No see that’s where you need a curriculum like how to safely use a VPN, Sandboxed environments when opening sketchy files, how to avoid phishing, spam and ransomware.But put heavy emphasis on how to set your region/out country on a VPN lmao. Gotta beat them at their own game.I mean why do you think I initially got into IT? To push the boundaries similar to this lmao."
    },
    {
      "author": "Mr_Nugglesworth",
      "timestamp": "",
      "body": "Gotta make sure kids see their first naughty bits in a wholesome way, like at a church youth group retreat."
    },
    {
      "author": "beastcock",
      "timestamp": "",
      "body": "The party of personal freedom at it again"
    },
    {
      "author": "AVLThumper",
      "timestamp": "",
      "body": "Will this apply to  alcohol and tobacco websites as well?  What about firearms?"
    },
    {
      "author": "Virtual_Honeydew_765",
      "timestamp": "",
      "body": "To start, I think this is stupid.But from a free market angle, it does suck for brick and mortar stores that they have to verify age but the internet does not."
    },
    {
      "author": "Brilliant_Risk_6332",
      "timestamp": "",
      "body": "Welp, there goes my weekend!"
    },
    {
      "author": "The_Angry_Turtle",
      "timestamp": "",
      "body": "Senator Gunch Smuthers representing The Sticks commented \"back in my day if a youngin' wanted to defile himself with sin he went out to the woods and found the JC Penny lingerie catalog the neighborhood kids hid under a rock. That catalog may have looked like a gat dang glazed donut, but we were grateful for it\""
    }
  ]
}