{
  "subreddit": "vrbo",
  "post_id": "1dongqe",
  "title": "Host is asking for personal information",
  "body": "Hi VRBO sub!\n\nSo booked a VRBO with less than two weeks notice.  No problem.  AFTER booking, I receive an email from host telling me to fill out ‘their standard form’.\n\nOn the first page of the form they want to know my travel plans, is it for business or pleasure or etc as well as my birthdate.   That’s page 1 of at least 2 pages.  I haven’t been able to view page 2+ because I don’t feel right about giving away my personal information to a random hosting company.  Birthday and such is required information.   I also don’t want to put in a wrong birthday either as to give them grounds for breaking their rules.\n\nMore to the point, I don’t believe it’s warranted to REQUIRE this information AFTER the booking.  I’ve contacted the host, made myself understood in a reasonable way, and they just keep saying I can cancel (not gonna happen) or I can fill out their form.  “It’s just our policy” is all they really say.\n\nI’ve asked them to please indicate where in the listing it’s disclosed that I have to give them this information.  They simply reply ‘That you agreed to the terms and conditions’.  Yeah. The ones like ‘No smoking’ and ‘No parties or pets’, but not my travel plans, birthday, plus who knows what else.\n\nAs far as age verification goes, I’m more than the required age of 21.  I would think that VRBO already knows that about me.",
  "author": "trophycloset33",
  "comments": [
    {
      "author": "bluemap79",
      "timestamp": "",
      "body": "What country is the rental in? There was extra paperwork when I traveled in Spain. Same paperwork at the hotel we stayed at too."
    },
    {
      "author": "Psychological_Fly135",
      "timestamp": "",
      "body": "USA and I am a US Citizen"
    },
    {
      "author": "joegremlin",
      "timestamp": "",
      "body": "VRBO has a name, email, phone number, credit card and a zip code, and that's it, unless you are verified.  Hosts ask for more information because people steal credit cards, book a last minute rental, then the money gets charged back by the original card's owner.  We ask for a copy of a driver's license to try and reduce fraud and verify the renter is over 25.  Did you read the agreement you signed when you booked it?  We put \"we will ask for verification of ID before sending a door code\" in the agreement."
    },
    {
      "author": "quornmol",
      "timestamp": "",
      "body": "they asked the host where it indicates they need to give this information, implying the listing did not provide this information would need to be given"
    },
    {
      "author": "Djmesh",
      "timestamp": "",
      "body": "Had to deal with similar issue on my last rental in San Diego.  They required a bunch of extra info and I'd.  Shrug."
    },
    {
      "author": "Acsnook-007",
      "timestamp": "",
      "body": "As I host, it is not unreasonable to ask for additional information when renting your home to strangers. I personally feel this approach might be too much but I certainly ask for a state issued identification with every one of my bookings and require a sign rental agreement."
    },
    {
      "author": "Psychological_Fly135",
      "timestamp": "",
      "body": "Agreed - the point is that these ‘requirements’ should be clearly spelled out prior to booking, not after."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Sounds pretty standard, don’t fill it out, don’t get to stay. Any place you stay, even a hotel or motel will want that same information, and even copy your id."
    },
    {
      "author": "Final-Beginning3300",
      "timestamp": "",
      "body": "Ask VRBO about it."
    },
    {
      "author": "trophycloset33",
      "timestamp": "",
      "body": "It’s not required so ignore and move on. Report to VRBO but run the risk of them closing the rental and you needing to find a new place to stay."
    }
  ]
}