{
  "subreddit": "Twitter",
  "post_id": "8nb6sf",
  "title": "Twitter Age Lock Megathread",
  "body": "Basic Overview:Twitter is permanently locking accounts which were opened by people under the age of 13.  It doesn't matter if you're currently above 13.  Since they can't limit/delete tweets from when you were, their only option is to destroy the whole profile in order to comply with current laws.\n\nFix:Twitter asks for identity verification.  IF YOU WERE UNDER 13 at any point when you operated the Twitter profile, DO NOT SEND THEM YOUR ID!!!  This only proves that they should remove your account.  Instead, use a parent or older person's ID and have them claim it's their profile.\n\nUPDATE:This approachseems promising.\n\nBecause we're getting a ton of posts about this issue, please post here instead of creating new threads.\n\nHere are some threads with many comments already on the matter:\n\nAge Locked?  Send in an ID.\n\nThe only thing you can do is submit valid ID- There's no other way of contacting Twitter support right now. It's maddening, but that's all they've left for us as an option.\n\nAge Lock Lifted\n\nMy lock was lifted just a few hours ago. I sent my ID and it didn't work so I sent it again and now I'm free. Just keep trying guys. Never give up. I sent my ID like 5 times before any success. It took like 7 days. BEST OF LUCK EVERYONE <3\n\nAlready told Twitter you were under 13?\n\nIf you, too, made the mistake of choosing the \"I created the account before I was 13, but now I'm over 13\" on the lockout form, there is a solution.\n\nPrivacy Invasion!\n\nDoes it seem suspicious to anybody else? I kinda feel like following my gut here when it’s telling me that this all seems like a privacy invasion so they can sell out more information about its users... but that’s just me.\n\nGuardian Article\n\nIn an effort to comply with GDPR, Twitter is blocking users who were underage when they signed up for the service – even if they’re now well over 18.\n\nVenture Beat Article\n\nRedditors believe that Twitter users are being locked out of their account if they created the account when they were under 13 years old — which has traditionally been how old users need to be to use Twitter.\n\nI don't have an ID!\n\nThe ONLY form of ID that I have is my birth certificate which shows the date of birth and stuff but doesn't have a photo. It is the only photo ID that I have and I know that if I try to get a Passport then it won't come for like a month.\n\nID Rejected.  Now what?\n\nTry submitting a different ID.\n\nTwitter has no support.\n\nWe know.\n\nStart Fresh.\n\nFor those suspended from their accounts, the best bet for now is to start fresh.\n\nSome hope.\n\nFINALLY got my account back after 5 days of waiting.  Spam support with your credentials as much as you can until its fixed.\n\nPlease post relevant information here and share your stories to keep information consolidated in one place for users.",
  "author": "Foul_Howell",
  "comments": [
    {
      "author": "aalsaeedi100",
      "timestamp": "",
      "body": "Hello, My account has been locked I don’t know why, I have 13 thousand followers and I spent days and days to reach to this point but suddenly twitter has blocked my account. I was born in 2000 so I think my age is not a problem but it shows me that I’m under 13 why??? Please I need help to unblock my account!"
    },
    {
      "author": "FlyingFrogFF",
      "timestamp": "",
      "body": "I got my Twitter account locked even though I am 18 now. feels bad man... :/"
    },
    {
      "author": "kyleli",
      "timestamp": "",
      "body": "I still have yet to be unlocked. Anyone else unlocked yet?"
    },
    {
      "author": "Helenarth",
      "timestamp": "",
      "body": "What option did you pick?"
    },
    {
      "author": "Foul_Howell",
      "timestamp": "",
      "body": "I put in my request today and nothing. When did you send in yours?"
    },
    {
      "author": "moistfetus_",
      "timestamp": "",
      "body": "What a fucking joke. 21 years old and I'm going to have to get my mother to fill out a form to please the fucks over at twitter. IF that even works."
    },
    {
      "author": "moistfetus_",
      "timestamp": "",
      "body": "2 days after getting my parents permission and sending the form, my Twitter account is restored. I hate that I like that website."
    },
    {
      "author": "Foul_Howell",
      "timestamp": "",
      "body": "Same here lol, this is ridiculous. I was two months away from turning thirteen when I made my account."
    }
  ]
}