{
  "subreddit": "google",
  "post_id": "kthfkh",
  "title": "Google Asking for ID/Credit Card age verification for 14 year old account.",
  "body": "So a friend of mine just now got a request to verify that they are above the age of 18; even though they've had their Google account forfourteen full years.\n\nThey would've had to make their Google account when they were younger than 4 to not be 18 or older now.\n\nThis however leads to a larger question - How long has Google been doing this? On a quick search; the earliest mention we could find of this measure isDecember 3rd.\n\nThis measure seems incredibly over-reaching, especially for an account of this age and I think raises even more concerns about user data, privacy, etc. Have you encountered this? What do you make of this?\n\nFacebook has been doing it for longer; but I'd not heard of Google doing this until now. Good thing is you can avoid a lot of Google services and many don't need you to be verified 18+, but YouTube is one of the few services you just cannot avoid.",
  "author": "TheSystemGuy64",
  "comments": [
    {
      "author": "gloriousredcurrant",
      "timestamp": "",
      "body": "Isn't it internet 101 to never ever ever ever ever send anyone a picture of your ID? Like what the heck is google doing?"
    },
    {
      "author": "StopYTCensorship",
      "timestamp": "",
      "body": "Privacy intrusion. They want to know exactly who you are. I believe we're moving towards a social credit system, slowly but surely. Anonymity on the internet is already incredibly difficult as it is. Once they can link your real world identity with your formerly anonymous online activity, this information will be linked to a social credit database. It can then potentially be used in matters like hiring, loans, insurance. And there will be no real recourse.This may still be a ways off, but I assure everyone, it is coming unless we stand up to our corrupt government and these unbelievably powerful corporations. Judging by the state of society, with so many seemingly loving tyranny, I doubt that's going to happen."
    },
    {
      "author": "ABigChalliceOfCum",
      "timestamp": "",
      "body": "First they look at our history in Incognito Mode, now they want our personal information, what if there would be data leak? Every person with some hacking skills would know your name, your address, your credit card info."
    },
    {
      "author": "Borobej",
      "timestamp": "",
      "body": "Incognito mode is not and never was to \"hide\" you in the Internet, LOL. It only doesn't write anything in your browser's history, so no one using this computer after you will be able to check what you were looking at - and when I say \"no one\" I mean average users, because someone with a proper knowledge will know where to look anyway. Nice however that you're aware about the importance of your personal data and you don't want to share without a valid reason. Keep it up, mate!"
    },
    {
      "author": "CatWithAHat_",
      "timestamp": "",
      "body": "I'm certain they don't need it and are just trying to get more information use and/or sell. They've been pushing the limits for a while, I'm surprised this hasn't already pushed people over the edge. I literally just found out about it today, so maybe it's not well known yet, but this is not ok. They do not need this information, and I really wish people would stop letting google get away with this kind of shit."
    },
    {
      "author": "pete-hob",
      "timestamp": "",
      "body": "Gmail has been asking me for my Age the past week. What happens if I don't provide my age?Will providing my age, then require me to prove my age?"
    },
    {
      "author": "Tubbit",
      "timestamp": "",
      "body": "Is there any way to undo this after sending them your card details, feel like I fucked up"
    },
    {
      "author": "ABigChalliceOfCum",
      "timestamp": "",
      "body": "Nope, now you can just pray to Google servers to not leak any dataAnd to servers that it was sold to"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Are you in Europe? Thank your regulators for that then.https://www.digitalmusicnews.com/2020/11/02/youtube-age-gate-verification-europe/"
    },
    {
      "author": "TheSystemGuy64",
      "timestamp": "",
      "body": "I bet America is next. I'm downgrading to AOL dial up internet service if that happens..."
    }
  ]
}