{
  "subreddit": "pcmasterrace",
  "post_id": "1k1nu96",
  "title": "Discord is scanning users' faces and IDs in Australia and the UK to 'experiment' with age verification features",
  "body": "",
  "author": "the_dr_roomba",
  "comments": [
    {
      "author": "Captain_Saki",
      "timestamp": "",
      "body": "Discord is the last place anyone should give sensitive data to"
    },
    {
      "author": "16tdean",
      "timestamp": "",
      "body": "I tried the face scanning thing and it decided I was a minor, and auto locked me from any nsfw channel on my discord acfount now.Stupid thing is I can just open another account and a vpn and get around it. Its more inconvenient to actual adults then minors."
    },
    {
      "author": "HelpRespawnedAsDee",
      "timestamp": "",
      "body": "It’s such an unfortunate thing that there’s now a shitload of app, tweaks and mods and supporting information that are now gatekept under the privacy nightmare that is discord.Bring back forums!"
    },
    {
      "author": "DragonLord375",
      "timestamp": "",
      "body": "Can't wait for discord to leak peoples data lol"
    },
    {
      "author": "ExposingMyActions",
      "timestamp": "",
      "body": "Someone working in Cali is gonna leave their MacBook open at a coffee table for a few seconds too long to scrape that login credentials from a txt file"
    },
    {
      "author": "shadowds",
      "timestamp": "",
      "body": "Yeah, I'm sure nothing can go wrong...If they push that on everyone, I think a lot of people just switch back to teamspeak, raidcall, or something."
    },
    {
      "author": "dragon-mom",
      "timestamp": "",
      "body": "Yeah if they ask me for that I'm just deleting it. I don't know what I'll use but I definitely am not giving them my face or ID"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "teamspeak, please save us"
    },
    {
      "author": "Jakesummers1",
      "timestamp": "",
      "body": "They need to pull a RunescapeTeamspeak: Evolved"
    },
    {
      "author": "the_dr_roomba",
      "timestamp": "",
      "body": "No thank you."
    }
  ]
}