{
  "subreddit": "VRchat",
  "post_id": "1duj3ue",
  "title": "Do you guys know good cozy houses or apartments world to lie down and chill like this one? I've found a few, but wanna discover more!",
  "body": "",
  "author": "gamerdanger14",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Heres a little list, I mean not all are houses but they are still good places to rest -Cold Motel by Coldcancer (literally a motel)MidNight Drive by WispyWoo (Car thing you can sleep in, it drives itself)The Texas Pocket Mansion by GaykujoQueen Bella's Mexican Beach Hideaway by Cain` (Tropical mansion ? place)SunDown by WispyWoo (A resting place near the beach)Dreamy Loft by KireyaMusic ＆ Chill by Kinashi ( A world where you can listen to music and rest)"
    },
    {
      "author": "SovietVelior",
      "timestamp": "",
      "body": "Thanks! I'll take a look at all these when i reach home!"
    },
    {
      "author": "Greene413",
      "timestamp": "",
      "body": "RØDREVEN _ Scandinavian Island Homehttps://vrchat.com/home/world/wrld_9c703738-b963-4558-a23c-182f538a7e50This is my favorite world, especially because it has a very realistic night mode and I'm super picky about how most night modes is just turning down all the brightness. PC only though.Shoegaze Apartmenthttps://vrchat.com/home/world/wrld_6364fa61-1ba6-4333-b8a3-566ca813d12dThis is another one that I like, although it doesn't feature the entire apartment which I usually prefer. But it's got impeccable vibes."
    },
    {
      "author": "INSTINXXXXX",
      "timestamp": "",
      "body": "Shoegaze is amazing, videoplayer is shit though"
    },
    {
      "author": "SovietVelior",
      "timestamp": "",
      "body": "I'll take a look when i reach home, but what I've seen ok vr chat home, the first one looks promising! And the second one, I don't have any idea but I love Post rock and Shoegaze music, hope it is related somehow! :)"
    },
    {
      "author": "Ar7gallik",
      "timestamp": "",
      "body": "real life?)"
    },
    {
      "author": "SovietVelior",
      "timestamp": "",
      "body": "I can't afford a real life cozy house in the woods."
    },
    {
      "author": "ExperaMental",
      "timestamp": "",
      "body": "Lol I literally use the same avatar as that I just edited mine"
    },
    {
      "author": "SovietVelior",
      "timestamp": "",
      "body": "Good tasted, this avatar is a gem compared with any male avatar in gunroad. Glad I could find this one in a Japanese website (Booth)."
    },
    {
      "author": "gamerdanger14",
      "timestamp": "",
      "body": "Here are some of the worlds I like to laze around in.https://vrchat.com/home/world/wrld_e11e82d2-06af-40d3-a0d7-edfebc8528e9https://vrchat.com/home/world/wrld_1e0e3667-af03-4ce2-9399-30014a109c48https://vrchat.com/home/world/wrld_bce23d07-7e19-4018-8652-34fa30b7308bhttps://vrchat.com/home/world/wrld_0450123c-a41c-4fde-92d1-4f6c8b58ad6chttps://vrchat.com/home/world/wrld_5b3012f5-d26a-4d00-8271-146bdc5513c2"
    }
  ]
}