{
  "subreddit": "virtualreality",
  "post_id": "1et1ydr",
  "title": "Meta is using tricks to get your REAL personal information, and fight fake, random accounts. If anyone refuses, they brick your headset",
  "body": "I personally don't care about my own privacy, and I already gave them correct information, correct birthday, during signup.\n\nBut you know what they do? Out of the blue they send emails asking for your birthday, even if you already gave all information long ago. They even have my credit card information, and they still asked.\n\nIt is a trick. If you made a random account and entered some random birthday, you most likely forgotten what you entered. When they ask you to reenter your birthday, numbers won't match. If numbers don't match, they ask you to send them your ID documents.\n\nOtherwise they won't let you login, basically bricking your headset. You might make another fake account, but it will be just a matter of time till they block you again.\n\nI don't live in the USA or anywhere else where age confirmation is required by the law, so can't be that in my case. Even if it is, I gave those details during signup.\n\nI will also say that I am not a fan of multiplayer or any social apps, so I never ever went there.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "JorgTheElder",
      "timestamp": "",
      "body": "Yea, they are usingtricksto see if you committed fraud when you signed up for a Meta account.Locking your account does not brick your headset, you can just factory reset it and make a new Meta account.They have laws they have to follow that require them to know the age of their customers, if you don't like that, don't be a customer.I don't live in the USA or anywhere else where age confirmation is required by the law, so can't be that in my case. Even if it is, I gave those details during signup.I don't believe that is true at all. Pretty much every country has added laws to protect underage kids, and those laws require online services to know the age of their customers. They also sell age restricted software on the Quest store which again, requires them to know the ages of their customers."
    },
    {
      "author": "WyrdHarper",
      "timestamp": "",
      "body": "Plenty of services require regular age confirmation checks, too. I have to enter it into steam every time I want to look at certain games, for example.And with states/countries being more aggressive about age laws when it comes to device use (a good thing) to protect children, you’re going to see it more and more."
    },
    {
      "author": "No-Marionberry-772",
      "timestamp": "",
      "body": "The cope in the face of this issue is something else.The laws don't require them to know the age of their users.The law requires them to not collect data on minors, and thats a    EXTREMELY different requirement.They use that requirement as a shield to confuse users, like you, into believing that meta has no choice here, but they do.They have a choice to allow users to opt in to data collection. They have a choice to not force every user to pay for using their hardware both upon purchase, and every time the users use it.They don't care about those choices, because they care about turning you into a product and using you for profit, and they are not allowed to do that with minors.Stop bending the situation and acting like people who are upset about this. , are somehow wrong, or bad people.You're the bad person for putting up with this bullshit."
    },
    {
      "author": "ScriptM",
      "timestamp": "",
      "body": "My phone never asked me to update my birthday information, nor it forced me to signup to be able to use my device. Where is \"think of the children\" in this case?And they are plenty of devices that don't force signups. Even VR ones"
    },
    {
      "author": "theScrewhead",
      "timestamp": "",
      "body": "Whenyoucreated an account, you signed a contract that said the information you entered was truthful. If they ban/disable your account, that's on you. You may not be in the US, but a contract is a contract."
    },
    {
      "author": "ScriptM",
      "timestamp": "",
      "body": "Except, contract cannot be above the law. If the law says they robbed you of your goods, no contract in the world will be valid.In the contract they might say I should commit a crime so they let me use their device, but it won't be valid.EULA is absolutely useless in the EU court. They don't recognize it as the valid contract"
    },
    {
      "author": "fdruid",
      "timestamp": "",
      "body": "If you made a random account and entered some random birthdayWhy the hell would anyone do that in the first place? Here's the source of all this drama: yourself."
    },
    {
      "author": "Suphas0n1c",
      "timestamp": "",
      "body": "Privacy"
    },
    {
      "author": "ShortLingonberry6148",
      "timestamp": "",
      "body": "Meta sucks for everything besides VR. Too bad no one else is investing in VR as much as them."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}