{
  "subreddit": "YouthRights",
  "post_id": "1gcmdr1",
  "title": "Why are there now all these proposed social media bans/age verifications",
  "body": "There's long been a tendency for people to claim that the newest thing is highly detrimental to young people. As SCOTUS discussed in \"Brown v. Entertainment Merchants Association\", this goes all the way back to at least the 1870s, when \"dime novels\" were supposed to be turning young people's brain to mush. Then, by the 1890s, the Puritans had stopped criticizing \"dime novels\" and had moved on to newer panics.\n\nWhat's weird about this social media panic is that social media really isn't that new at this point, and this panic has gotten worse over time rather than better. That's contrary to every previous panic that I'm aware of.\n\nThere was an initial panic over social media circa 2005-2007 when MySpace was the main social media site. But even then, few people suggested that MySpace should be forced to ban anybody under 16 from the website or require a digital ID to verify everybody's age. The suggestions of that panic were moreso than MySpace should do things to make the site safer for minor users and/or parents should tell their kids to use Facebook rather than MySpace since Facebook was supposed to be safer. And that initial social media panic went away by 2010 at the latest. I barely remember anybody from about 2010-2021 expressing concern about minors on social media.\n\nWhat's hardest to figure out is how  this panic came back and actually became worse than ever before around 2022 or 2023. I'm not aware of a similar thing happening with any past panic about a new technology with young people.\n\nI struggle to understand exactly who this legislation is supposed to appeal to. Really, parents themselves already could have banned their kids from social media by using parental controls. The websites for the parental controls advertise their products as being meant for the parents of literal 5 year olds. However, that just further begs the question of who this social media legislation is supposed to appeal to- people only buy parental controls for literal 5 year olds, yet we're supposed to want government-enforced parental controls to interfere with internet usage for kids as old as 15.",
  "author": "sarahlipiano1987",
  "comments": [
    {
      "author": "UnionDeep6723",
      "timestamp": "",
      "body": "It appeals to anyone who wants the ego boost of imposing things on other's, to anyone who wants to virtue signal they care about young people without actually doing anything meaningful or beneficial for anybody, a lot of people actually enjoy being condescending to youth, it's the last socially acceptable bigotry, it's frequently under the guise of care/protection and ironically it's harmful and dangerous."
    },
    {
      "author": "aroaceautistic",
      "timestamp": "",
      "body": "iirc KOSA came from wanting to keep kids from seeing anything to do with transgender people.I think it’s because social media is an uncontrollable source of information. Kids on average are less indoctrination by standard american/western propaganda because they haven’t had as much time to absorb that information. Lawmakers are motivated to keep kids away from anti-american sentiment, anticapitalism, challenges to traditional gender, and other things that challenge them that kids sure won’t learn in school."
    },
    {
      "author": "AR15rifleman_556_223",
      "timestamp": "",
      "body": "This is just due to desires for control and overprotection. This is just irrational fear which sadly, society as a whole is very prone to.The US has bright spots such as gun rights and homeschooling rights, but the recent attacks on social media rights for minors is stupid.All this is just irrational fear.I was born in 1998. Hit my teens in 2011 and started using YouTube and Facebook then. Had my first YouTube account at age 12 and my first Facebook account at age 13.Here I am.In 2024, I am alive and well.Nothing happened to me.This whole craze over social media is stupid. My guess is that we have too many control freaks and narcissists in society these days.Oh well. We have a narcissist vying for the presidency, Kamala Harris. She laughed about jailing parents of youths who skip school.The fact that vast numbers are voting for Kamala (and Trump is not ideal either) shows the character of society. Narcissistic."
    },
    {
      "author": "Fold_Optimal",
      "timestamp": "",
      "body": "There a lot of new scientific data that links social media use for children to more mental health issues,  less social development and lower IQ scores.This data matches my own personal experience when comparing the kids intelligence now compared to when i we a child.  The kids now are overall less intelligent it's pretty bad actually."
    },
    {
      "author": "Stompor",
      "timestamp": "",
      "body": "It's all the same BS.  Goofuses wanting to have control over people they don't know."
    },
    {
      "author": "CentreLeftMelbournia",
      "timestamp": "",
      "body": "We already know for a fact it's not for kids as Albo said on Facebook \"it's about keeping kids safe\" and when Albo says that, it's NEVER about keeping them safe.And besides, it's not even gonna happen, Albo will keep delaying it until he forgetsI struggle to understand who this legislation appeals toI will tell you who.Celebrities and random conservatives off streets. Not actual parents.Take a look at 36Months Instagram account."
    },
    {
      "author": "sarahlipiano1987",
      "timestamp": "",
      "body": "Totalitarianism and again, just fears.The fact is, social media is perfectly safe.It cannot injure or cause death. It is literally the safest thing in the world, physically. Safer than taking a walk in the park!"
    }
  ]
}