{
  "subreddit": "VRchat",
  "post_id": "1dmaktv",
  "title": "VRChat is planning to add age verification using third party processor within the year.",
  "body": "",
  "author": "vrc_miyuky",
  "comments": [
    {
      "author": "nuttycapri",
      "timestamp": "",
      "body": "EhhhhhhFuck man I just gotta hope it's a good thrid party then I guess?"
    },
    {
      "author": "The-Flan",
      "timestamp": "",
      "body": "Still, how is this going to work for EU and the Asian VRChat playerbase?"
    },
    {
      "author": "Mcsavage89",
      "timestamp": "",
      "body": "As much as I support verifying ages, I feel nervous sending my ID to a company that I just have to trust to use VRChat. It's really weird. if only fucking parents did their job, we wouldn't need corporations to be our nannies. How will this work in other countries?"
    },
    {
      "author": "Capable-Trip-4423",
      "timestamp": "",
      "body": "Believe me, i hate kids being in VRChat as much as anyone, but the game advertises itself as 13+.Most parents will check the age rating and assume it's fine.Would you let your kid watch a PG or whatever the other one is, U rated movie? Yes, you would assume it's rated as having no adult content.You can't be barely moderated and 13+ at the same time. One of those needs to change."
    },
    {
      "author": "--an",
      "timestamp": "",
      "body": "Just a note that VRChat's timelines almost never hold up."
    },
    {
      "author": "null0x",
      "timestamp": "",
      "body": "This is the way.... of software development!"
    },
    {
      "author": "Mlpskystars",
      "timestamp": "",
      "body": "This is quite surprising, I didn't think they’d ever do something like this ngl"
    },
    {
      "author": "Docteh",
      "timestamp": "",
      "body": "i wonder if my steam account itself can sign up for this, its 20 years old."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "BTW US companys and country don't have good privacy laws. For example EU with gdpr."
    },
    {
      "author": "vrc_miyuky",
      "timestamp": "",
      "body": "BTW US companys and country don't have good privacy laws. For example EU with gdpr."
    }
  ]
}