{
  "subreddit": "tsa",
  "post_id": "1atajam",
  "title": "Can a High School Student ID be used for a teen’s ID?",
  "body": "Another post just asked about teens with no ID and got me wondering. Would a teen’s ID from their high school suffice? My kid is 15, not quite old enough for learner’s permit (which is just paper here anyway). We don’t travel internationally, so really no need for passports. We’ve been told she can’t get a ID in our state until 16.\n\nThe High School ID is her only photo ID.",
  "author": "sneesnoosnake",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome tor/tsa! If you're new here, please make sure you check out the pinned FAQ posthere.Please also make sure that your question(s) aren't something that are easily found on the official TSAwebsite.If you cannot find the answers to your question(s) easily with those two resources, then please sit tight and someone will be here shortly to answer your question(s)Have a good one!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "alibiii",
      "timestamp": "",
      "body": "Under 18 she just needs a boarding pass. There's no ID requirement for minors."
    },
    {
      "author": "HSYT1300",
      "timestamp": "",
      "body": "Teens under 18 only need  valid boarding pass"
    },
    {
      "author": "lauti04",
      "timestamp": "",
      "body": "They don’t need an ID to fly domestically"
    },
    {
      "author": "sunkenshipinabottle",
      "timestamp": "",
      "body": "Under 18 they don’t need ID"
    },
    {
      "author": "A_Lost_Desert_Rat",
      "timestamp": "",
      "body": "Passports are cheap on an annual basis.  Being military, all my kids had theirs early.School ID often do not have birthdates on them, which is a TSA requirement.  It is why we cannot use Government CaC for travel"
    },
    {
      "author": "thebarnhouse",
      "timestamp": "",
      "body": "Used my cac all the time for travel and they do have your birthday? Birthday on the ID is not a tsa requirement. Kids under 18 don't even need an ID."
    },
    {
      "author": "MJR-WaffleCat",
      "timestamp": "",
      "body": "My CAC definitely has my birthday on it. It's harder to see than on my state ID, sure, but it's still on there."
    },
    {
      "author": "sneesnoosnake",
      "timestamp": "",
      "body": "They don't need ID but they are old enough for groping."
    }
  ]
}