{
  "subreddit": "IRS",
  "post_id": "1ajoj6e",
  "title": "Id.me Shitty Service",
  "body": "Is anyone else having a hard time with Id.me? I can’t verify my identity, and when they sent me a link for a video call, I’ve been told it’s around a 15 minute wait, and yet have been waiting about 3.5 hours now.",
  "author": "pixxelzombie",
  "comments": [
    {
      "author": "Ok_Equivalent8004",
      "timestamp": "",
      "body": "I'm sharing this update just in case anyone comes across this search and needs this help. If you are locked out of idme due to phone number change or other MFA issues, you can attempt to use your facebook account to login (make sure the email address on your idme account is the same one on facebook), it will eventually say that you already have an account & take you right back to the idme sign in page, but now you should see a link under the password box that says \"lost all access to your MFAs, click here.\" Once you click the link, you can update your phone number and choose a new MFA. I recommend using the app codes, as a new MFA, so much easier and less risk in the event your number changes in the future. & idme never contacted me back to assist. I tried this for the hell of it and that worked."
    },
    {
      "author": "erinflowers",
      "timestamp": "",
      "body": "you just saved me from two weeks of frustration i've been going through waiting for a response from them. Thank you so much!!for anyone else struggling another note if you try facebook and it says it's not available at the time try using the google sign in option instead as long as it's the same email you have for yourid.meaccount"
    },
    {
      "author": "MyraMainz",
      "timestamp": "",
      "body": "I coulda kiss you on the mouth rn THANK YOU"
    },
    {
      "author": "Evening_Green_4720",
      "timestamp": "",
      "body": "Your comment saved me! I was able to access my account thanks! Have a beer a shot or smoke a joint on me what ever makes you happy!!"
    },
    {
      "author": "Ok_Equivalent8004",
      "timestamp": "",
      "body": "hate them, if they are going to be used for government services then they need to be regulated. Seems they pick and choose when providing efficient customer service. I remember contacting their customer service because I was locked out of my account and needed to verify my veteran status so I could get free seaworld tickets. I contacted them 4 months in advance, even noted I was requesting help so I could obtain park tickets for a visit in 4 months. It took them 6 months to get back to me, I totally forgot about it by then, and even then, they replied with a generic response. I then asked them to delete my account several times before I ultimately gave up. Now, it's the same bs, requested assistance getting into that same account for IRS purposes and only getting generic responses. Why can't the government pay for their own verification software, isn't contracting more expensive? As long as they've been around, it puzzles me why they still don't have a resolution for account access when your number changes. It's not that dang hard, answer security questions, do the facial thing, boom update your phone number."
    },
    {
      "author": "Sad_Picture3642",
      "timestamp": "",
      "body": "An absolute joke, supper inefficient and bugged."
    },
    {
      "author": "GaryChalmers",
      "timestamp": "",
      "body": "I made the mistake of using these clowns today.  I thought filing directly through the IRS would be simple.  Instead I continuously got my documents rejected and then they are going to make me wait an hour and a half just to verify my identity via video call.  I should have just used a third party tax site that offers free filing.  I have zero doubt that the people who founded this company have a personal relationship with some government official that gave them their contract.  Cronyism and corruption at it's finest."
    },
    {
      "author": "B2utyyo",
      "timestamp": "",
      "body": "I am so angry about it. It is keeping me from even verifying. I want my money"
    },
    {
      "author": "pixxelzombie",
      "timestamp": "",
      "body": "The service is very shitty. My wife has been trying to get a hold of someone for the past 10 days. There is an email on my wife's account that we DO NOT recognize and there doesn't appear a way to reset that without assistance from IDme."
    }
  ]
}