{
  "subreddit": "AustralianPolitics",
  "post_id": "1gtpuv7",
  "title": "Age verification tech trial results still six months away",
  "body": "The trial, which was announced ahead of the federal Budget, will extend to social media, as well as pornography and other online age-restricted services, which could be covered by a new set of online safety codes as early as next year.\n\nThe tests will consider a range of technologies, including biometric age estimation, email verification processes, and device or operating-level interventions for social media, according to tender documents released in September.\n\nFor age-restricted online content, the Communications department has explicitly asked that double-blind tokenised attribution exchange models and hard identifiers such as credit cards be considered.",
  "author": "vriska1",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Greetings humans.Please make sure your comment fits withinTHE RULESand that you have put in some effort to articulate your opinions to the best of your ability.I mean it!! Aspire to be as \"scholarly\" and \"intellectual\" as possible. If you can't, then maybe this subreddit is not for you.A friendly reminder from your political robot overlordI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "_Green_Light_",
      "timestamp": "",
      "body": "An unfortunately poorly written article that confuses age verification with age assurance.To verify someone’s age requires the presentation of some type of official documentation such as a birth certificate, that includes a date of birth.Age assurance is designed to avoid requiring official documentation and rather uses technology such as face scanning to estimate the age of the person.Some of the promoters of age assurance technology see it as a way to restrict access for underage people without risking privacy issues related to inevitable data leaks."
    },
    {
      "author": "RamboLorikeet",
      "timestamp": "",
      "body": "So basically they want to roll out new legislation  before the end of the year that can only (maybe) be enforced by some new technology that won’t be trialed and reported back on until after the election (probably).Oh and the tech is intended for its for all age verification online not just social media.Really getting tired of govts ramming things through with scary noises only to have those things lurk in the darkness. e.g. meta data retention, assistance and access."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Even if you agree with this it seems like madness to pass something that is very complex and far reaching in that time frame."
    }
  ]
}