{
  "subreddit": "privacy",
  "post_id": "1g6w3dr",
  "title": "My teenage son (born in US)  just got his first job at a small local coffee shop.  Employer is asking for a copy of the following documents:  SS card, Drivers License, and Passport.  SS card and photo ID, I get is needed.  But is asking for the passport typical?",
  "body": "My teenage son (born in US)  just got his first job at a small local coffee shop.  Employer is asking for a copy of the following documents:  SS card, Passport, and Drivers License.  SS card and photo ID/license, I get is needed.  But is asking for the passport typical?  For most  employers, is just showing the documents good enough or they really need a physical copy?    I’m just trying to protect his personal info as much as I can.  Thanks.",
  "author": "Jediheart",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This is it, this is what HR departments usually ask for. The employer probably said or meant to say, \"ss and id, OR passport\"."
    },
    {
      "author": "Big_Assist_7390",
      "timestamp": "",
      "body": "This is it, this is what HR departments usually ask for. The employer probably said or meant to say, \"ss and id, OR passport\"."
    },
    {
      "author": "Beneficial-Sound-199",
      "timestamp": "",
      "body": "for the I-9 verification yes its REQUIRED to present documents that verify your identity and eligibility for employment- I think he or the employer misread the requirements.  The instructions are listed on the I9 form. It's one document from each list not ALL of them.For a US citizen-One documentfrom List AOROne document from List BANDone document from List C must be provided by the employee.List A (Documents that establish both identity and employment authorization):U.S. Passport or U.S. Passport CardPermanent Resident Card or Alien Registration Receipt Card (Form I-551)Foreign passport with temporary I-551 stamp or I-551 printed notationEmployment Authorization Document that contains a photograph (Form I-766)Foreign passport with a Form I-94 or Form I-94A that has an endorsement of nonimmigrant status, if the individual’s work authorization has not expiredPassport from the Federated States of Micronesia (FSM) or the Republic of the Marshall Islands (RMI) with Form I-94 or Form I-94AList B (Documents that establish identity):Driver's license or ID card issued by a state or outlying possession of the U.S. with a photo or identifying information (such as name, date of birth, gender, height, eye color, and address)ID card issued by federal, state, or local government agencies or entities (with a photo or identifying information)School ID card with a photographVoter registration cardU.S. military card or draft recordMilitary dependent’s ID cardU.S. Coast Guard Merchant Mariner Document (MMD) CardNative American tribal documentDriver’s license issued by a Canadian government authorityList C (Documents that establish employment authorization):Social Security card (unless it says it’s not valid for employment)Certification of Birth Abroad issued by the Department of State (Form FS-545)Certification of Report of Birth issued by the Department of State (Form DS-1350)Original or certified copy of a birth certificate issued by a state, county, municipal authority, or outlying possession of the U.S.Native American tribal documentU.S. Citizen ID Card (Form I-197)Identification Card for Use of Resident Citizen in the United States (Form I-179)"
    },
    {
      "author": "unflavoredmagma",
      "timestamp": "",
      "body": "Nice, detailed response.Also, it is worth noting that the employer must accept any valid document or set of documents which satisfy the proof of work authorization as identified in the instructions. Put another way, they may not restrict the verification documents to a subset that they prefer from the options listed on I9 instructions, i.e. they can't say \"we only accept passports.\"Also, they must be originals. Photocopies of documents are not permissable, at least as I understand the regulations."
    },
    {
      "author": "Cats_Are_Aliens_",
      "timestamp": "",
      "body": "I think they meanorpassport as in a different form of identification. I’ve been asked this several times"
    },
    {
      "author": "fiachra973",
      "timestamp": "",
      "body": "Either/Or. Not both photo IDs."
    },
    {
      "author": "Bogey_Kingston",
      "timestamp": "",
      "body": "from a business owners perspective, according to my payroll platform (ADP) i am legally obligated to collect that information & it won’t let me “hire” someone without it."
    },
    {
      "author": "Jediheart",
      "timestamp": "",
      "body": "A picture ID. His state ID should suffice. Not everyone has a passport."
    }
  ]
}