{
  "subreddit": "Foodforthought",
  "post_id": "1i5n8po",
  "title": "VPNs Are Not a Solution to Age Verification Laws",
  "body": "",
  "author": "LeoSolaris",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »For the sake of discussion quality, participants who engage in trolling, name-calling, and other types of schoolyard conduct will be instantly and permanently removed.If you encounter any noxious actors in the sub please use the Report button.This sticky is on every post. No additional cautions will be provided.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "ParaSiddha",
      "timestamp": "",
      "body": "I don't think people should respect stupid laws.Certainly better solutions should be considered, but until then circumventing the stupid law is valid."
    },
    {
      "author": "padawanninja",
      "timestamp": "",
      "body": "<looks to Prohibition>\nBeen done before."
    },
    {
      "author": "critiqueextension",
      "timestamp": "",
      "body": "The implementation of age verification laws in various states, including Florida, has led to significant drawbacks, as evidenced by Pornhub's decision to block access in regions enforcing such laws, raising concerns about privacy and accessibility. These developments illustrate that such regulations may unintentionally drive users towards less regulated and potentially harmful online environments, suggesting a counterproductive outcome to the intended protection measures.Fighting Online ID Mandates: 2024 In ReviewHey there, I'm just a bot. I fact-check here and on other content platforms. If you want automatic fact-checks on all content you browse,download our extension(... )and devs, check out our API."
    },
    {
      "author": "bandalooper",
      "timestamp": "",
      "body": "VPNs are for getting around NHL blackouts duh"
    },
    {
      "author": "LeoSolaris",
      "timestamp": "",
      "body": "They are not along-termsolution."
    }
  ]
}