{
  "subreddit": "lacrosse",
  "post_id": "13rh0jx",
  "title": "AGE VERIFICATION IN YOUTH LACROSSE",
  "body": "Top clubs are getting behind it!  91 included!\n\nAge Verification Policy – National Lacrosse Federation\n\nThis is huge for the sport and will drive more kids BACK into the sport.  As a father of a younger 5th grader, this is welcoming news.  He is 10, routinely playing against 12's.  he can hold his own, but the early days was exceptionally hard - especially when playing off-island clubs (NY has a December 1st school cutoff when most of the country is September 1 - he is October 26).",
  "author": "Dear_Internal5171",
  "comments": [
    {
      "author": "terry_bradshaw",
      "timestamp": "",
      "body": "Playing youth and club up through middle school in maryland was often annoying because teams would be entirely reclasses. Glad  this is finally happening. This will be great for the sports growth at the younger levels."
    },
    {
      "author": "Mooze34",
      "timestamp": "",
      "body": "This is how it should be. No more reclassing bs"
    },
    {
      "author": "unkibunki",
      "timestamp": "",
      "body": "Making the windows 15m was s massive cop out. January 1- December 31, just like every other club sport that I’m aware of. But I guess it’s progress. Will be interesting to see how much my son’s roster is effected."
    },
    {
      "author": "Ant-from-here",
      "timestamp": "",
      "body": "The 15 month is OK.  There are a lot of kids who are not ready for KG and will benefit from the added 3 months.  This though equates to 18 months in NY because we cut off December 1.My son is October 26.  My wife and I were contemplating keeping him back because he was so close to the cut.  The price of day care  and the fact that my son was ready (he was actually digressing in day care/Pre School because he was bored), swayed our opinion.  Lacrosse was not even in our thoughts yet.    Now he is a full year+ younger than some of his teammates"
    },
    {
      "author": "cliff_huck",
      "timestamp": "",
      "body": "100% cop out. Typical for Team 91. Aways saying \"we don't have any reclass players\" when everyone knows 80% of the roster is older. 15 month window actually gives the NY kids 18 months. Plus they only want it U14 and below so they can still say \"look at all these commits we have. Give us your money now while Little Johnny is 7, and we will get him there.\" Meanwhile, their older teams are all reclassed, and they will dump Little Johnny in a heart beat for kids all over the east coast in the final years to keep listing all those college commits."
    },
    {
      "author": "Diverswelcome",
      "timestamp": "",
      "body": "I can get behind that one, my son is a 2029 with birthday in June, but he was in a pre k program.  The 15 months keeps him with his teammates from our community. With the increase in pre k programs and more knowledge of development, this aligns more than the US lacrosse calendar."
    },
    {
      "author": "ForegoneConclusion22",
      "timestamp": "",
      "body": "This is a great idea, especially the 15-month window."
    },
    {
      "author": "Dear_Internal5171",
      "timestamp": "",
      "body": "It's gonna be useless to reclass in the 8th grade, as that's the current trend now...good. #realonesplayup"
    }
  ]
}