{
  "subreddit": "OculusQuest",
  "post_id": "1k4oduk",
  "title": "Anoying age verification.",
  "body": "I just bought my quest 3s and i played on it for like 1 month. Meta is asking me to verify my age. I do not want to enter card details, nor i want to have a children account. They are also saying that if i dont, they will suspend my account. What am i supposed to do? Create new a account every month? Its pretty much the equivalent of \"give me 5 euros which ill give back in a year or so or ill take 100 euros\" Why cant you make a button that says \"Hell nah im not adding my card\". I paid 360 euros + delivery. Is that not enough for you??? Now im not satisfied with the VR.\n\nThanks meta!!",
  "author": "hdgamer1404Jonas",
  "comments": [
    {
      "author": "webheadVR",
      "timestamp": "",
      "body": "it means someone reported you as being underage. COPPA requires them to do verification."
    },
    {
      "author": "NotRandomseer",
      "timestamp": "",
      "body": "You can give other forms of identity verification like a drivers licence if you don't want to add a card. Based on your post history I'm 90 percent sure you're lying about your age though. If you're under 13 don't use voice chat , if you do getting reported and getting your account taken down is entirely on you"
    },
    {
      "author": "Longshoez",
      "timestamp": "",
      "body": "Dude just put your card in the damn thing, they won’t charge you anything"
    },
    {
      "author": "Electrode15",
      "timestamp": "",
      "body": "Good Luck with that...."
    },
    {
      "author": "bad_robot_monkey",
      "timestamp": "",
      "body": "I’d rather a few be inconvenienced than have every lobby filled with eleven year olds.  Then again, eleven year olds borrow headsets, so what can you do?"
    },
    {
      "author": "BalooBot",
      "timestamp": "",
      "body": "Suck it up and verify your age"
    },
    {
      "author": "Zealousideal-Book953",
      "timestamp": "",
      "body": "Ah yes who cares about other people's rights and comfort, allow any corporate entity force all decisions onto you.Nobody should ever have to \"Suck it up\".  This person bought their piece and paid a delivery fee, what other crap do you want them to jump through?You think its alright to enforce these regulations and personal profiling  onto people, should the consumer just always suck it up when daddy corporate says so?Oh daddy corporate you asked me to give you my social my debit my bank account and you want me to belittle anyone who isn't apart of your cult yes oh yes daddy corporate"
    },
    {
      "author": "fyhnn",
      "timestamp": "",
      "body": "tHaNkS mEtA!"
    },
    {
      "author": "Kevinslotten",
      "timestamp": "",
      "body": "Thats Meta,follow their rules and code of conduct or you are out. You have to verify."
    },
    {
      "author": "hdgamer1404Jonas",
      "timestamp": "",
      "body": "The age verification is there for a reason. It’s to protect children from the dangers of vr. And while it doesn’t seem like there aren’t much dangers to it, if you actually know what’s going on, especially in games like vr chat, you want a age verification to be there."
    }
  ]
}