{
  "subreddit": "Virginia",
  "post_id": "13iuvvu",
  "title": "Youngkin signs law requiring stringent age verification for porn sites - WTOP News",
  "body": "Virginia Gov. Glenn Youngkin signed a bill Friday night that requires users to verify they are 18 years old through advanced verification methods to enter pornographic websites.\n\nHe said this is in an effort to protect children from being exposed to adult content. Under the bill SB 1515, adult websites must require users to provide government-issued IDs, biometric scans or submit to age verification software.\n\nThis new law is for websites where at least 33.3% of its content can be considered “material harmful to minors.”",
  "author": "DorkChatDuncan",
  "comments": [
    {
      "author": "djamp42",
      "timestamp": "",
      "body": "And his law was made possible by our sponsor, NordVPN."
    },
    {
      "author": "skrugg",
      "timestamp": "",
      "body": "The party of small government"
    },
    {
      "author": "TheWileyWombat",
      "timestamp": "",
      "body": "To be fair, this bill passed unanimously. The spineless Dems who voted for this definitely have some explaining to do."
    },
    {
      "author": "unofficial_pirate",
      "timestamp": "",
      "body": "Disgusting abuse of power"
    },
    {
      "author": "WhatIsThisSevenNow",
      "timestamp": "",
      "body": "Why is this such a backward-ass state?"
    },
    {
      "author": "polysoupkitchen",
      "timestamp": "",
      "body": "So, twitter then.idk what you guys are using it for but for me it's that exclusively."
    },
    {
      "author": "Due_Turn_7594",
      "timestamp": "",
      "body": "Blumpkin can’t stop my vpn, and this is why old people should be elected officials they are too disconnected from reality and tech and how the mass of Americans live to make laws that make any damn senseNext up “vpn’s support terrorists and harm our children”"
    },
    {
      "author": "djamp42",
      "timestamp": "",
      "body": "If you made an argument against encryption basically the internet is useless. Fraud would be so rampant no one would do business on it. Seeing how much business is done over the internet these days, it would be the greatest economic disaster ever."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yeah, that'll stop 'em!Fucking idiots..."
    },
    {
      "author": "DorkChatDuncan",
      "timestamp": "",
      "body": "You know whats been proven harmful to minors?Guns."
    }
  ]
}