{
  "subreddit": "beermoney",
  "post_id": "5hbaz5",
  "title": "Have a question? Read this FAQ first.",
  "body": "Note:I AM NOT A MOD. If you have a question fora mod,please send it to /r/beermoney. I merely wrote the FAQ.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis section covers questions about beermoney in general. This includes questions about exchanging gift cards, what equipment to use, issues with a site not working or offers not crediting, info on posting a giveaway or tasks, taxes, using VPNS/VPS/etc, and other general questions.\n\n\n\nPart two covers common terms and which sites to use.This includes questions about which sites are available, how to make money quickly, the \"best\" sites, work under age 18, information about Engageme.tv, and other related questions.\n\n\n\n\n\nIf you use any autosurfing websites,do not cash out to PayPal.There is a chance your PayPal account could be permanently limited.The post specifically mentions fastcashmining.com and cashminingbot.com but others may have the same problem. You should be fine to cash out using other methods.\n\n\n\n\n\nDue to an increase in spam posts, new posts must be manually approved by a mod before showing up. Most posts will be approved within 12-24 hours. Please be patient during this time.\n\nIf your post has not been approved in 24 hours, you likely broke a rule or you simply weren't posting about ar/beermoneytopic. Having the opportunity to make money does not necessarily make your postr/beermoney. Sign up bonuses, crytocurrency wallets, investments, affiliate marketing, actual jobs, and other such things are notr/beermoney.\n\n\n\nYou need to be an active member of this community. Users who consistently submit top/quality content to this subreddit will receive the opportunity to put their referral link on the list. Have you seen someone being particularly helpful?Message Threw_it_to_ground to put in your nomination.\n\nHere is more info.\n\n\n\nThis typically happens when you've missed a lot of attention checks or were kicked off the job. Don't worry, you should still get paid as long as you weren't giving bad answers. It may take a bit longer for them to validate your answers, and you may get paid a bit less due to the incorrect answers. Make sure to shoot them an email though.\n\n\n\nAre you being invited to jobs?— Neevo invites their best workers to new jobs first. You may get an opportunity later.\n\nIs your task counter correct?— Your number of tasks will drop if you are banned from the job for failing too many attention checks.\n\nIs the job still active?— It's possible that they simply ran out of tasks. Jobs are not closed until the project is completed and verified. Check back later to see if more tasks have been added.\n\n\n\nGive them some time. They pay out after the job has been completed and validated. It can take a few weeks to get paid. If the job has been closed for a few weeks and you still haven't received payment, send them an email:neevo@definedcrowd.com\n\n\n\nNote: Quickthoughts and IPoll are run by the same company.\n\n\n\nr/giftcardexchange— This is the most popular option.\n\nr/GCTrading— Good for people with less karma/activity.\n\nSell it on an exchange website.— Costs more for buyers and pays less for sellers.\n\nSell to your friends or family.\n\neBay or Craigslist.\n\nIf you are looking for a way to sell Amazon Balance,check out this post.\n\nIf you want to exchange cash methods, check outr/Cash4Cash.\n\n\n\nThere's no easy way to do it. Your options include:\n\nFind someone willing to trade an app for money (you buy the app for them, they give you money).\n\nMake an app and set up a payment system. Then spend your credits through the app you made.\n\nComplete an offer on a site like Swagbucks where you are awarded for spending credits.\n\n\n\nMturk is only available for users age 18 or older. They primarily invite US citizens and permanent residents, but some international workers are accepted as well. Their selection process is seemingly random. If you weren't accepted, you may unexpectedly be approved in the following weeks/months.\n\n\n\nDid you just join yesterday?— New users often see more surveys available on their first day due to the site already having a batch of surveys available. You need to wait for more to get added.\n\nIs it during a holiday or a summer/winter break?— Many sites such as mTurk and Prolific offer academic studies. This means that there will be more surveys during the school year, and far fewer during summer and holiday breaks. Also, there are more people looking for work during the breaks.\n\nAre you checking the site constantly?— Surveys go quickly on the better paying sites. You may only get a few seconds to a couple minutes to accept the task.\n\nAre you outside the USA?— There tends to be fewer surveys for non-USA workers.\n\nWere you speeding or lying on previous surveys?— You may have been banned.\n\nIf you still aren't seeing any surveys after a few weeks, you may just not be in a desirable demographic. It doesn't hurt to contact support to ensure there isn't anything wrong with your account, but chances are there just hasn't been a survey needing you yet.\n\n\n\nYes, that will happen.\n\n\n\nYup. It happens. Survey portals are notorious for disqualifying people. Sites that specialize in doing just surveys tend to be better. Basically, if you're on a site that has an offer wall and surveys, expect disqualifications to happen.\n\n\n\nThere are a few ways to prevent it, but nothing is guaranteed.\n\nTake a couple screenshots as you progress through the survey, especially towards the end. Sometimes support will credit you if you bring it to their attention.\n\nDon't rush, and don't walk away in the middle of a survey. If you're getting disqualified a lot, try counting to 5 after each question.\n\nAlways be consistent in your answers. There are a lot of questions designed to figure out if you're telling the truth or not. If your answers keep changing, you'll be disqualified.\n\nWatch out for attention check questions. Sometimes questions will ask you to select a certain response, answer questions about text you've just read, or ask you silly questions such as \"Are you an alien?\".\n\n\n\nMake sure you don't have an adblock or any other extensions that could be interfering with it. Allowing the site isn't enough, you need to disable them. I recommend using a separate browser or profile for doing offers. It's also incredibly important to clear your cache between offers.Vanilla cookie manager is a good extension for this.Even if you do clear the cache, some offers just don't like to credit.r/Swagbucksis a great place to see what offers are currently crediting easily. Since many sites use the same offer walls, you can probably find the same offers on another site.\n\nIf you met the requirements for an offer and it didn't credit, the only way to get credited is to contact the support for the offer wall and show them proof that the requirements were met.\n\n\n\nIs your cash out taking forever?orIs the site just not working right?- Look on a relevant subreddit, facebook or twitter. If there is a problem, people will be posting about it. If there's no mention of the problem, try asking on those subreddits, facebook or on twitter.  If you don't know where to look, just go to google and type in the website name and what site you're looking for. For example \"Swagbucks reddit\" will bring you right tor/Swagbucks. This works for facebook, twitter, whatever you need. If all else fails, contact support.\n\n\n\nIs the site not loading?Try clearing your cookies. If that doesn't work, try another browser or another device. If it still isn't working, follow the advice above about \"Is the site just not working right?\". If you can't find anything about it, try waiting an hour or two, or even wait until the next day. There could be some issue on the website. If all else fails, contact support.\n\n\n\nCan't login?Follow the instructions above about the site not loading. There's also a chance you've been banned. Some companies won't alert you to bans and will just suddenly remove your ability to login. Follow the advice below for \"Have you been banned for no reason?\"\n\n\n\nHave you been banned for no reason?Contact support. There is absolutelynothingwe can do for you here. A few site owners browse this place, but the bulk of us are just general users. Just be polite and friendly. If you didn't do anything wrong, you'll likely get your account unbanned. Sometimes a site's fraud detection is triggered on accident.\n\nIf you were banned by Quickthoughts, you likely will not be unbanned, but it still doesn't hurt to send them a message.\n\n\n\nDid you cash out to the wrong PayPal account?First, add that email address to your PayPal account. You can have multiple emails attached.Next, contact support and ask for guidance. If they already sent the payment, it may get stuck in limbo. If they didn't already send it, they may be able to send it to the correct email. It's best to contact support as soon as you can, so that they can advise you on the proper steps for you to get paid.\n\n\n\nHaving another problem?You're best off just contacting support. Most of the people here are general users. If you need individualized help, contact support.\n\n\n\nIf you get a reply and it doesn't answer your question, then send apolitereply. Make sure to restate what you said in the previous email. Don't just copy and paste; they may have misunderstood what you needed the first time. Keep it short and to the point.\n\nUnder no circumstances should you yell, swear, or be rude to the staff. Remember,youare asking fortheirhelp. Being rude will only get you longer wait times, more copy and pasted responses, and potentially banned. Support is more likely to help those who are polite, so say hello and thank you with each email.\n\n\n\nMost people use a spreadsheet. Here are a few options:One|Two|Three\n\nIf you're interested in making your own spreadsheet, here are a few ideas:One|Two\n\n\n\nCheck outr/BeermoneyHomeNetworkfor help with configurations. The posts are old, but the info is solid. It's just one of those things that doesn't change.\n\n\n\nShort answer:Yes.\n\nLong answer:It doesn't matter if you get PayPal, Cryptocurrency, Gift Cards, physical items, or whatever else. It is all considered income because you are earning it in exchange for a service. In the USA, once you earn $400 in self employment you are required to file taxes. If you earn $600 or more with any individual site in a year, you should receive a 1099 from them. Even if you don't make $600, or don't get the form, you're still supposed to reportanyamount you earn. There are a few circumstances in which someone doesn't need to file taxes, and if you think you would be in one of those circumstance, you should speak to a certified tax consultant.\n\nHere's more information.\n\n\n\nAlways cash out as soon as possible, unless there is some sort of discount for saving up your points. You never know when you might get banned or a website might go away. Building up your points is just increasing how much you have to lose. The points are not yours until the money is in your possession.\n\n\n\nIf a post is at least 48 hours old or made by a user with flair beside their name, it is likely legit. Known scams get removed pretty quickly.GPT sites are more likely to be a scam than any other type of site posted here.If you are worried about being scammed, I highly recommend sticking to the more well known sites in this FAQ andthe Common Beermoney Sites List.You can also ask the poster for proof that they were paid by a site. If they can't prove they've been paid, they are only looking for referrals. I don't recommend signing up on sites when the user can't provide payment proof.\n\n\n\nIf they send you a check and ask you to return part of the money,it is a scam. The check will bounce, and you will be out the money. If an employer needs you to buy something, they will either buy it with a company card, or ask you to send a receipt for a refund. If they've already sent the check, you can give it to your local police department if you want. Just block all communication from them.\n\nThey pay a ridiculous amount of money or claim to pay \"the most\". Very few surveys pay more than $10/hour. You won't get more than about a penny to click links. Videos rarely pay more than a couple pennies. This is about the maximum, and it's very common to make half this rate or lower. If the site is claiming to pay so much more than anywhere else, it's a scam.\n\nYou get an offer or interview from a site or job you didn't apply for. Be especially cautious if they want to do the interview over google hangouts.\n\nYou are being asked to work for free as a \"sample\", or you are asked to install a program and wait to be accepted at a later date.\n\nThey have a high minimum cash out amount (above $25). Many sites have $1-10 minimums.\n\nYou are required to refer people to get paid.\n\nYou have to spend money to use the program. Even if it is an \"optional\" fee, be careful. This includes \"training fees\".\n\nThey don't disclose what type of work you're going to do. Sometimes job listings need to be vague for non-disclosure reasons, but you should always be able to get a general description of the work you will perform.\n\nThe website or post is full of grammar errors. An error here or there is bound to happen, but any legit site is going to put in effort to look good.\n\nIt's never been mentioned on this subreddit and/or you can't find reviews on google. Unless it's a completely new service, you should be able to findsomethingabout itsomewhere.\n\nMost importantly - does it feel too good to be true? Does it feel sketchy? Is there something that is just off, but you can't put your finger on it? Trust your instinct, and come here to find out if anyone else has heard of the site.Do a search first,and if you can't find anything, then make a post about it.\n\nThere are exceptions to most of these, but these are some things to be on the lookout for.Here are a few more safety tips.\n\nAlso, never trust what a blog says. They are trying to get your referral link, so they will pretend the site is better than it is. If you see the site onr/beermoney, look in the comments. If the poster is making outrageous claims, usually someone will leave a comment about it.\n\n\n\nGiveaways without any stipulations or endorsements are permitted. If you intend to promote a site/link/etc or require users to sign up somewhere or complete a task,you must get moderator approval prior to posting.Failing to do so may result in a ban. Due toan incidentusers are no longer allowed to simply host their own giveaways.When in doubt, message the mods.\n\n\n\nDepends. What type of task are you offering?\n\nPaying people to utilize their Facebook Ads account is not permitted here.\n\nTasks related to Amazon reviews are not permitted.Amazon's explicitly states that users are not allowed to post reviews in exchange for compensation of any kind - including free or discounted products, refunds, or reimbursements.The reviewer can have his reviewing privileges revoked, and the seller can have his account closed. There have also been cases of Amazon suing reviewers and sellers over fake reviews.\n\nAre you only looking for just one person or a couple of people? Go tor/slavelabour.\n\nAre you looking to do commissions or sales? Go tor/slavelabour\n\nIs it more of an actual \"job\" and pays at least minimum wage? Go tor/WorkOnline.\n\nAre you paying people to signup on a website/app/etc? Go tor/signupsforpay\n\nIs it a survey? If it's a raffle, go tor/SampleSize. If it's a guaranteed payout and pays decently, then it will be well received here. However, I don't recommend posting it on here. Unfortunately, there are a lot of scammers here who will try to do your survey multiple times. I suggest taking it to a different subreddit, or an alternative site such as mTurk.\n\nIs it a decent paying amount task, and a lot of people can complete it? Sounds like it's fit for this subreddit.Make sure to ask the mods for permission first though.\n\nWhen in doubt,message the moderatorsand ask if it's allowed.\n\n\n\nInvite your friends and teach them how to use the sites.\n\nAdvertise on social media.\n\nFind a new website that haspaid youandhasn't been discussed here (search first!)then advertise it here (with lots of info and payment proof!)\n\nConsistently submit top/quality content to this subreddit for the opportunity to have your referral put onthe Common Beermoney Sites List.\n\nPay for referrals (make sure the site allows it first!).\n\nJoin a referral chain.\n\n\n\nAbsolutely. Youneedto have correct info on the sites that pay you. Lying about anything can cause a whole lot of trouble, including getting your account banned.\n\n\n\n\n\nFree Options—Google Voice|List of free services| Ask a family member or friend\n\nPaid services—r/phoneverification|List of paid services\n\n\n\nNo. You can get banned for doing this. Usually they ban you right after you redeem your first reward. The location is restricted for a reason.\n\n\n\nNo. Third party software is not allowed, and you can be banned for it.\n\n\n\nNo. Don't listen to the trolls. Beermoney changes over time. Some methods are less lucrative now than in the past. Some are more lucrative. Some have less sites offering the service, and some have more. Passive methods are on the decline, but beermoney is more than just passive methods.\n\n\n\nEvery post will get a few downvotes. You can't please everyone. If you get down to -5 or lower, you might want to take a look at what you're typing. Beermoney users in general are more likely to upvote than to downvote, so either you're breaking a rule, spreading false info, or you're just being rude.\n\n\n\nIf you saw something in this FAQ that you think is wrong, is confusing, or you think needs more information, please let me know and I will look over it.\n\n",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Fishering",
      "timestamp": "",
      "body": "Very well written, thanks for putting all this together.I'll send you a PM if I think there's anything important missing."
    },
    {
      "author": "weaselpaws",
      "timestamp": "",
      "body": "If anyone has any questions about selling plasma I can probably answer them.  It usually pays pretty well and helps a lot of people out."
    },
    {
      "author": "lBLOPl",
      "timestamp": "",
      "body": "How can I work gigs on craigslist without getting scammed or killed?Any tips? What I should look for in posts? Things to avoid?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Just curious, do most sites actually allow paid referrals?"
    },
    {
      "author": "weebae",
      "timestamp": "",
      "body": "Should I be using my real address, name, dob? Won't I get a ton of spam from these surveys?"
    },
    {
      "author": "CassiusTheDog",
      "timestamp": "",
      "body": "For a site like swagbucks, how long does it take for a referral bonus to show up in my friends account if they referred me, and how long do I have to be active or what steps do I take to make sure it shows for them?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}