{
  "subreddit": "AvakinOfficial",
  "post_id": "1dbtzlg",
  "title": "Age verification",
  "body": "Why am I just NOW finding out you need to pay for age verification. $9 is absolutely ridiculous",
  "author": "TucanaTheToucan",
  "comments": [
    {
      "author": "Willing_Tree_2628",
      "timestamp": "",
      "body": "$9?! It was 4.99 like last week?!-update I read the comments, also I wanna buy it now because I’m scared that they might raise it. But can anyone tell me is it worth it?(Ps. I personally do not think age verification should be free because then kids for example could just find a way to cheat it or use their parents thing behind their backs so I feel like despite it being kinda bs it’s almost like an extra layer of security for adult players)"
    },
    {
      "author": "Significant-Win1582",
      "timestamp": "",
      "body": "Exactly. Makes no sense for it to be free. It's a way to verify 18+"
    },
    {
      "author": "sadlazz",
      "timestamp": "",
      "body": "I honestly dont know why people pay for this...just for getting 18+ content? you guys do know that there is possibility of random kids asking one of their old sibilings to do age verification for them right? biometric age verification can be easily bypassed by using a video and software that allows you mirror mp4 to webcam. Storing data and profiting by third party companies yoti and not avakin company itself is consider as red flag. They should be held accountability and face tough legal consquences when it posted in online. Age verification should never be trusted and should be banned due to how easy can abuse the system in third party. We dont even know how our data collected by the company.. plus the fact that they said we pay age verification for the support, development and use of the third party companies is sketchy af and I can see that they wanna get more profit over privacy. I dont understand this system at all its absolutely worthless and idk who came up with this idea think this is good idea to implent it in the game while its obviously relate to huge privacy concern. This has to be one of the dumbest decision has been made from avakin"
    },
    {
      "author": "avakinveteran",
      "timestamp": "",
      "body": "Damn. Is this just the price in your country or did they raise it?"
    },
    {
      "author": "YellowTheYapper",
      "timestamp": "",
      "body": "This is AUD"
    },
    {
      "author": "RStar2019",
      "timestamp": "",
      "body": "I find it so funny that Avakin Life has a horde of defenders (players who have like a Stockholm syndrome) and always come to advocate for them, for free, here or in other places on internet... 🤣 If someone dares to express any dissatisfaction with the game (which became money-hunger, with no doubt), they quickly come to fight tooth and nail to defend them, like they worked in the company and if they had any share in the company's profits...😒 They don't care to expend a lot of money and being exploited too - they behave like part of the team that is profiting from this LOL. What really makes me wonder if these ppl are LKWD employees in disguised, among users, to defend the company's side, or if they're just ninnyhammers...😂Oh, and read this comment of mine, quickly, as it will definitely be reported by their defenders on duty and be removed! They removed my last comments in this post (AND in others about totally different subjects, also), cause they can't stand see opinions that diverge from theirs and tried to \"cancel\" me 👅...No free speech for me or for anyone who says something they don't like! 🤦🏼‍♀️"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "The price ($5 USA, $9Au, 4£ 4€? Etc) is to cover Yoti fees mostly. This was in all the original posts on game and social media as well as explaining the costs... You might have missed that part?"
    },
    {
      "author": "RipNugget1",
      "timestamp": "",
      "body": "Paying for a badge"
    },
    {
      "author": "Magicquest213",
      "timestamp": "",
      "body": "Age verification is optional."
    },
    {
      "author": "TucanaTheToucan",
      "timestamp": "",
      "body": "It should be free if you ask me."
    }
  ]
}