{
  "subreddit": "SchengenVisa",
  "post_id": "1k4z1ub",
  "title": "🇸🇪 Sweden Visa – Family Visit + Business Travel – Need Advice!",
  "body": "I applied for aSweden Schengen visain 9th ofApril 2025for afamily visit+business travel comboat Bangalore, India. I have given my VFS experience in another posthttps://www.reddit.com/r/SchengenVisa/comments/1dys98u/comment/mn6vyno/?context=3\n\nHere’s my situation:\n\nI'm an Indian citizen working for American MNC at Bangalore India with a Good travel history.\n\nI planned todrop my parents(Aged 68 & 63 Years) at my brother’s place inGothenburg, Sweden(May 18th).\n\nThen I would fly to the San Diego,U.S.Afor a Business Conference (June 8–12).\n\nAfter the conference, I planned toreturn to Swedenbriefly (GOT) before flying back to India., and take my Father back to India as he is having his business running at India - My mom will come little late (like after 30 days )\n\nApplied for aSchengen Visa via Sweden (VFS, Bangalore)with:\n\nCover letter explaining thedual purpose(family visit + business).\n\nRound-trip tickets (Etihad Flex Tickets booked 18th May to 25th July) - These were tentative dates, I Will return to Sweden from USA by 14th Jun and return to India by 16th Jun (Ticket was not yet changed as i was waiting for Sweden Embassy's response, Mentioned the same in cover letter as well)\n\nand USA Conference invite letter, support letter, hotel bookings and attached the copy of my passport with the valid USA B1/B2 Visa.\n\nInsurance - for Schengen zone\n\nInviting letter from my brother.\n\nStrong financials, employment proof, travel history, Verification of Employment, 2 weeks of Paid time Off appproval to prove that i have taken leave in between.\n\nIrequested multiple-entryor at leastDual Entry, mentioning theneed to return to Swedenafter the U.S. trip.\n\nI was granted aSingle Entryvisa fromMay 18 to July 25 (69 days).\n\nThis completelybreaks my plan, as Ican’t re-enter Swedenafter my U.S. trip!\n\nShould I:\n\nAppealto the Swedish Embassy in New Delhi asking for an amendment or reissue?\n\nApply for a new Schengen visafrom another country for re-entry (time is tight)? I can apply via my official Travel desk by 23rd April - 16th May is our expected travel date start from BLR.\n\nChange return plansand skip coming back to Sweden (parents return separately)?\n\nAnyworkaroundsothers have tried successfully?\n\nWould love input from folks who’ve faced something similar—especially those who've dealt with Schengen visa quirks with dual-purpose travel. Thanks in advance!",
  "author": "WillHsp",
  "comments": [
    {
      "author": "That_Inspection_5912",
      "timestamp": "",
      "body": ""
    },
    {
      "author": "WillHsp",
      "timestamp": "",
      "body": "If they said no, then nothing can't be done tbh, you need to change your plans. You can try requesting again. I had a similar case but for France and they immediately contacted me to come to the embassy with my passport and corrected the visa on the same day"
    }
  ]
}