{
  "subreddit": "australia",
  "post_id": "1gkbppu",
  "title": "How age verification could push children to dark sites",
  "body": "",
  "author": "PM_ME_UR_A4_PAPER",
  "comments": [
    {
      "author": "CuriouserCat2",
      "timestamp": "",
      "body": "Of course it will. How do you make something extra attractive to teens? Tell them they can’t have it.The whole point of the internet is that you can reroute past obstacles. This is old men trying to control digital natives.HerpyderpTo make this stupid plan even appear to succeed on the surface, all our internet activity has to be locked down tighter than a fish’s arsehole. Yours. Mine. Every search and comment attached to you. All your kinks, all your fascinations, all your honest comments, doxed by the government.Welcome to hell."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "That why this is likely to fall apart and be dropped."
    },
    {
      "author": "AddlePatedBadger",
      "timestamp": "",
      "body": "Digital natives is a key aspect here, you've hit the nail right on the head. I'm xennial and as a kid had for the time reasonably computer literate parents (they did BBS's and all that kind of stuff when they were a thing). I know enough to know that I will never be able to out-tech my kid. I'm going to have to use teaching and trust to ensure she doesn't get harmed by what is out there."
    },
    {
      "author": "QkaHNk4O7b5xW6O5i4zG",
      "timestamp": "",
      "body": "I’m not sure I’d call young people today digital natives like you’d call people born in the 90s that.The tech grads/interns I see get more and more clueless about how stuff works with each year.With that lack of fundamental understanding they’re more in the subcategory of “user-friendly native” where they’re just as likely to run malware or get scammed as dear old granny.But, at the end of the day, it’s the parents jobs to control internet access. And the government’s role should be education more than regulation for this. in my opinion, anyway."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "They tried this in Louisiana, US. All it did was push up VPN usage. Secondly users just went to sites which didn't have age verification."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Remember when they put “parental advisory warnings” on CDs? That’s so the kids knew which were the best ones to buy and not show their parents.I’d rather have my kids (age appropriately) using social media openly where I can show them how to safely navigate the platforms, learn to recognise disinformation and keep themselves safe from all kinds of predatory behaviour (not just sexual predators).Our kids devices were in the living areas where everything could be seen and heard until they could show themselves to be good digital citizens and even then, we check with them regularly. The benefits of social media have been amazing for my kids - connecting with like minded kids and learning together while playing.We don’t stop children from swimming because pools are dangerous. We teach them how to swim and be safe around bodies of water."
    },
    {
      "author": "Wankeritis",
      "timestamp": "",
      "body": "This isn’t surprising. Even in the early 2000s we would have bans on certain websites at schools. All that did was make kids work their way around the bans just so they could go on sites they wouldn’t have thought about otherwise."
    },
    {
      "author": "National_Way_3344",
      "timestamp": "",
      "body": "Especially when it made it impossible to do the workHey I'm doing an assignment on dogs, now I need pictures[Sorry this website is blocked]I swear they didn't denylist apps, I squarely believe they had 10 websites whitelisted and that's it.Ok sure, I'll use Google fucking Translate as a web proxy to access the site anyway.My primary school was the villain origin story that turned me into an IT guy."
    },
    {
      "author": "TheCleverestIdiot",
      "timestamp": "",
      "body": "It's the oldest rule in the book. If the legal avenue for something people want becomes banned, they won't stop looking for it. They'll just go the illegal route.Or the shunned route, or the really trying hard to make this illegal route. Basically whatever fits there."
    },
    {
      "author": "PM_ME_UR_A4_PAPER",
      "timestamp": "",
      "body": "At least young people will learn about the benefits of using a VPN early.That will be a net positive."
    }
  ]
}