{
  "subreddit": "GalaxyWatch",
  "post_id": "1eirxbz",
  "title": "AGEs index",
  "body": "Hey everyone! Now that the galaxy watch 7 & ultra have been out for a bit I thought I'd ask about people's experience with the AGEs index tracker. My levels have been at ~7 or 8 out of 10, and haven't changed at all over time. This has concerned me a bit since I don't consume many high AGE foods, am not diabetic, and am very physically active. Anyone else have similar experiences?",
  "author": "kongacute",
  "comments": [
    {
      "author": "derausgewanderte",
      "timestamp": "",
      "body": "As Rainmaker pointed out in his YT Video, it'salmostthe same for everybody. For now I can only think that Samsung just dropped the ball on this one. It's a joke and I hope they get their act together. I'll show you mine, which just looks like yours and everybody else's -or almost at least."
    },
    {
      "author": "Waabajack",
      "timestamp": "",
      "body": "lmao that is hilarious. i saw that video and then it hit me that mine was the same result and then realized so was everyone else's lol"
    },
    {
      "author": "Brekin73",
      "timestamp": "",
      "body": "Here's mine. And I'm pretty active and try to maintain a healthy diet."
    },
    {
      "author": "Saotik",
      "timestamp": "",
      "body": "Here's mine. I'm middle-aged, not very active, and don't eat very well.Hmmm."
    },
    {
      "author": "David_1993",
      "timestamp": "",
      "body": "Same here. I think this feature needs some research"
    },
    {
      "author": "Senior_Line_4260",
      "timestamp": "",
      "body": "everyone has the same it seems haha, they really gotta add a scale to compare things to and so"
    },
    {
      "author": "cakehead123",
      "timestamp": "",
      "body": "Everyone likely has AGEs they are pretty hard to not have, you basically have to eat next to no fat to have a low or medium level"
    },
    {
      "author": "frostyfire22_2",
      "timestamp": "",
      "body": "Here's mine. Yours looks slightly higher."
    },
    {
      "author": "Rapiere",
      "timestamp": "",
      "body": "I guess this feature isn't yet completely baked and/or they missed FDA or regulatory authorization to be used for glycemic index. Wait and see or would need another hardware upgrade until those UV led provide useful and actionable data."
    },
    {
      "author": "kongacute",
      "timestamp": "",
      "body": "Look like they put the best sensor they can but don't know how to interpret this AGEs metric. And now they put it as a Labs feature. Btw, mine is almost near the middle. *"
    }
  ]
}