{
  "subreddit": "InstacartShoppers",
  "post_id": "vmz5jf",
  "title": "Is there a way of getting around verifying your ID",
  "body": "I have a temporary drivers licebse as my wallet was stolen a week ago. The temporary drivers license is a peice of paper and is not recognized by the scan system. I tried contacting support but they said they cant do anything. My new drivers license will come in 4-6 weeks. Is there anything I can do?\n\nEDIT/UPDATE: I wanted to update the post in case anyone else looks this up. I contacted support through email, the app, and twitter and a temporary drivers license is seen as invalid in instacart's eyes. Only a permanent ID can be used for verification. So looks like I won't be using instacart for the next month",
  "author": "FunFactress",
  "comments": [
    {
      "author": "myBisL2",
      "timestamp": "",
      "body": "I have never seen a gig app allow you to bypass identification.  The thing is everyone can say they don't have a scannable license forreasonsand if instacart allowed exceptions then they're just creating a way to bypass identification.  Most systems aren't even set up with a way to turn the identification requirement off, because it's a hard requirement.  So you can ask, but I'd be shocked if it happened.Edit: totally misread that OPs wallet was stolen."
    },
    {
      "author": "biancanevenc",
      "timestamp": "",
      "body": "OP's license was stolen."
    },
    {
      "author": "FunFactress",
      "timestamp": "",
      "body": "Is the number the same?  Have you reached out to IC Twitter to ask?"
    },
    {
      "author": "MLGJustSmokeW33D",
      "timestamp": "",
      "body": "The number is the same, and they said they cannot turn the verification off on my account."
    },
    {
      "author": "Emotional_Level1395",
      "timestamp": "",
      "body": "If you go to the DMV they will print you out a new one immediately. Might be a $30 charge. At least it is here in Philly"
    },
    {
      "author": "MLGJustSmokeW33D",
      "timestamp": "",
      "body": "They only mail them here. I went to the dmv and said it qas urgent and needed it, but all they could do is give me the paper with the tenporary"
    },
    {
      "author": "Hannahmarie1109",
      "timestamp": "",
      "body": "I'm waiting on mine too. It'll be here 3 to 4 weeks but no longer than 60 days. Today I went to work an hr away and it wouldn't let me on until I updated the ID. I have the paper copy but was told it's not accepted. I asked for a number to speak with someone else and was told they didn't have one. I don't understand how the state considereds something a valid ID but 1 single company doesn't."
    },
    {
      "author": "MLGJustSmokeW33D",
      "timestamp": "",
      "body": "I agree. Once you get ur license make sure to have a picture of the front and back saved onto your computer, as I have seen that work before. Hopefully yours comes soon!"
    },
    {
      "author": "jason100727",
      "timestamp": "",
      "body": "Most likely not. However why can’t you just go to your local DMV and have one made right on the spot?"
    },
    {
      "author": "FunFactress",
      "timestamp": "",
      "body": "Some states no longer issue them on the spot, supposedly mailing them is more secure."
    }
  ]
}