{
  "subreddit": "ViaRail",
  "post_id": "1j4j3ey",
  "title": "New VIA Rail ID Verification Policy",
  "body": "https://www.viarail.ca/en/plan/onboard-train/policies\n\nVIA Rail is committed to ensuring the safety and security of its passengers, and as part of this commitment, we are increasing the verification of identification (ID) on all long-distance, regional and remote trains, starting March 19, 2025.\n\nIt is the responsibility of each passenger to ensure that they are travelling with a valid photo ID or two pieces of non-photo ID, all according to the list of accepted IDs below. The name on the ID must match the name on the ticket.  The photo on the ID must resemble the passenger. All passengers aged 13 and over must present their identification to a VIA Rail staff member at the time of boarding or on board for validation.\n\nValid identification:To be considered acceptable, the valid identification needs to meet the following requirements:\n\nFor all passengers:\n\nOne piece of valid photo identification.\n\nOR\n\nTwo pieces of valid identification without photo.\n\nCanadian identification:\n\nPassport.\n\nCitizenship card.\n\nCanadian provincial or territorial driver's license.\n\nCanadian provincial or territorial health card.\n\nBirth certificate.\n\nRecord of Landing Form or Permanent Residence card (IMM 5292 and IMM 5688).\n\nImmigration documents issued to foreign nationals (e.g., Work Permit, Study Permit, Visitor Record, Temporary Resident Permit, Refugee Approved Status).\n\nCanadian military identification.\n\nFederal police identification.\n\nOld Age Security (OAS) identification card.\n\nSecure Certificate of Indian Status (SCIS).\n\nMétis Nation Membership Cards from:\n\nMétis Nation of Ontario.\n\nManitoba Métis Federation.\n\nMétis Nation of Saskatchewan.\n\nMétis Nation of Alberta.\n\nMétis Nation British Columbia.\n\nInuit Land Claim Beneficiary Cards from regions such as:\n\nNunavut.\n\nNunatsiavut.\n\nInuvialuit Region.\n\nNunavik.\n\nCongress of Aboriginal Peoples (CAP) and Affiliates membership cards.\n\nProvincial, territorial or federal Correctional Services identification.\n\nNEXUS card.\n\nFirearms license.\n\nHunting, boating or fishing license.\n\nForeign identification:\n\nPassport issued by the country of which the passenger is a citizen or a national.\n\nNEXUS card.\n\nPermanent resident card issued by the United States.\n\nEnhanced driver’s license.",
  "author": "CanadianErk",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »r/ViaRailis not associated with VIA Rail Canada in any official way. Any problems, concerns, complaints, etc should be directed to VIA Rail Canada through one of the official channels.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "wbsmith200",
      "timestamp": "",
      "body": "i can see where VIA is coming from with this, heaven forbid there’s a train derailment, a bunch of coaches and sleeping cars get burnt to a crisp. You need to account for passengers and train crew."
    },
    {
      "author": "VideoKilledMyZZZ",
      "timestamp": "",
      "body": "I have no issue with this, and will happily comply."
    },
    {
      "author": "Yecheal58",
      "timestamp": "",
      "body": "Has anyone considered that Via's shareholder through Transport Canada, CSIS or the RCMP may have asked Via to implement this policy?  I can't think of any reason why Via would undertake to enforce this change without very good reason. And could it have anything to do with this fentanyl issue with Trump under the guise of trying to reduce the odds of distributing it to remote areas by train?The other reason could be because Via is getting abused by persons claiming discounts (such as Indigenous, Canadian Military, CAA) which they don't qualify for, by using someone else's ID or discount code and instead of singling-out people on the train, they are avoiding issues by making it a blanket policy?This change requires a lot of work for the on-train crew. I doubt Via would attempt to enforce this new policy without good reason."
    },
    {
      "author": "shoresy99",
      "timestamp": "",
      "body": "Why?  I can take a GO train into Union station that would have WAY more people than a VIA train. How does it make sense to have an ID check on VIA but not GO. If a terrorist wanted to kill a lot of people they could do it on a GO train."
    },
    {
      "author": "Rail613",
      "timestamp": "",
      "body": "Only applies to the VIA Canadian every second day leaving Union Station.Does not apply to Corridor trains (nor GO).Assume the Amtrak departure checks ID to reduce issues at Border Crossing."
    },
    {
      "author": "judyp63",
      "timestamp": "",
      "body": "I welcome it for safety.  I only use VIA for travel by rail."
    },
    {
      "author": "Prinzka",
      "timestamp": "",
      "body": "So regional trains includes the corridor, right?That's going to make the lines go crazy slow.There's already so many people who when they get to the front of the line don't even have their phone out, and then don't want to get out of the way. Even in business class when they specifically call for you to board you often have to slalom through the line of people who walked up to the person checking and then managed to forget they had to show a ticket.If they're checking on board instead then it's a lot of extra workload on the crew as they're already busy with preparing to depart.And I assume they have to check everyone before departing otherwise there's no use, so that's not going to help leaving on time."
    },
    {
      "author": "CanadianErk",
      "timestamp": "",
      "body": "Long Distance, Regional and Remote trains are everything outside the Corridor.NEW TRAINS FROM COAST TO COAST | VIA Rail"
    }
  ]
}