{
  "subreddit": "VRchat",
  "post_id": "1js6dho",
  "title": "How does getting Age-Verified work?",
  "body": "As the title says. I am confused, do I HAVE to pay for the VRC+ membership to get Age Verified or can I get verified without it? No hate to the devs for wanting a premium membership for their free game, not gonna get into that can of worms, but I'd actually like to enjoy the game without people screaming out racial slurs or screaming kids in my ear.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "EricFoofy01",
      "timestamp": "",
      "body": "Here is how it goes. You pay for VRC+ You go ahead and do the age verification process which is a few pictures and your ID After that it will take some time to process and you will have the option to show that on your profile.You DO NOT have to continue paying for VRC+ for it to stay on your profile"
    },
    {
      "author": "Rough_Community_1439",
      "timestamp": "",
      "body": "Can confirm, it can take from 20 minutes to three days to show up. Also I can also confirm that after letting the vrc+ expire you will still have the marker saying your verified."
    },
    {
      "author": "TheNastyNug",
      "timestamp": "",
      "body": "You can alternatively wait till it rolls out for everyone else for free but who knows when that will be"
    },
    {
      "author": "zig131",
      "timestamp": "",
      "body": "In the first stage, you could get verified by being in certain Groups.Each Group had a limited number of verifications available. There /might/ still be some left, but unlikely.Thought I'd mention as this explains why you might have heard of people without VRC+ getting verified."
    },
    {
      "author": "AshernStoryTime",
      "timestamp": "",
      "body": "Supposedly they'll roll out the verification system for non-members but for now the only way to do it is through vrc+"
    },
    {
      "author": "AnimatedMania",
      "timestamp": "",
      "body": "Is their a goal to when they'll roll it out or is it a pipe dream kinda deal?"
    },
    {
      "author": "oofx99",
      "timestamp": "",
      "body": "yeah, it's functional at this point so I think they are just putting off letting everyone have it for free to milk money out of people to cover persona's costs that they have to pay them for."
    },
    {
      "author": "Embarrassed-Touch-62",
      "timestamp": "",
      "body": "Yes, verification right now is only for people with VRC+ or those who were lucky to get it at beta testing. But once you veridy, badge stays with you, no need to continue paying for subscribtion.You will be taken to Persona's website for verification and be asked to show both sides of your ID (photos or scan). Also you will need to give a scan of your face."
    },
    {
      "author": "LeokingVR",
      "timestamp": "",
      "body": "when i did mines I payed for VRC+ verified my account went through immediately got on VRChat to see if it was there which it was and canceled VRC+ as you do not need to keep it to stay Verified 😌👌🏿"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "You pay for vrc+ then gave your id and then you can hangout with loser adults who think they are better than you"
    }
  ]
}