{
  "subreddit": "AskALiberal",
  "post_id": "163ito7",
  "title": "Should children be prevented from watching pornography? Utah, America's most conservative state, requires robust age verification to view porn. Do you object to Utah's action? Would you mind other states following suit?",
  "body": "Utah hasn't banned porn. They've just made it difficult for children to access it.\n\nUtah law requiring age verification for porn sites remains in effect after judge tosses lawsuit",
  "author": "MateoCafe",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »The following is a copy of the original post to record the post as it was originally written.Utah hasn't banned porn. They've just made it difficult for children to access it.Utah law requiring age verification for porn sites remains in effect after judge tosses lawsuitI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "FizzyBeverage",
      "timestamp": "",
      "body": "I worked at an Apple Store Genius Bar during college and after.One thing I will tell you…there is no software mechanism in the world that will stop a healthy, horny teenaged male from looking for pictures of naked women on the internet.End of story.On several occasions I’d have puritanical moms schlepp their 27” iMac into the bar for advice on how to stop Liam or Tyler or Jacob from using VPNs or any other circumvention to see some boobs.They’d just find a new way in, get careless, and leave a stepmom video for mom to find later 😆. A new porn site ahead of the database, Twitter, a new nsfw Reddit, endless choices.It’s like ants at a picnic.It’s gonna happen. His entire world is about seeing boobs or more. Short of putting him on an Amish farm, nothing is gonna stop the hunger.I have 2 daughters. My psychologist wife informs me girls look at porn too, it’s just something you gotta deal with via good parenting and yes,if she’s asking you to get on the pill, that means “mom I’m already fucking my boyfriend I haven’t told you much about, and I want to be safe so you’re not a 44 year old grandma.”Don’t depend on her young and dumb boyfriend to properly use condoms either assuming he even buys them. That’s a snowballs chance in hell.These righties who think their son or daughter is a good kid (because the kid would rather die than tell their uptight parents that they’re screwing) are the ones with the kids having the most unprotected sex."
    },
    {
      "author": "C137-Morty",
      "timestamp": "",
      "body": "Short of putting him on an Amish farmNot even then. A girl churning butter would start lookin hot."
    },
    {
      "author": "Ut_Prosim",
      "timestamp": "",
      "body": "One thing I will tell you… there is no software mechanism in the world that will stop a healthy, horny teenaged male from looking for pictures of naked women on the internet. End of story.Absolutally correct, but more than that, these efforts to block major websites only makes things less safe for kids.First it pushes kids to shadier foreign websites. Yes major companies like pornhub will block a whole state, but I bet mrhardcore.porno.cx or something won't. Who knows what weird shit is on those pages. If it isn't hard core fetish material, it could also be viruses or crypto miners.Second, it could also encourage kids to use alternative tech. VPNs work well, but most reputable ones cost money. The free ones with no size limit are usually sketchy af. At best they're mining your data. You could use tor, but do you really want a teenager looking at porn on tor? Ugh! You could go back to torrenting porn like we did with BearShare in the early 00s, but how many times are the downloaded videos mislabeled (somethings horrific things) or viruses?This bullshit literally makes thingsless safe for kids, while also violating the privacy of adults. Lose / lose."
    },
    {
      "author": "Certainly-Not-A-Bot",
      "timestamp": "",
      "body": "I don't think it's possible to stop kids from finding porn if they want to see it. End of story.I further think this law causes significant online privacy problems because verification requires that you send pictures of your face for AI scanning (no issues with that whatsoever) or sensitive ID documents. It's like the dream scenario for identity thieves.I also don't like the law because it's another one of those dumb \"random citizens can sue a person or company over this law if they want to because it would be illegal for the government to do this\" laws that pretty much ignore all logic, the US constitution, and any sort of objectivity just so that they can avoid the government doing stuff. Democrats really need to pass a law like this in California or New York saying \"if anyone owns a gun, any other citizen can sue them for $10000 for endangering their safety\" so that this nonsense gets declared unconstitutional."
    },
    {
      "author": "2dank4normies",
      "timestamp": "",
      "body": "You can't stop porn. There'snothingyou can do to stop it. It's a fools errand. Nothing at all. You can shut down every porn company in the world and people will make their own.They've just made it difficult for children to access it.I guarantee they haven't. They've probably made it more annoying for older people to access it since they are less tech savvy.This is one of those things you don't allow in your presence as an adult, but stop wasting your time trying to fight an unwinnable battle."
    },
    {
      "author": "blatantspeculation",
      "timestamp": "",
      "body": "Alrighty.I used to be in the camp of \"I dont really care, spunds like a dumb law, but whatever, I'm an adult, it won't effect me\"Then ID based age verification was implemented on VA, and porn sites got divided into two-groups:A) major sites with the resources to implement this policy and the official infrastructure to be held responsible.B) Small sites without those resources or sites already shady enough to be designed for it to be difficult to hold them responsible.Before this new law, A were sites that could and would put effort into keeping illegal content off their site, who would have actual advertisers rather than malware ads, and who could the smallest modicum of effort into seeing performers were treated well.B were sites where you could easily pick up malware, find revenge porn, etc.  Or worse.Now?  Group A complies with the law, requiring ID verification, and B doesn't.  A loses a ton of traffic from people who dont want to hand their ID to a porn company, people who dont consume enough to go through the hassle, and.... people who dont have over 18 IDs.  All of that traffic, 100%, goes to group B.These laws benefit shady companies who prey on performers, risk the safety of their customers, and proliferate illegal content."
    },
    {
      "author": "PurpleSailor",
      "timestamp": "",
      "body": "If parents want it have them install software that filters the web. It's not up to me to have to parent for absent or substandard parenting. Maybe the feds could pay for something for free that people could use."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Performative BS, but they created themselves a nice legal tool allowing the government to make all kind of things difficult to access to “save the children”. If only they were that concerned when it come to guns"
    },
    {
      "author": "MateoCafe",
      "timestamp": "",
      "body": "Would we have to put our ID in to go to all of the site that aren't porn but have porn on it? Like Reddit?Would you trust pretty much any porn site other than the absolute biggest 1 with your personally identifiable data?"
    }
  ]
}