{
  "subreddit": "shoebots",
  "post_id": "gcd1oy",
  "title": "Sneaker Botting MEGA GUIDE",
  "body": "Table of Contents:\n\nFAQ\n\nBasic vocabulary and botting terms\n\nWhere to buy bots and how to avoid being scammed\n\nDifferent types of bots\n\nBot Rentals\n\nCook groups\n\nProxies\n\nServers\n\nCaptchas, harvesters and Gmails\n\nBot restocks\n\nPrivacy and virtual credit cards (VCCs)\n\nJigging\n\n1. Frequently Asked Questions\n\nAre sneaker bots illegal?- Bots are legal but they do break the terms of service of many websites and online retailers. As a result, they have the right to cancel botted orders or ban/blacklist any of your information from making future purchases.\n\nDo I need a paid Cook Group?- A good, paid Cook Group is a must for reselling and botting. It is your #1 resource for everything. Free groups aren't collecting any money to provide paid services so you can't expect nearly as much from a free group as any paid one.\n\nWhat are the costs of botting?- You'll most likely have to pay the resell price for any bot due to nearly every bot being out of stock. You'll also have to pay for a Cook Group each month. Datacenter and Residential proxies would be recommended and a server would also be recommended for the most success. Bot subscriptions and renewal fees may also cost.\n\nIs botting difficult?- Botting is certainly not as easy as many would expect. There are thousands of people who purchase the best bots and continue to experience failure for months. Botting requires time, patience and investment.\n\n2. Terms And Vocabulary\n\nAIO or AIO Bot- \"All in one\", a type of bot that usually supports many sites. For example, Cybersole is an AIO bot that supports many different site types such as Shopify, Footsites, Supreme, and Mesh.\n\nAWS- \"Amazon Web Services\", a virtual server provider. SeeServer.\n\nBrick- A shoe or another item that will not be profitable.\n\nCaptcha- Anti-bot measure that many sites utilize. Usually \"I am not a robot\" and selecting pictures out of a 3x3 grid.\n\nCook Group- Discord or Slack group with botting, sneaker and reselling info and guides.\n\nCop- To buy or purchase something.\n\nDatacenter (DC) Proxies- Faster than residential proxies but easier to be banned by sites. Usually purchased in packs of 10, 25, 50, etc for intervals of 1-30 days of usage.\n\nDelay- Millisecond intervals used on bots. SeeMonitor DelayandRetry Delay\n\nEarly Link (EL)- Links usually provided by Cook Groups that are scraped from the back ends of sites, hand made or given by stores to increase your bots checkout speed. Also helpful for manual users without bots.\n\nFootsites- Footlocker (FTL), Footaction (FTA), Eastbay, Champs. These are all owned by the same company and all the sites function in the same way.\n\nGCS- Google Cloud, a virtual server provider. SeeServer.\n\nGroup Buy (GB)- Exclusive opportunities provided by bots and Cook Groups to purchase out of stock bots, proxies, tools or programs for their retail price or a discount. These are usually limited similar to bot restocks but only people in that Cook Group can go for the product.\n\nKeywords (KWs)- A way that bots can monitor for products on a website, usually used with + and - symbols. For example, \"+air,+jordan,-3,-5\"\n\nMonitor Delay- How often your bot refreshes a page or website to monitor for a new product.\n\nOOS- \"Out of Stock\"\n\nProxies- Virtual IP addresses used to mask mass amounts of requests coming from your bot on one IP address, needed to avoid IP bans. SeeDatacenter (DC) ProxiesandResidential (Resi) Proxies.\n\nResidential (Resi) Proxies- Slower than DC proxies but more reliable on sites with high bot protection. Usually purchased by the gigabyte and function similar to a phone's data plan. More usage uses more data quickly and you will run out. For example, 1gb, 2gb, 4gb plans and they usually expire after 30-60 days depending on the provider.\n\nRetry Delay- How often your bot retries to complete a task after encountering an error.\n\nServer- A virtual computer with good specs and a good connection used to run bots. Usually located in the same location as a websites server that you are botting and the same location as your proxies.\n\nSitelist- A list provided by a Cook Group for each release which mentions every site dropping a certain product with details about each site.\n\nSlots- A service provided by a trustworthy, experienced botter which involves them using your payment information and shipping info to purchase limited items for you, you are usually charged a set Pay After Success (PAS) by them.\n\nWTB- Want to buy.\n\nWTS- Want to sell.\n\nWTT- Want to trade.\n\n3. Where To Buy Bots And How To Avoid Being Scammed\n\nMarketplaces:\n\nTidal\n\nThe Process\n\nIn Tidal and any marketplace, be sure toalwaysuse amiddleman.\n\nThe buyer or seller opens a ticket using the \"-new\" command in the \"ticket-submission\" channel for Tidal for example.\n\nThe other person is added into the ticket by the middleman.\n\nThe seller sends the bot's key and info to the middleman so he can verify it is legit.\n\nThe middleman verifies the bot and tells the buyer to pay the seller.\n\nOnce the seller notifies the middleman that he was paid, the middleman will send the key to the buyer.\n\nWhoever agreed to pay the middleman fees, pays the fees. Usually around $10.\n\nThe ticket is closed.\n\nHow To Avoid Being Scammed\n\nAlwaysuse a middleman no matter what.\n\nNeverdo a deal in the dms.\n\nCheck if the seller/buyer has any legit checks on Twitter.\n\nCheck how many deals they've done.. In Tidal, the number in parenthesis, for example (15), is how many successful deals they've done.\n\n4. Types Of Bots\n\nAIO- All in one bots. Support many site types but may not do amazing on each one they support. Project Destroyer (PD) is an AIO bot that supports Shopify, Mesh, Footsites, Supreme and Demandware. It's Shopify and Mesh is not very good at the moment but they excel at Footsites and Yeezysupply.\n\nShopify- Shopify is an eCommerce platform that many retailers use. Most notably, Kith, Undefeated, Palace, Bodega. Concepts and more. This is arguably the most difficult type of site to bot and the bots that do well are the most expensive.\n\nSupreme- Supreme bots have been around for a long time and the site is relatively easy to bot. There are several popular Supreme only bots such as F3ather, Mek and Velox but some AIO bots also do incredibly well on Supreme.\n\nMesh- Mesh is an EU site type and features sites like Footpatrol and Size?. A very limited amount of bots support Mesh and many that do, don't work.\n\nFootsites- Footlocker, Footaction, Eastbay and Champs. There aren't any footsite only bots and the module is featured in many AIO bots. Payment verification cancels are very heavy on these sites.\n\nDemandware- Demandware sites include YeezySupply and Adidas. These sites are queue based and randomly choose people to get the chance to checkout.\n\nRaffle Bots- Raffle bots are bots used to enter mass amounts of accounts or emails into raffles. Sites like Naked or Footpatrol do raffles for each release and they're nearly impossible to win with one entry. Raffle bots are quite saturated and will require many unique emails, proxies and gmails for captchas. Raffle botting is certainly not for everyone.\n\n5. Bot Rentals\n\nMany bots can be rented out for a fraction of their price for specified intervals. These are usually daily, weekly or monthly rentals. You can find the rental channels for a bot in Tidal.\n\nRenting a Bot\n\nIf you don't have a bot or want to try a new bot, you can rent it out. Renting usually doesn't use a middleman and you don't gain access to the bot's Discord server so your renter has to supply you with any information about updates or guides. The buyer usually pays first and then the renter will send the bot's download link, license key and any guides needed. After your rental period is up, the renter will \"reset\" the key and you will lose it's activation on your computer and he can rebind it to his own.Alwaysmake sure your renter is reputable because it's very easy to get scammed renting a bot.\n\nRenting Out Your Bots\n\nDepending on the bot, the process is relatively simple. You find a reputable, legit renter, they pay, then you send them the guides, key and download link. Firstly, you should make sure that your bot is capable of being rented and is allowed to be rented. You should also be careful that the buyer is legit because they can chargeback the payment or they could possibly crack your key which would get it banned and you lose your key. Renting out your bots for drops you aren't interested in or buying bots for the purpose of renting is a great way to make some passive income each month.\n\n6. Cook Groups\n\nCook Groups are your number one resource for reselling, botting and being able to purchase limited items ranging from shoes and clothes to toys and memorabilia. Most groups will cost you around $40-$60 per month. Unfortunately, like almost everything in this community, almost all groups are limited or out of stock and you'll have to pay resell to join.r/Shoebotsis partnered with House of Carts, a reputable group that's been around for over four years. You can use code 'hocreddit' to secure your spot for a discount of 30% offhere. The most common features of cook groups are support, release information, sitelists, groupbuys, backdoor plugs, restock monitors, social media monitors, early info for releases, local information, and so much more. These are vital to your success.\n\n7. Proxies\n\nProxies are also vital to success and needed for your bots to function. It's recommended to have a plan for Datacenter proxies and Residential proxies each month so you're able to bot any site. Proxies are pasted into your bot's proxy section then they apply to each task that you run. You always want to be running at least a 1:1 task to proxy ratio to minimize bans. It's also recommended to test your proxies speeds and whether they're banned within your bot's tester or a program like FOGLDN.\n\n8. Servers\n\nServers are not necessary but are recommended due to their incredibly fast ping speeds to websites. Running a virtual server in the same location as the website you're botting and the same location as your proxies will yield the highest speeds. Providers like AWS and GCS charge an hourly fee for your server while they are running and can be costly especially if you're running for restocks so dedicated server providers like 10xServers may be ideal for many people. These providers charge a flat rate monthly and you can run your server 24/7.\n\nThe quality of servers generally goes GCS < AWS < Dedicated Provider.\n\nYou can also utilize the promo code 'REDDIT' for 15% off 10xServers each month.\n\n9. Captchas, Harvesters And Gmails\n\nCaptchas are apart of many sites protections against bots. Most bots will have built-in \"Captcha Harvesters\" where you can solve the captchas required to checkout a product. Within these solvers, you can log in to a gmail and apply a proxy as well.\n\nAged, trustworthy Gmails are extremely important because the more \"trustworthy\" a Gmail is, the easier the captchas are and on some sites, you can even receive a \"one-click captcha\" where you don't even have to click any images. Trustworthiness is based on the activity of your Google accounts. These captchas are known as ReCaptcha V2.\n\nOn YeezySupply for example, they have ReCaptcha V3, these are captchas that don't have images but are harvested in the background. Because of this, YeezySupply botting requires many high level V3 score gmails.\n\nTools like AYCD toolbox provide Gmail activity generators which can also be run with proxies to maximize your Gmail scores and gain the best captchas.\n\n10. Bot Restocks\n\nThroughout your research, you'll discover that nearly every bot is out of stock and you're forced to pay resell for them. When bots restock, they often sell out faster than the items they're used to bot, there are thousands of people racing to purchase bots with only 100 or even 1 copy available. Most bots restock via Twitter so it is essential that you have fast Twitter monitors and these are provided through your Cook Group(s). With these monitors you'll have the speed to see the tweet the instant it's posted but you'll also want an autofill or autocheckout extension or software to keep up with everyone else and beat everyone who doesn't have one. The most common are Flow, Fattye and Zenyscripts which can all be found in Tidal or other markets for less than $100. These autofills are also useful for manually purchasing items on Shopify, Supreme and other sites as most people aren't able to fully automate the checkout like you will be able to.\n\n11. Privacy Cards And Virtual Credit Cards (VCCs)\n\nHaving multiple payment methods and addresses is extremely important. Many sites only allow a one per person policy and having different information can help bypass this.Privacyis a service that allows you to link your bank and create virtual credit cards with spending limits easily. Privacy is US only but an alternative is Revolut. Some banks such as Capital One also allow you to create VCCs.\n\n12. Jigging\n\nIf you don't have multiple addresses and names at your disposal, a trick called jigging is what most people use. This is making slight changes to your address that make it seem different but having your items still ship to your address. Some methods are changing \"road\" to \"rd\" or \"lane\" to \"ln\". You can also use the 2nd line to your advantage by adding \"floor 1\" if you live in a house or just adding \"1\". You can even go as far as adding a few random letters or numbers to the beginning of your address, for example, AAAA 123 Southwest Street.\n\nSummary\n\nAlwaysread your bot's manual, guides and Discord channels.\n\nFeel free to ask for help when you have a question or need anything. My DM's are always open.\n\nAlwaysuse a middleman for all transactions.\n\nYou must put in time and effort to be successful.\n\nJoin a cook group.\n\nJoin our Discord serverhereif you have any questions!",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Great response, for everyone else i’d also keep in mind that the best bots are always changing, check how old this comment and post is and do your research to make sure you’re not buying a bot that hasn’t worked in 2 months."
    },
    {
      "author": "FIexOffender",
      "timestamp": "",
      "body": "Great response, for everyone else i’d also keep in mind that the best bots are always changing, check how old this comment and post is and do your research to make sure you’re not buying a bot that hasn’t worked in 2 months."
    },
    {
      "author": "ChromeBones-",
      "timestamp": "",
      "body": "Is this “budget” a one time buy or annually /monthly? Etc? I’m new thanks"
    },
    {
      "author": "FIexOffender",
      "timestamp": "",
      "body": "DM Me if you need any help with anything relating to botting or reselling."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Captchas are solved with what is called a captcha harvester - each uses a gmail and its own proxy. It may be called something different in each bot. I am speaking in regards to project destroyer. That captcha harvester and it’s proxy in theory could solve the captcha for every single task, however you want the ratio of tasks to harvesters to be 10:1 or less on most websites. Your bot developer will give you this info. The task proxy is not the proxy that is used to solve the captcha.IMPORTANT: always use the same proxy (data center proxies are best) with the same gmail. For example proxy 1 goes with gmail 1. Proxy 2 goes with gmail 2. ALWAYS - keep an excel doc with that info. You don’t want captcha thinking you’re using the same gmail on 100 different IP addresses. If it does you certainly will be flagged and never solve a captcha.2. AYCD toolbox is great for warming your gmails - warming refers to increasing their trust score. The program can also test your scores. Or you can just run a test task in your bot and see if it gives you a one click captcha (verify and you’re done/high trust score) or if it keeps saying next, next, next, verify (bad trust score).there are also links online that will test. All of these methods will lower your trust score just a bit."
    },
    {
      "author": "Cbnash22",
      "timestamp": "",
      "body": "Captchas are solved with what is called a captcha harvester - each uses a gmail and its own proxy. It may be called something different in each bot. I am speaking in regards to project destroyer. That captcha harvester and it’s proxy in theory could solve the captcha for every single task, however you want the ratio of tasks to harvesters to be 10:1 or less on most websites. Your bot developer will give you this info. The task proxy is not the proxy that is used to solve the captcha.IMPORTANT: always use the same proxy (data center proxies are best) with the same gmail. For example proxy 1 goes with gmail 1. Proxy 2 goes with gmail 2. ALWAYS - keep an excel doc with that info. You don’t want captcha thinking you’re using the same gmail on 100 different IP addresses. If it does you certainly will be flagged and never solve a captcha.2. AYCD toolbox is great for warming your gmails - warming refers to increasing their trust score. The program can also test your scores. Or you can just run a test task in your bot and see if it gives you a one click captcha (verify and you’re done/high trust score) or if it keeps saying next, next, next, verify (bad trust score).there are also links online that will test. All of these methods will lower your trust score just a bit."
    },
    {
      "author": "Kunchiii",
      "timestamp": "",
      "body": "What’s about Spash Force and just get it yesterday :/"
    },
    {
      "author": "Cbnash22",
      "timestamp": "",
      "body": "This is good stuff. I would also add something about running restocks or how to minimize costs. Six tasks max on Shopify, always be up to date on websites as well, their restock times, security measures, etc.Checking the exchanges to know whether to buy on a whim. For example quick tasks.Being up to date on new supplementary programs like AYCD, etc"
    },
    {
      "author": "JustFloat_",
      "timestamp": "",
      "body": "I am trying to write my own bot, would a cook group be helpful?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Figuring that a lot of people new to this will be here, if you need help with anything please DM me or (preferably) discord .Jacob#7984"
    }
  ]
}