{
  "subreddit": "FAFSA",
  "post_id": "195ik5d",
  "title": "FOUND A LOOPHOLE: No SSN Parent (Married + File Jointly)",
  "body": "My situation: My parents are married and file their taxes jointly. One parent has has SSN, the other one does NOT- they have an ITIN instead.\n\nProblems encountered: No ITIN Field\n\nThe Loophole:\n\nSTUDENT FORM\n\nStart an entirely New FAFSA form, delete the one you might already have by clicking on right hand side \"Edit actions\" -> \"Delete FAFSA Form\".\n\nCreate a new FAFSA form as a Student (from Student's side)\n\nFollow FAFSA form steps, when you get to the Contributor page add the info for BOTH parents (my form said to only fill out the \"Parent who will fill out this form only\" but ignore). Put the parent who has a SSN on the LEFT side as the primary parent (\"Parent who will fill out....\") . Then add the 2nd parent's info on the RIGHT side as the \"Parent spouse\". **In this step there is access to a checkbox \"MY PARENT DOESN'T HAVE A SSN\", click and add ITIN # on the field that appears.\n\nClick on \"Send invite\" for Parent first (LEFT) and then Parent Spouse section (RIGHT). If there is an error, try to maneuver with the spelling and spacing of words. (On my end I got an error for the Parent spouse section so I deleted a space in the last name and cut off the amount of characters). The primary parent (LEFT) must have an account, and be able to accept the invitation on their end (but don't do this yet)\n\nOn the student's side, once both invites have been sent, continue through the steps of filling it out (adding colleges, etc).\n\nOnce you're done filling out the form, the last step will be to review info before signing. Scroll down to the bottom on the \"Parent Spouse\" section and click on blue ITIN field. It will take you to a step where you can add a Phone#, and an ITIN#. After those have been filled out, click on top right corner \"save\" and then \"edit actions\"-> \"review\"\n\nOnce everything has been reviewed (Non Blue Fields can't be filled out) then **SIGN** the form by hitting continue at the very bottom. Once you have signed ~ DO NOT EXIT FORM or click anything yet~ scroll down to the bottom of the page where it will say to \"enter info manually\" and click. (Don't worry on the stuff said right above about the aid you \"won't receive until consent is given\" blah blah)\n\nUpon clicking, the form will take you through a series of steps and make you fill out financials more specifically (adjusted gross income, IRA distributions, etc). Type answers to best of knowledge, but I wouldn't stress since in the next steps the parent will consent, thereby most info will be deleted and retrieved from IRS.\n\nGet to the last step, and it will take you back to a summary form. Hit Save and exit... now for the parent's turn.\n\nON THE PARENT SIDE Parent will:\n\nGet the invitation through email. Login and accept.\n\nGo through the series of review steps to confirm information.\n\nAt the very end, SIGN the form\n\nScreen will Change and message will appear as \"CONGRATULATIONS THE FAFSA FORM IS COMPLETE\"",
  "author": "Jacques_Corvo",
  "comments": [
    {
      "author": "B1ueboat",
      "timestamp": "",
      "body": "An agent told me to try this loophole but tried to get me to do it without starting a completely new form. But it was not successful since I already signed the student section and can't make changes to it.I see that the first step is to delete the form entirely, but I wanted to know if I'm still allowed to delete the form if I already signed the student section?"
    },
    {
      "author": "Dazzling-Special-771",
      "timestamp": "",
      "body": "Hi. Yes, I think you can. I remember doing the FAFSA and deleting it like 10 different times (sometimes with a signature) before finding the loophole and submitting it."
    },
    {
      "author": "SillyGoose_505",
      "timestamp": "",
      "body": "Oh my goodness, you have no idea just how thankful I am for your post!! I've been extremely stressed since the beginning of January due to being consistently hit with the \"Unable to Complete This Action Thanks for your patience\" because the ITIN field wouldn't appear. I wassoclose to just sending in the paper form but I'm so glad I didn't.Stumbling onto your post was the highlight of my day. I was able to finally turn in my FAFSA today!!From the bottom of my heart, thank you so much and God bless!! You're absolutely amazinggg!! 😭💕"
    },
    {
      "author": "Dazzling-Special-771",
      "timestamp": "",
      "body": "Thank you so much!! I'm really happy to hear you were able to submit with no issue.I played around with the FAFSA form for days trying to figure something out since I hadn't heard updates from FAFSA themselves. After I was able to submit my own FAFSA with the loophole, I knew I had to share with others. My hope is that this reaches the people who need it the most.Once again, thank you for the kind words. Your post made MY day! :D"
    },
    {
      "author": "North-Departure8642",
      "timestamp": "",
      "body": "God bless you. i was having so much problems with this"
    },
    {
      "author": "Dazzling-Special-771",
      "timestamp": "",
      "body": "Thank you. Happy you found it helpful!"
    },
    {
      "author": "Temporary_Worker1272",
      "timestamp": "",
      "body": "It didn’t work for me, when I was on the section of adding contributors I clicked “no ssn” and an ITIN# box didn’t appear :("
    },
    {
      "author": "Acceptable-Impact-80",
      "timestamp": "",
      "body": "please help! i followed all the steps, and when i enter my \"parent spouse\" (the one that doesnt have a ssn) and check the box that says \"my parent doesn't have a ssn\", I dont get a field to enter the ITIN. instead, it asks me to fill in the address"
    },
    {
      "author": "TheMightyBeefers",
      "timestamp": "",
      "body": "you are a god send brother!"
    },
    {
      "author": "Jacques_Corvo",
      "timestamp": "",
      "body": "What about ifneitherhas a SSN?"
    }
  ]
}