{
  "subreddit": "artstation",
  "post_id": "1e9032q",
  "title": "ID Verification failed, no reply from support for several weeks. (Pro member here)",
  "body": "Their store requires new ID verification via their app.Although I am sending correct and valid documentation the ID verification fails and I am not getting paid my royalties.\n\nIn my case as I am permanent resident in Japan my documentation is written differently from what I guess is the most common way, so some kind of AI check I assume fails. It seems that the address is most commonly written on the back of the ID card but as I am permanent resident and have not moved it is written on the front of the card.\n\nSo I have sent several requests to support but as usual, getting no replies at all for several weeks now.I am Pro member and they clearly say they offer premium support. This is unfortunately clearly not the case.\n\nIn worst case if I dont get this solved I am getting my whole account deleted as they clearly issue the threat in their site to close all accounts that have not finished the ID verification process. What a joy.\n\nOriginally they said:\"Please finish your seller setup by February 1, 2025.\"\n\nIn addition, they have now pushed the deadline down to September 20, 2024 per their latest email. At this rate I will be kicked out of the site with no reason other than their app failing to recognize edge case such as foreigner living in Japan.",
  "author": "Able-Shoe-7307",
  "comments": [
    {
      "author": "kotelrv",
      "timestamp": "",
      "body": "I'm experiencing a similar situation with ArtStation's ID verification process. Like you, I've encountered issues with the AI not accepting my documents. I've attempted the verification multiple times using valid documentation, but it consistently fails at step 4. The support team did manage to reset the verification process for me, but this has not resolved the fundamental issue.It's incredibly frustrating, especially as I've been waiting for a response from support for over four weeks now, despite being a Pro member, which supposedly offers premium support."
    },
    {
      "author": "yaschancool",
      "timestamp": "",
      "body": "https://www.reddit.com/r/artstation/comments/1dm904n/my_account_is_not_verified_problemCheck this out"
    },
    {
      "author": "Softii88",
      "timestamp": "",
      "body": "Same issue here, since in Belgium they don't put addresses on the ID cards. This is pure discrimination and we should file a class-action lawsuit against them. Totally unacceptable. This way the pull forwards a select few competitors and totally mismanage their position in the industry as lead-platform."
    },
    {
      "author": "yaschancool",
      "timestamp": "",
      "body": "Since now it started working again somehow.. but still not feeling comfortable at all.."
    },
    {
      "author": "kotelrv",
      "timestamp": "",
      "body": "you can find others with the same problem at this link:https://www.reddit.com/r/artstation/comments/1dm904n/my_account_is_not_verified_problem/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button"
    },
    {
      "author": "Knightingale_Mason",
      "timestamp": "",
      "body": "An even bigger question is why would you send your personal information to the EU?They do not have the same protections for your personal info. When a breach happens and your data is stolen, and that WILL happen, they'll say you don't live in their country so you have no case.I closed my shop and website I hosted through ArtStation because of this. What's next? China needs my SSN too? I don't think so. There are plenty of other market places we can sell on.And now the system is not working correctly in the first place? Yeah forget that."
    },
    {
      "author": "RonanMahonArt",
      "timestamp": "",
      "body": "Chiming in with the exact same issue. Stuck on the verification even though it said complete.Dont accept ID without the address in English? Wow... way to lock out most of your european sellers?Tried to login to ArtStation help as a Pro used... which diverted me to an Epicgames url which asked me to log in again which fails... probably because I'm also an Unreal Engine marketplace seller with an epic account... which they probably mashed all credentials together and now the computer is confused.What a mess"
    },
    {
      "author": "Able-Shoe-7307",
      "timestamp": "",
      "body": "I have a similar problem, the problem is still not solved, the support service responds very very slowly - in most cases they say they can't do anything - because it's a third-party serviceHi there,We understand that there are a lot of sellers all over the world affected by this legislation. We are working with our third-party provider and will do the best we can to help our sellers, but at this time there is not so much we can do about it.We will provide you with an update once we have one.Sorry for the inconvenience.ArtStation Support"
    }
  ]
}