{
  "subreddit": "parentalcontrols",
  "post_id": "1ibqy1b",
  "title": "iOS screen time doesn’t have any loopholes",
  "body": "I have a iPad, I don’t have limits on anything except games. I can’t install a bypass limits plug-in cuz it wants me to download three stupid and poorly made mobile games. I can’t turn off screen time with Apple ID cuz configs are enabled, banning me from signing out and also banning me from changing time zone.  Anyone have ideas about how to bypass apple screeen time, I know there should be a way, it is extremely buggy, sometimes showing as time limited, but I can still access the app. And my parents cannot be reasoned with, they are very strict on screen time, only allowing access from 2-4pm.\n\np.s. how to remove the configs???",
  "author": "2004suckmydick",
  "comments": [
    {
      "author": "Amogus314",
      "timestamp": "",
      "body": "I know a bypass, but it'll take a few hours, and it might not even work. I used it on my phone, but you have to be stupidly persistent and desperate if you really want to make it work.Go to settings, general, then scroll all the way downtap on \"reset\",  then \"erase all content and settings\".Enter the password, and from here you can start brute forcing screen time passcodes.I think and hope your screen time passcode is 4 digits, if it's 6, RIP.You do have infinite attempts at this, and if you do succeed, there is a confirmation button I think (or you can cancel the resetting).If you have any questions, please let me knowHowever, this is a very stupid and time consuming brute-force method. Best of luck to you."
    },
    {
      "author": "TheAutisticSlavicBoy",
      "timestamp": "",
      "body": "like 1 try an hour?"
    },
    {
      "author": "Over-Discount5461",
      "timestamp": "",
      "body": "Will this power erase your phone or delete anything?"
    },
    {
      "author": "2004suckmydick",
      "timestamp": "",
      "body": "does it work on ios 18? i tested on ios 17 and under works but idk about ios 18"
    },
    {
      "author": "Horror-Comparison917",
      "timestamp": "",
      "body": "Hey, does this still work? I cant try it because i dont have parental controls myself but my friend does. If he gets through and brute forces the passcode will it reset or will it ask for a confirmation?"
    },
    {
      "author": "Aquaxe05",
      "timestamp": "",
      "body": "https://www.reddit.com/r/parentalcontrols/s/gdj9sjsdkB"
    },
    {
      "author": "rch-out",
      "timestamp": "",
      "body": "I have a loophole for safari and incognito mode"
    },
    {
      "author": "2004suckmydick",
      "timestamp": "",
      "body": "can you share?"
    }
  ]
}