{
  "subreddit": "IRS",
  "post_id": "1ajrd5n",
  "title": "Verified ID with ID.me but am not able to use id verification tool to answer questions about my return?",
  "body": "Why can’t I use the online tool?? I’m SO damned frustrated. I desperately need this return within a normal time frame! Why is my identity in question? Nothing has changed since last year. Same address. Same career. Same phone number. Used TurboTax like I usually do.\n\nWas successful with verifying my ID, so shouldn’t I be able to just finish the process? I’ve not received a letter of any kind and I filed on01/26.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "PaintChipsAreVegan",
      "timestamp": "",
      "body": "2 different verificationsYou need to wait for your letter"
    },
    {
      "author": "pharmucist",
      "timestamp": "",
      "body": "I was unable to use the online tool as well in 2020 when I got the id verify letter. Some people have to go in person, some have to call, and some get to do it online. It all depends on what they are wanting to verify and why. You will get a letter that will tell you if you can do it via phone call or if required to go in person. Most can do it over the phone."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Hi, thank you. I just spoke with a rep who could only tell me that I should wait and see if I get my refund OR a letter. Couldn’t tell me why I needed to verify my ID, or why I couldn’t use the online tool. Useless."
    },
    {
      "author": "Comfortable-Tree4337",
      "timestamp": "",
      "body": "Log onto your I’d.me account go to privacy and security, click on privacy then scroll down below the authentication options and it will show you who you granted access to."
    },
    {
      "author": "wizardbeard0811",
      "timestamp": "",
      "body": "Mines been like this for as long as I can remember, doesn’t mean anything for getting the verification from IRS"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Welcome tor/IRS, the subreddit for taxpayers and tax professionals to discuss everything related to the Internal Revenue Service. We are glad you are here!Here are a few reminders before you get started:Please be respectful of others in the community. We do not tolerate personal attacks or harassment.Be wary of scammers and spammers. The IRS will never contact you via direct message or email. If you receive a message from someone claiming to be from the IRS, do not respond, and report it to the IRS immediately.Direct messaging is forbidden and bannable onr/IRS. If you have a question or need assistance, please post it in the subreddit so that everyone can benefit from the discussion.For more information aboutr/IRSrules, please visit our subreddit wiki:https://www.reddit.com/r/IRS/wiki/index/Link to finding local tax advocate:https://www.irs.gov/advocate/local-taxpayer-advocateWe welcome international users tor/IRS. Please feel free to participate in our discussions, even if you are not a US taxpayer.The moderator team is committed to keepingr/IRSa safe and welcoming community for everyone. We will not tolerate hate speech or discrimination of any kind.If you see something that you think violates our rules, please report it to the moderators. We appreciate your help in keepingr/IRSa positive and productive space.Thank you for your cooperation! We hope you enjoy your time onr/IRS.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Comfortable-Tree4337",
      "timestamp": "",
      "body": "I talked to the irs today, same thing with me even after verifying successfully online Saturday. She said there was no note in my file that a letter was mailed and might not be. It all depends. Go on your I’d.me account and make sure you have them access. It will look like this"
    },
    {
      "author": "DefiThrowaway",
      "timestamp": "",
      "body": "How did you grant them access and where in id.me do you see that?"
    },
    {
      "author": "Comfortable-Tree4337",
      "timestamp": "",
      "body": "And you’re right, but since they access to it you might not need a letter if they can get the information from there. It’s what I was told by the IRS today when I called"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "With the myriad posts about this very topic, wtf am I being downvoted. Who’s the asshole."
    }
  ]
}