{
  "subreddit": "LegalAdviceIndia",
  "post_id": "1hthjkm",
  "title": "Girl married at 12, mother at 13 now 18, stuck in a life of misery",
  "body": "I'm a student nurse, which means I've the least authority in hospital wards. Today I met a girl who is the same age as me (18 years old) admitted in the hospital, her disease was something which should have been treated and her discharge from hospital should have been done days ago but for some reason she has been kept here without any reason since last 20 days. I looked into her case file and while talking to her I asked her and found out:\n\nShe was married at 12 years of age or before that\n\nShe has no age verification document (meaning she could be below 18) {for the note: everyone getting admitted in hospital mostly has age Verifying govt document} I suspect that she doesn't have age verifying document because she isn't actually 18, but her husband faked her age to avoid legal liabilities. (Because she had a child at 13 but her kid is apparently 3 years old, which doesn't make any sense cuz she's 18)\n\nHer husband is 20 years older than her or more ( at least that's what she said, but when I saw her husband he appeared to be in his 50s)\n\nHer husband abuses her her mother in law and father in law torture her by not letting her eat if she talks to her mother or father.\n\nShe's not allowed to visit herfmother and father. And she getsbeatenb by her husband.\n\nHer husband doesn't allow her to work in handicrafts or continue her education in any way fearing she'll \"fall in love with someone else and run away\".\n\n7.Additionally the main reason why she was not allowed to leave hospital was because, She's suicidal and has uncountable scars from SH.\n\nHow can I help her? (The incharge can't help her, because apparently \"we gwt people like them every now and then but we can't possibly help them all\" And its not worth it)\n\nEDIT: I'LL LIKE TO ADD A FEW ADDITIONAL INFO\n\nShe's from a muslim community.\n\nHer husband might actually come tomorrow if I report to police, and if he gets the chance, he'll actually kill her.\n\nHer family doesn't give an f about her.\n\nHer husband had previously had fights with her and choked her (she has scars around her neck, which she claims are from falling down the stairs)\n\nHer husband comes to visit her and picks fights with staff nurses, yesterday he almost beat someone up (this is a female only ward so he made some patients way too uncomfortable)",
  "author": "rhapsodicwallflower",
  "comments": [
    {
      "author": "dr_deadman",
      "timestamp": "",
      "body": "Try contacting NGOs. Be covert probably, since this can escalate and involve you and the hospital as well. And given the attitude of hospital, they probably will throw a hammer on you. And not just 1, tip off multiple NGOs."
    },
    {
      "author": "Sad_Raspberryy",
      "timestamp": "",
      "body": "Thank you but can I tip off anonymously in NGOs?"
    },
    {
      "author": "Tata840",
      "timestamp": "",
      "body": "Reach out to women NGO"
    },
    {
      "author": "Sad_Raspberryy",
      "timestamp": "",
      "body": "Are they India based or State based?"
    },
    {
      "author": "Economy-Inspector-69",
      "timestamp": "",
      "body": "You can try reaching out tou/st_broseph, I've heard he runs an NGO based in Bengaluru, not sure if he can directly help you at your location but he can certainly give you sound advice"
    },
    {
      "author": "AlternativeNo2261",
      "timestamp": "",
      "body": "u/st_broseph"
    },
    {
      "author": "ScoobySnack87",
      "timestamp": "",
      "body": "Hoping there are some NGOs that can take this matter off your hands with the help of specialists. They generally know how to navigate the legal process and have support structures. It is insane how everyone has normalised this throughout India. The weaker you are, the more you are exploited. A female child from a desperate family in a poor neighbourhood is the most vulnerable and often live a life of nightmares."
    },
    {
      "author": "unhealthymuffin",
      "timestamp": "",
      "body": "Can't a pocso case be filed against the man? If she has a child, that means he had sex with her when she was a minor. NGO's should be able to help."
    },
    {
      "author": "Subjectobserver",
      "timestamp": "",
      "body": "Some more NGOs:Childline 1098https://childlineindia.org/a/about/childline-indiaBachpan Bachao Andolanhttps://bba.org.in/CRY - Child Rights and Youhttps://www.cry.org/Save the Children Indiahttps://balrakshabharat.org/"
    },
    {
      "author": "rhapsodicwallflower",
      "timestamp": "",
      "body": "The problem is that the victim has no support + ability + desire to get out of this abusive situation.If you go above and beyond, you may put yourself in harm’s way. This sounds morose, but you cannot help someone who doesn’t want to help themself."
    }
  ]
}