{
  "subreddit": "escaperooms",
  "post_id": "146hyzv",
  "title": "Red door age policies",
  "body": "Can someone explain a little more about it, cause it mentions that anyone younger than 16 needs an adult. On the other hand, it says that anyone younger than 18 needs a waiver. Does this mean that a 15 year old can't participate if there is no adult playing? What if it was only 16 year olds? Would they just send the waiver to their individual parents and wait for them to sign? Also, do they ask for an identification? I want to go with friends but we are all 16 except for one who is 15",
  "author": "kitkat198",
  "comments": [
    {
      "author": "MrCoolguy80",
      "timestamp": "",
      "body": "I would just call ahead and ask.  They likely need someone over 18 for liability."
    },
    {
      "author": "Depressedcarrot67",
      "timestamp": "",
      "body": "I know that a guardian needs to sign a waiver online and stuff like that, but yeah... I guess it's better to call and ask if it'll be okay for the 15 year old and if we need an adult to be present at some point. I'll do that tomorrow, thank you though!"
    },
    {
      "author": "runnerd6",
      "timestamp": "",
      "body": "The waiver has a little check box and signature box from a legal guardian. You can probably just scribble a name in there and be fine. They just need it for insurance purposes."
    },
    {
      "author": "Depressedcarrot67",
      "timestamp": "",
      "body": "Alright, thank you!"
    },
    {
      "author": "LeaderMindless3117",
      "timestamp": "",
      "body": "When going to red door if you are under 16 you need a legal guardian with you. If you are under 18 your legal guardian must go to the website and fill out an adult waiver and then click a box to add a minor and fill out that info. It doesn't matter which guardian does it (or at least the employees didn't care when I went to the one in Oklahoma)"
    },
    {
      "author": "Depressedcarrot67",
      "timestamp": "",
      "body": "Got it, thank you! I' might still call just in case, but I'll see."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I work at an escape room with an age limit (12-17 year olds need to be accompanied by an adult)We do this for 2 reasons:Our rooms are difficult so having someone who is an adult can be handyhealth and safetyliability"
    },
    {
      "author": "MuppetManiac",
      "timestamp": "",
      "body": "Everyone needs a waiver. Anyone under 18 can’t sign a waiver because minors can’t sign legally enforceable contracts, so an adult has to do it for them.I’ve never been asked for ID, but I don’t look like a kid. If your 15 year old friend goes without an adult there is a chance they will be denied entry and there very likely won’t be a refund for their ticket. I wouldn’t risk it."
    },
    {
      "author": "kitkat198",
      "timestamp": "",
      "body": "It honestly depends on the location.  If Red Door states that a parent or adult must be present just call to make sure.  It is likely that they will be fine with it.  Just make sure your friend's parents sign their waiver before you get there"
    }
  ]
}