{
  "subreddit": "EscapefromTarkov",
  "post_id": "92xkbb",
  "title": "Current State of Escape From Tarkov Closed Alpha Test 0.9.1.1610",
  "body": "To begin, I would like to state that I have taken part in many Beta tests (closed, under NDA), and have spent thousands of hours at some point in my life developing games as acharacter texture artistand3d weapon artist. I have been doing so for a while, although I settled as a web developer in the end, my passion still lies with games. As tester now, our job is to use the product, both as intended and not, to discover flaws and bugs within the game, than notify the development team of your discoveries via the Bug Report option.\n\nHere is, according to me, a summary of the beta's current bugs and quirks that have been around mostly for a while, and upset other testers. Everything that happens with development, happens behind closed doors. The team is busy, but in my honest opinion, they should prioritize the bugs listed here, although solutions may be deeper in the works which we simply are unaware of. In either case, my dear fellow testers, please do not loose your patience. It would be silly to grow to hate a game that's in testing stages of development, if you get to that point, you may never see the finished product as objectively as a you should. Take a step back, go play some Arma 3 Exile or something, and let the developers do what it is they do, which is making a game we all love.\n\nCurrent Most Annoying Bugs\n\nAmmo Bug- discovered by many already, submitted by many I would assume, and exposed by streamers, again, fairly sure this has been around for ages.\n\nAmmo Bug - Posted by Pestily on Jul 26, 2018\n\nArmor Bug-I don't have any footage personally, however I have read many comments that may suggest this still exists. I would like Anton or someone (maybe I'll do it with someone and just record the proceedings). I do however know there is currently an issue with the FastMT and LShZ helmet Face Shields and Visors. No ability to utilize either as per in-game button pressing or menu \"Turn on\" option. See here:\n\nRecorded Footage\n\nMagazine Loading Bug-Not sure if it's known or not, however, if you're in the inventory, and you have 1 spare mag on your person, you can start loading it, than right-click on the weapon and select Reload. This will load your still-loading magazine into the weapon. The bullet count will keep going up until max. If the process is interrupted, the count may reset to 0, and then weird shit starts happening. If you unload that mag from the weapon, the animation will play to unload, then loads an invisible mag. If however, you do not interrupt the process, the bullet count will max and the full magazine will be available for you to fire. I recorded a portion of it on a live raid in Customs. Reproduced it countless times.\n\nRecorded Footage\n\nDesync and Performance Issue -The screwed up thing is, we can't really say if it was the game at fault or server performance. We are at the Closed Beta stage, I am not expecting them to shell out any sorts of fortunes on servers, and there may have been someone doing something to it at the time too. They will know what it is, maybe they can share with us, because it's been kinda nuts.\n\nThe thing about this game is - everything is server based, maybe even personal FPS. I have personally seen posts reporting frame drops between squads of a few people to like 5-10FPS. Someone else can elaborate on this perhaps, as I play solo. I personally always notice a difference in FPS (call me crazy, you can try it too) switching between the lowest pinging 4 servers available to me: Beauharnois, QC ~22-25ms,  Washington, DC  ~30ms , St. Louis and Miami, ~45-46 both. It has everything to do with how many people are playing on the current raid, and also the total server population.\n\nAlso, sometimes generally weird stuff happens because of your connection to the server. I am running \"ping -tgoogle.com\" and \"ping -t router.ip\" so I can monitor the quality of my connection whenever I play, you as a tester, can do this too to make sure the problem with whatever stuff that just happened wasn't caused by low connection quality. There are other utilities out there you can use too to perform packet loss testing and pinging. Whatever may have or will happen to you, at least have that assurance that whatever just happened to you as a tester, whatever weird shit just happened in game, wasn't caused by poor connection quality whether it be between you and your router or WAN in that time period.\n\nI myself personally recorded a few videos, so believe me when I say it happens to me too.\n\nDesync/Freeze Post 0.9.0.1582 Patch\n\nMy system specs and hardware verification can be foundin this EFT Forum thread.\n\nThere's thisReddit post too.I've seen more, probably so has the team, and are well aware at this point. Mr. Buyanov is too hands-on not to, since he frequents here too.\n\nIn regards to the issues - Maybe it's something as stupid as servers being overcrowded at certain times of day or the team doing work on them. Bear in mind, BSG is not only the developer but the publisher as well. They are the ones responsible for running the content servers that let you install the game and the launcher development itself. This on it's own takes resources, and keeps their engineers busy. Deploying, testing, maintaining and patching game servers is an animal on its own. It is not feasible for them at this point to spend more resources towards this with us being in a closed beta state.  If this is the case, I completely understand, just let us know. In regards to the various frame drops I have seen videos of and experienced myself. Problem for me in regards to testing is that Afterburner causes my game to crash whenthe frame drops happen, which makes it kinda tough to monitor my resource usage. When the FPS dropped on certain occasions (at random, which it does too, I Alt-Tabbed out to glance at resource manager on a few occasions, and the peculiar thing is - my CPU was at 32%, GPU at 69% and RAM available was 52% (with like 11 Gb page file). So I am not entirely sure this is a local resource issue.\n\nOff-topic; Allow me to get technical and let me explain something to you other beta testers. The team is developing an entirely procedural physics system to pretty much handle everything to deal with weapon handling, recoil, etc. to give us those silky smooth animations/movement affected by physics. I think a good example would be walking speed and rough terrain. If you're walking slower you might not be able to walk up an obstacle whereas increasing your pace, backing up and trying again with momentum will let you keep walking (ie going up to Shoreline Resort). Tarkov is very different from other games in many, many aspects. Most typical FPS games that exist use a separate 1st person view hands and weapon model (some games even fake the feet like this too), then there are the 3rd person animations and models - which the other players see from their perspectives. This is the complete opposite of EFT. There is only one instance. What you see in 1st person, is what happens in 3rd person as well. Arma does this too, and look how wonky it looks, now compare it to EFT.\n\nThey are writing this procedural physics system literally from scratch. This is still mostly uncharted territory for developers. There is a reason other studios did not go this route with their games. This is literally a monumental task. The really complicated thing writing this system is that it has to be extended in a way that will replicate your actions to the server and to other clients, and it needs to do so smoothly. It's one thing to be able to write code, it's another thing to be able to write code that replicates properly from client to server and to other clients. Now, go play EFT in Offline mode, it will run and work great, and you will not encountermostof the bugs you would playing on a server. All the calculations are run locally on your machine.\n\nImagine the game Metro 2033, which runs on  4A Games' proprietary 4A Engine. It's a single-player game. Those devs at some point made the decision not to completely rewrite their engine to be a multiplayer game because writing code that doesn't need to replicate across a client-server structure is a significantly simpler process, especially since it has to run super smooth for multiple players, or they'll come to Reddit and whine and moan. :P\n\nSecond most important thing when it comes to performance is texture streaming, or lack thereof. Our version of Unity does not have it. Which means, all the high quality primo looking textures need to be loaded to RAM/VRAM all the way in the beginning of a raid and managed accordingly throughout. This means not only the world textures, but also item/loot textures, and there is A LOT of item textures. Naturally, BSG optimizes the textures throughout and createLODassets and other methods, utilizing Unity's capabilities to the max. However, they can only do so much this way.I truly hope they considered going with a third-party solution such asGranitefor this.Implementation would be far simpler than writing one, and the programmers can focus on the physics (replication?). This is something I hope Mr. Buyanov has or will consider.\n\nFactory Door Bug- Not posting another link to DDG's video, this is definitely an issue. Unless they are planning on redoing the map or some other reason why fixing this would be a waste of resources, I would do so (by popular consensus) by removing the problematic door (place metal on floor for footsteps or something). Factory is a crucial map to any EFT newcomer, and new testers coming in playing that map might get discouraged from further testing because of some douche exploiting a design flaw with the door physics. Since fixing the design flaw with door physics is not a viable solution, perhaps consider removing that door? Sometimes the easiest solution is the best one.\n\nPlease feel free to post your own quirks/bugs/problems here. Remember, BSG is only a team of 70 in-house devs that are working on:\n\nProprietary Procedural Physics\n\nProprietary Lighting System\n\nVarious Optimizations\n\nNew Content (levels, guns, equipment, sounds, music, etc.)\n\nCheat Prevention\n\nAnd that's just to list a few, the extent of the inner workings of their company can only be guessed by me.\n\nYet they still find time to make quick (perhaps even irrelevant to the final game, think spawn locations) fixes that the testers complain about. Now, to those who think that because these bug(s) exist for a long time and fear that they will never be addressed, I will leave you with this - 100 people cannot build a house in 1 day, but 1 person can build a house in 100 days. The team is 70-strong, there is no overhead publisher calling shots, and Mr. Buyanov is uncompromising in bringing his vision to reality.\n\nEverything I have written here I believe is factual, and any details about BSG, the game or the engine was acquired by readingEscape From Tarkov: Game Tech Overviewarticle and my knowledge as a developer. If you feel I was mistaken about something, please feel free to correct me. Now, what did I miss?",
  "author": "Wizbomb",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "TheDUDE4029",
      "timestamp": "",
      "body": "Great post. I really hope Nikita is able to see this one."
    },
    {
      "author": "evangamer9000",
      "timestamp": "",
      "body": "Automatic firing randomly stops still happens to me all the time :("
    },
    {
      "author": "VizDevBoston",
      "timestamp": "",
      "body": "Something like this wouldn't work out of the box?https://assetstore.unity.com/packages/tools/utilities/world-streamer-36486Asking due to my rudimentary knowledge, and fully expecting a no, but I'm sure I'll learn something from why it's a no. Also this is one of the best and most interesting posts I've ever seen here, thanks for the time spent."
    },
    {
      "author": "Angry__Bull",
      "timestamp": "",
      "body": "Pagingu/trainfender"
    },
    {
      "author": "Fuzzy227",
      "timestamp": "",
      "body": "Wow! dude this is amazing! How long did this post take to make?"
    },
    {
      "author": "Artoritet",
      "timestamp": "",
      "body": "One if the main issues making me uncomfortable is how objects load for you only when you are close. Like when I'm on Interchange and i look at gochan from far away, i see empty hall and see players, when i zoom in all the shelves and other items appear. Or how helmets, armbands and other gear do not load in on player models if they are 20+ meters away. I have killed my teammates several times cause i know they are wearing UN helmet, and then i see this bald head dude, shoot him, my friend says i'm killed, i come closer and UN helmet renders in...Im am very far from tech stuff but sounds like that \"Granite\" stuff you mentioned can fix it? If so i want it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Nicely written and truthful post - 80% upvotes. Welcome to our community, I hope to see more of your posts/comments."
    },
    {
      "author": "Hannibal_Pain",
      "timestamp": "",
      "body": "Great post. Make Tarkov great devs."
    },
    {
      "author": "Wizbomb",
      "timestamp": "",
      "body": "I just hate where armor is currently. This game went from one of my all time favorite realistic shooters to the fucking division overnight. it makes me sad...I remember a 10 man brawl I came out on top off with an SKS and at-least 8 of them had RSASS/Fort. Cant fucking do that anymore.People can play stupid and their armor will protect them."
    }
  ]
}