{
  "subreddit": "OasisVape",
  "post_id": "49zeh5",
  "title": "I am Alex @ BlueCheck - Ask me anything about Age Verification",
  "body": "Update:  Signing off for the night - I'll be around sporadically tomorrow and Sunday (it's SXSW in Austin) but Monday will be back full swing. Thank you all, and if something is pressing, please email me - alex (at) bluecheck (dot) me\n\nHello Reddit! My name is Alex Zeig, and I’m the CEO of Blue Check!\n\nBy now, I think you all know that we are providing age verification on Oasis Vape's website. From what I’ve been told, this has not gone over very well in the community here. After speaking to Malcolm at Oasis Vape, and finding some stuff on Reddit myself, it’s become clear that we have some questions that need to be answered.\n\nSo let's get to it.Transparency is key - especially for a company like BlueCheck.  We're a company asking you to trust us with your private information, so hopefully doing this AMA will help give you a reason to trust us. We want to prove that we have nothing to hide, and that the product we've created is best-in-class.\n\nPlease use this AMA to ask any questions you have about Blue Check, or our technology. If any questions require divulging private company information to answer, I won’t be able to answer them, but I will give as much info as possible as well as explain why I can’t give certain details. Also, I’ll be here for most of the day, and will attempt to answer every single question asked, so don’t be afraid to ask something just because this post is a couple hours old.\n\nHappy Friday",
  "author": "Dee_Ahh",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I see that your employees see and verify the information.  How are employees vetted?Sorry,  but I will never order using this method.  I haven't placed an Oasis order since this started and never will again.  If this becomes industry standard I would DIY or go back to buying from a B&M.I do not trust random employees handling my DOB,  full name and last four digits of my SS number."
    },
    {
      "author": "Giraffesarecool123",
      "timestamp": "",
      "body": "If you don't understand that asking me to hand out my SSN just so I can buy ten dollars of e juice is a bad business practice, you can go fuck yourself"
    },
    {
      "author": "Adach",
      "timestamp": "",
      "body": "you really shouldn't hate on this guy, it's not his regulation, he just is trying to provide a solution. That being said there's no way I'd ever give my ssn and upload a pic of my face+id, you gotta be kidding me"
    },
    {
      "author": "KiteinCloud",
      "timestamp": "",
      "body": "Question from a vendor here!To comply with Texas law, we utilize EVS which ties into the nationally recognized identity check systems (like LexisNexis). Around 75% of the time we get age verification just from the customer's name and billing address. For the remaining 25% that don't verify, simply asking for the customer's date of birth / confirming their billing address allows us to verify. There is a small fraction that do not show up in the system, and that is usually due to the billing address not being up to date.So I guess my question is, why should I go with your solution? Sell me! :)"
    },
    {
      "author": "mflbninja",
      "timestamp": "",
      "body": "Your \"frictionless\" process is costing mtbakervapor.com this customer."
    },
    {
      "author": "MichiganCur",
      "timestamp": "",
      "body": "I agree.   I decided to play the game and give it a shot.   Doesn't seem like it's going to be a \"one time process\" I received my good to go email, purchased then received a more information needed email.   Problem is the email doesn't state what's needed or how to get it to them.   So I replied to the email and they replied saying it was an email saying it was a reminder that more was needed.   Again not saying what was needed.   Now I get an email that says I couldn't be verified.   How's that when they already verified me for a purchase??  At least I already got my Mt Baker vapor purchase...  Sadly might be my last"
    },
    {
      "author": "BlueCheckHelp",
      "timestamp": "",
      "body": "How long have you been business? (As in officially operating?)October 2014, as a Delaware C-CorpHow long have you been providing age verification to the vaping industry?Specific to the vaping industry, about 4 months.  We learned about as the Texas legislation was coming to light, and decided to test the waters.  However, we have been doing identity verification (age as a component of identity) since we started.What is your favorite Will Smith movie?Absolutely love I am Legend – not sure if I like the alternative ending better than the original tho.Do you have a privacy policy? If you do have one, why has it not been publicly displayed?Privacy policy is attached – we are also just about to finish a new privacy policy and TOS specific for this use case, and that will be displayed as a checkbox on the popup that is mandatory for all users.We have been shuffling things around on our website (which is why the documentation is outdated as well) and haven’t had it back up.  I don’t differ with you that it needs to be displayed, and that was not presented well on our end.We’ll be adding it back on our website and to the popup ASAP.Who has access to the information? Who is verifying those that send in photos of them with their ID?BlueCheck employees have access to the information – we manually verify the photos sent in by hand.  No one else has access to the information – even Oasis doesn’t have access to it.  All we pass along is the time of verification, and whether it was a success or not.Why do you require the last four of SSN when others do not?This has been a question that has plagued me for a while! The original goal of BlueCheck was a simple way to verify that the person you were interacting with online was who they said they were.  So the question becomes: What is the easiest, most frictionless way, to verify an identity?I’ve looked at everything from photo recognition to social media mapping to voice verification/biometrics (Dragon API).  Everything always came back with some sort of hitch – either there was hardware required, or it wasn’t a ~100% match on a person, ie: people can create multiple social media profiles, to do biometrics you need a phone or webcam.We always came back to SSN – however as the outcry noted, it’s a big ask!  But it’s the easiest and fastest way to verify identity.The issue, on the other end of the spectrum, is that some people (fin-tech, etc) feel that SSN isn’t valuable enough anymore.  That there have been too many breaches.  So for now, we feel comfortable drawing our line in the sand at SSN (it’s only last 4 btw) and doing extra validation on those we can’t automatically verify.Edit: didn’t answer why others don’t use it?To be honest – I’m not sure.  Most of the laws are pretty clear about what constitutes age verification.The other systems ask for name, age, and address.  But there is no validation that you actually own that information.  How easy would it be for someone to plug in their parent’s information?  Or their older siblings.That’s why we use SSN – easy, quick, and secure.  One time verification of information only you know.What do you do with the information submitted after you verify their age? I know the last 4 digits aren't stored, but what about the rest of the info? Are you keeping it? For what purpose?We do keep the remaining info – because our software is designed to allow the user (you) to easily verify your identity on any site.  So the next time you go through Oasis, you won’t be asked for that information again.  The alternative to not keeping the information would be asking for it every time – which isn’t a great user experience.Additionally, I’d love to know if the other systems keep your information once it’s submitted – and if they sell the data.I have a hunch, but that would be interesting.  Put it this way, I think their business model is radically different than ours.Roughly how many commercial accounts do you provide service for currently?We are currently live at only a couple sites – however we have commitments from a good amount.  At this point, I want to be extremely sure that the accounts I do activate are serviced the hell out of.We’ve had to tell sites “No, not yet” because we knew there were going to be kinks to work out.  And there were.  But every week we get better – and we add new sites.This week, we increased our efficiency by over 75% for automatic verifications – next week, we add “aliases” to our program.  This means that if I enter Bob instead of Robert, our system would still be able to process that automatically.Also, a cool tidbit about our software: Once you’re verified on one site, you’ll never have to go through the initial verification process on another.  So if you become verified on SiteA, and then go to SiteB (uses BlueCheck), you automatically be verified on that site as well.Why have a (dot)me, (dot)co, and a (dot)technology domain?We do different things with different domains – for example, the (dot)co domain is focused on e-cigs/vapes.  But the (dot)me was an older website focused on general identity verification.  The dot(technology) one we haven’t done anything with – but we may.We also have a couple more domains that we may use as more information sites.Why does your Computer and Security person not seem to have any tech background? Self taught?I can only assume you are talking about me (Alex)  First off, I’m a college dropout, so no formal education at that level.  However, I have been in the technology and startup world since 2012, and have been programming way before that.  Additionally, I do some of the programming still, but we do have in-house devs that are extremely talented – we’ll be putting up our “About Us” page soon, and you’ll get to meet the whole team.What are the plans for the 500k in capital? Not trying to be too personal, but if cash is needed, the incentive to sell data is stronger.That website or data is old – we are no longer looking to raise capital.  We recently went through an accelerator and raised $125k as part of it – but at this point, there is no need to raise any additional money.  We will never sell your data!  That’s just not our business model.However the question of what we intended to do with it is great: Signup the entire e-cig/vape market!  We think we have a great product that is suited well for the recent legislative changes.  Our prices are low, our technology is easy to implement, and our support service is exceptional.Who is the GP? You filed the business as an Limited Partnership. MN state law says there must be a GP.We formed the LP for an investor – they wanted it for tax reasons. I believe after this year, we will be able to disband it. BlueCheck is a Delaware C-Corp through and through.  Everyone that engages with or uses BlueCheck software is interacting with BlueCheck Inc.How much of the software was developed in-house?Depends what you mean by software.  All of the critical structure components were developed in-house (API/Verification) – a lot of the front-end/CSS was done by designers, etc.  However, in full disclosure, we have used both Vestigo (for proof of concept in the early days) and Astwellsoft (CSS/website design).  We do not use either of them anymore tho.Again, I’d love to know the answer by the other companies in this space :-)**Why is the blog on your site not functioning? Same question for the email? **Because we have so much going on and the blog was low down on our priority list – same for the old documentation, website, etc.In a couple weeks, we’ll be going live with new website, blog, documentation (already done) and hopefully will shore up those lose ends.Why did you delete your Wix site page? Same goes for the rest of the things you cleaned up. Yes, I caught that. That should of been done after this AMA. For transparency sake. Here is another you missed.)A large part of this conversation stems from old and outdated information – and it makes sense to delete it so we don’t have this confusion every time.There is no intention of hiding it, or not being transparent.  After all the research you’ve put in, I’d be shocked if you didn’t notice that I deleted them. You can probably find them if you do an archived page search.But – transparency is key to what we do at BlueCheck.  I’m more than happy to discuss anything on them with anyone.  Anything that was on the Wix site, or on the fundraising site, was at one point, public knowledge. If you have any questions about any of the old websites or information, please ask and I’ll do my best to answer.Why are your social media accounts not maintained?See answer about so much to do and what brings the best return on time invested.Would you (the users) prefer that we interact on social media more?  It’s clear the Reddit and ECF are pretty big places that we’ll need to invest some time learning and becoming part of the community.Why are/were you using Email Hunter?To find emails.  This is pretty standard."
    },
    {
      "author": "50wpm",
      "timestamp": "",
      "body": "Thank you for answering. Thanks tou/OasisVapefor posting for me.For your computer and network security person, I was referring to someone with the initials SH. I don't want to doxx the person so I won't name them. I can pm you if you need.Also, the last two questions got clipped.Why did you choose \"Let's Encrypt\" (public beta, DV only) for your CA and not opting for an EV from a paid CA? It stands to reason a company offering your services would go for the EV. OV at the very least. You see the irony I'm sure.Are you planning on joiningCASAAandSFTA?Where is the privacy policy? It says it is attached, but I can't find it.I'll be back in a bit for follow up questions. Thank you again for answering."
    },
    {
      "author": "ihatebluecheck",
      "timestamp": "",
      "body": "Blue check does tell you that in order to order anything you need to have the same address on your ID as the mailing address. this is caused me to be unable to order and unable to receive verification from blue check I did not even receive an email within 24 hours letting me know that it would be longer than 24 hours even though the email told me that it would be 12 I hate blue Check made this I'd just for that reason"
    },
    {
      "author": "Dee_Ahh",
      "timestamp": "",
      "body": "I am a bluecheck client. I am desperately trying to reach someone at bluecheck. You aren't answering your calls. You aren't answering your support tickets. You aren't answering your emails.Will someone answer my reddit?"
    }
  ]
}