{
  "subreddit": "Constructedadventures",
  "post_id": "1gavvj1",
  "title": "Help creating an escape room",
  "body": "Hi everyone, I currently work at a school and for a Halloween event we decided to do an escape room for the kids. I am in charge of planning an escape room for my class. The problem is I have never done or planned an escape room before. Can you guys recommend me some good ideas? All help is appreciated. Thank you!\n\nHow many kids: 4-6 at a time\n\nAge range: 4-5th graders\n\nTime length: 15ish minutes.\n\nLocation: classroom",
  "author": "fin_the_destroyer",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hey There! Always happy to help! If you haven't already, please make sure you add in as many parameters as you can including but not limited to:Date, Starting/Ending Location, Potential stops, Number of players, Problem solving capability of players, Potential themes, etc.If you're just getting startedthis blog postis a great place to begin. You can also check out theYoutube channelfor ideas.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Briaaanz",
      "timestamp": "",
      "body": "It's a good idea to come up with a story for the escape room. The story helps guide you into what puzzles to use. So, where are the kids in this fictitious scene, what's the story?What ages are 4th & 5th graders?  A lot of escape room props use recommended age ranges not grades.What kind of props do you have access to?For puzzles: Avoid long cryptograms or puzzles that require a lot of reading. With repeated groups, you'll likely want some time set aside between groups to let you reset the puzzles. Still, you'll want to choose puzzles that can be easily checked and reset between groups."
    },
    {
      "author": "ember3pines",
      "timestamp": "",
      "body": "not OP but 4th and 5th graders are typically 10-12 yrs old depending on their bday in the US."
    },
    {
      "author": "RoxyRockSee",
      "timestamp": "",
      "body": "You could tie it into The Legend of Sleepy Hollow and have the Headless Horseman looking for his head, which is in a locked box. Then pull things from the story to create the puzzles for the lockbox code. Maybe have a picture of a bridge with a certain amount of supports to give you one of the code numbers.Or a witch stole the Halloween treats and they have to find her cauldron, which is in a locked cabinet.There are plenty of ideas on Pinterest or Teachers Pay Teachers.You'll need locks. Ones you can choose the code for are better, but you can also use a bunch of locks and keys.I've seen people use LEGO bricks as an alphabet or code, like one brick is an O, a brick with a square on it is N, and a vertical brick on top of a horizontal one is E, so the answer is ONE."
    },
    {
      "author": "inkzillathevampsquid",
      "timestamp": "",
      "body": "Spend an hour learning about escape rooms and how they work. And while I normally wouldn’t say “google it” you really can find TONS of teacher resources for escape rooms and even purchase them for cheap to download premade for you to just set up. The key is making the environment set up in a space where its clear what is part of the game and what is just the classroom stuff. So see if an empty room can be set up for clarity.And as a “game master” you also need to plan guidance and clues if they get stuck. Its not easy to learn how and then create one so quickly. Especially when you need a break between students to re-set all the puzzles. It can get exhausting so make sure someone is able to help with keep time and resetting up for the next group.My advice (just in this situation) is to buy one online that is meant for students that age and made by teachers. Then you can always change it up or have a template to work from.Also, this might get me downvoted but don’t overlook Chat GPT."
    },
    {
      "author": "gottaplantemall",
      "timestamp": "",
      "body": "ChatGPT can be super handy for this stuff. Helps overcome some brain farts and creative blocks. Even its generation of bad or mediocre ideas gives me something to either realize I don’t want or to build from into something I like."
    },
    {
      "author": "MyPatronusisaPopple",
      "timestamp": "",
      "body": "Get yourself a uv light, uv pen/ink, some locks, and containers. Get a cryptex or number locks. You can use zip ties as make shift chains if your containers don’t have a place for locks or if you have plastic containers you can eye hook screws to hook locks through.Start at the end result first. For example, maybe the kids have to find the antidote to a poison from a mad scientist or one of the teachers have been infected to turn into a zombie. The antidote is in the box with a number lock. You might have the number put on a puzzle and it’s written with uv ink. They have to find the puzzle pieces put it together and get the uv light. Which you may put in the cryptex and have the kids unscramble letters that they find to solve.You just have to make sure that you have enough set dressing so they can spend time also searching. Since it’s Halloween, you may consider hiding keys or clues in play doh or slime.I’ve made a few escape room for kids and teens at my library. Mine average between 10-15 minutes. Make sure to give yourself at least 5 minutes between sessions to reset. Use some hacks to help you for example if I use locks with color, I’ll put a blue key in a blue container or blu play doh. I tell the kids when we are done that everything should stay on the tables. Some kids want to help put stuff back but may mess up where it goes or potentially could jam a lock."
    },
    {
      "author": "MyPatronusisaPopple",
      "timestamp": "",
      "body": "This may help:YouTubeandYouTube"
    },
    {
      "author": "trekgrrl",
      "timestamp": "",
      "body": "I have done many escape rooms and scavenger hunts with puzzles. I takemonthsto create a good, immersive experiences... how are people doing this in mere weeks/days?"
    },
    {
      "author": "fin_the_destroyer",
      "timestamp": "",
      "body": "I made a fun wizarding escape room for my library a couple of years ago (absolutely not Harry Potter themed at all, honest) the story was you were stuck in a classroom and you had to escape before the grouchy caretaker of your wizard school finds you. Two mischievous twins had hidden a bunch of clues that would spell out a phrase that you could give to a living portrait (me in a cardboard picture frame on a stand) and open a secret passage to get out without being caught.A couple of the puzzles the kids enjoyed: I made a wand with a magnet on the end and one of the puzzles was casting a spell to move phoenix ashes and reveal a clue, the phoenix ashes were iron filings and the magnet on the end of the wand shifted them out the way. The ashes were in a photo frame with the clue printed off and placed under them. Later on in the room was a white board with potion mixes written on it, they had to make each of the potions (they were pretty fun to make with food colouring and different ingredients, the favourite was a foaming volcano one) the final potion you had to put your wand in to stir and there was a metal key inside that stuck to the magnet when you pulled the wand out. This opened a padlock on a cool looking wooden box I borrowed from a coworker.There were various other puzzles that involved solving clues and it took 10-15 minutes to solves. Because of the potions it did take a little bit longer to set up in between groups."
    }
  ]
}