{
  "subreddit": "nashville",
  "post_id": "1h1coa7",
  "title": "Federal lawsuit filed against Tennessee’s porn age verification law",
  "body": "NASHVILLE, Tenn. (WKRN) — A federal lawsuit has been filed against a Tennessee law that requires users wanting to access adult content to upload various forms of identification.\n\nA nonprofit known as Free Speech Coalition (FSC) filed the suit in federal court in West Tennessee Tuesday, stating Tennessee’s “Protect Tennessee Minors” Act runs afoul of the First and Fourteenth Amendments, as well as the Supremacy Clause of the U.S. Constitution. FSC was joined by Deep Connection Technologies, Inc., JFF Publications LLC, and a Tennessee adult entertainer known as MelRose Michaels.\n\n“Now, providers are in the untenable position of abiding by the Act’s terms and enduring the constitutional infringement, or violating them and risking ruinous civil and criminal liability,” the suit claims.",
  "author": "xaicvx1986x",
  "comments": [
    {
      "author": "pcm2a",
      "timestamp": "",
      "body": "Sixteen states have already implemented this. I assume a Federal lawsuit would have been filed in all of them. Does anyone know the outcomes? If the courts upheld those state's ability to do this age verification, why would Tennessee be different."
    },
    {
      "author": "UsualForm",
      "timestamp": "",
      "body": "There’s currently a lawsuit over Texas’s that’s about to go to the Supreme Court. If the Supreme Court says it’s a first amendment issue it would basically kill this one along with others (though given the ultra conservative nature of the court as it stands I have my doubts.)That and with this one specifically they reached much farther than the other ones to the point where one could make the argument a lot more strongly that it’s a free speech impingement. But again, with how conservative the courts are in Tennessee I have my doubts."
    },
    {
      "author": "Ok_Protection9126",
      "timestamp": "",
      "body": "Me: uploads photo ID w/ personal information Me: clicks agree Me: carefully considers first search  Me: types in “pegging”"
    },
    {
      "author": "99999999999999999989",
      "timestamp": "",
      "body": "Please welcome Gov. Bill Lee.  Bill, what can you tell us about your new initiative?Thanks.  I'd like to say it will protect kids everywhere.  We are now going to start posting lists of the usernames of those folks who access these sites and the searches they do on these perverted places.  Our first list is one I personally have never heard of and completely have no idea what it is.  But I am assured it is horrible.  It is called 'Pegging'.  And to reiterate, I do not know what that term means or to what it refers.Wow.  'Pegging'.  Sounds weird.  Let's see that list.  First name TNGBL_69.  Hmm.  Can't tell anything about this person from that unfortunately.  But they looked up this 'Pegging' thing 217 of the last 365 days.  Sounds like they are addicted and probably need an intervention."
    },
    {
      "author": "The_Triagnaloid",
      "timestamp": "",
      "body": "Big government only getting bigger under christofascist authoritarianism!!!Good job America"
    },
    {
      "author": "Creative_Ad_8338",
      "timestamp": "",
      "body": "The bigliest."
    },
    {
      "author": "38DDs_Please",
      "timestamp": "",
      "body": "\"Why are you saving videoes on your hard drive? Just stream them!\"WHO'S LAUGHING NOW???"
    },
    {
      "author": "gatorgongitcha",
      "timestamp": "",
      "body": "All I know is Reddit porn about to blow up even more if this stands"
    },
    {
      "author": "TabOverSpaces",
      "timestamp": "",
      "body": "I’m not too familiar with the law or how it’s worded in this state - is it exclusive to sites that only host porn, or does it cover all sites with porn, regardless of what else they offer?If the latter, that could spell some serious issues for Reddit and its user anonymity if the law is upheld."
    },
    {
      "author": "xaicvx1986x",
      "timestamp": "",
      "body": "So people who want a watch porn need show id, but racists can go downtown with mask and no problems at all?"
    }
  ]
}