{
  "subreddit": "privacy",
  "post_id": "17s2mvz",
  "title": "Google asking a passport or ID-card for age verification is just another ploy to collect more personal data",
  "body": "They only need my age. If I gave them my ID-card or passport, there's so much more information on them, including photo, document number, full name, signature, card code, etc... This is excessive.\n\nIf they want to check an age, they could ask me to make a 0,01 cents purchase and check the birth of date through my bank account. This it could be even easier, just check the bank account by the type to verify the age, every minor won't have an adult bank account and every adult won't have a bank account for people below the age of 18. They could even base my age on my past Google purchases.\n\nThere are so many smart ways to maintain anonimity on the internet and only collect the necessary data, but Google: \"Nope, the regulations say we can ask for your passport or ID-card, gimme all the sweet personal data\". This is just another ploy to collect more data than is necessary.",
  "author": "batterydrainer33",
  "comments": [
    {
      "author": "webfork2",
      "timestamp": "",
      "body": "This has been going on for years and is only getting worse with Meta and whatever they're currently calling Twitter.The current and loudest line is that they are claiming it's all to push back against bots and AI accounts.  As you point out, there are many other methods to verify a user is not a bots.  It's all about the user data."
    },
    {
      "author": "sassergaf",
      "timestamp": "",
      "body": "“Increase your security, provide your phone number.”“Save time by using facial recognition to access your account.”“Avoid remembering pins and passwords, authenticate using voice recognition.”“This account uses facial recognition for authentication.”Me: No. No. No. Not signing up."
    },
    {
      "author": "gobitecorn",
      "timestamp": "",
      "body": "Meta/Facebook asked me for my birthdate on Instagram. No Documents. That being said I funnily enough got a passcode sent to my email for a Facebook account that wasn't mine and that I never set up on this email. I want sure if I was tripping so I used the password reset but skipped creating and it said the name of the person who allegedly owned the account and said 'your logging in from an usual location...choose the method below to proceed.' It asked for an upload of an ID. Man if that was me.id just never log into that account again. Unfortunately Google has all my data already cuz I learned to late they were creeps"
    },
    {
      "author": "eidolons",
      "timestamp": "",
      "body": "This is a bit obvious because anything G does is for the purpose of collecting more information.  Frankly, I hope the guy who developed Android got a massive bonus, that he can enjoy while he rots in hell."
    },
    {
      "author": "carrotcypher",
      "timestamp": "",
      "body": "Assuming they need your age, how do you recommend they verify it? Have you ever tried submitting a document with all the other info blacked out?"
    },
    {
      "author": "CannotStopMeOnReddit",
      "timestamp": "",
      "body": "By checking if I am a person who is 18 years or older and bank accounts are often valid ways to do this. You don't need a visual picture and all the other information that comes with it. Even an ID, passport or creditcard can be faked or using another person's card, so there's no point."
    },
    {
      "author": "s3r3ng",
      "timestamp": "",
      "body": "The real goal of the ruling class is to effectively demand KYC to even access the internet and to do client-side scanning to bypass encryption.  Both very logical moves of the control freaks with a lot of evidence in the news that this is what \"they\" want."
    },
    {
      "author": "batterydrainer33",
      "timestamp": "",
      "body": "This is not done by the ruling class but by \"democratic\" politicians and bodies like the EU and OECD. Google wouldn't want to do this shit, neither would banks/FIs, but they're forced to, by the regulators. So go yell at them instead."
    },
    {
      "author": "batterydrainer33",
      "timestamp": "",
      "body": "You can't check a birthday from someone's bank account by charging it as far as I'm aware, and unless Google is really saying it, I doubt they process those documents for wnyrhijg else than what they claim to. They'd be fined and sued in countless ways if they would be doing that."
    }
  ]
}