{
  "subreddit": "Helldivers",
  "post_id": "1cj8sdy",
  "title": "Age Verification to create Sony account",
  "body": "For all of you saying “you can fake everything” and “you don’t need to share any more data than you do to anyone else”",
  "author": "Velo180",
  "comments": [
    {
      "author": "Viruzzz",
      "timestamp": "",
      "body": "This is only a requirement for select countries. The UK and possibly more. Most countries do not have this requirement."
    },
    {
      "author": "Sufficient_Slide_991",
      "timestamp": "",
      "body": "\"Any data used for the verification won't be saved\"Im sure it won't"
    },
    {
      "author": "ASourBean",
      "timestamp": "",
      "body": "No it won’t be, it will be distributed to the highest bidder!"
    },
    {
      "author": "Soul950",
      "timestamp": "",
      "body": "Typo on their part - \"... won't be safe\"*"
    },
    {
      "author": "TH3_F4N4T1C",
      "timestamp": "",
      "body": "Oh that’s sociopathic"
    },
    {
      "author": "BravoWhiskey89",
      "timestamp": "",
      "body": "TikTok should be banned for this."
    },
    {
      "author": "ASourBean",
      "timestamp": "",
      "body": "Worth noting this may be a UK thing, seems to be inconsistent with regards countries"
    },
    {
      "author": "twiz___twat",
      "timestamp": "",
      "body": "i definitely did not have to do this when i made my psn"
    },
    {
      "author": "VoidStareBack",
      "timestamp": "",
      "body": "People have said it seems to be local to the UK and Ireland."
    },
    {
      "author": "Velo180",
      "timestamp": "",
      "body": "\"You'll be taken from out website to Yoti's website\"(One google search later)\"Yoti is a digital identity company that makes it safer for people to prove who they are. We started by empowering people with a free, reusable digital ID app that minimises the data they share with businesses. We now provide verification solutions across the globe, spanning identity verification, age verification, eSigning and authentication.\"Actually the safest way to prove who you are online is by not having to do it at all. The constant push to kill internet anonymity is fucked. I don't remember having to do this for PSN when I made an account years ago, is this new, or region specific?"
    }
  ]
}