{
  "subreddit": "VRchat",
  "post_id": "1j9i7pq",
  "title": "Age verification",
  "body": "If I delete my age verified account can I make a new account and verify that account with the same  id",
  "author": "Shadowraiden",
  "comments": [
    {
      "author": "LizaraRagnaros",
      "timestamp": "",
      "body": "I don't think the average user knows for certain. I'd ask VRC support or check their info page about age verification if there is something about it.as someone else already said ban will lock that ID, but idk if that is because your ID is permanently tied to the account or if that's just because you were banned.I would assume the ID is now permanently tied to the account, because otherwise people with 2 \"strikes\" on their account can just make a new one to reset the counter. for less severe offenses VRC bans twice (1 week, 1 month) before issuing the perma"
    },
    {
      "author": "bunnythistle",
      "timestamp": "",
      "body": "That would be a question for VRChat support. However, their FAQ page does mention that if your account is banned and you later create a new account, they would be able to prevent you from age verifying a new account:Enforce bans: We can check if an ID was previously associated with a banned account, preventing banned users from verifying new accounts with the same ID.However they have also mentioned that in the future they are considering changing it so that you may be able to verify multiple accounts with the same ID:Enable multiple accounts: We can allow users to have more than one verified account using the same ID. Previously, this would have required keeping your full ID data with Persona. While this is not planned for initial launch, we are considering the feedback that you have given us.Source:https://ask.vrchat.com/t/age-verification-faq/28458Of course, it's rather unusual that you would need to delete and make a new account too. If you don't like your username in VRChat you can change it. If you're trying to avoid some people, just block them. If you're trying to get around a block or ban, don't do that."
    },
    {
      "author": "Andreasmeow",
      "timestamp": "",
      "body": "Cute bnnuy pfp uwu"
    },
    {
      "author": "EstidEstiloso",
      "timestamp": "",
      "body": "Good question. It's known that if you are permanently banned from a verified account, you will never be able to verify another account with the same ID.However, what happens if the user voluntarily deletes their verified account entirely, and then creates a new account in the future and tries to verify it with the same ID? Would that be possible?"
    },
    {
      "author": "LigerXT5",
      "timestamp": "",
      "body": "If what I recall from the update posts is still current, it'd be best to do the following.Request your Verified ID to be removed, clearing your ID from the system. Then you can delete your account and start a new one and verify it."
    },
    {
      "author": "dailyflyer",
      "timestamp": "",
      "body": "It is my understanding that you can only age verify one account. If you delete it or lose it you are out of luck going forward."
    },
    {
      "author": "Todayitworksyaknow",
      "timestamp": "",
      "body": "Why delete the account?Remove all your friends and name change"
    },
    {
      "author": "DanES104",
      "timestamp": "",
      "body": "does the note section persist if i remove them from my friendlist? for example they put a note in my account"
    },
    {
      "author": "Shadowraiden",
      "timestamp": "",
      "body": "best to contact support here from what i know the ID is paired to the account permanently."
    }
  ]
}