{
  "subreddit": "AskFeminists",
  "post_id": "1bkyvrt",
  "title": "What are your thoughts on the recent Texas pornhub age verification law?",
  "body": "a decent source on the issue:https://www.statesman.com/story/news/state/2024/03/15/texas-pornhub-blocked-age-verification-law/72976661007/",
  "author": "WillProstitute4Karma",
  "comments": [
    {
      "author": "thepineapplemen",
      "timestamp": "",
      "body": "In an ideal world, there would be an effective way to verify age without it being tracked and your identity associated with it.I’m not sure if that’s even possible. And I don’t think it would be possible really to prevent determined minors from accessing porn via VPNs or using other sites."
    },
    {
      "author": "Opposite-Occasion332",
      "timestamp": "",
      "body": "Also at least imo, minors that areinsexual content, are much more of an issue than minors viewing sexual content. But then again, none of it surprises me considering Texas’ other laws and lack of sex ed!"
    },
    {
      "author": "Pietro-Maximoff",
      "timestamp": "",
      "body": "It won’t really amount to anything - Pornhub is not the only porn site on the Internet, and as long as kids have access to the Internet, they will find porn. A far more ideal solution would be to educate children at an early age about sex and consent, and to actually keep an eye on what kids do online. Give them the tools to navigate the Internet better, as well as an understanding that porn does not equal sex and can be damaging to view it as such."
    },
    {
      "author": "JadeHarley0",
      "timestamp": "",
      "body": "It's just a cynical way to allow the state to surveil people's Internet usage even further.  We have a right to digital privacy especially when it comes to sexual things.  This is absolutely going to be used to target LGBT people and people who are otherwise do not fit into their stupid little patriarchal nuclear family ideal."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Agree and somehow it will miraculously not be targeted to those accessing CP"
    },
    {
      "author": "its_a_gibibyte",
      "timestamp": "",
      "body": "I want to give a perspective from a feminist viewpoint, but only indirectly. This is primarily a free speech issue where the law has a massive chilling effect on legal speech. Also, free speech has been critical for the feminist movement, as the movement has always been about speaking truth to power.There's a temptation to make this issue about pornography and sex work, of which feminists do have a variety of opinions about. However, the core issue is not about pornography, it's about free speech."
    },
    {
      "author": "WillProstitute4Karma",
      "timestamp": "",
      "body": "Exactly.  It is, at it's core, about having people register using government ID through a government monitored system what sort of speech they are consuming."
    },
    {
      "author": "SocialDoki",
      "timestamp": "",
      "body": "More government surveillance is always a bad thing. You can have a debate on whether porn is inherently bad but giving any government entity the keys to the Internet will not improve anyone's life."
    },
    {
      "author": "TheIntrepid",
      "timestamp": "",
      "body": "Well, it won't stop Texans accessing Pornhub for one. They'll just do it through a VPN, which the article you linked highlights. Those who don't want to use a VPN will be happy to note that there are about 5 bajillion porn sites out there, so access to porn won't be at all restricted. There's also the issue that adults who are above the legal age limit aren't going to want to submit very identifying personal ID to a pornsite. People treat those habits as private for a reason, and for anyone who identifies as a part of the LGBTQ+ community, that goes quadruple.Generously assuming this was done with good intentions, it feels like a very 'old person' solution to a problem that they don't really care to understand. Like a group of old people who still think of computers as scary thought that Pornhub wasthepornsite, the only pornsite on the entire internet, and now they've heroically killed the beast. But that's not how any of this works.Underage people accessing pornographic material is a problem, but this was not the solution, and will probably have greater negative effects."
    },
    {
      "author": "WillProstitute4Karma",
      "timestamp": "",
      "body": "I'm curious to see what, if anything, they will do to enforce the law against all the other porn content available."
    }
  ]
}