{
  "subreddit": "AskAnAustralian",
  "post_id": "1glbjag",
  "title": "How do I verify age without compromising identity?",
  "body": "As above, if we're mandating this how will it actually be implemented?",
  "author": "InadmissibleHug",
  "comments": [
    {
      "author": "Kementarii",
      "timestamp": "",
      "body": "Many years ago (when my children were under 16), I taught them that when online, always mangle your date of birth, and name, and keep a few spare email addresses (which didn't include any parts of their real names) to sign up for stuff.Meanwhile, well-meaning governments have always been of the attitude of \"one ID to rule them all\", and link everything, and if your ID is public, and you use your \"real name\" on socials, then you'll be dissuaded from posting \"bad\" things.It will be interesting if I, as an over-60 retiree, need to \"verify my age\", because who's to know that I'm not under 16?Oh, hang on. My reddit account is so old I don't even have an email address attached to it (and I'm reminded to add one every time I log in). I suppose I'll be kicked of the platform soon for not being verified."
    },
    {
      "author": "HobnobbingHumbuggery",
      "timestamp": "",
      "body": "I've been making new accounts with 10 minute mail to try this out. It seems that it's OK - until you private message someone. Then it asks you to verify the email again. That's happened on two accounts I made specifically to try it out with, recently.This account I'm on now used 10 minute mail and so far there are no problems."
    },
    {
      "author": "RantyWildling",
      "timestamp": "",
      "body": "The whole idea is that you need to identify yourself to be on social media.Also makes it easier to find you when you threaten the PM :)"
    },
    {
      "author": "QuantumG",
      "timestamp": "",
      "body": "It's pretty impressive how completely unaware the general public is of the worldwide push to de-anonymize social media, especially considering it has been going on for about 9 years now."
    },
    {
      "author": "Rundallo",
      "timestamp": "",
      "body": "its more fucking \"think of the children\" bs they pulled with vapes. its like labors version of \"sudanese african gangs\" that the LNP like spouting. its a un enforceable law. i will be using a VPN if its passed. might even have to make a new account.  quite frankly this country is a international laughing stock."
    },
    {
      "author": "purplepashy",
      "timestamp": "",
      "body": "What happens to kids who have a parent overseas? Or other family. Will school social media accounts, including compass and dojo, be canned?It is dumb. It won't work. It really is just a push to lock down the internet even more.."
    },
    {
      "author": "Old_Engineer_9176",
      "timestamp": "",
      "body": "In what context ?"
    },
    {
      "author": "GaryTheGuineaPig",
      "timestamp": "",
      "body": "Use a PCUse a VPN, here afreeone to try which is verified as safe.Change location to outside of AustraliaDisable location serviceswindows - privacy - location - allow apps to access your locationChrome - settings - privacy and security - site settings - location - don't allow sites to see your locationFirefox - preferences - privacy - permission - location settings - block new requests"
    },
    {
      "author": "Archon-Toten",
      "timestamp": "",
      "body": "You don't. If any websites bring in verification just leave."
    },
    {
      "author": "InadmissibleHug",
      "timestamp": "",
      "body": "That’s the fun bit, you don’t.I am against it for this reason, to be honest."
    }
  ]
}