{
  "subreddit": "vending",
  "post_id": "1fel6eb",
  "title": "Age Verification for Vape Machines",
  "body": "Hi folks. I would love to get started with some non-food and particularly vape/CBD machines. I saw it mentioned in another thread, and I found and priced out a machine that would offer age verification by scanning driver's licenses and passports. Are age-verifying machines legal in all US states?\n\nI read up a bit on the law in Texas, and it says that the machine has to \"not be accessible\" to someone under age 21, and gives an example of being behind a stall at store. So far I have been thinking about getting in front of local bar owners to place basic glass front machines, with the understanding that the bar is not allowing anyone under age 21 to enter. But if I could put a CBD/Vape machine with age verification outside the motel, that could be a game changer. Does age verification make the machine \"not accessible\" to people under 21 in accordance with Texas Law?\n\nI'd be interested in your thoughts and opinions and will not construe that as legal advice, unless you tell me you are a lawyer :)",
  "author": "Appropriate_Tea_7837",
  "comments": [
    {
      "author": "VendingGuyEthan",
      "timestamp": "",
      "body": "Age verification is key, especially with vape products. In Texas, you’ll need to make sure that the machine isn’t accessible to underage customers, which can be done with ID checks. I’ve been in the vape vending business for years and have dealt with these laws, so feel free to reach out if you need help figuring it out!"
    },
    {
      "author": "costacomo",
      "timestamp": "",
      "body": "Hey there . Check out annovend.com they are US based and their machines come with age verification software. Well priced too. I’ve bought 2 machines from them and super happy."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "trustworthysauce",
      "timestamp": "",
      "body": "Looked those up. The machines look cool, but I wasn't ready to give all my info and request a quote. What is the typical price range for a basic machine?Thanks for the suggestion"
    },
    {
      "author": "Additional_Pain_812",
      "timestamp": "",
      "body": "So l have 18 machines and I think I created the thread you were taking about. You woudint be able to do the hotel idea because it has to be in a place that serves liquor.From what I understand with my network of vape vendors there are many people who “break the law” in Texas and put vape machines in under 21 accessible bars/clubs and never see or face any repercussions. So it’s kinda up to you whether you want to do it or not.If it’s in 21+ locations you don’t need Age Verification and you can profit up to $1000 a month off of it. If it’s under 21 you’d want the Age Verification  just to be safe age verification spots can be just as lucrative as 21+ locations.Please do not make the mistake of buying a Chinese vape machine or convert just a normal glass front snack machine into a vape machine. I can talk about why you wouldn’t want to do that later. Just Pm me l can even hop on call and explain everything in depth if you’d like."
    },
    {
      "author": "trustworthysauce",
      "timestamp": "",
      "body": "Awesome. Thanks for the information and the offer. I may reach out if I go farther down the vape path. One of the websites I was on was selling snack machines by saying they could be used to sell vapes and CBD products in the machine's product description. I would be interested in why that is not a recommended solution. Really appreciate the response."
    },
    {
      "author": "Original-Address-611",
      "timestamp": "",
      "body": "Where are you in Texas"
    },
    {
      "author": "trustworthysauce",
      "timestamp": "",
      "body": "Near Austin, but not in Austin. I have looked into county and city ordinances, but have not found any about tobacco or CBD vending"
    },
    {
      "author": "Appropriate_Tea_7837",
      "timestamp": "",
      "body": "Been thinking the same in Illinois tho. Similar laws too from what I read. Bars is definitely on the radar, but prior to a bar being a bar they’re usually a grill that allows under 21. So that would be a hurdle. But in Illinois every bar has slots that need to be monitored over 21. But also strip clubs!"
    }
  ]
}