{
  "subreddit": "unitedkingdom",
  "post_id": "1k1ge0t",
  "title": "Discord's face scanning age checks 'start of a bigger shift'",
  "body": "",
  "author": "GiftedGeordie",
  "comments": [
    {
      "author": "IsWasMaybeAMefi",
      "timestamp": "",
      "body": "I will not join channels that require my phone number. I have no idea what they will do with that number regardless of what they say.Age scanning? Nope, not happening here. Again, I have no idea what they will do with my data regardless of the fact they say it will be discarded.They don't sayhowit will be discarded, they don't talk about any rolling backups they should have, they don't talk about security - and even if they did I don't trust them.I predominantly use Discord for games I like in Early Access so I can give feedback, upload logs etc. Game devs using these 'tools' means I pass. I cannot be the only one."
    },
    {
      "author": "Willeth",
      "timestamp": "",
      "body": "Living in the UK may make these checks pretty commonplace unfortunately. The Online Safety Act requires \"highly effective age assurance\" if your user-to-user communication service would appeal to children but shouldn't be viewed by them. Video games firmly fall into this category. And there's no standard of \"highly effective\" that doesn't include processing of some kind of personal data."
    },
    {
      "author": "Codeworks",
      "timestamp": "",
      "body": "Reddit will be doing it soon enough. The Online Safety Act is a nightmare and should be scrapped."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Will see if Reddit does it, This law is unworkable."
    },
    {
      "author": "neptune_2k06",
      "timestamp": "",
      "body": "Fuck Ian Russell, because he was unable to supervise his daughter on social media, or just tell her \"no\" until she was a bit older, all British gamers must suffer."
    },
    {
      "author": "OkRecommendation5011",
      "timestamp": "",
      "body": "People will get scammed and doxxed thanks to this, instead of one suicide, he'll have the blood of thousands on his hands."
    },
    {
      "author": "Be-My-Girlfriend",
      "timestamp": "",
      "body": "As much as I understand the reasoning for it and for age restricted servers, I get it, but I hope this isn’t the start of everything needing verification of some sort"
    },
    {
      "author": "No-Adhesiveness-4251",
      "timestamp": "",
      "body": "In my eyes, that seems to be exactly what it is. Coinciding with total AI surveillance of all social media."
    },
    {
      "author": "Zofia-Bosak",
      "timestamp": "",
      "body": "It is what the UK government wants, total control and surveillance of the population, it has nothing to do with protecting youngsters it's all about controlling the population."
    },
    {
      "author": "GiftedGeordie",
      "timestamp": "",
      "body": "OK, I'm someone who regularly uses Discord, I'm nearly 30 and I've genuinely joined a server to see if this face scan comes up and I got nothing, so does this mean that it's just for new accounts or does every single British Discord user have to do this face scan every single time you want to join a server?"
    }
  ]
}