{
  "subreddit": "dlsu",
  "post_id": "190jl4y",
  "title": "Any loopholes for ID?",
  "body": "So I need to find a loophole to last 3 days while I wait for my ID. I thought of using the visitor’s pass without returning it. Are there any other safer loopholes that I can use to enter the school without the use of an ID?",
  "author": "AutoModerator",
  "comments": [
    {
      "author": "bloopboop14",
      "timestamp": "",
      "body": "Bro dont attempt to not return ur gatepass cuz thats a minor offense😭 just show ur eaf since ur a new student"
    },
    {
      "author": "fgoplayermatthew",
      "timestamp": "",
      "body": "Ahhh gotcha I did not know that before thank you for informing"
    },
    {
      "author": "DXNiflheim",
      "timestamp": "",
      "body": "Show that you lost your id and waiting on replacement they'll let u in"
    },
    {
      "author": "YesterdayIndividual7",
      "timestamp": "",
      "body": "Not a loophole because it's officially  advised by the university, but you can just use your EAF and any other ID (national ID, passport, etc.) to get into campus."
    },
    {
      "author": "fgoplayermatthew",
      "timestamp": "",
      "body": "Ohhh there’s no drawbacks to using that method?"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Hiu/fgoplayermatthew! Thank you for your post. This is just a gentle reminder to read our rules located in the sidebar. You can alsocheck the detailed and expanded rules here. If you see any post/comment violating our rules, please don't hesitate to report and/or send us amodmail.If your query is about DLSU guidelines and/or policies, please refer to theStudent Handbook.Please be informed that this sub is not officially managed by DLSU admins. For official announcements, you may check their officialWebsite,Facebook Page, and/orTwitter.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    }
  ]
}