{
  "subreddit": "news",
  "post_id": "1hvhbok",
  "title": "Judge largely blocks Tennessee's porn site age verification law as other states enforce theirs",
  "body": "",
  "author": "Any-Fig3591",
  "comments": [
    {
      "author": "leohat",
      "timestamp": "",
      "body": "This by design.  There is now a disagreement between US court circuits which means it will almost certainly be  heard by SCOTUS."
    },
    {
      "author": "yamirzmmdx",
      "timestamp": "",
      "body": "I didn't put \"porn getting banned inadvertently in the US\" on my bingo card.Man, becoming 2nd rate China pretty much sucks."
    },
    {
      "author": "GayGeekInLeather",
      "timestamp": "",
      "body": "SCOTUS is already ruling on it this term. Lawsuit against the bill in Texas ."
    },
    {
      "author": "IHeartBadCode",
      "timestamp": "",
      "body": "For those wondering, Tennessee's law is different than all the rest of them.  Tennessee is attempting to make it a criminal offense rather than the Government trying to regulate a business.It's this idea that you can toss people into jail for distribution of porn that's got a lot of the federal court system in a tizzy.  If Tennessee was only attempting a Texas ban we'd have a different story.But Tennessee is trying to take the whole porn thing to a new level and there's not many who believe the federal justice system is going to let criminalizing the whole thing stand.Like it's one thing if they were just trying to regulate business, but the notion of tossing people in jail I know that's not going to sit well with Roberts and Kavanaugh, these two are usually anti-new criminal law.Kavanaugh especially as he's got quite the list of opinions he's signed onto that try to limit everyone's attempts to limit free speech.Moody v NetChoice LLC (2024)NRA v Vullo (2024)Lindke v Freed (2024)Counterman v. Colorado (2023) - This one especiallyI mean he even signed on to Ashcroft v ACLU for the ACLU in the Court of Appeals for the Third Circuit, indicating that COPA (the Child Online Protection Act) was likely a substantial over-breadth that violated the first amendment.So even if this makes it to SCOTUS, the current composition of SCOTUS does NOT assure this to be the slam dunk that some think it will be.  The current Justices are really hesitant to grant anyone brand new criminality power.  Kavanaugh signed on to the denial of Texas' abortion travel ban.  He was not cool with Texas getting a brand new criminal power.The Justices don't seem to have problems with allowing States brand new regulatory power over businesses, but brand new criminality like Tennessee's law attempts is perhaps a line too far for the majority to cross.  This may be their limit on how much they'll bend over for conservatives.But it is important that everyone notes that Tennessee's law is very different than the other ones that have come out from other states."
    },
    {
      "author": "rainbowgeoff",
      "timestamp": "",
      "body": "Great write up. Only thing I'd add is that the threat of criminal sanction would solve any potential standing issue."
    },
    {
      "author": "Metalgrowler",
      "timestamp": "",
      "body": "People realize that this will be ultimately be used to get rid of any anonymity on the internet right?"
    },
    {
      "author": "SweetLenore",
      "timestamp": "",
      "body": "People are stupid so no, they don't get that."
    },
    {
      "author": "fluffynuckels",
      "timestamp": "",
      "body": "But think about the children who might see a tit"
    },
    {
      "author": "kandoras",
      "timestamp": "",
      "body": "The judge also said the impact could be overly broad, potentially affecting other plaintiffs such as an online educational platform focused on sexual wellness.I'm pretty sure that was the actual point of the law.  Conservatives define the basic existence of LGBT people to be sexual, so this law was just another step towards erasing them by making it illegal for a website to mention them without first checking a viewer's driver's license."
    },
    {
      "author": "Any-Fig3591",
      "timestamp": "",
      "body": "You think we have sexually frustrated incels now just wait till they can’t bate no more"
    }
  ]
}