{
  "subreddit": "undertheoaktreebook",
  "post_id": "ud5xvu",
  "title": "DETAILED step-by-step age verification guide for Ridibooks.",
  "body": "I apologize if this has been posted already. I’m attempting to complete my age verification form but I’m a bit slow and am having trouble understanding the guides that have been linked on older posts. Are there any guides out there with very clear instructions on how exactly to enter the info on the site?",
  "author": "EveningResearch9435",
  "comments": [
    {
      "author": "harukafano",
      "timestamp": "",
      "body": "This is in the new members post but I used this info and it worked for mehttps://onedrive.live.com/view.aspx?resid=7CBF2634A0BC0D7F!958&ithint=file%2cdocx&authkey=!AB_rvTOCK_cu5NMAlso, you don't get an email to say that everything has been verified, just check back later and look for UTOT and you'll see you can access it, maybe 24 hours"
    },
    {
      "author": "BootyBooty-BumBum",
      "timestamp": "",
      "body": "Thank you!"
    },
    {
      "author": "Apart-Potato2058",
      "timestamp": "",
      "body": "I wanna ask if I have the ticket, how to submit it?"
    },
    {
      "author": "malkuuusha",
      "timestamp": "",
      "body": "I know that it’s been 2 years, but maybe I’ll get a reply. What if I got a confirmation letter that I’ve been verified, but nothing changed and I still have no access to 18+ content? I already signed out and signed in, and cleared site’s cash. But still no access. Should I just wait?"
    },
    {
      "author": "nutella_dxpped",
      "timestamp": "",
      "body": "I'm desperately in need of help, actually I don't know Korean(language) but there's this bk which got picked up by Rain of Snow translation \"your outrage R19\" I want to read it so badly but since the og publisher is ridibooks so I'm unable to read it :/ any help would be sincerely appreciated"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Middle-Ad3709",
      "timestamp": "",
      "body": "what does 6 digits of births mean like I mean I've been trying my birthday but still doest work"
    },
    {
      "author": "Xaixyla",
      "timestamp": "",
      "body": "Please if you know tell me"
    },
    {
      "author": "Last_Front5446",
      "timestamp": "",
      "body": "Hi I know it’s been a while for this post but it’s time for me to renew my RIDI license I have the same problem did you find out how to do it please? it asking for 6 digit of birth and then a different box with one number only im not sure what to type in there I’ve tried to many different ways but didn’t work"
    },
    {
      "author": "EveningResearch9435",
      "timestamp": "",
      "body": "If you were born on October 14,1995…. It’s 951014"
    }
  ]
}