{
  "subreddit": "FAFSA",
  "post_id": "1cgxt4p",
  "title": "Parents without FSA ID verification restrictions lifted temporarily!!!",
  "body": "The FSA Department is temporarily allowing individuals without an SSN to enter and complete the 2024-25 FAFSA. Students and contributors without an SSN must continue to manually enter their tax information. Students without an SSN must verify their eligible noncitizen status through their school before they receive any federal funds.\n\nhttps://fsapartners.ed.gov/knowledge-center/library/electronic-announcements/2024-04-30/update-access-2024-25-fafsa-form-individuals-without-social-security-number\n\nContributors without an SSN will not have to wait to have their identity validation completed before they can use their account username and password to access and complete the online 2024-25 FAFSA form.\n\nUpdate: It you’re having issues with parent not getting the invite from you, please refer to a comment I have made on this post.",
  "author": "Excellent-Size669",
  "comments": [
    {
      "author": "Honest_Mousse7065",
      "timestamp": "",
      "body": "I just needed my mom's signature and I submitted it today."
    },
    {
      "author": "PinkkRosa",
      "timestamp": "",
      "body": "Wait really?!! cause oh my goodness I’ve been waiting for a whole month to get my mom verified 😭"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "SeriouslyDecent",
      "timestamp": "",
      "body": "so i sent the invtie to contribute info to my fafsa but my mom keeps on getting a blank page that says \"requested URL cannot be found\" so ive given up on waiting for this to be fixed and am currently filling out an in paper fafsa form instead 🤷 idk what else to do-edit!-I FINALLY GOT IT SUBMITTED!!!!!!! so i deleted my fafsa application and my mom started and invited me to the application rather than me inviting her, filled everything out and signed, invited me and i filled out what i needed and signed. BOOM submitted. idk if it would work for everyone but it worked for me"
    },
    {
      "author": "Few-Reward9899",
      "timestamp": "",
      "body": "every single person at FSA should fired for the horrible roll-out of this FAFSA."
    },
    {
      "author": "Lost_Cardiologist518",
      "timestamp": "",
      "body": "Ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhghhh finally"
    },
    {
      "author": "RJ_The_Avatar",
      "timestamp": "",
      "body": "Right?!?! It only took them 4 months to realize the chaos they were causing."
    },
    {
      "author": "WestAd6374",
      "timestamp": "",
      "body": "I have the issue that my when my mom log into her accound, she does not see the contributor invitation and I have not been able to complete the form. My dad did not had any issue with that."
    },
    {
      "author": "Excellent-Size669",
      "timestamp": "",
      "body": "currently struggling right now. I can't invite my parent because is says URL cannot be found and the option for them to start a form is unavailable as well. What can i do now?"
    }
  ]
}