{
  "subreddit": "privacy",
  "post_id": "x9w9rg",
  "title": "Appeal against EU’s new age verification policy?",
  "body": "Apologies if something like this has been already posted, I searched here, and all over the internet and couldn’t find anything (or maybe my skills are just limited…).\n\nAs age verification is a thing now in Europe and more and more people experience the scary dilemma as to whether to share their ID/credit card details with privately owned companies (where who knows what happens with their personal data), or get involved in illegal activity such as faking ID documents (so all the features are still accessible as opposed to the currently available bypassing methods) - I was wondering if there’s any “movement” that has already been started to reverse this policy. I am not against the safety of kids of course, but in my opinion (and possibly many others) it should be enforced trough parental restrictions (for which there are already plenty of solutions out there) instead of forcing people to give up sensitive information and data to third parties.\n\nTL;DR: I am looking for the people or place that has already started an appeal against this policy to stop the enforcement of sharing sensitive information and data with private companies.",
  "author": "Dudetterina",
  "comments": [
    {
      "author": "Frosty-Cell",
      "timestamp": "",
      "body": "Not aware of anything as of yet. The law is arguably illegal since the govt interferes with the right to freedom of information. I think it took 8 years to get rid of the data retention directive. It's entirely possible the mass-surveillance and blocking will force people to VPN into the US."
    },
    {
      "author": "Dudetterina",
      "timestamp": "",
      "body": "unfortunately VPN no longer works with youtube 😞 and of course youtube implemented ID and credit card verification ASAP. Google’s dream has come true finally ☹️"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What? Europe starting to do the same thing as China? How sad."
    },
    {
      "author": "Dudetterina",
      "timestamp": "",
      "body": "I think it’s even worse. Basically data collection is now legal for even private companies 🙁"
    }
  ]
}