{
  "subreddit": "canada",
  "post_id": "1bzzrsx",
  "title": "Opinion: Requiring age-verification for porn won’t save children from online harm. But it will invade our privacy",
  "body": "",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I've been lying about my age online since I was 105!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Parents! Supervise your own damn kids, please."
    },
    {
      "author": "glx89",
      "timestamp": "",
      "body": "You misunderstand.These \"moral panic\" folks aren't trying to control their kids.They're trying to controlyours."
    },
    {
      "author": "dualwield42",
      "timestamp": "",
      "body": "Or just raise well-adjusted, educated kids. Most of us could easily access all the explicit materials we wanted as teens, but that doesn't mean we were just locked in our bedroom obsessing over it."
    },
    {
      "author": "BeautifulWhole7466",
      "timestamp": "",
      "body": "Instagram/snapchat/ tiktok will still be posting sexual content with links to the actual stuff"
    },
    {
      "author": "leekee_bum",
      "timestamp": "",
      "body": "Not even borderline stuff sometimes too. It's always on pages with huge follow counts and ones that I actually liked for the original content too. I unfollowed \"mechanicmemes\" on Instagram recently because it got so bad.Was a post of an onlyfans girl straight up giving a blow job with tits out and all."
    },
    {
      "author": "Jacob666",
      "timestamp": "",
      "body": "It also will only prevent them from visiting porn sites that operate in Canada. Those outside of Canada won't be required to do anything at all.  The author of this bill even stated in an interview that she knows it won't be effective for kids over the age of 10, cuz they will be smart enough to circumvent the protections."
    },
    {
      "author": "lubeskystalker",
      "timestamp": "",
      "body": "That's not an opinion, it's a fact!"
    },
    {
      "author": "WintermuteTOR",
      "timestamp": "",
      "body": "I honestly can't believe this is a thing we are talking about in Canada in 2024. I'm so massively disappointed in this country."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}