{
  "subreddit": "patreon",
  "post_id": "18of10m",
  "title": "Is Jumio safe?",
  "body": "I received a message today from Patreon asking me to scan my face with my documents using this specific service called Jumio. I didn't find any information about them on the internet just positive things, like how safe it is and how they will delete your pictures and documents afterwards. I find it super-dodgy and probably your face will be stored on some servers forever. Did anyone of you do it? Aren't you scared your documents and data will leak + if other start to use this service your profile will be linked to different accounts?",
  "author": "NinaPinkova",
  "comments": [
    {
      "author": "mhunt0",
      "timestamp": "",
      "body": "I don't do NSFW material anymore because of that, safe or not."
    },
    {
      "author": "ScarletBlond",
      "timestamp": "",
      "body": "Yeah, Jumio are quite well known in the ID verification area. Face scanning and document verification are very commonplace these days, so we just have to get used to it and hope they are as secure as they say.."
    },
    {
      "author": "NinaPinkova",
      "timestamp": "",
      "body": "I see, but the trick is that they want age verification but the method they use will basically reveal all the information about me to them. That's why I think they just want to have a database of all people who do NSFW content or something. Especially later when you travel in the future I think different governments will have access to this information."
    },
    {
      "author": "NinaPinkova",
      "timestamp": "",
      "body": "Thank U for your replies! I have a week to decide and then I will get suspended."
    },
    {
      "author": "gordobabosoFF",
      "timestamp": "",
      "body": "Your only other alternative is to remove all NSFW content from your Patreon, and make it a Safe For Everyone profile, afaik* there's no need for verification in that case.. But of course that might impact your earnings..[*as far as I know]"
    },
    {
      "author": "gordobabosoFF",
      "timestamp": "",
      "body": "I did the Jumio verification, because times are tough, and I'm trying to build up my Patreon subs to earn $s for my story-writing and picture creation..Sure there's an unknowable risk of leaks / hacks / exposure, but I'm self-employed and nothing I put on my Patreon is illegal* in anyway, there's just pics of fictional adult nudity and weight-gain stories.. So, yeah, at worst it might be a little bit embarrassing for me if leaked.. YMMV..(*at least not in the US nor in my own country.. I expect that nudity is illegal in various mad theocracies around the world, but I won't be visiting those countries *ever*.)"
    },
    {
      "author": "NinaPinkova",
      "timestamp": "",
      "body": "... sadly I was born in a country like that and currently I had to move to a country where all nudity is banned by law just to escape being drafted in my home country. In that case Patreon should openly state that their Jumio policy works only in certain countries to avoid future problems."
    }
  ]
}