{
  "subreddit": "Instagram",
  "post_id": "ur1sfm",
  "title": "Have anyone got problems with the \"Verify your age\"?",
  "body": "Two days ago I got asked by Instagram to put my age on the app for later to find myself blocked from using instagram because \"I may not be old enough to use instagram\" so I need to send them some sort of identification to prove I'm that age. But here is the real problem. After I get redirected and fill all my info + a photo of my ID, I get a message stating \"Sorry, you cannot confirm your identity right now. Please try again in 24-36 hours\". It's been 2 days and it keeps giving me this message. Has anyone had this problem and found a solution?",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "For me I already added the info before pop up to prevent it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I think there is a fair few people, myself included. Appeal Form keeps doing same to me."
    },
    {
      "author": "Angiemarie23",
      "timestamp": "",
      "body": "Mine is saying the exact same thing since Saturday , I press send and it pops up please try again in 12-36 hours. I can’t even find anywhere to even email the help centre"
    },
    {
      "author": "unpopularopinion0",
      "timestamp": "",
      "body": "yes. fuck them. assholes. we had to fill out our ages when we first started. this is complete bullshit."
    },
    {
      "author": "heavypiff",
      "timestamp": "",
      "body": "Same problem here, can’t get past the 24 to 36 hour pop up. Also had this happen over the weekend."
    },
    {
      "author": "drwphoto",
      "timestamp": "",
      "body": "Same, with an account that's over 11 years old.But since the platform is nearly 50% adverts now, I don't use it much anymore. If Meta was looking for a means to put the final nail in the coffin, then they accomplished it."
    },
    {
      "author": "These-Comparison-214",
      "timestamp": "",
      "body": "Mine started on Friday, sent about 4 appeals and I just got back into my account today."
    },
    {
      "author": "Professional_Air4619",
      "timestamp": "",
      "body": "Did you got any mail after you sent appeal? If yes, what did it say?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Are you old enough? Why would they think you’re not?"
    }
  ]
}