{
  "subreddit": "australian",
  "post_id": "1cvckpr",
  "title": "How age verification laws could affect you, no matter how old you are",
  "body": "",
  "author": "Nostonica",
  "comments": [
    {
      "author": "GreenTicket1852",
      "timestamp": "",
      "body": "Why not. Permission to access points with that permission linked to your DigitalID sitting in a single large data honey trap for the world to target. /sVPN and Private DNS. Simple solutions to ever increasing bureaucratic inertia."
    },
    {
      "author": "ThroughTheHoops",
      "timestamp": "",
      "body": "The number of ways this will prove both ineffective and dangerous is huge. Sat this morning with my GF and we came up with half a dozen each without thinking too hard about it.Yet another terrible idea that will solve nothing."
    },
    {
      "author": "Basic-Tangerine9908",
      "timestamp": "",
      "body": "It also relies on websites to  sign up voluntary to the age check. 99% of pornsites are overseas.So that wont be happninghttps://digitalrightswatch.org.au/2023/08/31/campaign-win-against-age-verification/"
    },
    {
      "author": "LuckyErro",
      "timestamp": "",
      "body": "\"the eSafety commissioner has cited research that a quarter of all Australian internet users have VPN technology in place.\"Expect that figure to double over the next 5 years with no added privacy intrusion by the gov anyways means this is just a waste of taxpayers money and an invasion of our privacy laws."
    },
    {
      "author": "Jrad27",
      "timestamp": "",
      "body": "Govern me harder, Daddy."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Will Australia blacklist and censor non complying websites?"
    },
    {
      "author": "Ardeet",
      "timestamp": "",
      "body": "I’m guessing they’ll give it a crack and if they don’t get what they want we may see more laws or amendments."
    },
    {
      "author": "locri",
      "timestamp": "",
      "body": "My \"run by idiots\" feeling flared again, you're right, how do they enforce this?Can anyone else remember high school legal studies and tell me about unenforceable laws?Or are they going to fire wall the internet as if the pirate bay dns thing didn't cause a scandal. Can those guys find a different way to retire?"
    },
    {
      "author": "snex1337",
      "timestamp": "",
      "body": "This is a joke. Why does our government continuously try and take our rights away. They already look at all our metadata."
    },
    {
      "author": "Nostonica",
      "timestamp": "",
      "body": "This is gold for any company that does advertising, imagine having a 18+ site and been able to say that any ads for Australians are 100% real adults viewing them."
    }
  ]
}