{
  "subreddit": "privacy",
  "post_id": "1d2ymvn",
  "title": "Opinion: The age California verification law AB 3080 is poised sail past the senate and Governor's desk, becoming law. Requiring websites to collect a user's government issued ID to access adult websites.",
  "body": "If you're unaware of the growing spat of age verification laws across the country, several states in short order have begun passing laws requiring websites to demand a user's government issued ID to access adult websites online, sacrificing the privacy rights of millions of Americans in exchange for shifting the burden of managing a child's internet access from the parent to everyone else.\n\nI just called my state assembly rep. and senator voicing my strong opposition, and from the receptionists' reaction like seemed like mine was the very first time anyone has bothered to contact them about this bill.\n\nThe California state assembly has already voted with the bill having zero votes against it, and Newsom has recently approved a similar 'protect the children' law in AB 2273 Age-Appropriate Design Code Act.\n\nIf you care about privacy rights or are against this bill in general and live in California thenI encourage you to find your representatives and give them a call (prioritize contact senators, as it's already past assembly without opposition). Politicians know that it takes a lot to get the average person to call, so it's what makes the most difference to stopping these heavy-handed measures, and it only takes a minute.https://findyourrep.legislature.ca.gov/.",
  "author": "tempreffunnynumber",
  "comments": [
    {
      "author": "Training-Ad-4178",
      "timestamp": "",
      "body": "like teenagers are gonna have to use fake ids to upload to pornhub now?that's an insurmountable obstacle /swill the uploads be checked against any kind of database I wondersuddenly ca would have a long perv list (/s) at its disposal"
    },
    {
      "author": "Training-Ad-4178",
      "timestamp": "",
      "body": "ohh, theminordatabase lmaothis will never ever work"
    },
    {
      "author": "RaisinProfessional14",
      "timestamp": "",
      "body": "I never understood obscenity laws. There's literally caveman-drawn porn. It's that old."
    },
    {
      "author": "Jmich96",
      "timestamp": "",
      "body": "Government enforced data collection, \"to protect the children\".Before this, failed attempts were for things such as \"the war on drugs\" and \"terrorism\"."
    },
    {
      "author": "Here2Derp",
      "timestamp": "",
      "body": "To quote Mayor Quimby \"Again? This stupid country!\""
    },
    {
      "author": "you_can_not_see_me",
      "timestamp": "",
      "body": "just curious, as a non american, what if the servers are based in EU / Asia?  do the companies not need to do anything, or are americans going to be geo-blocked?"
    },
    {
      "author": "GuySmileyIncognito",
      "timestamp": "",
      "body": "The people that pass these laws have zero idea how the internet actually works or what application of their dumb laws actually means. There won't be geo blocking or anything that intricate and there will be a large uptick in VPN sales."
    },
    {
      "author": "AtlanticPortal",
      "timestamp": "",
      "body": "I guess Pornhub will keep blocking users from States that will demand such idiocy."
    },
    {
      "author": "SqueezyCheesyPizza",
      "timestamp": "",
      "body": "Fuck giving the government or the corporations my real name and ID so they can make a list with me and all the weird fetish porn I jack off to."
    },
    {
      "author": "tempreffunnynumber",
      "timestamp": "",
      "body": "Fuck that. It's gonna be another fucked up spending project with zero accountability. These people that implement the tech behind these things need to die first.Not to mention the kids would just take their parent's id and access the sites anyway."
    }
  ]
}