{
  "subreddit": "google",
  "post_id": "16azpfu",
  "title": "I got an email to verify my age of lose my gmail",
  "body": "I had my gmail account for over 20 years, surely I can’t be under 13? What to do now? Literally my entire life is there, in my emails (20+ years). I know they want my data and I am not happy, it will link me with all my search history etc. Just so unfair. If I choose not to give them my personal info, is there any chance I can preserve my emails (upload them to another account)",
  "author": "Buck_Thorn",
  "comments": [
    {
      "author": "g0ing_postal",
      "timestamp": "",
      "body": "Are you sure it's legit from Google and not a scam?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What?"
    },
    {
      "author": "boringalex",
      "timestamp": "",
      "body": "Indeed."
    },
    {
      "author": "BrisingrReborn",
      "timestamp": "",
      "body": "Literally my entire life is there, in my emails (20+ years). I know they want my data and I am not happy, it will link me with all my search history etc. Just so unfair.Bro what. You already said they have all your data. So they already have your name, billing address etc. What's your license going to give them that they dont already have?edit: and yeah like other commenters are saying, are you sure its a real email from Google?"
    },
    {
      "author": "DownvoteOrUpvote",
      "timestamp": "",
      "body": "Could this be what you got?https://support.google.com/accounts/answer/1333913?hl=en&sjid=3345969416564420519-NA"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Don't click on any links in your email. Use the menu options above to navigate to your account and verify your ID from there (if it's legit)."
    },
    {
      "author": "EnolaGayFallout",
      "timestamp": "",
      "body": "I wonder what you searched"
    },
    {
      "author": "verpejas",
      "timestamp": "",
      "body": "Just upload the front of your id to them (verify the link and sender is legit) and you won't have any issues.Seeing how google randomly flags newborn pictures for medical reasons etc. as policy violation, I am doing a monthly google takeout, just in case."
    },
    {
      "author": "Buck_Thorn",
      "timestamp": "",
      "body": "I found this:With that said, Google, at times, can misjudge your profile if it happens to stumble upon something fishy. If you know you’re clean and haven’t been messing around anytime lately, keep reading to learn how to confirm your age in Gmail to avoid losing your account. We’ll be sure to implement the instructions in an easy-to-grasp format.Recently, Google has started to send notifications on Android phones to verify age.How to confirm your age to avoid losing your Google account"
    }
  ]
}