{
  "subreddit": "facebook",
  "post_id": "rijmay",
  "title": "Stuck in a verification loop on my phone- I complete the process and get this message but then go back to stage one when I press continue. Any ideas on how to actually log in?",
  "body": "",
  "author": "DuelLinksNetwork",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »THE MODS OF THIS SUBREDDIT ARE NOT ASSOCIATED WITH FACEBOOK.  They CANNOT HELP YOU with ANY Facebook issues.Welcome tor/Facebook.This sub is for:Posting technical support questions not related to you being banned/jailed from Meta/Facebook.Posting articles about the platformThis can include videos as long as they are not your own Youtube videos and are \"professional\" in nature.This sub is NOT for:Complaining about the platform; you have all of Reddit to do that.Telling OP very unhelpful information like \"just delete your facebook\" when they are asking for help.Asking about how to get out of \"Facebook Jail\".Asking about your hacked account.This rule is in place due to spammers.  They are BAD.This is an example of comments from one postfrom hackers attempting to get OP to contact them.  IF YOU SEE THESE PEOPLE ALWAYS REPORT THEM TO ADMINS.No one here can help you with that.If you wish to find a place dedicated to talking about being jailed from Facebook, go tor/facebookdisabledme.Posting anything looking like a meme.Posting that Facebook is down.If you want to verify if Facebook is down go to:http://downrightnow.com/facebookPosting anything that shows identifiable information (your real name, your friends, etc).  The exception to this rule is if the information includes a celeberty and conforms to the two bullet points that are accepted here.Posting Clickbait articles.Posting anything against the rules will get you a minimum of a three day ban and muted from modmail.  Please note thatr/facebookhelphas been retired.Related Subredditsr/deletefacebook/- Meta/Facebook is truly not a good place, and if you can afford to, here is where you can go to talk about deleting it.r/Facebookdisabledme|r/facebookjail/- Subs where you can go if you have been sent to Facebook Jail/Banned from Facebook.r/FacebookPagesr/TimelineCoversr/facebookdramaI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "noobtradr20",
      "timestamp": "",
      "body": "I'm stuck in this exact situation, I've tried everything even sent my ID multiple times to verify account still locked out. If ya figure it out keep me posted!"
    },
    {
      "author": "janineidk27",
      "timestamp": "",
      "body": "Yep same... day 4. Check play reviews/Twitter. We are not alone. Hoping with all the new Christmas phones they find a fix. Started the day the outage occurred. Have submitted to their website \"security checks preventing log in\" a zillion times. No fix and everyday, I only see more ppl with the same issue. You complete the checks, it repeats itself, ad infinitum."
    },
    {
      "author": "GregW3145",
      "timestamp": "",
      "body": "Glad I'm not alone in this. Extremely frustrating. I got through once and could access my stuff. I wish I would have turned the 2 factor authentication off instead of trying to log into another device. A lot of my business communication is done via Facebook and this is EXTREMELY frustrating."
    },
    {
      "author": "DuelLinksNetwork",
      "timestamp": "",
      "body": "FOUND SOLUTION FOUND SOLUTION !!! MAKING VIDEO NOW !!!!"
    },
    {
      "author": "Steaua10",
      "timestamp": "",
      "body": "Try to exit the loop logging via a browser on PC or mobile, then try again on mobile app."
    },
    {
      "author": "No-Afternoon-2746",
      "timestamp": "",
      "body": "Hi there,I am having a huge issue with Facebook at the moment.I simply wanted to change my e-mail and my password, and now, when I log in it tells me to identify myself by asking some of my trusted friends to click on this link so they can give me a code.The issue is, when they click on the link, it ALL tells them (including my mom) that they are not trusted friends from my account even though it says they are. The site literally does not work and they can't even access any codes to give me. Blank page."
    },
    {
      "author": "No-Afternoon-2746",
      "timestamp": "",
      "body": "I am going through the same thing!"
    },
    {
      "author": "DuelLinksNetwork",
      "timestamp": "",
      "body": "Small update, GOOGLE PLAY facebook app section comments. Lots of people more then honderds are complaining about this problem! so lets hope there will be a fix!"
    },
    {
      "author": "DuelLinksNetwork",
      "timestamp": "",
      "body": "Can everybody experiencing report this problem to this apply section.https://www.facebook.com/help/contact/283958118330524Just put your phone number in, describe the situation and send it in.use all the same title:Verification problem, Device,Friends,Commentlets hope this will wake them up, fingers crossed, my whole life in that account 2013/ personal/ business/photo's i dont have on my personal devices!!!!!! photo's of the day my son was born on facebook.Why is this not in the news already!!!!!"
    }
  ]
}