{
  "subreddit": "teenagers",
  "post_id": "1jsbx9o",
  "title": "Here is what your teenage age says about you",
  "body": "13- you think u are a teenager, but you really arent, you are just a slightly more mature version of ur 12 year old self. You are 12 and only 12 you also say u are \"technically a teen\" and will protect that claim with ur life. But there are a small percentage where you guys are chill and mature\n\n14- you are officially a teen and people will now think you are mature and stuff. I cant think of anything insulting, so frick you. From what ive seen yall watch a lot of jjba (respect)\n\n15- ngl ur like the middle child. People either think ur 14 or 16, no one really notices.\n\n16- this is where you are actually recognized as a human member of society. You dont have time to do anything cuz you are flipping patties for minimum wage\n\n17- ngl u guys are chill, but yall are hella nervous about ur future. So stop being a discord mod and do something productive instead of commenting on a post that came out -6 seconds ago\n\n18- certified unc status (looks like my phone bouta die, the life support is in the way)\n\n19- i respect yall. You are like the sensei wu of this sub. You give out advice even though ur as old as ancient china.\n\n20- \" \"\n\n30+ yall are either pedos or try to save this subreddit like batman or somethting\n\nOk so some people dont understand the fact that i meant 13 year olds being 12 not literally but maturely. Most 13 year olds from my experience are childish",
  "author": "Sea_Scale_4538",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hey!We're currently looking for new moderators! If you're interested, read morehere! Here's adirect linkto the application form as well.Our discord server is also accepting moderator applications. Please check ourannouncements channelin ourdiscord serverfor more details.Can't wait to see your application!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Mrs_Shirso",
      "timestamp": "",
      "body": "Commenting from the retirement home"
    },
    {
      "author": "FunniMonkilol",
      "timestamp": "",
      "body": "My phone is deadunplugs lifesupportthanks unc"
    },
    {
      "author": "Pretend_Drawer_9542",
      "timestamp": "",
      "body": "commenting from the afterlife"
    },
    {
      "author": "NeptunesNewt",
      "timestamp": "",
      "body": "Im basically dead already"
    },
    {
      "author": "To_gay_or_not_to_gay",
      "timestamp": "",
      "body": "I'm replying from my coffin"
    },
    {
      "author": "Aggravating_Sky9814",
      "timestamp": "",
      "body": "Also, \"14 year olds think they are already 15\""
    },
    {
      "author": "KolkataFikru9",
      "timestamp": "",
      "body": "sigh... sucks to be 19 then"
    },
    {
      "author": "Guilty_Letter4203",
      "timestamp": "",
      "body": "My life is over already :(((( back in my day we had to walk 19000000000000000000 miles to school"
    },
    {
      "author": "Sea_Scale_4538",
      "timestamp": "",
      "body": "Cant wait to die of old age next year"
    }
  ]
}