{
  "subreddit": "Scams",
  "post_id": "1cjkhwj",
  "title": "Is this a scam or is it legit?",
  "body": "This landed in my inbox today.  I’ve had this account for over twenty years.  Why are they now questioning my age?  Why would they need this information?  Can I trust them with it?\n\nIf I click links contained within the email, it says they could completely delete everything in my account after 30 days.  That’s rather extreme.",
  "author": "cyberiangringo",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »u/11gus11- This message is posted to all new submissions tor/scams; please do not message the moderators about it.New users beware:Because you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee.We call these RECOVERY SCAMMERS, so NEVER take advice in private:advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.A reminder of the rules inr/scams:no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, orclicking here.You can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.Questions about subreddit rules? Send us a modmailclicking here.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "ZeldaGaiden",
      "timestamp": "",
      "body": "\"You'll need a credit card or government-issued ID to verify your age\"? Have we ever had to provide that for a Google account?"
    },
    {
      "author": "RedditorKain",
      "timestamp": "",
      "body": "Step 1.Verify the e-mail's header.Step 2. Depends on if it's real or not.I've been constantly annoyed by the age verification thing for a while by youtube when some videos were marked age restricted. I decided to just use a credit card ($1 that got immediately refunded) because I didn't want to send them a pic of my ID (and to be fair, the credit card was going to expire in a month).This happened on an 18 year old account, too... Whoever wrote the automatic age verification code is an ass. When the account is >18 years old, what's the point of asking for age verification? Was I a newborn when I made it? Ffs.The whole \"everything gets deleted\" does indeed sound a bit extreme... They didn't threaten me with that. Ol' uncle Google might want an extra serving of personal information and decided to push a little...Anyway, real or not, don't follow any links in the e-mail. Just log into your account and verify your age however you feel is appropriate so you can forget about this whole mess.The alternative would be to download all of your content, switch any accounts that use your gmail as the linked address to something else and stick it to the man..."
    },
    {
      "author": "BatterEarl",
      "timestamp": "",
      "body": "Odd I never had to verify my age except for me saying I was over 18. Is this something new? There is     no way I will ever give ass-hats my real information. They can figure it out on there own."
    },
    {
      "author": "jessiebeex",
      "timestamp": "",
      "body": "My favorite part is the bold text that says your account \"won't work anymore\" that is most definitely not how google would word that lol"
    },
    {
      "author": "RelChan2_0",
      "timestamp": "",
      "body": "Google asks for your age the moment you sign up, I'm pretty sure the only time they'll ask for verification is when you use Google Ads or something.Google will delete your account if you haven't used it for 2 years."
    },
    {
      "author": "Faust09th",
      "timestamp": "",
      "body": "What's the sender's email domain?"
    },
    {
      "author": "Putrid-Snow-5074",
      "timestamp": "",
      "body": "You need to look at the headers"
    },
    {
      "author": "11gus11",
      "timestamp": "",
      "body": "I Googled the issue, and I found this.  It looks legit, but I’m nervous to hand over any info.https://support.google.com/accounts/answer/10071085?hl=en"
    },
    {
      "author": "cyberiangringo",
      "timestamp": "",
      "body": "Have you signed into your Google account to see if you are being prodded for this info?  That would always seem to be a solid step number 1."
    }
  ]
}