{
  "subreddit": "technology",
  "post_id": "13ijq03",
  "title": "Online age verification is coming, and privacy is on the chopping block | The internet could soon become a very different place",
  "body": "",
  "author": "AlFender74",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "An_Actual_Thing",
      "timestamp": "",
      "body": "Make no mistake. This doesn't end at age verification. They want your cookies for monetization and legal action over anonymous statements/leaks."
    },
    {
      "author": "throwawaygreenpaq",
      "timestamp": "",
      "body": "They want your personal information too"
    },
    {
      "author": "WhatTheZuck420",
      "timestamp": "",
      "body": "‘Senator Tom Cotton (R-AR), the backer of the Protect Kids Online Act, said. “Just as parents safeguard their kids from threats in the real world, they need the opportunity to protect their children online.”‘America needs protection from reactionary thugs like Tom Cotton who authored a letter to the Iranian government to undermine President Obama in 2015"
    },
    {
      "author": "ioncloud9",
      "timestamp": "",
      "body": "I guess “personal responsibility” and actual parenting isn’t the job of parents anymore when it comes to online porn. Love it when the party of personal responsibility and “freedom” makes these decisions for you."
    },
    {
      "author": "Hrmbee",
      "timestamp": "",
      "body": "FTA:Government agencies, private companies, and academic researchers have spent years seeking a way to solve the thorny question of how to check internet users’ ages without the risk of revealing intimate information about their online lives. But after all that time, privacy and civil liberties advocates still aren’t convinced the government is ready for the challenge.“When you have so many proposals floating around, it’s hard to ensure that everything is constitutionally sound and actually effective for kids,” Cody Venzke, a senior policy counsel at the American Civil Liberties Union (ACLU), tells The Verge. “Because it’s so difficult to identify who’s a kid online, it’s going to prevent adults from accessing content online as well.”...As pointed out by CNIL’s report on various online age verification options, all these methods have serious flaws. CNIL notes that identifying someone’s age with a credit card would be relatively easy since the security infrastructure is already there for online payments. But some adult users — especially those with lower incomes — may not have a card, which would seriously limit their ability to access online services. The same goes for verification methods using government-issued IDs. Children can also snap up a card that’s lying around the house to verify their age.Similarly, the Congressional Research Service (CRS) has expressed concerns about online age verification. In a report it updated in March, the US legislature’s in-house research institute found that many kids aged 16 to 19 might not have a government-issued ID, such as a driver’s license, that they can use to verify their age online. While it says kids could use their student ID instead, it notes that they may be easier to fake than a government-issued ID. The CRS isn’t totally on board with relying on a national digital ID system for online age verification either, as it could “raise privacy and security concerns.”...To privacy and civil liberties advocates, none of these solutions are ideal. Venzke tells The Verge that implementing age verification systems encourages a system that collects our data and could pave the way for more surveillance in the future. “Bills that are trying to establish inferences about how old you are or who you are based on that already existing capitalistic surveillance, are just threatening to legitimize that surveillance,” Venzke says. “As we think about kids’ online safety, we need to do so in a way that doesn’t enshrine and legitimize this very surveillance regime that we’re trying to push back on.”The Electronic Frontier Foundation, a digital rights group, similarly argues that all age verification solutions are “surveillance systems” that will “lead us further towards an internet where our private data is collected and sold by default.”Even some strong supporters of child safety bills have expressed concerns about making age verification part of them. Senator Richard Blumenthal (D-CT), one of the backers of the Kids Online Safety Act, objected to the idea in a call with reporters earlier this month. In a statement, he tells The Verge that “age verification would require either a national database or a goldmine of private information on millions of kids in Big Tech’s hands” and that “the potential for exploitation and misuse would be huge.” (Despite this, the EFF believes that KOSA’s requirements would inevitably result in age verification mandates anyway.)...Some proponents of online safety laws say they’re no different than having to hand over an ID to purchase alcohol. “We have agreed as a society not to let a 15-year-old go to a bar or a strip club,” said Laurie Schlegel, the legislator behind Louisiana’s age restriction law, after its passage. “The same protections should be in place online.” But the comparison misses vastly different implications for free speech and privacy. “When we think about bars or ordering alcohol at a restaurant, we just assume that you can hand an ID to a bouncer or a waiter, they’ll hand it back, and that’s the end of it,” Venzke adds. “Problem is, there’s no infrastructure on the internet right now to [implement age verification] in a safe, secure, private way that doesn’t chill people’s ability to get to constitutionally protected speech.”This tension between privacy and verifying part of ones identity (in this case, age) has been ongoing for years, but now that the infrastructure is in place to implement large-scale and widespread tracking, that infrastructure is also unfortunately being pressed into use for these purposes. It would be good to figure out how (if possible) we can create a way to verify a part of someone's identification, in a trustless system, without revealing too much about the rest of their identity. Likely a successful solution will bridge both technical as well as social approaches. Less successful approaches will likely rely strictly on available technologies and solutions."
    },
    {
      "author": "Tall-Wonder-247",
      "timestamp": "",
      "body": "Jeez are you telling me I cannot use my fake birthdate anymore?"
    },
    {
      "author": "TheFriendlyArtificer",
      "timestamp": "",
      "body": "On another topic, happy 122nd birthday!From Valve"
    },
    {
      "author": "MajorNotice7288",
      "timestamp": "",
      "body": "I remember a time when parents and guardians were responsible for protecting their kids.....just another washed up excuse to level up surveillance capitalism."
    },
    {
      "author": "AlFender74",
      "timestamp": "",
      "body": "What is this \"privacy\" thing of which you speak?"
    }
  ]
}