{
  "subreddit": "CanadaPolitics",
  "post_id": "1c06r59",
  "title": "Opinion: Requiring age-verification for porn won’t save children from online harm. But it will invade our privacy",
  "body": "",
  "author": "topazsparrow",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »This is a reminder toread the rules before posting in this subreddit.Headline titles should be changed onlywhen the original headline is unclearBerespectful.Keep submissions and commentssubstantive.Avoiddirect advocacy.Link submissions must beabout Canadian politics and recent.Postonly one news article per story.(with one exception)Replies to removed comments or removal notices will be removedwithout notice, at the discretion of the moderators.Downvoting posts or comments, along with urging others to downvote,is not allowedin this subreddit. Bans will be given on the first offence.Do not copy & paste the entire content of articles in comments. If you want to read the contents of a paywalled article, please consider supporting the media outlet.Pleasemessage the moderatorsif you wish to discuss a removal.Do not reply to the removal notice in-thread,you will not receive a response and your comment will be removed. Thanks.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "PandaRocketPunch",
      "timestamp": "",
      "body": "If the government wants more people fucking instead of fapping, instead of going after porn sites, maybe try increasing the people's quality of life?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Be a parent? There are tools out there to prevent your children accessing unsavoury sites.Like literally being with them and being proactive about internet safety.You can PAY someone to setup a filter if you're not computer savvy. I rather our government be diverting resources to much needed social assistance like housing, not policing everyone's internet connection."
    },
    {
      "author": "KvotheG",
      "timestamp": "",
      "body": "Not only that, but you will see a rise in use of VPNs to access porn. Also, don’t underestimate kid’s ability to use VPNs as well. Protecting kids is nothing more than an excuse. This is about the government policing what adults choose to watch in the privacy of their own bedrooms."
    },
    {
      "author": "MarkG_108",
      "timestamp": "",
      "body": "Yeah, it's like alcohol.  Requiring kids to show ID to get booze is wrong.  We know that they just go to sketchier suppliers and buy potentially toxic bathtub gin.  Don't under-estimate the kids.  Best to just not require ID and declare any such supposedly adult-only things as available to all."
    },
    {
      "author": "topazsparrow",
      "timestamp": "",
      "body": "This is about the government policing what adults choose to watch in the privacy of their own bedrooms.I think they have less interest in this than setting the footwork that would allow them to policeanythingwe choose to consume on the internet.I don't think it's an underlying grand conspiracy or anything, but the road to hell is paved with good intentions.anyways, it's the parent's responsibility at the end of the day. If you're going to give children the ENTIRE WORLD'S KNOWLEDGE at the touch of their finger tips, there really shouldn't be any expectation that anyone else should be able to monitoryour kidson such a powerful platform."
    }
  ]
}