{
  "subreddit": "MentalHealthPH",
  "post_id": "1gu00ku",
  "title": "PWD ID verification",
  "body": "Hi guys!\n\nI don’t know if this would help pero I was able to get in touch with our PDAO here sa Antipolo. And the reason daw why di nag a-appear sa DOH website is binago daw nila ang format. Dati last 5 Digits lang pero ngayon you have to put in two “00” before the last 5 Digits.\n\nHope this helps.",
  "author": "pusang_itim",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Thank you for posting inr/MentalHealthPH. Please be guided by the rules found in the sidebar. We highly recommend that you seek professional help if things are getting out of hand or PLEASE CALL:In Touch Community’s Crisis Line Landline: \n+63 2 8893 7603\n+63 919 056 0709\n+63 917 800 1123\n+63 922 893 8944\nEmail address: helpline@in-touch.org\nwww.in-touch.orgOn the fence about calling? Please read this helpfulpostfromr/SuicideWatchwhat to expect when calling crisis hotlines.Moderators do their very best to maintain this subreddit a safe place. If you see any offending post or comment, do not hesitate to report or message the mods.Clickhereif you are looking for a doctor/hospital! Also, some of your questions might already been answered on our FAQ. Please check ourwiki!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "ukissabam",
      "timestamp": "",
      "body": "eto bilang ng tamang PWD ID No. (include dashes)xx-xxxx-xxx-xxxxxxx 2-4-3-7"
    },
    {
      "author": "J58592958",
      "timestamp": "",
      "body": "Bakit ayaw pa rin sa akin. 😳"
    },
    {
      "author": "miggy1111",
      "timestamp": "",
      "body": "Hello! May I ask the link po where to verify? Thank you!"
    },
    {
      "author": "pps_13",
      "timestamp": "",
      "body": "Here po:https://pwd.doh.gov.ph/tbl_pwd_id_verificationlist.php"
    },
    {
      "author": "hnsnghyk",
      "timestamp": "",
      "body": "Hi! Kasama ba yung dashes or puro numbers lang ang ilalagay?"
    },
    {
      "author": "pps_13",
      "timestamp": "",
      "body": "Include the dashes po"
    },
    {
      "author": "thegirlisnuts",
      "timestamp": "",
      "body": "Hello. Pa-clarify lang po. Last 5 digits lang po pa ng ID number yung ilalagay plus two zeros? Meaning 7 digits lahat? So if for example \"12345\" yung last 5 digits mo, you have to input \"0012345\"? Tama po ba? I tried inputting both, (last 5 digits and then added 2 zeroes) pero pareho \"no records found\". I plan to contact my local LGU but I want to make sure tama ba yung ginagawa ko bago ako mangulit (I get anxiety trying to bring this up). Thank you for bringing this up."
    },
    {
      "author": "pps_13",
      "timestamp": "",
      "body": "Tama po. Ensure that you follow the format of your PWD ID na may dashes. If wala pa rin, please contact your LGU."
    },
    {
      "author": "pusang_itim",
      "timestamp": "",
      "body": "Lah as a person na taga-Antipolo din. Its a big help. Matry nga pag ok na yung website"
    }
  ]
}