{
  "subreddit": "FemaleDatingStrategy",
  "post_id": "kokgrt",
  "title": "How to spot a cheating man",
  "body": "EDIT/UPDATE:\n\nI read some of your responses with tears. Thank you to everyone who said something encouraging! I tried to answer some questions and hope I didn't miss any. I am not able to respond very fast; I still feel some emotional hangover just from sharing what I wrote. I initially made this as a one-and-done throwaway, but now I will keep this account active and hopefully share some more in the future, since some of your responses really got me thinking. I am truly grateful that this space exists. I still received some harassment (which I blocked), but I know the mods / automod filter out a lot more, and that level of safety was what encouraged me to speak up. Thank you!!\n\n-----\n\n(TW for self harm and abuse.)\n\nI am a FDS member/poster. I made an alt to tell my story as a former sugar baby. I understand this might not go through because sex work is fundamentally anti-FDS. I am now anti-sex work and I hope this post has value here.\n\nI won't go into childhood details, but I suffered from abuse and poverty from a very young age, so everything about luxury and having a sugar daddy appealed to me. I was also raised very patriarchal, and was told since birth that certain things were only achievable via a man, even if I was deeply ambitious when young. My own family tried to \"match\" me at age 15 with an adult family friend they felt was wealthy. Thanks to FDS, I now realize I was groomed and it was statutory rape. It was a major breakthrough when I told my therapist for the first time two weeks ago, and what sparked my motivation to write this post.\n\nThere was no clear \"beginning\" to my sw journey. I have always slept around casually. I also have always had rough/kinky sex. I was exposed to porn at a very young age. Eventually I happened into sleeping with richer men. But I became successful as a SB after I unknowingly implemented very strict FDS-like ground rules and demanded more. The irony was, after I started earning more, I got banned from several sex work/sugar baby forums. People thought I was lying about my standards and earnings. Even in the sw community, you had to be a deferential pickme to be accepted. Any high standards must be a lie. I was unknowingly lifting myself out of the sw fog, becoming more outspoken, and I was alienated.\n\nI eventually managed to make a lot of money (bought my family a house). I had strict requirements that men provide verification of their identities (passport / work profile), and ability to provide. At my peak (financial peak and self-delusion peak), I abandoned my own career to do it full time, and even considered outsourcing the admin side of vetting + marketing myself like a product, to maximize earnings.\n\nThis was also a time when my self esteem was so chipped that I only knew one avenue of building it up: male validation and monetary reward.\n\nLooking back now, even if money was there, everything else was bad. I traveled all the time. I was burned out. I still experienced FREQUENT sexual assault and rape without recourse, which I treated as \"occupational hazard.\" I suffered emotional damage, extreme guilt and shame, loss of sense of self, loss of friendship, loss of sense of value regarding money and life. I spiraled to a point of being constantly suicidal. I was a shell. I drank a lot.\n\nFinally, the most prominent of all: despite what I was telling everyone in my circle, I never could fully feel pride about my \"work.\" I had a nagging sense that I was meant for something else, somethingnot this,exceptwho knows what though.It was like the part of myself I locked away was knocking from its cage. So I became more and more split psychologically. I dissociated a lot, where I literally floated up to the ceiling and \"saw\" my body going through the motions, even if it's not sexual and just a dinner at a nice restaurant. I was potentially losing my mind. I often imagined ending my life during a dissociated phase so I wouldn't \"feel' it.\n\nYet, I continued to justify that all that was just normal work stress, because \"sex work is work.\" My feelings must be wrong. I must have internalized slutshaming. This is the danger of that kind of rhetoric. Even if I entered it voluntarily as an adult, seemingly benefitted financially, I gaslighted myself about leaving and delayed it for far too long. My pickme self felt I wasnot like the otherswho were traumatized, and I was fine. In reality, I was in danger mentally and physically. I still feel this eerie brush with death when I try to imagine if I had never left.\n\nI still have a very small circle of friends in the lifestyle and I make a point of talking to them about leaving whenever possible. I don't know if some of them will ever leave, though. I have to rebuild my social life as well.\n\nWelp, that got long. I originally wanted to share some cheating red flags here, since many of my sugar daddies were married. I hope these help confirm everything FDS already says in the handbook. So here it is:\n\nSocial media\n\nEither no social media, or social media has very few wife-focused posts.\n\nTakeaway: Your fears when he is not posting you prominently are not unfounded. No social media is not automatically green flag.\n\nPhone lock\n\nAll had locked phones. Some had two phones. Many often were able to keep up intensive texting with me even if they could not physically meet.\n\nTakeaway: Heed your fears if he is glued to his phone in a secretive manner. Moving forward, I will never trust a man if he does not release his phone codes to me. Also the multiple phones were all \"unintentional,\" as in, he \"lost\" his phone and had to get a new one, then \"found\" his old phone, so just kinda \"wound up\" having two phones, and if you tried to ask he would gaslight you about \"overthinking.\"\n\nBusiness trips\n\nLots of travel. They took me along. Some even lovingly checked in with their wives/kids daily.\n\nTakeaway: I am not sure. Not all who travel cheat. But business travels and conferences are a very easy way to maintain affairs.\n\nCash withdrawals / Business expense accounts\n\nAnd I mean large (over 10K) cash withdrawals. Or he puts expenses on his business cards and explains them as taking a client out.\n\nTurbulent at home\n\n\"Mandatory\" family vacations such as birthdays, holidays, were often windows of fighting with the spouse, due to their resentment and guilt. The men also never planned stuff. They treated showing up as a gift to their families. And then they excused everything by attributing it to \"holiday stress.\" I received calls from exotic vacation locations needing a listening ear (me). They told wives those were \"business calls.\"\n\nTakeaway: The common FDS red flags apply- low effort and bad attitude. The \"holiday stress\" is simply a myth and excuse to justify abusive behavior at major family occasions.\n\nCouples therapy\n\nYup. Useless. They come to meet me after a couple's therapy session. Or, they go into detail to tell me what transpired.\n\nOther addictions (alcohol / work / gambling)\n\nSelf explanatory\n\nOften cluster B types\n\nGaslighting / accusations of wife being too sensitive, too controlling, too XY\n\nHas an unhealthy relationship to money\n\nUses it to buy sense of power, love, women, patch feelings of inadequacies\n\nTakeaway: vet by having clear discussions about money. This includes their trauma, expectations, histories, etc.\n\nFamily man image + powerful man image\n\nThe best way to describe this is perhaps the madonna/whore comparison. Some men genuinely believe being a man means keeping a good family/wife on the outside and a mistress on the side. They will give up neither.\n\nTakeaway: Vet for misogyny and leave.\n\nEmotional hoover / vampire\n\nThey had an impressive ability to cry and appeal to wife's sympathies when found out. Many were \"forgiven\" and go right back to it. Or they 'take a break' and ghost me, then come back months later.\n\nTakeaway: If you sniff a cheater out, you must leave.\n\nThere is no one type of \"cheated wife\"\n\nSome were beautiful stay-at-homes, some were in high powered careers such as elite surgeon or high-earning entrepreneur, some were overly codependent \"will maintain the family at all cost,\" some are checked out and close one eye\n\nTakeaway: A man who wants to abuse you will abuse you, it's not you.\n\nIf he wanted to, he would\n\nThe bumbling idiot man who is clueless about how to organize a simple family outing could turn around and get elaborate gifts, efforts, and attention for someone else.\n\nIf a man wants to cheat, he will. You cannot plug every leak. You cannot follow him everywhere. He could be going out for a run, he could be going on a business trip to earn money for you and the family. He could be sweet to you, or mean to you. He could frequent strip clubs, or never ever set foot in one.He WILL stay married to you to protect HIS financial interests. The only way to protect yourself is be clear with yourself on what behavior you will accept, what you won't, and have a clear backdoor for yourself to walk away. Always retain full transparency on all your joint accounts. Always have control of your finances. Always seek a divorce and pursue maximum damages and alimony.\n\nThat's all I can think of for now. I don't know if a healthy relationship with an age-appropriate man will ever happen for me. I have tried to date normally since my exit, but found that I struggle to vet as strictly as I did when I was a sugar baby. I have stopped dating. I do know I am now a radfem working on spending a life with myself if a man doesn't happen. I genuinely believe men,as a whole,abuse women, and we cannot categorically escape it, and must always watch our own backs. I am working up the courage to become more outspoken against sex work, and hopefully help younger girls out of the trap I fell in myself.\n\nIt's been 1 year since I last had a drink, and 1.5 years since I broke up with my last SD. My wish for 2021 is to rebuild my career and friendships. I start to feel low when I think of the last 5 years of a black hole, and how to explain that. I am working up the strength. When I was a young girl, I wanted to be a lawyer. I don't know if I have the gumption to follow through, but I can fantasize. I also have a couple of other fields I have interest in. I only need my self worth to catch up and open my eyes that I can achieve my dreams.\n\nI wish you all a happy 2021.",
  "author": "temproaryusername",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »NOTE: This sub doesNOTsupport the commercial porn industry, as it is an institution that promotes and normalizes sexual aggression, incest, pedophilia, violence, racism, degradation, low sexual satisfaction, and objectification of women and girls, many of whom have been drugged, raped, misled, trafficked and otherwise coerced to appear on film.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Samvanderkamp123",
      "timestamp": "",
      "body": "Thank you for sharing this.My cheating ex-husband did so many things you mention: phone lock; automatically cleared the Internet history; changed his credit cards to online statements that I didn’t have access to; big cash withdrawals.And you are so right about the holidays. All sorts of excuses to make calls. Take your cheating partner to a place there is no cellphone signal and watch him fume."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I guy I was dating for over a year swore he had zero social media and no online presence. His birthday came up and he mentioned how people he hasn't spoken to in YEARS have wished him a happy birthday today... I asked, well how would they know it was your birthday? You haven't spoken since you were kids...and you supposedly don't have Facebook so there's no birthday reminders...and you supposedly do not have these people as contacts...Anyway, these were my foolish pick me days. Lying came naturally to him. I pity anyone that has the misfortune of crossing paths with his bummy self."
    },
    {
      "author": "JelielAllelle",
      "timestamp": "",
      "body": "Holy shit. My ex did the same thing. I actually didn’t even find out until we were broken up. He had a FEW different Facebook accounts, and on every single one of them, he had me blocked. The craziest thing about that is we were strictly platonic friends for 1.5 years before we ever dated, and he had to have blocked me almost instantly after first meeting me, bc I looked him up the next day, then asked for his socials that he “didn’t have.”  That is calculated. Men truly suck."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "OP, thank you for taking the time to sit down and post all of this; women are often not taught strategies to sniff out unfaithful liars in favor of being \"understanding\" and \"nurturing\" and all the other toxic shit that gets heaped on us from childhood onward.The idea of the craaaaazy~ overly suspicious woman is so ingrained into society and it is SO damaging to our perceptions of reality and to our reputations. To listen to one's intuition and dig when they see any of these signs out of a man is often regarded as crazy and paranoid, and men are often waiting until we reveal what we know before denying the truth, accusing us of \"snooping and being deceptive\" and then using it as an excuse to dump us as quickly as humanly possibly so they don't have to face a second more of our displeasure.Men who cheat are cowards. End of story. They're a lot of other things, too, but chiefly they are fearful and cowardly losers and they will never change. If they managed to get by with it once (even if it ended in discovery), they know they can do it again. They can and they will.Please stay in recovery, OP. Support groups, therapy, whatever it takes."
    },
    {
      "author": "level_up_always",
      "timestamp": "",
      "body": "I was also raised very patriarchal, and was told since birth that  certain things were only achievable via a man, even if I was deeply  ambitious when young.Also former swer, I relate to this a lot and it's not just exclusive to sw but I think that is how a lot of us end up in it because we want to be ambitious and achieve and see the patriarchal programming and it seems like the best way to maximize and work that ambition in it's own fucked up wayAlso wanted to add some additional points from my own experience (I agree with all of yours)- the classic 'man staying late after work': they've gotten smarter than that as a lot of them want to see you early in the day like wayyy early bc it's less suspicious leaving early for work then coming home late- they like to tell the sw how much they love their wives, and want validation from the sw that they aren't the piece of shit they truly are. i think they actually believe their own bullshit which is the scariest part of the whole thingI hope that you will take your time to heal and pursue your dreams. It's never too late and your story can help others. It's a weird position to be in having been a former sw and critical of it while also wanting to support women themselves who have been in similar predicaments because so much of the rhetoric (even on this sub sometimes unfortunately) is to demonize the women or in libfem circles 'sEx pOsiTiViTy' there is not a lot of nuance of understanding why we choose to do certain things but at the same time (at least in my case) felt brainwashed into it.edit: and another thing - NEVER go 50/50 if you want another reason not to because they literally use that extra money to spend on other women and in fact find ways to spend less/have her cover more so they have more discretionary income to spend on them. don't make it any easier. so if he starts wanting to have more 'equality' or whatever the fuck trying to get you to earn more etc. that is another sign he's trying to free up his finances to spend on someone else"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Thank you so much for writing this out. I appreciate your insight.Also, if you decide to become a lawyer, you could specialize in helping women divorce these men and men's narcissistic behaviors. Women need lawyers who understand the levels of manipulation men put women through and how wrecked women get in the process."
    },
    {
      "author": "temproaryusername",
      "timestamp": "",
      "body": "Wow. Incredible. THANK YOU SO MUCH!!These stories need to be heard, and I know how FDS is spilt on that idea, so thank-you for your bravery.I would like to emphasize to the young girls reading this...........It means NOTHING to make money off being sexy, sexual, and/or subservient to men. Any woman can do it; the sexual appetite of men in this world is deep and endless. You put your own self-worth at risk, as well as setting back the progress of your sisters. If women are groomed from childhood to believe their only worth lies in their sexuality, and this idea is reinforced through the actions of women; how many female Drs, Tradespeople, Lawyers, Politicians, CEOs are we losing out on each generation?I also thank OP bc I know now for sure my ex was cheating. I have been having difficulties since my breakup (months ago) accepting the fact that my ex lied (and continues to deny) that he was cheating on me. It is incomprehensible to me how people can bald-face lie to ones they love and maintain a secret life with virtually no shame. Your story proves to me without a doubt he was capable of such.😥 As always, this stuff is hard to hear, but thank goodness for FDS."
    }
  ]
}