{
  "subreddit": "legaladviceofftopic",
  "post_id": "1fqp9ua",
  "title": "A minor creates an OnlyFans promising they will post there when they turn 18. People believe that and pre-pay based on that belief and the assumption that there will be nudity. Were laws broken? [Florida]",
  "body": "Based onthis comment threadabout \"'Cash Me Outside' girl\".\n\nSummary of facts: A minor went viral and then created an OnlyFans where she does not post anything but says she will post when she turns 18. When she turns 18 she posts lingerie pics. People prepaid their subscription to start when she turned 18, presumably expecting adult content.\n\nDid she do anything illegal?Was she allowed to set up an account on what is regarded as an adult content site (but not technically only an adult content site) and start collecting money? Did she need her guardian to provide the consent?\n\nDid subscribers do anything illegal?It seems like a very legally gray area since the people are paying a minor and are clearly, based on the context of OnlyFans, expecting sexual content in return. However, the content they will get in return isn't explicitly defined or guaranteed to be sexual and the content will not be released until it would have been legal to do so. So, in a way, it seems like these subscribers thought they were entering into a sort of informal contract with a minor for sexual content. But in another way, it seems like there was no contract and the content ultimately shared was between adults and wasn't necessarily going to be sexual.\n\nDid OnlyFans do anything illegal?Should they have prevented her from creating the account as a minor? Should they have prevented people from subscribing to a minors account?\n\nETA:Were her parents/guardians liable if they were aware of this?\n\nETA: My intuition here is that all parties may have broken some laws, so my title (\"were laws broken?\") isn't meant to suggest that I think this might be okay, but just to identify how the law might apply. I am only going based on the description I was given so consider this a hypothetical as the real details may vary.",
  "author": "rustys_shackled_ford",
  "comments": [
    {
      "author": "Ablomis",
      "timestamp": "",
      "body": "I would be surprised if OF doesn’t have 18+ in their T&C.Very likely she would be breaking T&C and would be removed from the platform."
    },
    {
      "author": "CreativeGPX",
      "timestamp": "",
      "body": "Just checked. T&C includes:You must be at least 18 years old;You must be able to be legally bound by a contract with us;You must be legally permitted to join, view Content, and to use any functionality provided by OnlyFans;. . .Adult material: Some Content on OnlyFans contains adult material, and you acknowledge and agree to this when you access OnlyFans. We are not responsible for any loss or damage you suffer as a result of how or where you view Content.So, assuming the facts are correct, either:She lied about her age and OnlyFans believed her.OnlyFans knew her age and didn't care.OnlyFans put her in some sort of special category due to her age (e.g. only letting her reserve the name, but not truly use/create her account)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "OP seems pretty similar to what IIRC bhad baby of whatever the cash me outside girl did. She pretty much did a countdown to her 18th birthday when her OF went live.I guess the difference here is the actually pre-payment, as opposed to...I guess hype marketing?"
    },
    {
      "author": "the_third_lebowski",
      "timestamp": "",
      "body": "This is not the kind of law I handle, so my answer is kind of useless, but I do have some thoughts. They boil down to the idea that you could probably be prosecutedsomewherein America, and that due to the nature of the internet there's a real risk that some random state's laws will actually apply - at least as to the website and the customers.Knowing how laws are often written, I would expect at least one or more US states have a law about child abuse written broadly enough to apply. Whether that's under a theory of \"sexual abuse\" or \"child abuse\" that covers non-physical acts (for example, explicit lewd conversations with children, or telling a child that you will give them money for future sex acts). Think of it this way: do you expect that it's illegal (at least somewhere) to walk up to a eight year old and offer them candy now to have sex with you in ten years? Because if so, the law is probably not written in a way that distinguishes different ages of being below the age of consent. Itmaybe written in a way that relies on a subjective measure of \"causing emotional harm\" which might apply to differently aged children differently. But it might just discuss the idea of lewd subject matters being discussed for the purpose of sexual gratification. (Hell, these days you're at risk of some state passing a law against discussing sex with minors at all, even for the purpose of teaching biology! But going back to normal laws for the moment . . .)I believe, although I don't know for certain, that child pornography laws focus more on whether the purpose of the media is for the purpose of sexual gratification rather than whether it actually involves sex. That's why naked baby photos and national geographic stuff about tribal societies with different clothing norms aren't legally child porn. There is likely an argument that posting normal photos of a child on a website for the purpose of paying her money now to get her naked later fits into this legal scheme. At least under some state's law if not the federal law.I am basically certain that normal prostitution/sex work laws have provisions against children engaging in sex work - after all its obviously illegal to have child sex phone lines. It's likely that at least some of these laws will be written broadly enough to include planning and paying for future sex acts.It is fairly likely that at least one state has a law about grooming that is written broadly enough to apply, although to be fair I did a quick Google search and the few I found only discussed facilitating future illegal actions - not the idea of grooming minors to have sex upon turning 18. But that behavior is widely considered abusive and so I bet there's at least some law somewhere that covers it.Assuming for the moment one of these laws is written broadly enough to apply, there would then be a question of who to prosecute, who did what, etc. It depends on how the law is written, but I would expect such laws to get to actual intent, which can be proven regardless of what people pretend to say. I doubt it would help that a customer never talked to the child, they actively participated in paying the child (and therefore encouraging/participating/whatever legal term was used) to engage in this work now. Even if the most explicit acts are for the future. The child is possibly in violation as well. Prosecuting child sex acts against the children is tricky but it does happen. Usually more in the realm of actual child pornography and prostitution laws rather than in terms of broader  child abuse laws. So it depends what laws end up applying. The government would conceivably be incentivized to rely more on civil forfeiture than prosecution (taking away the money that the child earned through illegal conduct, for the purpose of disincentivizing additional children to follow suit).Finally, the website is almost certainly in trouble for allowing any of this to happen in the first place."
    },
    {
      "author": "Uhhh_what555476384",
      "timestamp": "",
      "body": "\"Knowing how laws are often written, I would expect at least one or more US states have a law about child abuse written broadly enough to apply. Whether that's under a theory of \"sexual abuse\" or \"child abuse\" that covers non-physical acts (for example, explicit lewd conversations with children, or telling a child that you will give them money for future sex acts).\"I didn't even think about this and I'm a public defender in Washington State.  This is a felony.  Communication With a Minor for Immoral Puproses.https://app.leg.wa.gov/RCW/default.aspx?cite=9.68A.090"
    },
    {
      "author": "Either_Curve4587",
      "timestamp": "",
      "body": "Look at Tracie lords. She lied about her age and did main stream porn for two years.Lords made the first of many porn movies in 1984, when she appeared in What Gets Me Hot! alongside Tom Byron, who later became her boyfriend off‑screen.[17] She first appeared only in a non-sexual role but was later replaced with a hardcore scene. In her next movie, Those Young Girls, she appeared in a sex role alongside Harry Reems and Ginger Lynn. After turning 16 and appearing with John Leslie (an actor 23 years her senior) in the porno parody Talk Dirty to Me Part III (which won the AVN Award for the best movie), Lords was hailed as the “Princess of Porn”.[9] She became one of the highest-paid porn actresses of that time, earning more than $1,000 a day. Besides her work in porn, she also appeared in the music video for “Gimme Gimme Good Lovin’” by the heavy metal band Helix. Lords continued making more movies until late 1984 when she tried to quit the industry at age 16, but returned a few months later. Just before her 17th birthday, she met Stuart Dell, who became her boyfriend, manager, and business partner - Dell used the pseudonym Steven (or Stephen) Cartier. Together they formed the Traci Lords Company. Dell and Lords made a distribution deal with Sy Adler, an industry veteran who ran Vantage International, in which they would produce three movies for the company. In March 1986, the first TLC feature was released; titled Traci Takes Tokyo, it was shot in Tokyo around Christmas Day 1985. The second, Beverly Hills Copulator, was released afterwards, but the third movie, Screamer, was shelved.[17][18] During late May 1986 (around three weeks after Lords’ 18th birthday), authorities were informed that she had been underage when she appeared in the porn movies. She had lied (according to Lords, it was a “white lie”) to law enforcement, photographers, producers, directors, co-workers, and the general public for two years. The owners of her movie agency and X-Citement Video, Inc. were arrested (see United States v. X-Citement Video, Inc.). She was taken into protective custody and hired high-profile lawyer Leslie Abramson. On July 10, district attorney’s investigators searched Lords’ Redondo Beach home as well as the Sun Valley offices of Vantage International Productions (a major producer of adult movies) and the Sherman Oaks offices of modeling agent Jim South. South and other industry officials said that Lords, who was seeking employment, provided a California driver’s license, a U.S. passport, and a birth certificate, which stated that her name was Kristie Nussman and gave a birth date of November 17, 1962. Leslie Jay, a spokeswoman for Penthouse publisher Bob Guccione, also said Lords showed identification indicating that she was older than 18 before the illicit photos for the September 1984 issue were taken.[19] When investigators used Lords’ fake birth certificate and fake state identification cards to locate the real Kristie Nussman, Nussman said that her birth certificate had been stolen a few years earlier and that an impostor had apparently forged her name on official forms. Two adults who knew Lords, but who requested anonymity, said they saw her picture in the adult magazine Velvet during July 1984 and telephoned the district attorney’s office to inform authorities that she was underage, but that an investigator told them, “There isn’t anything we can do about it.”[20][21]"
    },
    {
      "author": "Uhhh_what555476384",
      "timestamp": "",
      "body": "I'm reposting it as a top level reply to original poster.One of the replies you recieved was about the way the internet is broadcast everywhere and how it's probably a crime somewhere.  So here it goes:\"Knowing how laws are often written, I would expect at least one or more US states have a law about child abuse written broadly enough to apply. Whether that's under a theory of \"sexual abuse\" or \"child abuse\" that covers non-physical acts (for example, explicit lewd conversations with children, or telling a child that you will give them money for future sex acts).\"I didn't even think about this and I'm a public defender in Washington State. This is a felony. Communication With a Minor for Immoral Puproses.https://app.leg.wa.gov/RCW/default.aspx?cite=9.68A.090"
    },
    {
      "author": "Awesomeuser90",
      "timestamp": "",
      "body": "Contracts made by a minor can often be voided once they become an adult, if they give back the consideration they got. It might well not bind her to actually deliver it, if she disclaims the contract and returns the money. I don't know if this is especially helpful to answer this question but it is something I suppose."
    },
    {
      "author": "rustys_shackled_ford",
      "timestamp": "",
      "body": "Well can a minor enter Into a legal contract?Can the hurt parties prove that the offending party made a promise for something in exchange for money and then refused to make them whole or refund the money?not assumptions based on this or that. A legal case would need evidence that something was clearly advertised or promised that is now no longer being upheld.The \"court\" would look at alot of these things to make thier decision, and I'm sure it would be case by case.I'm sure theres a judge who would say, throw out every case because of the minor thing, and any reasonable adult should know better then to try and enter Into a legal contract with a minor. So the pervs got exactly what they deserved.If a judge decided they were willing to hear the facts beyond the minor thing, they would almost certainly want to see some proof that the person made certain promises and is now not willing to full fill said promises. Which, at worst would be a refund. This would probably look like a verified DM, message, or post that clearly states adult content to come one shes 18. And even then, what does adult mean here? A good lawyer would argue adult could range from racy pics to triple X content.The biggest head scratcher in your question is in your 'did the subscribers do anything wrong?'.... In that paragraph you make alot of assumptions the court simply wouldnt make.When something comes to court, it needs to be clearly defined. If 100 men started a sub because they were hoping for Bob's and vagins,  but that was never clearly stated, your looking at 100 idiots that have absolutely no case."
    }
  ]
}