{
  "subreddit": "escaperooms",
  "post_id": "7mqoo5",
  "title": "Escape room with strangers?",
  "body": "So my family of four (mother and three adult sisters) booked a room earlier this week for tomorrow. I was hoping no one else would book the same room since this place allows a maximum of 8 people in a room but apparently another group of four has. Has anyone here had any experience working with strangers? I'm really worried it won't be as fun and that it will just be awkward.",
  "author": "RygardBair",
  "comments": [
    {
      "author": "VampNightClub",
      "timestamp": "",
      "body": "It's not a good idea to play with strangers in a large group. If it's 2 people and another 2 this has been ok for us, if it's an 6-10 person max room. Basically 2 couples, in an 8 person max room, was ok. The common problems are only \"potentially\" going to make it bad. Two we did with strangers were \"bad\", but both times that had to do with over stuffing the room. You can also get DRASTICALLY different skill levels, a group of \"newbs\" gets robbed of a lot of the puzzling, with a matching group of experienced players. Call the company and ask when they shut down booking for an empty room. It varies from till the last minute, to 1.5 hours before the time slot. This lets you wait until you are sure it's empty to book. I can't stress enough strangers are a gamble that could ruin a VERY expensive hour. Many (smart progressive minded) rooms are booked for solo groups now, they just charge a little more for 1/2 max, or so. Example it's $31 for 2-4 people, $27 for 4-6 people and say $25 for 8-10."
    },
    {
      "author": "varineq",
      "timestamp": "",
      "body": "I’ve done it a few times with strangers and it was fine. We actually got along with one group so well that we stay in touch and occasionally do escape rooms together."
    },
    {
      "author": "FrontierPsycho",
      "timestamp": "",
      "body": "I live in Europe, where I hadn't even considered doing a room with strangers. Then I visited the US, where almost all rooms could only be booked  with strangers, except if one booked the entire room (and the few that didn't do this were more expensive and advertised it as a perk).We did one room with strangers, and fortunately we were enough people to completely book the second room we did.The one with strangers was weird, it took ten people and was very disjointed and had lots and lots of optional stuff to find, so that people could work all over the room all the time. At the same time, that meant it was very hard to solve the main puzzle. It didn't work for me. It was the first (and only, to date) room we didn't complete, and we didn't have as much fun.I can only imagine what it would be like to do a more regular sized room, four of us and two strangers, or three of us and three strangers. It, obviously, all depends on who you'll be matched with, which is the entire reason one should only go with their friends, as then you know what you're signing up for: with strangers, you can't. They can be much worse or much better than you, which makes for an awkward experience, IMHO.Or you could be lucky :-)"
    },
    {
      "author": "MuppetManiac",
      "timestamp": "",
      "body": "Every time I’ve failed a room it’s been with a group of strangers. With my regular crew I can beat most any room. Strangers throw a kink in things. It’s doable, but certainly more difficult."
    },
    {
      "author": "blacjax",
      "timestamp": "",
      "body": "As someone who currently works at an escape room I've probably seen every combination of group dynamic out there. For the most part what people in this thread have been saying is true-a group of strangers is a gamble; that being said you and your family do have some say in how it all works out.I'm sure ya'll are very nice people but remember that everyone in the room is escaping from the same room so for the time you're in the room these four strangers are now part of your group. Don't ignore them and just work within your family-introduce yourselves, crack a small joke, ask them what their experience is, etc. The groups that actively engage with the other group has a lot more fun (and a higher success rate) than those that choose to isolate them.Lastly, the rooms are kind of designed to accommodate the maximum number so having these extra hands might help.Good luck either way!"
    },
    {
      "author": "Bcashdaddy",
      "timestamp": "",
      "body": "Think of it like going to the movies or a restaurant, or ball game. There will be other people. There might be kids. Could be good or bad. If you don't have a good experience, let the staff know and they should be able to help you find a solution."
    },
    {
      "author": "jondarmstr",
      "timestamp": "",
      "body": "I've had a good time with other strangers, especially if they're experienced in escape rooms. Just be friendly and positive"
    },
    {
      "author": "Jah-Eazy",
      "timestamp": "",
      "body": "First time I did an escape room it was with two of my friends, two sisters of one of those friends plus one of those sister's boyfriend. We were joined by four people who I think were like a sibling couple thing cause one couple was around our age and the other couple was like in high school. It was fun. They weren't weird or anything and the guy laughed at all my jokes lolI did another one with a club from my school. It was three others and I didn't really know them. But once it got going, it didn't really matter, though two of them were kinda just going along for the ride"
    },
    {
      "author": "EscapeWilmington",
      "timestamp": "",
      "body": "I've actually won every single room I've played with strangers with the exception of one.Generally, playing with strangers is awesome and I think because there is no interruption or distraction through in-jokes and the like, stranger groups tend to be more focused on the goal.However, though the only bad experience I've had with children was in a private booking with a family - if you can avoid having kids in the room, do it."
    },
    {
      "author": "RygardBair",
      "timestamp": "",
      "body": "Ultimately, it depends on the people, both you and the other team.  We've stopped booking 'party rooms', and now we only do private rooms similar to what @vampnightclub mentioned.Ultimately, we had fairly few issues with the mixed groups, generally everyone still gets into it, and had a great time, assuming the room itself is good.My personal preference had always been to play with just my group, and I always call escape rooms to try to arrange this one way or another, but sometimes you just have to go with it."
    }
  ]
}