{
  "subreddit": "paypal",
  "post_id": "rus2tu",
  "title": "How does PayPal verify your age?",
  "body": "Paypal asks to verify your ssn and photo ID to use the account, so I proceeded to do that.\n\nMy friend suggested that he “change” my passport photo to make the age 18. (Because I’m only 17). Through some software\n\nI know this probably a downside to this, but could PayPal see your age through your ssn or full name?",
  "author": "Invoked6",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »If you have not done so,Read our FAQ!which answers most questions.Please note that with the current CoVid-19 crisis that support is very limited at PayPal. No one here can fix that or offer solutions. The most common answer is to telephone PayPal support. However at this time such a call may be frutile, though you can keep trying.Try contacting PayPal support using social media such as Facebook or Twitter as this works more often than telephoning.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "TimeResolution9",
      "timestamp": "",
      "body": "PayPal will close your account since you're under 18."
    },
    {
      "author": "tgruch714",
      "timestamp": "",
      "body": "Yes your SSN will say your true age on it. Banks,financial institutions, and background checks can tell you + or - on if the SSN has been around for 18 years"
    },
    {
      "author": "wizardstrikes2",
      "timestamp": "",
      "body": "All is the above and it is a felony offense.  For real don’t do it.  Ask your parents to setup an account for you."
    },
    {
      "author": "TheREALCheesePolice",
      "timestamp": "",
      "body": "If your not bright enough to realize your SSN, has your age built in , your not smart enough to get away with forged documents …..Sorry but that’s a fact"
    },
    {
      "author": "NEHOG",
      "timestamp": "",
      "body": "Do not submit altered documents!It is a criminal offense (wire fraud.)PayPal will know IMMEDIATELY you altered it because: they check the documents!Once caught you'll be permanently banned from PayPal.Oh and yes, your SSN will reveal your age/birthdate to PayPal."
    },
    {
      "author": "bitflowers",
      "timestamp": "",
      "body": "Don't worry PayPal won't check your SSN details, they just want to see SSN photo. ID also they not care too much, if your friend saying that he'd edit, it's okay. Mostly robot will check and they just compare digits with your information at PayPal. After that robot will delete all uploaded files from their server. Next time whenever you'll turn to 18, you can upload original passport."
    },
    {
      "author": "Invoked6",
      "timestamp": "",
      "body": "Just to clarify, it wouldn’t work unless I’m actually 18, correct?"
    }
  ]
}