{
  "subreddit": "discordapp",
  "post_id": "1g1771v",
  "title": "How does Discord know my age?",
  "body": "I don't think I ever added my age in my Discord profile, and I can't find it in my profile. Yet, now I got a diablo ad with this pop up window. I use Discord to follow gaming communities, but I can't figure, but I don't know how it knows my age. Is there any way to check it or even change my age?",
  "author": "AlternativeLength231",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »If this is a bug report or technical issue, please also post aproperly formatted commentin the Monthly Megathread pinned at the top of the subreddit. It is closely monitored and prioritized by Discord. Thank you.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Otherwise_Sol26",
      "timestamp": "",
      "body": "When you first sign up for Discord, you would have to enter your date of birth. So it makes sense they got your age from there.However, from what I read, Discord doesn't store your birthdate. They only need it to determine whether you're under/above 18 and you can view NSFW server or not"
    },
    {
      "author": "Distinct_Crow_9734",
      "timestamp": "",
      "body": "when you first make ur account you put your age"
    },
    {
      "author": "DarkOverLordCO",
      "timestamp": "",
      "body": "Discord use machine learning to predict your age range,there was a post a couple days agothough they've been doing it for much longer."
    },
    {
      "author": "letsplayer27",
      "timestamp": "",
      "body": "You have to add it when you’re making your account"
    },
    {
      "author": "SonicLeaksTwitter",
      "timestamp": "",
      "body": "😐"
    },
    {
      "author": "Wypman",
      "timestamp": "",
      "body": "it could be based on just location and activity maybe?"
    },
    {
      "author": "zvadlekvitky",
      "timestamp": "",
      "body": "With signing in you have to input birthdate info"
    },
    {
      "author": "Fit_Combination_6936",
      "timestamp": "",
      "body": "How did you get to that screen?"
    },
    {
      "author": "AlternativeLength231",
      "timestamp": "",
      "body": "Probably by the birthdate you set it to when you first made the account"
    }
  ]
}