{
  "subreddit": "TheoryOfReddit",
  "post_id": "18hu873",
  "title": "Reddit Should Be 18+",
  "body": "I believe that Reddit should require the user to verify (credit/debit card, passport, birth certificate, driving licence, etc) that they are over the age of 18. I have numerous reasons for my belief, but my 5 main points are as follows:\n\nExtreme Gore and Pornography- I’ve never understood why gore and porn videos are even on Reddit in the first place, but that’s a different point. I (and I would hope most people would agree) don’t believe that children should be viewing scarring, horrific, vile gore and pornography.\n\nGrooming- Reddit gives predators an easy, unregulated, anonymous chat room to talk to and groom minors without any sort of parental or adult supervision. We wouldn’t allow 13 year olds to talk to random strangers alone in real life, yet it’s completely acceptable online. There have also been countless cases of children sending nudes and other sexual content to adults on the internet.\n\nBullying- Bullying is already a huge enough problem in real life, add on to that anonymous people from anywhere in the world insulting or even sexually harassing minors on Reddit and you’re asking for severe depression leading to possible suicide.\n\nRadicalisation- Read the comment section onr/islam(for example) on a video of a gay man getting murdered and there will be countless children (assuming by their vocabulary, profile pictures, etc) commenting horrendous comments like “Doing Gods work”, “Based”, etc. This also holds true for Islamist radicalisation where there are comment sections full of Muslim children praising Jihadists including the evil murderer of Samuel Paty.\n\nMisinformation and Propaganda- There is a concerning amount of obvious Russian/Chinese/etc bots on Reddit who can easily manipulate naïve children. There are also harmful “hacks” and medical “remedies” that children are more likely to follow.\n\nThere are several other reasons why I feel this way, but I’ve tried to keep my post as clear and concise as possible.",
  "author": "MyThrowaway1890",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Welcome to social media.You'll find that points youve mentioned here can be found on every platform on the internet.You'll also find that most users do not want to provide private information and for good reason. This info gets leaked on a regular basis. It's leaked from bad actors inside the company, accidently, and by users with malicious intent. There are entire marketplaces for this info."
    },
    {
      "author": "17291",
      "timestamp": "",
      "body": "I believe that Reddit should require the user to verify (credit/debit card, passport, birth certificate, driving licence, etc) that they are over the age of 18.Sounds like a privacy disaster waiting to happen"
    },
    {
      "author": "GaryNOVA",
      "timestamp": "",
      "body": "OP is the fun police"
    },
    {
      "author": "devperez",
      "timestamp": "",
      "body": "Would you make all social media 18+? Or just Reddit? They all have these same issues, so I'm curious as to how Reddit is different here."
    },
    {
      "author": "dissenting_adult",
      "timestamp": "",
      "body": "In theory, I strongly agree with you.In practice, I don't know how to overcome the two very strong difficultles:Privacy and security - see the other commentsApathy - the Reddit owners and admins just don't care; they just want volume from anyone and everyone.Something similar is done on some subreddits.r/AskDocsandr/Ask_Lawyershave rules requiring that commenters submit evidence of their credentials. I don't know how, or if, the mods handling that evidence keep it secure.Someday, someone will figure out how to securely verify the identity of posters, and start another social platform similar to Reddit.  When they do, and it gains some traction, I for one will quickly drop Reddit for such a platform."
    },
    {
      "author": "AChickenInAHole",
      "timestamp": "",
      "body": "Debit cards aren't accepted for age verification by Google because plenty of teenagers have them."
    },
    {
      "author": "DharmaPolice",
      "timestamp": "",
      "body": "Will someone please think of the children!Also, this is not going to happen (unless enforced by law) since it would crash Reddit's user base. Not because everyone is under 18 but a lot of people don't want to verify their age by giving documents over.Besides:Gore/etc - can be found on the wider internet and I'm skeptical it is that harmful.Grooming - is there any evidence this is happening? Would seem to apply to any site where there is messaging. You could always disable PMs for unverified users if this were a serious danger (it isn't).Bullying. Isolated insults from across the world are not bullying. Unlike Facebook or TikTok your identity is not tied to your account so if someone insults you just create a new account. Again, I'm skeptical this is an issue - kids need to be able to cope with being insulted.Radicalisation. This is happening via YouTube and TikTok more than here. And even if you don't allow them to signup they can still read comments unless you hide the site from Google (crushing a huge part of Reddit's value).Misinformation. Trying to hide information from people doesn't work. And is a larger problem elsewhere.Overall this all sounds like a classic moral panic driven by authoritarianism. Younger children should be supervised with internet usage generally. Older children / teenagers can cope with Reddit which is pretty tame overall.And if you ban them here they'll just use 4chan which is many times worse."
    },
    {
      "author": "Ayjayz",
      "timestamp": "",
      "body": "Reddit is 18+. Parents shouldn't let their kids on here.It's not something for Reddit or anyone but the parents to worry about."
    },
    {
      "author": "MyThrowaway1890",
      "timestamp": "",
      "body": "I hate this argument so much. Most parents are objectively not the best. It’s impossible to actually regulate what your child is looking at. We wouldn’t say “Let’s not help drug addicted teens, it’s their parent’s responsibility.”"
    }
  ]
}