{
  "subreddit": "walmart",
  "post_id": "1c8bvk0",
  "title": "Alcohol ID policy",
  "body": "if someone is in their 40s, and there is zero chance that they are under 21, is it necessary to ID them?   Why would a worker ID them?  Do some workers feel a sense of power when they ask for ID?",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Lefty68w",
      "timestamp": "",
      "body": "It’s the law and the easiest way to not break the law is simply request id from anyone buying anything age restricted"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Besides the law and stores that have failed stings, it just becomes a habit. And where I live, when you ask, you HAVE to see the ID before making the sale. You can't change your mind, technically. On many occasions, I asked out of habit, realized the person was like 60, but had to insist on seeing the card. Dealing with age restricted items is not fun, and it's not a power trip, especially when stubbborn customers throw a fit over us just doing out jobs and trying not to lose them or even get into legal trouble"
    },
    {
      "author": "WapaneseWeeaboo",
      "timestamp": "",
      "body": "If you/any other customer appears under 40, the employee is to ask for an ID to verify the age. The only exception to this if that store has failed age check stings, and in those cases they’re required to IDeveryonethat’s buying anything age restricted, don’t matter if they look 100.Don’t like it? Shop elsewhere."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "We have every right to ID anyone that we wish. If you don't have a valid ID, we can refuse the sale. Don't like it? Show your ID or fuck right the hell off. You are NOT entitled to special treatment."
    },
    {
      "author": "Screaming_InternalIy",
      "timestamp": "",
      "body": "Always always always id. Doesnt matter if they look 20 or 80"
    },
    {
      "author": "Apart-Ad923",
      "timestamp": "",
      "body": "Walmart pays people to come into the store to see if we’re carding people if you fail you get a “red card” which means a coaching lol plz be careful with this"
    },
    {
      "author": "badeboy993",
      "timestamp": "",
      "body": "Someone didn't do their job and Walmart must have gotten busted, so instead of educating their employee's, can't teach a turnip crap, they just set absurd alcohol ID policy. Well it just cost them $75.00 sale today. The lady said that if I were by myself she would not card me, but because my wife \"LOOKED\" under 40 to her (the cashier) and we were together, she insisted my wife show her ID. Well we don't carry our ID with us. I'm 63 my wife is 52. HEY WAL FART. how about you find some reasonable educated people to run your registers and you won't lose sales. I won't be going back to walfart to buy anything anymore for the simple fact that they are the stupidest, most ignorant company I have ever encountered with absurd ridiculous policies because they are unable to train their employees, but want to screw the consumer for their own short falls. BYE-BYE WALFART."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yes some of them definitely do it as a power trip .  There’s one self checkout clerk that “asks me” for id every time despite the fact I’m over 40 and work there and she knows it .  I say “asks me” because she just comes over and stands there and I have to ask her if she wanted to see my id ."
    }
  ]
}