{
  "subreddit": "law",
  "post_id": "1hiw76d",
  "title": "Pornhub to block access in Florida amid lawsuit over state’s age verification law",
  "body": "",
  "author": "kingtacticool",
  "comments": [
    {
      "author": "ControlCAD",
      "timestamp": "",
      "body": "Pornhub says it will block access to its website in Florida as an adult entertainment advocacy group sues over the state’s new law requiring age verification.HB-3, an act relating to online protections for minors, will go into effect in the Sunshine State on New Year’s Day, requiring adult websites to prevent children from accessing them.Mike Stabile, a public policy director with Free Speech Coalition, a group that advocates for the adult entertainment industry, says he is concerned about the steps that will be used to verify someone’s age.“When you’re uploading an ID or when you’re doing this type of verification, nothing is ever secure,” Stabile said.Free Speech Coalition is the lead plaintiff in a federal lawsuit seeking to prevent the law form taking effect over privacy and free speech concerns.“You are asking people who are legal adults to risk their privacy and risk possible surveillance to access the internet,” Stabile said.Since 2022, 19 states have passed laws requiring age verification to access adult websites.Ian Corby, the director of global group Age Verification Providers Association, pushed back, saying personal information will be protected.“The Florida law includes, explicitly, a requirement for anonymous age verification done by a third-party. Our entire industry was created to prove your age online and not have to disclose your identity,” Corby said.It’s a measure that was passed with overwhelmingly bipartisan support.“All we are trying to do is to make the same laws apply in the online world as applied in the real world,” Corby said.Florida Attorney General Ashley Moody is listed as the defendant in the case.“As a mother, and Florida’s Attorney General, I will fight aggressively in court to ensure the ability to protect Florida children,” Moody said.Aylo, Pornhub’s parent company, released a statement after vowing to block access to users statewide as a form of protest that read in part:“First, to be clear, Aylo has publicly supported age verification of users for years, but we believe that any law to this effect must preserve user safety and privacy, and must effectively protect children from accessing content intended for adults.”“Unfortunately, the way many jurisdictions worldwide, including Florida, have chosen to implement age verification is ineffective, haphazard, and dangerous. Any regulations that require hundreds of thousands of adult sites to collect significant amounts of highly sensitive personal information is putting user safety in jeopardy. Moreover, as experience has demonstrated, unless properly enforced, users will simply access non-compliant sites or find other methods of evading these laws.”"
    },
    {
      "author": "Sabre_One",
      "timestamp": "",
      "body": "Doesn't surprise me. No one wants to be responsible for all that personal data."
    },
    {
      "author": "kingtacticool",
      "timestamp": "",
      "body": "Shots. Fired."
    }
  ]
}