{
  "subreddit": "VRchat",
  "post_id": "1jdvfbi",
  "title": "What's the deal with Age Verification?",
  "body": "As someone that has played since around 2018,  slowly experiencing the degradation of the public experience from the rise of kids infesting everywhere I go (most notably around the release of the quest), how long do we expect age verification to be gated behind a paywall? I understand the business necessity for this, but as someone that has complained as early as 2021 shouting my problems from the rooftops, why are we JUST now getting this feature that makes this \"game\" playable again? It's not even that the money is the direct problem, but the separation of people willing to pay a fee to not talk to solely kids is no different that everyone deserting public lobbies for inclusive private ones? As a long time VRC+ subscriber for a while between then until ~2023, with founder badge etc. how has this not been in development and planning for way earlier?\n\nI'm assuming that verification wouldn't go away after the initial month but do we have any idea how long this period should last? God forbid someone wants to introduce a friend to VRC only to tell them that they need to pay money to talk to someone not remotely braindead? The separation of the (adult) public community is what drove me away from the game a while ago, and I fear that this \"feature\" would only incentivize VRC to remain gated behind a paywall forever, recurring subscription and all.",
  "author": "Lycos_hayes",
  "comments": [
    {
      "author": "BobLeMaladroit",
      "timestamp": "",
      "body": "Im not sure about the time it will take to be available to everyone but I know if you verify and then run out you are still verified and are able to join the 18+ instances."
    },
    {
      "author": "Bahamut1988",
      "timestamp": "",
      "body": "I doubt it will be, since creating groups is also still VRC+ only, and they said that was also temporary"
    },
    {
      "author": "SocietyTomorrow",
      "timestamp": "",
      "body": "From the company side, it costs anywhere from $8-15 to do an ID verification with the companies that do it. They're charging because they cant take a loss to verify ID. If the government came up with a free program to privately verify age (because they seem to want that for pron pretty bad) then I could see VRC doing it since it would be neutral for them."
    },
    {
      "author": "Docteh",
      "timestamp": "",
      "body": "VRChat works slowly on things because anything they do, someone will panic about it. Just today I saw a bunch of people all worried that people putting stickers on things might be disparaging to vtubers, and that if they can't prevent stickers in worlds they'd have to take them down.  God forbid photoshop exist.I just checked age verification of all my friends, 21%. Last time I checked it was like 10% so its a going, but I know a lot of people who aren't in a hurry."
    },
    {
      "author": "Strawberry_Sheep",
      "timestamp": "",
      "body": "They've said it's because it costs them money for every verification so they can't make it free. Similar platforms (second life, IMVU, etc) all paywall their age verifications for the same reason. Also because paywalling it adds another layer of verification since the subscription for VRC+ can't be paid for with steam wallet and has to have a credit/debit card attached to the steam account. Though VRC+ gifting is still possible"
    },
    {
      "author": "BUzer2017",
      "timestamp": "",
      "body": "\"since the subscription for VRC+ can't be paid for with steam wallet and has to have a credit/debit card attached to the steam account.\"huh? It absolutely can be paid with a Steam wallet.I use Steam wallet to buy vrc+ and vbucks all the time."
    },
    {
      "author": "FemBoyGod",
      "timestamp": "",
      "body": "I’m ngl I support age verification, it just makes sense for people who want to join 18+ only servers.Idk maybe I’m weird, but I’ll gladly pay the fee"
    },
    {
      "author": "FatedHero",
      "timestamp": "",
      "body": "They’ve never stated verification would always be locked behind vrc+. The select group phase was mostly just to test out world stability and the core functionality of it. Now with vrc+ it’s probably a big stress test and or data gathering at a much larger scale. I don’t see it staying locked behind a paywall forever nor do I think it’s caused a “major” uptick in vrc+ sales."
    },
    {
      "author": "Lycos_hayes",
      "timestamp": "",
      "body": "We currently have a multi layered issue related to verification:-larger groups don't want to do age verified instances due to not all their members having verification, and by extension, ostracizing those who don't.-groups that use bouncers instruct their bouncers to not use verification status as a check due to misinformation about kids being able to bypass it.-we're still on phase 2 of the roll out of verification, with phase 3 being access to all, and we have no timetable on how long this phase will be."
    }
  ]
}