{
  "subreddit": "AvakinOfficial",
  "post_id": "17gphl2",
  "title": "Age Verification",
  "body": "Recently tried to do the age Verification and it failed. I tried doing it through my ID and that also failed as my ID is different for people under 21. I contacted Yoti and they told me to contact Avakin life, and I did. I'm 19 and I have a drivers license and a security card, as I work as a Security guard. I already paid for it so I was wondering who would I talk to to get this fixed or did Avakin life just take my money?",
  "author": "Open_Honey6903",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Is this a bug report? Is this a suspension or ban query? Please do not post those, we cannot help with them here. If you have a bug report or account issue, our Player Support will be happy to help in the app or athttp://avakin.com/supportHi! Welcome to the official Avakin Life Subreddit! When posting here, please choose a post flair to match the topic of your post, or choose \"Other\" if you're not sure. We appreciate you reading the rules before posting. Thanks so much. Have fun!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "ClubSundown",
      "timestamp": "",
      "body": "Hi. Exactly the same happened to me. I'm 29. It didn't tell me I looked under 18. It just told me the verification failed. I think the photo capture was too blurry. Same with my passport capture. I contacted avakin support. Here's their answer: for those of us who fail to verify we have to wait 30 days before we can try againI have another question: did you try several attempts? If so did it charge you on each attempt? I tried just 1 attempt with photo capture and a attempt with my passport"
    },
    {
      "author": "Stephenrules15",
      "timestamp": "",
      "body": "Okay I'll wait 30 days. I managed to get my money back from Google so I'll wait and try and see if that works. Thank you."
    },
    {
      "author": "Stephenrules15",
      "timestamp": "",
      "body": "Update: I got the Yoti app and it verified me as 18+. Now how would I go about sending that to Avakin?"
    },
    {
      "author": "Aromatic_Flow_9036",
      "timestamp": "",
      "body": "If u payed for verification u might need to delete and reinstall the game cause the game been glitching a lot lately"
    },
    {
      "author": "Magicquest213",
      "timestamp": "",
      "body": "You must verify through the Avakin Life App."
    },
    {
      "author": "SeaPalpitation1848",
      "timestamp": "",
      "body": "a similar thing happened to me, I’m 19 and my photo didn’t work but my ID did and now I’m verified. For some reason though i was charged twice for it"
    },
    {
      "author": "YaniSky",
      "timestamp": "",
      "body": "I stopped playing this game, but I tried the verification to see how that would go, paid it, got my selfie taken, and it said I was verified and it said i received my badge and background. Saw the verification Icon on my profile but the badge was still locked, so I restarted the app. Got back on and the icon was gone and I still don’t have the badge or background, this was when it first came out and till this day still don’t have anything, tried clicking on the verification button in settings again and it displays the same error everyone’s been getting. They can never do anything right.. actually got verified with just the selfie and still don’t have anything from it. That’s LKWD for you😐 oh and they still got my money too.."
    },
    {
      "author": "Open_Honey6903",
      "timestamp": "",
      "body": "Glad it didn’t charge me yet I couldn’t get that far before it says error and completely freezes, ig I’ll wait it out for a month or two then try"
    }
  ]
}