{
  "subreddit": "nanowrimo",
  "post_id": "1fvbegu",
  "title": "New email from NaNoWriMo is…interesting",
  "body": "“To Our NaNoWriMo Community:\n\nThere is no way to begin this letter other than to apologize for the harm and confusion we caused last month with our comments about Artificial Intelligence (AI). We failed to contextualize our reasons for making this statement, we chose poor wording to explain some of our thinking, and we failed to acknowledge the harm done to some writers by bad actors in the generative AI space. Our goal at the time was not to broadcast a comprehensive statement that reflected our full sentiments about AI, and we didn’t anticipate that our post would be treated as such. Earlier posts about AI in our FAQs from more than a year ago spoke similarly to our neutrality and garnered little attention.\n\nWe don’t want to use this space to repeat the content of the full apology we posted in the wake of our original statements. But we do want to raise why this position is critical to the spirit—and to the future—of NaNoWriMo.\n\nSupporting and uplifting writers is at the heart of what we do. Our stated mission is “to provide the structure, community, and encouragement to help people use their voices, achieve creative goals, and build new worlds—on and off the page”. Our comments last month were prompted by intense harassment and bullying we were seeing on our social media channels, which specifically involved AI. When our spaces become overwhelmed with issues that don’t relate to our core offering, and that are venomous in tone, our ability to cheer on writers is seriously derailed.\n\nOne priority this year has been a return to our mission, and deep thinking about what is in-scope for an organization of our size. A year ago, we were attempting to do too much, and we were doing some of it poorly. Though we admire the many writers’ advocacy groups that function as guilds and that take on industry issues, that isn’t part of our mission. Reshaping our core programs in ways that are safe for all community members, that are operationally sound, that are legally compliant, and that are mission-aligned, is our focus.\n\nSo, what have we done this year to draw boundaries around our scope, promote community safety, and return to our core purpose?\n\nWe ended our practice of hosting unrestricted, all-ages spaces on NaNoWriMo.org and made major website changes. Such safety measures to protect young Wrimos were long overdue.\n\nWe stopped the practice of allowing anyone to self-identify as an educator on our YWP website and contracted an outside vendor to certify educators. We placed controls on social features for young writers and we’re on the brink of relaunch.\n\nWe redesigned our volunteer program and brought it into legal compliance. Previously, none of our ~800 global volunteers had undergone identity verification, background checks, or training that meets nonprofit standards and that complies with California law. We are gradually reinstating volunteers.\n\nWe admitted there are spaces that we can’t moderate. We ended our policy of endorsing Discord servers and local Facebook groups that our staff had no purview over. We paused the NaNoWriMo forums pending serious overhaul. We redesigned our training to better-prepare returning moderators to support our community standards.\n\nWe revised our Codes of Conduct to clarify our guidelines and to improve our culture. This was in direct response to a November 2023 board investigation of moderation complaints.\n\nWe proactively made staffing changes. We took seriously last year’s allegations of child endangerment and other complaints and inspected the conditions that allowed such breaches to occur. No employee who played a role in the staff misconduct the Board investigated remains with the organization.\n\nBeyond this, we’re planning more broadly for NaNoWriMo’s future. Since 2022, the Board has been in conversation about our 25th Anniversary (which we kick off this year) and what that should mean. The joy, magic, and community that NaNoWriMo has created over the years is nothing short of miraculous. And yet, we are not delivering the website experience and tools that most writers need and expect; we’ve had much work to do around safety and compliance; and the organization has operated at a budget deficit for four of the past six years.\n\nWhat we want you to know is that we’re fighting hard for the organization, and that providing a safer environment, with a better user interface, that delivers on our mission and lives up to our values is our goal. We also want you to know that we are a small, imperfect team that is doing our best to communicate well and proactively. Since last November, we’ve issued twelve official communications and created 40+ FAQs. A visit to that page will underscore that we don’t harvest your data, that no member of our Board of Directors said we did, and that there are plenty of ways to participate, even if your region is still without an ML.\n\nWith all that said, we’re one month away! Thousands of Wrimos have already officially registered and you can, too! Our team is heads-down, updating resources for this year’s challenge and getting a lot of exciting programming staged and ready. If you’re writing this season, we’re here for you and are dedicated, as ever, to helping you meet your creative goals!\n\nIn community, The NaNoWriMo Team”\n\nEDIT: Fixing my grammar/structure mistakes cuz I shared this email while waiting for my doctor’s appointment",
  "author": "RealAnise",
  "comments": [
    {
      "author": "diannethegeek",
      "timestamp": "",
      "body": "\"We proactively made staffing changes\" No, their entire staff walked out in April. If they fired anyone, they took desperate measures to hide it, letting Faulkner step out gracefully on his own terms and hiding the staff page once people started to ask why others were missing."
    },
    {
      "author": "Apothecary-Apollo30",
      "timestamp": "",
      "body": "Honestly not surprised they don't want to outright admit that the staff left or that the grooming incident was handled really horribly and took longer than necessary and they also victim blamed the victims lmaoOf course they'll never outright admit THEY were at fault for anything lolJust blame the community. See how well your dumpster fire stays afloat."
    },
    {
      "author": "Routine_Pumpkin8438",
      "timestamp": "",
      "body": "Is it just me or did this feel weirdly condescending/ blaming the community?"
    },
    {
      "author": "FieryArtemis",
      "timestamp": "",
      "body": "That’s how I felt too. Maybe they did get some truly vitriol that could be classified as harassment and bullying but it couldn’t have been the community as a whole. Yet they are admonishing us like we are all perpetrators. Interesting take to have when they post the link to donate right after the email."
    },
    {
      "author": "Lost_Type2262",
      "timestamp": "",
      "body": "Nope, not just you. Classic \"sorry you were offended\" energy. Not a sincere apology."
    },
    {
      "author": "Nastybirdy",
      "timestamp": "",
      "body": "\"and we didn’t anticipate that our post would be treated as such\" or \"How dare you interpret our words in the way we wrote them!\"There's so many little digs at the community all through this email. It's OUR fault for reacting the way we did. OUR fault for responding to their statements the way we did. Never their fault because they're \"a small, imperfect team\".Unimpressed."
    },
    {
      "author": "bioticspacewizard",
      "timestamp": "",
      "body": "\"Our comments last month were prompted by intense harassment and bullying we were seeing on our social media channels, which specifically involved AI. When our spaces become overwhelmed with issues that don’t relate to our core offering, and that are venomous in tone, our ability to cheer on writers is seriously derailed.\"I genuinely don't think that NaNoWriMo understands what harassment and bullying are. They keep using this in defense of their actions, but all I've seen are people raising genuine concerns and them being swept aside as \"vitriol.\"Literally, all of this could have been avoided by making a clear, open, and public channel of communication with the community."
    },
    {
      "author": "notantonbaine",
      "timestamp": "",
      "body": "So basically \"We want to talk about our error with the AI statement that made you all abandon ship by... saying that our AI stance is crucial to 'the spirit of nano' and us shutting down the forums last year instead of taking any other action is good actually.\""
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I realized yesterday that Kilby's author headshot is literally AI generated, so I'm no longer even a little surprised that the goal is to double down on supporting AI as much as possible with her in charge."
    },
    {
      "author": "RealAnise",
      "timestamp": "",
      "body": "Are they going to apologize for calling criticism of AI \"ableist?\" The steel plate in my head would like to know."
    }
  ]
}