{
  "subreddit": "technology",
  "post_id": "18xhfm1",
  "title": "Pornhub blocks Montana and North Carolina as their age verification laws take effect | The website says the states' ID requirement would put users' privacy at risk",
  "body": "",
  "author": "stepheno125",
  "comments": [
    {
      "author": "johnlewisdesign",
      "timestamp": "",
      "body": "They are correct and Montana/North Carolina's voters ain't gonna like it :)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "FuckingTree",
      "timestamp": "",
      "body": "It’s not just users’ privacy but also increases the odds that people will run into more risky, illegal, or predatory content. Ironically increasing the risk to minors substantially. When informed of the risks, the backers of the bills shrugged it off, they don’t care how it works in practice, they just wanted to get their name in something anti-porn. This will likely go to the Supreme Court, which has historically held that you cannot moderate the internet unless you have an effective way to do it fairly, which is a requirement that nobody is prepared to meet."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "mrdude05",
      "timestamp": "",
      "body": "These ID verification systems are absolutely going to be used for blackmail and character assassination in the future. A database with verified records of the amount/type of adult content you consume is ripe for exploitation"
    },
    {
      "author": "Top-Squash4714",
      "timestamp": "",
      "body": "This crap happened in Virginia too. Just becomes a massive headache to switch VPN location all over since some sites work and some don’t. This is the beginning of the lockdown of the internet by religious republican nutcases. All in the name of “won’t somebody please think of the children!”"
    },
    {
      "author": "biff64gc2",
      "timestamp": "",
      "body": "people: \"Can we take some of our tax dollars and cover school lunches so kids don't go hungry?\"R: \"No!\"People: \"A kid found some boobs online.\"R: \"PROTECT THE CHILDREN!\""
    },
    {
      "author": "continuousQ",
      "timestamp": "",
      "body": "As long as you've verified the age of the actors, the rest really shouldn't matter that much. Corporations and governments collecting everyone's private data is much worse than a teenager watching a video."
    },
    {
      "author": "stepheno125",
      "timestamp": "",
      "body": "Sad Virginia noises."
    }
  ]
}