{
  "subreddit": "Bricklink",
  "post_id": "17twal0",
  "title": "Bricklink Age Verification",
  "body": "Hypothetically, if my friend were to submit an ID for Bricklink's store verification with an altered date of birth making him appear to be over 18 when he is not, what would be the consequences? (I think you catch my drift.)\n\nI simply don't want him to be criminally punished for it. If the worst that can happen is the application will be rejected, then that is okay. Do you think Bricklink would take legal action? Seems extreme and daft I know, but don't want him to ruin his whole life because of this one silly thing.\n\nMy worry is that the ID submitted has to have his address and full name, making him easy to track down if they were to take legal action.\n\nDo Bricklink actually cross-reference the ID with a governmental database to see if the person is who they say they are? Or do they simply check the ID and see if it says they are 18+ or not?\n\nAny input is welcome.",
  "author": "cosmicrae",
  "comments": [
    {
      "author": "DrewKilleen",
      "timestamp": "",
      "body": "That's pretty sketchy territory. I personally wouldn't mess with that sort of thing. There's nothing wrong with setting the store up under a parent's name or other adult though."
    },
    {
      "author": "Depressed_Darth_",
      "timestamp": "",
      "body": "I think this is what I'll go for. Thanks Drew"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "depends on what state you are in but you could get a fine or some community service if your friend gets reported to have a fake id"
    },
    {
      "author": "__Booshi__",
      "timestamp": "",
      "body": "You're friend might not run into immediate problems from Bricklink, your friend would almost definitely run into problems on the finance side, most likely with Paypal, as Paypal does have checks to ensure you're old enough to open an account.If you're friend somehow managed to bypass Paypal's checks, then your friend is wading into some real potential legal issues, as minors cannot enter legally binding contracts without a guardian.Ultimately, the issues your friend would encounter, as a minor, would be Paypal and the required tax documentation from doing business. If your friend were to be audited for some reason, their real age would come out in the wash.Edit: There is Paypal for kids, but that too requires a guardian."
    },
    {
      "author": "Free_Economist_5312",
      "timestamp": "",
      "body": "I think it’s more of a tax/record keeping thing. “He’ll” be fine"
    },
    {
      "author": "cosmicrae",
      "timestamp": "",
      "body": "Over at PayPal, you get a lifetime ban for pulling that stunt. Minimum age of 18 is a legal requirement, not just something the site thinks is cool."
    }
  ]
}