{
  "subreddit": "FanFiction",
  "post_id": "sgec00",
  "title": "The way minors are treated in fandom",
  "body": "So. I’ve finally reached my boiling point where I just don’t feel like I can continue quietly seething about this issue all by myself in private. Hence me making this post. It's also tagged \"vent\" for a reason.\n\nI am just so sick of the way I see other adults in fandom (and it’s the reasonable adults! not the clamouring man-childs who engage in dumb shipwars and seem to think their headcanons are canon, but those who are proshippers, inclusionists (in other aspects at least, huh), YKINMKATO-advocates, you get the picture… in short, those you’d actually want to hang out with!) generally treat minors. And I’m not talking about instances of voicing understandable discomfort with minors reading their pwps or not letting them have access to the nsfw-channels in a discord server, but the way they are belittled for their narrow-minded views in thinking and yet unpolished writing abilities at best and treated as nuisances or second-class humans or Satan Incarnate that should all be banned from the internet and their precious fandom spaces at worst.\n\nI guess it doesn’t really make sense to be cagey about the aforementioned reason that I’ve reached my boiling point on this topic – it’s that I discovered the threat here on this sub from a few days ago where someone (who’s actually an adult too apparently! I didn’t think I’d ever see that day!) pointed out this very issue, and the comments wereflooded(like, I expected someone to make this point, I already know how the wind blows in fandom on that topic after all) with comments along the lines of “nooooooo, you’re wrong and delusional and it’s the evil, EVIL minors that are saying everyone over the age of 25/30 should get out of fandom and file their taxes!!!!!”\n\nNow, I’ve been on tumblr for several years. Twitter, too. Discord I’ve only started using last year and I’m notthatactive on it, but still, it’s not completely unfamiliar to me. And in all that time, I have NEVER come across someone who actually said this to me or someone else. Only endless variations of this anecdotal issue written about in countless posts and tweets that crossed my dashboard and/or feed. Really makes me wonder about what I seem to be doing correctly and others seem to be doing wrongly in the choices of fandom corners they hang out in if they come across those accusations so often.\n\nThings Ihaveseen in my experience on the internet though:\n\n- Way too many “minors dni/age in bio or block” declarations in bios that were supplemented with lovely name-calling\n\n- People with posts celebrating their 18th birthday dated like a month or two ago having aforementioned “minors dni you ****(lovely name-calling)” in their bios\n\n- Pictures of emojis with a gun pointed towards the screen and the text “I sure hope you’re not a minor” on it on my feed (maybe making a joke about gun violence/shooting at somebody is not that big of a deal in America with their liberal gun laws though? idk I abhor all death threats or threats of violence that are said as a joke and think that is never-ever okay but perhaps I’m too sensitive about this matter)\n\n- Author’s notes at the end of smut story that read, “if you minors don’t f*** off from here I’ll (gory description of violence that they want to do to them) (again, I totally understand this sentiment, but no, it’s not enough to voice how uncomfortable you are with minors reading your story, you just have to wish violent mutilation on them apparently)\n\n- Discord servers that had nsfw-channels that were locked behind a separate opt-in age-verification role that were nonetheless declared 18+. The mods asked whether the sever should be opened up to minors too and the largest part of the members declined. Why? Because minors stink and nobody wants to deal with them. Paraphrased by me now but that was still their main argument.\n\nGoing back for a moment to the statement of minors telling adults to go do their taxes and leave fandom, despite how my words might have come across earlier, I do not doubt that minors who think like that or openly make statements such as thosedoin fact exist. Likewise, I’m also not saying that someone who gets a comment on their smut that reads like “um excuse me I am nine and have just read this story, maybe don’t post it somewhere where 9-year-olds can find it” should answer with “yes of course your lordship, I will take care to desist this behaviour from now on and furthermore also take down all my other stories from my ao3 account that you could come across and make you uncomfortable.” And if one doesn’t want to interact with minors because of whatever reason to enhance their experience in fandom, that is totally within their right to decide of course – although in my opinion, that is something that applies to all conversations on the internet, you should also be allowed to end a conversation with someone who makes too many spelling errors or is too excitable or has a too-narrow view on an issue or whatever other things are usually attributed to minors only if they are in their 20s or 30s or 40s and so on, not just if they are a minor.\n\nBut for a community like fandom that is otherwise so zealous to be a home for minorities and people who don’t have any place they feel they belong, my disappointment is just so immense that it somehow seems to have become the “in” thing to do to discriminate against a whole group of people based on a characteristic that they have absolutely no influence over.\n\nI guess I was always sort of aware that I was lucky to have entered a community in the first fandom I ever joined that was otherwise made up solely of adults, who were however all like “hey, welcome aboard, we’re glad to have you here and share your stories with us that do absolutely nothing for us (note: of course they never said anything like that, but c’mon, people, I was ten, how much of a enjoyable reading experience do you think I could have created for them – and yet they still read & commented & encouraged me to continue), we’re all here to geek out about the same characters and story we all love and the passion for writing we share, and if you have both of that of course you’re one of us too”, but now I’m aware of howincrediblylucky I actually seem to have been for my first fandom experience to have been like that.\n\nI also guess being in my 20s, I am speaking from the lower end of the age spectrum of adulthood too, there is still plenty of time left for me to become a jaded fandom-old screaming “get off of my lawn you minors!!!” and “oh if we just had no minors in fandom, how much better everything would be” at every corner. But my hope is that I can manage to preserve the feelings from when I was a teen first discovering the beauty of fandom and the love and support for each other shared among fellow fans no matter the background, and treat kids who did not actively do anything to rain on my parade with the courtesy and respect they deserve as fellow human beings.\n\nTL;DR:\n\nOtherwise sensible and logical adult on twitter: Oh, why do all minors in fandom have to be so hateful and ignorant towards adults, didn’t they know we were here first, how dare they, parents are so neglectful and not educating their kids on proper manners anymore these days,…\n\nTheir twitter bio: pronouns, fandoms, 18+ AGE IN BIO OR BLOCKED, MINORS F*** THE F*** OFF YOU MOTHER*******!!!!!\n\nMe, sipping at my tea: Yeah, it’s a great mystery, I guess we’ll never know. Oh, you don’t think it might have to do with the vitriol they constantly see adults direct at them? No, haha, of course not, that’d be totally absurd after all.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Jojosbees",
      "timestamp": "",
      "body": "As an adult in fandom, I don’t give a shit if minors are reading my PWP. I am aware people are curious, and you don’t suddenly discover the birds and the bees at 18. If a 15 year old comes across my appropriately tagged and rated fic and reads it, then it’s whatever. I’m not their mother. Literally the only time this bothers me is if they scream at me about how could I write X or why would I support AO3 or some other dumbass take. I’m on Tumblr too and I’ve seen just the dumbest statements. It’s not uncommon for people to argue that fics featuring XYZ shouldn’t be posted online or that we as adults should only act like a child is in hearing range and to do otherwise is to be at best a terrible person and at worst a predator yourself. It’s like they think there should be no adult spaces because god forbid a child stumble across it (saw one in the wild just yesterday). And no, it doesn’t matter if the person making this argument is 15 or 50 (though this is way more prevalent among the former). I have been told that I’m at least 25, so I should stop writing child porn because I’m a whole ass adult. A couple things: (A) I write Steve Rogers/Tony Stark, so wtf, and (B) Explaining why AO3 doesn’t moderate content is not pedophilia.When people are fed up with minors in fandom, what they’re really fed up with are others expecting that we cater to hypothetical minors who might stumble across our work. And honestly, if a Discord wants to stay 18+, then it should be allowed. Adults are allowed their private spaces to speak with other adults. It’s not that deep."
    },
    {
      "author": "Real_Myst",
      "timestamp": "",
      "body": "Agreed 100%. I can't even begin to count the amount of \"if you're 25+ and still watch anime you need to get a life,\" or something along those lines that I've stumbled across on platforms like twitter.Like, why do these people feel the need to come out of the woodwork to start giving their unsolicited opinions? And there are many that go into spaces not intended for them for the sole purpose of ranting at people and giving the latest \"hot take\" that everyone else is parroting.These are some of the reasons I've seen that \"adults\" don't want \"minors\" in their spaces. And I hear a lot of these instances because I have a good friend in a certain fandom that is pretty toxic and they get attacked like every other day for a certain ship because the \"minors\" think it's inappropriate. Meanwhile, both characters of the ship are canonically adults so I don't even understand the problem. (Aside from one of the hot takes being age gaps are the root of evil no matter how small they are.)So, again, agreed. If people want their own private spaces, just leave them alone. Everyone doesn't have to be allowed everywhere."
    },
    {
      "author": "airawyn",
      "timestamp": "",
      "body": "As an adult, I do not want to worry if everything I say or do is appropriate for children. And it isn't \"children are horrible\", it's that as an adult, I am ethically and legally required to behave a certain way in front of someone who is underage. People canlose their children, lose their jobs and go to jailfor providing NSFW material to people who are underage. Or for being queer in the presence of children, in some regions.\"Minors DNI\" and \"18+\" are the fandom equivalent of carding for alcohol and porn in real life. There's a reason that bars are 21+, and it's not because kids melt in the presence of alcohol. It's so the bartender doesn't have to constantly check ids. It's so you can buy a beer for someone and not get fucking arrested. I've known Discords were saying the words \"anal sex\" is not permitted in the all-ages channels. Do you really have to ask why anyone would want an 18+ server?And if people get hostile about it, then that may have something to do with being frequently told that you can't have fanfic or discussions that are inappropriate for young minds, and that adults are required to be on their best behavior around minors, or in a space where minors might pass through. These, by the way, are frequently also the conversations in which adults are told to go back to their knitting and taxes because fandom doesn't belong to them. These aren't separate conversations.There was a court decision back in the 90s when the WWW became popular that had to decide if everything on the Web had to legally be safe for children. It was decided back then that the internet was for adults, and it remains that way today.(The shit with the gun is not okay, but I'm pretty sure it's in the minority of DNI warnings.)Look, I think teenagers should be able to think about, discuss, and have sex, but it's illegal and creepy for me to provide it to them, and I am not fucking interested in censoring myself in my fun spaces."
    },
    {
      "author": "BothWing3539",
      "timestamp": "",
      "body": "Yeah, no, I've seen stuff all the time that...is the opposite of your experience. I got told to kill myself by antishippers. I've seen adults ganged up on for being in fandom at 35 by a bunch of minors. Who then proceeded to attack them for being autistic, because being autistic isn't an excuse for being creepy? Which is a true statement, but...just being an adult in fandom isn't creepy. I know that a lot of them are being manipulated but I also got manipulated in a similar way and I never told anyone to kill themselves about it. And I took responsibility once I was wiser. Considering that the vitriol adults in fandom display towards minors is a direct result of us being mistreated in a space we created, um, I'm not sure that blaming adults for doing something wrong, nebulously, is the way to go.I'd obviously prefer if the yelling at children went away, but...I get it."
    },
    {
      "author": "neongloom",
      "timestamp": "",
      "body": "But for a community like fandom that is otherwise so zealous to be a home for minorities and people who don’t have any place they feel they belong, my disappointment is just so immense that it somehow seems to have become the “in” thing to do to discriminate against a whole group of people based on a characteristic that they have absolutely no influence over.My thing is, this very much applies to the people trying to chase anyone 18+ out of fandom spaces. Older fans don't have control over their age and for a lot of people it seems to be the \"in\" thing to crack nursing home jokes or belittle anything that comes out of their mouth because \"you're old enough to be someone's mother\" or \"don't you have a husband to take care of?\" All for the crime of enjoying fandom as an adult.I agree treating minors with that kind of hostility isn't cool but I can see where the defensiveness might have come from. Of course older fans are going to relish having their own spaces when so many kids are trying to push them out of the ones they originally inhabited. It doesn't justify it but it at least explains it. I just wish we could all coexist peacefully instead of creating all this distance between each other. Age never used to be a huge factor like this. It's sad this is where we've ended up."
    },
    {
      "author": "GraboidFarmer",
      "timestamp": "",
      "body": "I’m 36 and I’ve been called a “senior citizen” and told to “stay in my own lane” by teens on tumblr. 😆 I was like, “Yeah, who do you think created the fandoms you’re into? Not kids, that’s for sure.” Little do they know they’ll be buying under-eye cream sooner than they think."
    },
    {
      "author": "plutoduchess",
      "timestamp": "",
      "body": "People say minors DNI when they are predominantly NSFW because it is in actual crime to knowingly share NSFW material with someone under 18. It's not discrimination. It's a literal crime.Also I'm sorry, but I'm in my 20s. I don't want to hang out with kids. I want to hang out with other adults."
    },
    {
      "author": "Careful_Cut_8126",
      "timestamp": "",
      "body": "People in one of my fandoms have been “exposed” for grooming and manipulating minors after literally just being friendly in a writerly space with them (think like 17 and maybe 23 as far as age differences go.) The adult writer creates nsfw content, there was a friendship fall out, and this is what it turned into. This is why adults don’t want to hang out online with teens even when it’s not nsfw content all the time. I don’t know how old you are OP but I’m going to assume you’re 18ish. Do you want to hang out with a 7 year old all the time? If you are around kids, you probably act differently and would have different conversations with other 18 year olds that aren’t even Bad conversations, but not great to have with a second grader."
    },
    {
      "author": "serralinda73",
      "timestamp": "",
      "body": "I haven't come across this personally (I'm not active on any social media other than reddit) but I have seen people complaining about this issue - most people here seem to think the whole, \"Minors GTFO! Do Not Engage!\" is ridiculous and going overboard but many understand the paranoia as well.I have also seen a lot of people saying they get attacked or harassed about their story content that has minors doing...not so perfect things (not necessarily sex, but probably that most of the time). And a lot of adults seem to be running scared over the thought that having contact with a minor - even in a perfectly innocent conversation in the comments of a fic that just happens to have a few sex scenes - will somehow get them arrested or \"canceled\" for...idk, corrupting a minor, enticing them into a real-life hook-up, grooming, pedophilia. But all they're doing is having a conversation about writing 99% of the time.As if any mixture of sex and a minor (NOT sexwitha minor) is automatically a crime and you'll end up on the child molester watch list. Some adults are scared, really scared, of this or they don't want to deal with the drama/accusations. Suddenly, adults aren't supposed to write about minors having sex, think about it, age them up enough to legally have sex, remember that they got into some interesting situations themselves when they were younger...it's like a whole subsection of the populace has gone insane.Back in my teen days (a long time ago), if you went into adult spaces on the internet (like you do), you kept your mouth shut. We were aware we were trespassing in a space not meant for us so we did our best to keep on the downlow. There was no announcing of our age and then getting pissed off when we're called out for it. There was no attacking the adults and their adult spaces as if those are not supposed to exist. And then on top of all that crazy, to guilt adults for being adults and actually following the \"rules\" of how to be a good adult by keeping your adult stuff away from the kids... Does this make sense?\"We want to go in there!\" followed by, \"OMG, what the hell did I just see in there?!\" Yeah...kind of the whole point of telling you to stay out in the first place. And because they're teens who have been raised by the internet and TV, they then think they're entitled to say adult things that make them uncomfortable shouldn't exist at all.To use fanfic as a metaphor - this is seeing a tag you know involves stuff you don't like, reading the fic anyway, then giving the author shit about writing it. So if writers are trying to guard their personal (online, but still personal) spaces by putting up disclaimers and warnings and insults...I think it's stupid and won't work anyway, but I can kind of understand why they do it.Sorry, I ranted and went off-topic. I just hate this stuff.This, in a country that has one of the highest teen pregnancy rates  of all the industrialized countries... Denial, anyone?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Back in my teen days (a long time ago), if you went into adult spaces on the internet (like you do), you kept your mouth shut. We were aware we were trespassing in a space not meant for us so we did our best to keep on the downlow. There was no announcing of our age and then getting pissed off when we're called out for it. There was no attacking the adults and their adult spaces as if those are not supposed to exist. And then on top of all that crazy, to guilt adults for being adults and actually following the \"rules\" of how to be a good adult by keeping your adult stuff away from the kids... Does this make sense?God, so much this. I'm sure I interact with minors in the fandom, but the only ones Iknoware minors are the ones that won't shut up about how we need to change our discoursebecause they are there. So when I bitch about minors, it's only the ones that use their age as a sword to force others to change, and as a shield to protect themselves from having to change. Why is it only them? Because the rest don't make their age an issue. They act like adults."
    }
  ]
}