{
  "subreddit": "dating_advice",
  "post_id": "tterjg",
  "title": "Are there any dating apps that don't mandate disclosing my age?",
  "body": "My own age makes me feel uncomfortable. I don't like to be asked \"You're (this many) years old but you don't already have a wife and kids of your own? How come?\" I don't want to reveal it's because of some mental health disorders that I haven't had long-term love interests. I'll just say \"because I decided to pay off some serious debts first.\"\n\nIf anyone asks how old I am, I'll first say \"older than I feel.\" If I'm pressed for it again, I'd say \"I may be a different age, but I would've preferred to be born on y2k so if I got what I wanted, I would only be 22 this year.\" (Or whatever are the last two digits of the current year by then.) If I say my own age makes me feel uncomfortable, I could set a negative tone for the whole meeting so I even hesitate saying my own age makes me uncomfortable. Or that it's an age I want nothing to do with at the present time.\n\nIf literally every dating app in existence mandates us to disclose our ages, why every single one of them? Why can't there be a few that doesn't?",
  "author": "Ang3lsCurse",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome tor/dating_advice!Please keep therulesofr/dating_advicein mind while participating here. Try your best to be kind.Report any rule-breaking behavior to the moderators using the report button. If it's urgent,send us a message.We rely on user reports to find rule-breaking behavior quickly.Thanks!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Tinderella80",
      "timestamp": "",
      "body": "Your age isn’t about you. It’s about the person looking to date someone who is in an age bracket that they are comfortable with. Many posts on dating groups I’m in are about men who lie about their ages so would recommend against that. Planning on lying to any potential dates is really poor form.If you’re that hung up on your age and your own history that you can’t bear to discuss either honestly then you need therapy, not a girlfriend."
    },
    {
      "author": "Reasonable_Hunt443",
      "timestamp": "",
      "body": "Tinderella, the problem for some of us--which it sounds like you don't see--is that when someone is over 45 or 50, the differences between physical age and chronological age can be profound. I am a genetically lucky guy who has lived pretty clean and folks regularly guess me at 15 years younger than I am. But now that I'm in my 60s, prospective partners are just running away from the number. Imagine if you had to post on the first screen how wide your ass is... or how much you weigh. That's what we're talking about here. I want to let the pictures do the talking, otherwise I'm stuck with agism that I can't avoid. I can still do over 500 pushups a day--but the number doesn't even let me get to the table to meet someone in similar youth and shape to me."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "The age limit is to prevent underage children from joining, and to allow adults to date within a certain age bracket. It's not meant to criticize anyone."
    },
    {
      "author": "InfernoFlameBlast",
      "timestamp": "",
      "body": "A dating app that doesn’t disclose age is a TERRIBLE dating app"
    },
    {
      "author": "jazzfairy",
      "timestamp": "",
      "body": "Um so based on another post you’re in your 30s and want to look 18-23……… 🚩"
    },
    {
      "author": "Avocadofarmer32",
      "timestamp": "",
      "body": "Is there a reason you want to hide your age? You’re only in your 30s according to your profile. How young are the girls you are trying to date."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "You sound like a creepy old dude Here.People want to date someone within their acceptable age range. You can’t be all ‘I feel 20’ when you’re 50. Be an adult. You are how old you are."
    },
    {
      "author": "Individual_Baby_2418",
      "timestamp": "",
      "body": "When I was a young person using dating apps, I wanted to find people like me - similar age and background. Where we might have similar interests and goals. I also wanted to have kids and wanted someone whose sperm was relatively young.I think trying to hide it makes things worse. It makes people wonder why you’re holding things back and if there’s something deceitful or creepy about your motives. Best to just put it out there and let a potential match decide for themselves if they have an issue with your age. (And I promise people aren’t asking themselves why you aren’t married with kids yet)."
    },
    {
      "author": "Ang3lsCurse",
      "timestamp": "",
      "body": "The replies go off on a tangent and morals that aren't even related to the question.Dating apps have filters. There is no reason for the app to disclose your actual age.Tinder is the only one that I am aware of that let's hide your age but you need to pay a subscription.If you're out of someone's age range you'll never match with them.Better yet, they should not show you people not interested in you, but they'd rather show you as many attractive people and you not matching is the cherry on top because they get money whilst you use their app and never actually move off of it.Some people have nefarious intent, maybe lying about their age, photos, etc. The last thing you want is for all of those strangers to have personal details about you.Having been discriminated for my age, for being younger and older, I went from replying my age without a thought to not telling people. Only, some people get offended if you don't want to disclose that information, which is kind of ironic, because those same people will get offended if you ask them something they aren't comfortable with.If the OP had nefarious intent he could just lie about his age, but his question indicates he does not intend on doing this.A picture speaks a thousand words: if lying about your age is bad, what are decade old bikini photos on holiday with makeup? Don't tell me not disclosing your age is remotely akin to all of those filters and make up photos you see online.I don't see how disclosing age protects anyone? Minor: hi, I'm 20 40 year old: hi I'm 20 Logic: None existent.Reality Honest people not disclosing their and and not caring: I had fun or I'm not interested... well I'm 30. Omg I am so now interested. Yeah... no.Woman that are attractive and look a decade younger? You're not going to care that they're actually a decade older, unless they don't actually look their photos and actually look older than their age, or are even lying about their age."
    }
  ]
}