{
  "subreddit": "OculusQuest",
  "post_id": "1c37zq7",
  "title": "Age verification is really implemented poorly.",
  "body": "So, right now my quest 3 headset is pretty much useless as it is locked behind an age verification lock.\n\nFirstoff I must admit that should properly have reacted soon to the mail telling me to verify my age. But the one day before the deadline I finally tried to do it.\n\nI had two option \"credit card\" and ID. \"credit card\" was the faster option so I did that. Only to be meet wirh an error message when meta tried contacting my bank - the authentication process window failed to show.\n\nNext day the headset got locked and after multiple attempts at fixing the issue wirh my creditcard, I ended up sending a picture of my drivers license. This will take a few days to resolve so in the mean time my headset is useless.\n\nTrying to make this unlock process go faster, I have tried a lot of things to make the credit card verificaiton work.\n\n- Tried doing the process using the mobile app, different browsers and on both laptops and PC.\n\n- I have been talking to the meta support multiple times using whatsapp, but they haven't really helped a lot - I'm currently locked behind a support ticket which requires help from some specialists who will get back to me in a couple of days - which will be about the same time my drivers license picture goes through. SO THATS PERFECT\n\nI contacted them again to try to edit my account name was it didn't quite match the name of my credit card and was wondering if that could be why the authentication process failed.\n\nBut the  communication with the customer support was not good. It felt like I was typing with an AI most of the time or probably more likely, a lot of copy and paste answers.\n\nMost of my questions were answered with an answer / questions that didn't make much sense. I finally gave up and now I'm here.\n\n\n\nthe error message I get is \"This content is blocked. Contact your site owner\" at the last step of the process when meta is trying to collect 1 dollar from my bank.\n\nI have called the company which runs the bank authenticator and they do not have any problems, the woman I talked mention that she talked to a person earlier that day who had similar problems with facebook.\n\n\n\nHave any of you had problems when entering your credit card information on themeta.comwebsite?\n\n\n\n\n\n",
  "author": "MindSponge78",
  "comments": [
    {
      "author": "jTiKey",
      "timestamp": "",
      "body": "So you ignore a warning and now you have to wait few days? The horror."
    },
    {
      "author": "MindSponge78",
      "timestamp": "",
      "body": "True, I should have payed more attention. But I still find it annoying that when I try to use one of the two systems that meta wants me to use to verify my age, one of them doesn't work.Also, while it was a bit late. I still did it before the date set."
    },
    {
      "author": "SQUIDWARD360",
      "timestamp": "",
      "body": "Lesson learned"
    },
    {
      "author": "jakejm79",
      "timestamp": "",
      "body": "Is it an actual Credit Card or just a Debit Card with a Credit Card logo?"
    },
    {
      "author": "MindSponge78",
      "timestamp": "",
      "body": "It is a normal credit card. Not a debit card."
    },
    {
      "author": "ChairAcceptable3451",
      "timestamp": "",
      "body": "I know I'm late but right now I am also having the same problem, support is so bad and I keep on getting sent to a error page too. I'm just asking, did U get your account back?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I don’t think it’s a lesson to be learnt I received the prompt because my brother launched Roblox, it’s intrusive and ridiculous in my opinion, I’ve never had a gaming device of any kind try to pull this shit"
    },
    {
      "author": "MindSponge78",
      "timestamp": "",
      "body": "Also, having read a lot of posts regarding age verification, if they deny or reject the sent in pictures and you fail to satisfy their requirements, you account will get deleted. This will end up removing all your games you have purchased.Why not just block the accounts ability to use the meta store and make it unable to play online. The fact that they can stop you from using your device unless you make a new account and start all over buying the same apps and games again, with the risk of it happening again."
    }
  ]
}