{
  "subreddit": "Centrelink",
  "post_id": "13yxs91",
  "title": "Trying to confirm identity and having problems",
  "body": "I’ve never dealt with Centrelink before and so don’t have a CRN. Am trying to go through the process of getting a MyGovID. I’ve put my passport details in and Medicare details in (plus my marriage certificate details as my passport is still in my maiden name and everything else is in my married name). It’s given me a Standard rating my I need a Strong rating for Centrelink but the only option it’s giving me is to put in details from an Australian Passport, problem is, my passport is a NZ passport.\n\nI’m trying to apply for PPL and don’t have a CRN as I’ve never had to deal with Centrelink before. I’ve tried doing the other ID setup but can’t because my passport details don’t match my MyGov details due to getting married.\n\nIs there anything I can do apart from actually going to Centrelink?",
  "author": "trumpstinyhandssayhi",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Nope sadly going in is the only way you will get over this"
    },
    {
      "author": "trumpstinyhandssayhi",
      "timestamp": "",
      "body": "Bugger, thought that was probably going to be the case, but had a small glimmer of hope that there was another way"
    },
    {
      "author": "Morning_Song",
      "timestamp": "",
      "body": "Yep! This was the reason you saw the long times at Centrelink at the start of the pandemic."
    },
    {
      "author": "PuzzleheadedYam5996",
      "timestamp": "",
      "body": "Came to say this!Aahhh, the days of hardly ever having to go in are here. Gone are you he weekly or fortnightly visits EVERY time... trudging in and waiting in line. .Remember when your nearest office was a ten min walk, a bus ride, then a train for 3-4 stations, then another 5min walk to the actual office was a thing!?"
    },
    {
      "author": "UsualCounterculture",
      "timestamp": "",
      "body": "Just call up. You may be in the system already if you were born I. Australia. You parents may have registered you then for some benefits, most people do not know or remember this."
    },
    {
      "author": "trumpstinyhandssayhi",
      "timestamp": "",
      "body": "Nope, wasn’t born in Australia, moved here in 2013 from New Zealand"
    }
  ]
}