{
  "subreddit": "technology",
  "post_id": "1jdx5h9",
  "title": "Bumble heightens safety measures with new ID verification feature | TechCrunch",
  "body": "",
  "author": "Feeling_Actuator_234",
  "comments": [
    {
      "author": "DarkAlatreon",
      "timestamp": "",
      "body": "It's always in the name of safety, isn't it."
    },
    {
      "author": "Feeling_Actuator_234",
      "timestamp": "",
      "body": "THINK ABOUT THE KIDS!"
    },
    {
      "author": "timshel42",
      "timestamp": "",
      "body": "safety features as in easier way to make the data they collect from you more valuable. no way would i give a dating app my government id, just like i wont give it to a porn site."
    },
    {
      "author": "QuotableMorceau",
      "timestamp": "",
      "body": "they had a perfectly simple and elegant way of ensuring safety, they ditched it and now trying honeypot  measures to get more useful data to sell/use ...."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I'm curious if this will create a revolution of people going back to meeting dates on the street, in a bar etc."
    },
    {
      "author": "voiderest",
      "timestamp": "",
      "body": "Eh, depends on what you mean by meeting dates.I don't think many women are receptive to random dudes approaching them in random places just to ask them out or get a number. Meeting people in group settings where social interaction is expected then perhaps a friendship turning romantic gets a solid maybe. A bar seems like a reasonable place to meet people but if you don't think it's viable right now I wouldn't expect anything to change."
    },
    {
      "author": "sheldonmeetshomer",
      "timestamp": "",
      "body": "I love the concept of Bumble, but of all the apps I used, it was the worst.  If I hadn’t met my wife (on Hinge) and was still online dating, I definitely wouldn’t be wasting my time jumping through their hoops."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Nice try skynet 😂"
    },
    {
      "author": "Feeling_Actuator_234",
      "timestamp": "",
      "body": "These are government approved procedure. Bumble answers to regulators in each country to do this. They don’t store your data, it travels through other highly secured servers mandated for that with no data retention bla-bla-bla.All that bumble gets is: “now we know this name and all the meta data attached to it refers to a human… which is more valuable to data brokers”Next step is a narrative where “it’s okay to first talk to someone’s AI before the real person because they verified their ID”. MMW"
    }
  ]
}