{
  "subreddit": "VRchat",
  "post_id": "1jw9mv3",
  "title": "Looking for a place to escape public world hell?",
  "body": "Are you new to the game and stuck in public world hell where your experience so far has been screaming children and trolls?\n\nIt doesn't have to be that way!  Whether you're new to the game or you're looking for a place that could be right for you, joining a community may be what you're looking for.\n\nIf you're looking for a relaxed and chill space to hang out and meet new people, check out Stranger's Tavern. We are a modestly sized community that hosts casual hangout events, karaoke, audience anarchy, game nights, movie nights, and even occasionally special themed events like birthday parties and holiday parties. It's a great place to unwind after a long day and get to know new people. We are a safe-for-work community that is 18+, so no kids here.\n\nWe want to make you feel included! That's why every member is welcomed and encouraged to make an introduction so we can get to know a bit about you. We don't want you to feel like the guy standing in a corner because they don't know anyone, so we make an initiative to talk to you and get to know you-- especially helpful if you're someone that's receptive to someone talking to you first.  All you have to do is have some open-mindedness into meeting new people and take that first step of attending a hangout or even just saying hi in the chat :)  We are mute friendly so text boxes welcome!\n\nAnd we also want to get you involved! Participating in events or even general hangouts is a good first start if you feel like you're having some trouble getting out of your shell (or if you're a chatty person!) If you have an idea for events we want to hear it and get you further involved in the community!\n\nOne of the nice things about this community is it's a place where you are welcome to just be yourself. There's no hard emphasize on \"self improvement\" or a hard regimentalized structure. Just come in, hangout, and relax.\n\nDown below I've linked Stranger's Tavern and some other communities also worth checking out.",
  "author": "illucio",
  "comments": [
    {
      "author": "dailybantam",
      "timestamp": "",
      "body": "Join the Discord and Group:https://discord.gg/3GHSsgaurWStranger's Tavern - VRChatAlso consider checking out these other cool communities:TalkGroupFantastic paired talk events with a focus on improving social anxiety and socialization. I've attended many of their events and enjoyed every single one of them!https://discord.gg/WymbcVqW2YOpenMindExcellent for deep introspection in their sharing circle events. These are very personal and meaningful.https://discord.gg/sQ2WH3DtGPCuriousConnectionsVery active group, has a little bit of everything. Paired talks, headpat events, and a wonderful and welcoming community as well. They also do field trip events to other communities to further broaden your horizons.https://discord.gg/gTREb5vZcH"
    },
    {
      "author": "kwizyvr",
      "timestamp": "",
      "body": "You already had me at \"headpat events\"."
    },
    {
      "author": "Spiritual_Pass_7475",
      "timestamp": "",
      "body": "Aww, thank you bantam for the kind mention about my headpat events! That’s a semi-secret squirrel event tho…you’ve to be in the know!!Those are special gatherings I host at Kibble’sCurious Connections. Headpats are all about sharing gentle, platonic moments of comfort and connection. They require a sense of trust and vulnerability, which is why I keep these events small and exclusive. Please know that these spaces are safe and respectful, withZERO tolerancefor anything that might make others feel uncomfortable. It’s all aboutbuilding meaningful connectionswith like-minded folks.Exciting news…I’m collaborating with Eye of Veritas for a Dual-Community Collaboration—a combo VR Fitness-Headpat event. I also have in the works a Community Trifecta event, A Very Curious Coalescence of three very special communities!!ALSO, a flashmob planned for the future, once I’ve trained enough headpatters—Flashmob Pat Pals: Spreading comfort in the community, one pat at a time🐾💆‍♀️"
    },
    {
      "author": "Twistedsteele",
      "timestamp": "",
      "body": "Field trip events to other communities? That actually sounds very very intresting, a good way to actually get to meet other players cause nobody worthwhile is going to be in a public lobby full of screaming children."
    },
    {
      "author": "rexyuan",
      "timestamp": "",
      "body": "Thanks for the compilation!"
    },
    {
      "author": "RiddleWolfsBane",
      "timestamp": "",
      "body": "Public world escape my ass, this game was made by satan"
    },
    {
      "author": "illucio",
      "timestamp": "",
      "body": "JOIN GROUPS.I say this to everyone. Go on vrclist website and find people advertising their groups. Ask people about groups. Look at banners in worlds or VRChat event worlds because you will see groups being advertised. Vket around the corner and load and behold more amazing groups trying to advertise themselves to find cool people to join them.Ancients of VRChat MondoCat The Faceless VRC Kmart Karaoke Nights Friday Dance Party Community Events Midnight Munchies Punchline Comedy Joshosh VR Adventures Virtual Maid Cafe Cinema Nights Gameshow NightAnd then hundreds of different DJ groups, dance parties and musics events under the sun."
    }
  ]
}