{
  "subreddit": "frenchie",
  "post_id": "1g5ayf5",
  "title": "Age verification!",
  "body": "Hopefully someone is able to help me out, I found this sweet girl about 9 months ago wandering the streets of my mom’s neighborhood. I went around nearby houses asking if they recognized her and no one did. I put up posters, made posts about her on our nextdoor app and other social media platforms. I also took her to the vet to get checked for a chip, she didn’t have one. About 2 months into having her in my care I decided to keep her. I was wondering if anyone could tell me her age? Vet told me she was about 3 years old but I’m led to believe she’s a bit older. Any information would be appreciated greatly! Thanks!",
  "author": "lammy1124",
  "comments": [
    {
      "author": "KimberlyElaineS",
      "timestamp": "",
      "body": "She’s gorgeous! I’d go by what a frenchie familiar vet says, they usually age by their teeth  and hair ( I think by how much white or grey that they have) mine is almost seven and her muzzle and chin has a bit of whiteness your baby’s muzzle looks pretty dark so she’s younger than that."
    },
    {
      "author": "Odd_Gain_7409",
      "timestamp": "",
      "body": "Thank you for the feedback!"
    },
    {
      "author": "Wilted_fap_sock",
      "timestamp": "",
      "body": "Hard to tell from looks alone. I'd imagine the vet came to that conclusion by looking at her teeth, among other things. The vet is likely in the ballpark."
    },
    {
      "author": "Odd_Gain_7409",
      "timestamp": "",
      "body": "Yeah, I knew it was kind of a long shot. Appreciate your comment!"
    },
    {
      "author": "Wilted_fap_sock",
      "timestamp": "",
      "body": "She's adorable, by the way!"
    },
    {
      "author": "Academic_Dare_5154",
      "timestamp": "",
      "body": "I'm glad she found you."
    },
    {
      "author": "QueenSpadeKelly",
      "timestamp": "",
      "body": "Aww 🥰"
    },
    {
      "author": "TerribleFishing3677",
      "timestamp": "",
      "body": "It's hard to tell but she looks like a senior to me maybe between 7-9, just a guess. Amazing you took her in! She's lucky to have you ☺️"
    },
    {
      "author": "ChelseyT85",
      "timestamp": "",
      "body": "When I rescued my baby, I was told that she was 3-4 years old. The vet took one look at her teeth and said she was 6. I was able to get previous vet records down the road, and it turned out that she was exactly 6 when I had first taken her to the vet."
    },
    {
      "author": "lammy1124",
      "timestamp": "",
      "body": "My guess is somewhere between 3 and 5. She’s definitely had at least 1 litter of pups based on her larger nipples and breeders usually start breeding when they are around 2-3 years of age. But like others have said the vet usually bases it off the teeth and they’re usually pretty close.Edited to add: she’s adorable 🥰"
    }
  ]
}