{
  "subreddit": "law",
  "post_id": "1984qsp",
  "title": "Age verification for adult web sites advances in Florida House",
  "body": "",
  "author": "UBTX22",
  "comments": [
    {
      "author": "ertgbnm",
      "timestamp": "",
      "body": "What ever happened to parental responsibility?"
    },
    {
      "author": "darkkilla123",
      "timestamp": "",
      "body": "party of personal responsibility is not actually about personal responsibility"
    },
    {
      "author": "Gibbons74",
      "timestamp": "",
      "body": "Which VPN is sponsoring this bill?"
    },
    {
      "author": "FriarNurgle",
      "timestamp": "",
      "body": "Whichever one donated to DeSantis"
    },
    {
      "author": "EricRower",
      "timestamp": "",
      "body": "I came here just to say this…The simplest technologies are beyond these people…🤦‍♂️"
    },
    {
      "author": "sophisticated_pie",
      "timestamp": "",
      "body": "I was always \"18\" on the internet growing up. The bill is a waste time. These verifications, new and old, are useless and so easy to bypass."
    },
    {
      "author": "weaverfuture",
      "timestamp": "",
      "body": "I was always \"18\" on the internet growing up. The bill is a waste time. These verifications, new and old, are useless and so easy to bypass.these arent the \"click 18 to enter\" verifications. websites will and currently are, accepting credit cards and drivers licenses as verification in states with similar laws. both of which arent all that easy to bypass.while installing/using a vpn is easy for advanced users, it is quite difficult for most people.the legal fun will come later, when a florida DA challenges a website who is only using geolocation to enforce age verification. when a florida child uses a vpn to access a website , that website will be prosecuted by florida. that website will lose.and then it will be \"click here to accept cookies\" all over again, except for the entire internet, with age verification.said another way, the current age verification system is so annoying that adults arent bothering to bypass it."
    },
    {
      "author": "UBTX22",
      "timestamp": "",
      "body": "HB1 (requires 16+ age verification for social media websites) and this bill (requires 18+ age verification for adult websites) should be viewed as a package deal to try to make age verification on the internet commonplace (in spite of legal precedent and the first amendment clearly rejecting such age verification) rather than independently, the two bills were made HB1 and HB3 to indicate their priority and have thus far advanced together.  The quote included at the end of the article from speaker Paul Renner certainly is treating them as a together as he rails on \"social media and adult content websites\"."
    },
    {
      "author": "Da_Bullss",
      "timestamp": "",
      "body": "\"The bill (HB 3) would require any company that 'knowingly and  intentionally publishes or distributes material harmful to minors on a  website or application' to use 'reasonable age verification methods' to  prove that people accessing the site are at least 18 years old.\"the biggest issue this bill face when it passes is how it defines the words it uses to get around the 1st amendment.(d) \"Material harmful to minors\" means any material that:The average person applying contemporary community standards would find, taken as a whole, appeals to the prurient interest;Depicts or describes, in a patently offensive way, sexual conduct as specifically defined in s. 847.001(19)*;When taken as a whole, lacks serious literary, artistic, political, or scientific value for minors.*847.001(19)(19) “Sexual  conduct” means actual or simulated sexual intercourse, deviate sexual  intercourse, sexual bestiality, masturbation, or sadomasochistic abuse;  actual or simulated lewd exhibition of the genitals; actual physical  contact with a person’s clothed or unclothed genitals, pubic area,  buttocks, or, if such person is a female, breast with the intent to  arouse or gratify the sexual desire of either party; or any act or  conduct which constitutes sexual battery or simulates that sexual  battery is being or will be committed. A mother’s breastfeeding of her  baby does not under any circumstance constitute “sexual conduct.”I think (d)3 is where they will get the most resistance because its too vague to establish a standard web publishers can reasonably follow. what lacks serious literary, artistic or scientific value for minors changes drastically dependent on the age of the minor. Arguably even pornography provides scientific value for minors in the later teenage years, but you don't need to make that argument because the definition of sexual conduct is too broad.However, if i were fighting this bill, I would focus on federal preemption and the commerce clause to avoid the current supreme court from fucking with our first amendment freedoms."
    },
    {
      "author": "UBTX22",
      "timestamp": "",
      "body": "That harmful for minors definition is fairly standard across the states and has been for a long time, thanks to a combination of Ginsberg v. New York and Miller v. California.  This bill should be found unconstitutional (with Reno v. ACLU being the direct legal precedent with regards to such age verification), but it is unlikely that the definition of material harmful to minors will be the reason it gets found as such."
    }
  ]
}