{
  "subreddit": "skzcollection",
  "post_id": "1jcqgej",
  "title": "Growing",
  "body": "So recently I bought my first ever album and I want to grow my collection more, I’m curious is anyone had any tips on this? Recommendations on where to buy, trustworthy websites and sources, things like that! This might be a bit vague but I don’t have any specific areas that I’m looking into so I just want some overall advice & help! 🥰🫶\n\nEverything in the photo is what I currently have (and as seen I literally only have one album and two non-official pieces haha)",
  "author": "MisshaJaey",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Interaction reminder:This is aQuestion/Helppost. Please do not offer to buy/sell/trade items. Please report any comments that do and let the mod team know viamodmailof any users who send offers via private messages.Why is this important? Please checkherefor an overview ofr/skzcollection's efforts to combat scammers.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Jhopes_grl94",
      "timestamp": "",
      "body": "I buy all my albums on Amazon or get them at Target and as for Skzoo or merch I usually buy from Jyp shop. I will also buy from ebay and mercari too sometimes, but I usually buy from the same sellers each time cause I like to go by how much sellers have sold, how many followers they have and by their ratings and the ones I have bought from I know to trust."
    },
    {
      "author": "yira337",
      "timestamp": "",
      "body": "You have multiple options.If you want to buy easily, you can buy from target or Amazon or any K-pop store in your country/city.If you don't have a K-pop store accessible to you or want to save some money you can find a go (group order) and buy with more people, that way you save up like 30-40% more than if you buy from a store (but the wait is way longer).If you want to buy a lot of merch that is only from korea/Japan, or merch that is older/harder to find you can look up for a proxy, it can be on the Philippines, korea or Japan, they can buy things for you from a seller in that country or when they have events like a pop-up store or fanmeetings, and they ship all that you buyed directly to you.If you don't care to open a brand new album and are looking for specific things you can look wts (want to sell) groups in your area or on Instagram or Twitter (X) and buy the merch second hand, a lot of people do this and save a little money too.If you have any questions don't hesitate to ask^"
    },
    {
      "author": "OliverAmith",
      "timestamp": "",
      "body": "Alright thanks! I’ll definitely look into it :D"
    },
    {
      "author": "MoonlightSnacks",
      "timestamp": "",
      "body": "Hey! Slightly side tracking but I LOVE YOUR COLLECTION 😭♥️✨ I’ve been looking for a good place to get Chan’s plushie for ages now 🥲 Hope your collection grows!"
    },
    {
      "author": "mapsbell",
      "timestamp": "",
      "body": "Omg!! Your phonecaseeee, love iiitt! And also love your collection✨"
    },
    {
      "author": "OliverAmith",
      "timestamp": "",
      "body": "Haha ty!!! It may be small but I hope to grow it soon <3And the phone case is definitely my favorite! Helps people to know there’s a STAY around 😆😆"
    },
    {
      "author": "Leafy_dragon797",
      "timestamp": "",
      "body": "If you are willing to buy in bulk, the price per album is pretty decent after like 6+ (like ~$18 per album including shipping) on cokodive and kpopalbums.com, I got most of my collection from those two in bulk and filled in any gaps with subkshopIf you want any Japan albums, Mercari Japan using a proxy was the least expensive option in my opinion but some other sites sell the Japanese albumsAnd if you don’t mind secondhand,r/kpopforsaleand mercari are good places"
    },
    {
      "author": "juniperwitch12",
      "timestamp": "",
      "body": "I’ve bought all of my albums at Barnes & Noble. They have exclusive albums sometimes too!"
    },
    {
      "author": "MisshaJaey",
      "timestamp": "",
      "body": "I feel like buying from a GOM was the cheapest and easiest way when i started, you could try searching on twitter to see if anyone in your region is opening for skz group orders"
    }
  ]
}