{
  "subreddit": "UKPersonalFinance",
  "post_id": "17fbjb5",
  "title": "Trust Fund, forced to Use Yoti (Digital ID which scans face and records voice) don't feel comfortable",
  "body": "So my mum has just borderline forced me to open my OneFamily account and to get into it I had to scan my face and voice with an app I've never heard before called \"Yoti\"\n\nI've since got her to delete the account but A: I'm concerned about my privacy and B: What the hell? Is this common to access child trust funds?\n\nThis was the ONLY way to open my account. When I clicked \"try another option\" it just kept looping to the front page.\n\nI'm sorry if I'm being a bit nutty but i care about my privacy and i really don't feel comfortable?",
  "author": "h_belloc",
  "comments": [
    {
      "author": "367yo",
      "timestamp": "",
      "body": "This is standard practice for most online bank accounts. They have to verify you are who you say you are and not just someone that has stolen your ID. Of the 3 bank accounts I've opened recently, all 3 required this."
    },
    {
      "author": "Glittering-View3231",
      "timestamp": "",
      "body": "I didn't know this...I appreciate you telling me at least.That's crazy"
    },
    {
      "author": "Kind-County9767",
      "timestamp": "",
      "body": "It's not common for your parents to force you to access your trust fund. No matter what that money is entirely yours to do with as you please."
    },
    {
      "author": "Glittering-View3231",
      "timestamp": "",
      "body": "no yeah ofc it wasn't really forced but they have like 0 money and i dont have a job so yeah. I wasn't \"forced\" but pressured. It's whatever.The face scan just freaked me out. been watching too much black mirror."
    },
    {
      "author": "390TrainsOfficial",
      "timestamp": "",
      "body": "How old are you?If you're a minor, they should have their own login credentials. There's no reason for them to require you to authorise their login as they're responsible for your Child Trust Fund on your behalf.If you're 18 or over, this is a massive red flag. There's no reason for them to sign in to the account as they're no longer responsible for it. Do you know why they wanted to sign in? It's slightly concerning that you've mentioned that your mum has 'borderline forced' you to sign in to it - do you think there's a chance that she signed in in order to withdraw money from the account?"
    },
    {
      "author": "h_belloc",
      "timestamp": "",
      "body": "You're right to be concerned about the use of your data (massive amounts of money are made surveilling, collecting, selling and analysing personal data, and negligent companies routinely suffer mass data breaches without any comeuppance).Unfortunately you may have no option but to go along with it, unless there's an option to fill in a form and send it by post."
    }
  ]
}