{
  "subreddit": "changemyview",
  "post_id": "kqnxeb",
  "title": "CMV: no one under the age of 18 should be allowed on any kind of image-centric social media and those social media platforms should require photo verification to prevent minors from using them",
  "body": "PHOTO ID verification, to be clear.\n\nI think that every looks-centric social media app like Facebook, Snapchat, Instagram, and TikTok should require users to be at least 18 years old and should require ID verification to create an account the same way that some online investment apps do because:\n\nExposure to face-tuned images on Instagram leads kids to internalize unrealistic beauty standards and seeing their own faces face-tuned and filtered to 'perfection' on Snapchat and Instagram is giving a generation body dysmorphia. When I discovered 'thinspo' online at the age of 11 back in the early 2000s I had no idea that all of that crap was photoshopped. While kids today are probably more aware of the fact that everything they see is manipulated since filters and facetune are so ubiquitous, they are clearly still internalizing those images-- just look at all the teenagers who are injecting their faces with unnecessary filler. The average age of plastic surgery patients keeps getting younger and younger. While plastic surgery isn't inherently bad, the demand for trendy surgeries has led to a thriving cosmetic surgery black market. Take a look atr/botchedsurgeriesand you'll see a heartbreaking number of teenagers and people in their early 20s who have become disfigured because of often dangerous 'trendy' procedures.\n\nLooks-centric social media apps contribute to the sexualization of children. Kids as recently as 10 to 15 years ago were allowed to look like KIDS and now every 12-year-old girl is pressured to look like a 20-something. Google the \"13-year-olds then vs now\" meme if you don't believe me. I know that every generation in the past has thought that 'kids these days' were growing up too fast and dressing too provocatively, but past generations didn't have their inappropriate pictures splashed all over the internet for strangers to see and message them about.\n\nEven worse than that, social media provides predators with easy access to insecure kids they can groom and worse.\n\nSocial media companies are able to get away with advertising shady diet supplements and cosmetic procedures to minors, whereas even if TV will rot kids' brains I can't imagine the Disney Channel running ads for lip-filler and shit-your-guts-out tea or diet pills that will give kids heart attacks. 'Pop up beauty clinics' and 'health spas' without a single physician on staff are well... popping up everywhere and they advertise heavily on Instagram, sometimes with the testimonials of soulless influencers that kids look up to. None of the claims of these ads are verified for accuracy. There's no oversight at all.\n\nImage-centric social media teaches kids to value sex appeal and consumerism too much.\n\nOnline validation is addictive and leads kids (as well as adults) to engage in potentially dangerous social media \"challenges\" and other unhealthy behavior for clout. Social media addiction can be as crippling as other addictions. We should not be teaching our kids to seek shallow looks-based validation.\n\nKids are stupid and if they post stupid stuff on social media that can hurt their future chances of employment.\n\nThe \"benefits\" of social media for children aren't enough to justify the costs (maybe social media can provide some sense of connection, but that's negated by the sense that kids get by looking at other people's posts that everyone else is happier and more connected to each other). I met some of my closest friends on forums dedicated to my interests a decade ago so I'm not against online friendships at all, but Instagram and other image-centric social media don't create friendships by bringing together people with similar interests--it's all based on looks and the format of Instagram (et al) isn't conducive to getting to know people. Hashtags and captions aren't conversations.\n\nChildren and teenagers require more sleep than adults. Staring at screens and checking notifications in the evening leads to sleep disruption, which leads to a host of mental and physical health issues.\n\nEven if requiring ID verification might mean that people who don't have the means to get an ID aren't able to use image-centric social media, that doesn't cause them harm any more than the fact that people who can't afford IDs can't buy cigarettes harms them.\n\nID verification would prevent predators and bullies from creating throwaway accounts to target children; online crimes against kids would be easier to trace and prosecute.\n\nSomeone, please change my view so I can stop despairing at the thought of what an entire generation is being exposed to on Instagram, TikTok, etc.",
  "author": "zippideedoodaa1640",
  "comments": [
    {
      "author": "DeltaBot",
      "timestamp": "",
      "body": "u/hellhellhellhell(OP) has awarded 10 delta(s) in this post.All comments that earned deltas (from OP or other users) are listedhere, inr/DeltaLog.Please note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.Delta System Explained|Deltaboards"
    },
    {
      "author": "vulcanfeminist",
      "timestamp": "",
      "body": "I recently graduated with a Master's in Information Science and my thesis project involved looking at how teens are ACTUALLY using social media (bc it's really easy for us to make assumptions but assumptions are pretty useless compared to actual reality). My work was focused specifically on what kinds of mental health related information teens (age 14-19) are sharing via twitter. I went through thousands upon thousands of tweets made during the calendar year of 2019 by 100 teens across the US. It turns out that actually teens are using social media in really cool ways that seem to be having a positive benefit on their mental health. Most of what they're sharing is information about their own personal struggles, they're getting advice from people with similar struggles (including celebrities who are open about their own mental health issues), they're venting and receiving support from peers, and there wasn't a single bit of misinformation throughout the whole thing (which is one of the metrics I was actively looking into). Teens use social media the same way everyone does which is to say that sure sometimes there are negative effects which is true even for adults but there are also positive effects too. Being a teen is hard these days and the simple fact is that people need support and having the opportunity to connect with support all over the world is a pretty big deal for struggling teens. Cutting them off from a significant opportunity for connection and support would be truly terrible and that negative consequence isn't worth it in my opinion.Learning how to use social media in healthy ways is an important skill for everyone and really we shouldn't be taking things away we should be offering them better education and support literally in schools (not just from parents). The simple fact is that abstinence doesnt work and has never worked for anything in the history of abstinence. It doesn't work for sex, it doesn't work for drugs, and it wont work for social media (en masse). The only thing that has ever been proven to work with actual evidence is better education and better support. The fact that adults are lazy and dont want to provide that support or are ignorant themselves and are therefore unable to provide the education isnt actually a reason go cancel things and cancelling everything is a dangerous solution that causes more harm than any good it might do.EDITED TO ADDhere's a linkto my project on the school website, there's a QR code on the poster that links to the paper itself. I want to be clear that this paper is still in the rough draft phase. I graduated at the start of the pandemic and I and my advisors all agreed to table publication (which was the original goal of the project itself) until this coming summer when (hopefully) the pandemic will be over and we'll all have more time and energy to devote to getting this finalized. So hopefully I'll be submitting it for publication this year but it hasn't been published yet and won't be until it's actually finished. I still have all my data and my codebook that I'd consider sharing privately with anyone who's genuinely interested in the research process, just message me."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What should happen if a minor is caught using one? Do they get fined? What if they can't afford to pay it?Even if requiring ID verification might mean that people who don't have the means to get an ID aren't able to use image-centric social media, that doesn't cause them harm any more than the fact that people who can't afford IDs can't buy cigarettes harms them.So just fuck poor people?Why shouldn't it be up to the parents to monitor what their children do on the internet?"
    },
    {
      "author": "Flite68",
      "timestamp": "",
      "body": "18 is way too high. We need to remember that teenagers aren't children, they're budding adults. We can't treat them like they're 10 years old, completely coddling them - then suddenly push them into the adult world with absolutely no experience with it what-so-ever. We need to give them more and more freedoms as they grow older - and access to social media is an important aspect they should have access to.Allow me to address various points:You claim that exposure to face-tuned images can create body image problems. These issues existed before social-media sites, and stem from various different sources. Although social media sites can expose teens to images with unrealistic beauty standards, you aren't going to help them by prohibiting them from using Facebook, Instagram, etc.. More importantly, you're throwing the baby out with the bathwater. Even if you did protect teens from unrealistic body standards by prohibiting them from using social media, you'll be prohibiting them from experiencing the benefits these sites have.Instagram, for example, is used by a lot of people to post images that support body positivity, encourages healthier lifestyles such as eating healthy and working out, and also allows people to learn more about photography in general - a generally healthy hobby to have.If the problem is sexualization of 12 year old, why are you prohibiting 13-18 year olds from using these sites?  You're prohibiting the wrong age group.Although predators are a risk, you can't prohibit all teenagers from accessing social media sites because some will become victims. Again, you're throwing the baby out with the bathwater. I know it's tempting to say \"we should be willing to do anything to prevent predation\", but that's bollocks. Why not go a step further and make it illegal for teenagers to be out in public without their parents? Why not outlaw social media in general and just nip the whole thing in the bud? Risk is a part of our lives and we need to do our best to prevent predation through education - not by outright prohibitions.Before online sites, teenage girls would read magazines that did all this stuff. The question you have to ask is, is it really that much worse than it was 20 years ago? If it is, is there data to substantiate this? And, lastly, is the problem so vast that it's worth infantilizing teenagers by treating them like small children?One of the weirdest things about becoming an adult is that people forget what it was like to be teenagers. Puberty happens, and teenagers develop this desire to have sex. This happens with and without social media. It's not taught. And consumerism? I fail to see the issue with this. Teens see adverts online and want to buy clothes? By golly, I wonder what it was like before the internet! Ah, yes, teens would spend more time at malls where they would buy clothes. Consumerism has only changed form. Instead of hanging out at malls, shopping is done online.Although social media addiction is a legitimate problem, prohibiting social media isn't going to teach teenagers to develop a healthy relationship with social media. I do believe we need to better educate and encourage healthier relationships with social media, but prohibiting its use will only delay the problem.As true as this is, we need to learn how to educate teens to use the internet responsibly instead of outright prohibiting them from using social media. Furthermore, your suggestion that we ID everyone who joins a site would only further discourage anonymity. Future employment is hurt on sites that force people to use their real names, like Facebook. Instagram, YouTube, Snapchat, TikTok, etc., can all be used anonymously. Forcing people to ID themselves on all these sites will simply stifle protected self-expression.13-18 year olds aren't children. They're teenagers. And we need to allow teenagers to transition into the adult world. Access to social media is a part of growing up nowadays. I agree, young children don't need access to social media.Teenagers also sleep in later than adults, but we force them to wake up earlier to match adult's schedules as most work during the day. This is a problem that won't be solved by preventing teens access to social media. Not to mention, there is plenty else to do online outside these sites you listed. Preventing access to social media isn't going to discourage teens from staying up all night online.ID verification would be a logistical nightmare and an invasion of privacy. I don't want Facebook to know where I live, my exact date of birth, my drivers license number, etc.. Some of that information I can provide willingly, but it should be my right to keep this information to myself. Invading privacy to protect children is wrong. We shouldn't martyr ourselves for the protection of children, and should instead rely on education to protect children. After all, providing an ID isn't going to stop predation.See point 10. I'll add onto it though. If teenagers don't have access to sites that require ID, they'll find sites that don't require ID. Facebook may not require ID to create an account, but suspicious accounts are locked until ID is provided proving those accounts are legitimate. So sites like Facebook are actually pretty good with their anti-bullying measures. It still happens, but there are protections. Unfortunately, being ID'd also leaves teens prone to being found by their bullies. Sites that offer anonymity have their own ups and downs. But my point is - teenagers will find ways to communicate with each other online, and to communicate with other people. The risks will remain present.As I stated in one of my points, requiring ID from every single user would be a logistical nightmare. None of those sites would be able to keep up. It would be invasive as hell. And teens would simply find other ways of communicating. And, let's be real, there are plenty of image sites that don't require an account to view images or follow others. A teenager is still going to be exposed to things that create unrealistic beauty standards - and that's a problem that will exist even if you prohibit them from using the internet at all.In high school, I felt we weren't listened to as adults. In too many ways, we were treated like grade schoolers. Going to community college was a jarring, but refreshing, change of pace. One of the issues with adults is that we sometimes become overbearing. You want to tell teenagers they can't use social media - when it used to be normal for teenagers to hop in a car together and travel around town unsupervised. Nowadays, teens tend to hang out with each other at each other's homes. I'm not sure if this is a good thing or a bad thing, but teenagers are going to distance themselves from adults and communicate with others one way or another. It's a part of growing up. Prohibiting their use of social media is going to simply result in teenagers becoming frustrated. And, since ID laws would be impossible to enforce (far too many users vs. staff), it would merely result in teenagers lying when creating accounts moreso than they already do."
    },
    {
      "author": "Kman17",
      "timestamp": "",
      "body": "Is the implication here that prior to social media, kids had less exposure to unrealistic beauty standards?  That they felt less pressure by their peers to act older / cool?  That they were advertised to and preyed on less?Growing up in the early 90’s, I’m rather confident that it’s not the case.The flip side of kids finding their celebrity icons and tends via social media rather than tv/magazines is that the former iswaymore diverse.Bullying, racism, homophobia is waaaay down.  Kids have more niche tastes and acceptance.It’s not all perfect, but it’s mostly better.Logistically, it’s awful hard to fight technology. Imposing restrictions that are only enforceable on large companies will just push the behavior to less controllable corners of the internet."
    },
    {
      "author": "Feathring",
      "timestamp": "",
      "body": "Are you saying this should be mandated by law, or that companies should do this of their own volition?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This assumes that Instagram's only purpose is selfies, and whilst true for some, it's certainly not the case for me and the wide reaching communities I have become a part of. I started using Instagram when I was 13 and used it especially frequently during the lock down in my country this year.You mention meeting your friends on internet forums; I have been able to become part of an incredible community of Lego builders on Instagram by sharing pictures of my own models, and I would call some of these people my friends. In many cases, I have no idea about these people's lives outside of this one specific hobby, including their personal appearance. Still, I think that seeing their builds, as well as their feedback on mine, has made me better at my hobby, and just being able to talk to people has made me a more well-rounded human being.Obviously this is anecdotal at best, and I agree that their should be more support in place for self conscious young people in the age that we now live in; one solution could be to tag photos that use excessive filters, or to discourage others from using those filters. However, I do hope that you can also acknowledge that Instagram, and other social media image sharing sites, have made me and countless other young people very happy, so I don't think it's fair to eradicate it completely."
    },
    {
      "author": "taurace",
      "timestamp": "",
      "body": "Looking through your comments some of your major concerns seem to be kids being exposed to damaging advertisements and kids being sexualized and exposed to predators. I’d argue those are two different issues with two different solutions.First, I’d argue that many of the “healthy” “thinspiration” lies and BS should be banned for everyone, not just teenagers. It’s no better than when cigarettes were advertised as something to make you sexy. Things that are blatantly misleading and cause severe health issues and deaths should be illegal to advertise full stop.Second, kids being exposed to predators and posting sexualized images is better handled by parents. Rather than collecting children’s information and verifying ages, social media sites should better equip parents to see who their child is messaging and what they’re posting. Sadly, the gap in technological ability between kids and parents makes this very difficult to implement effectively. And it doesn’t do anything for kids with irresponsible parents. But I still trust most parents to do a better job watching out for their kid given the right tools than a giant tech company which is only truly concerned with making max dollars.Lastly, a bit of hope. The internet and social media are still quite new and changing rapidly. Society, laws, and parents are struggling to keep up and rein in the dangers. I see evidence that gen zas a wholeare more cautious online, and have seen the lessons some older millennials learned the hard way. I think things will improve even more when most parents are themselves digital natives and able to keep up with the rapidly changing online environment. More people are becoming aware of the impact of sites like Instagram on mental well-being, and in the future more parents will be aware of the need to limit social media use.Also, the implementation of laws like the right to be forgotten and child privacy laws in the EU are signs that society is slowly adapting and moving in the right direction. It’s a tough battle, especially when only handful of companies wield such massive power and influence, but it can be done.TLDR: these issues are better addressed by empowering parents and legally punishing bad actors than by giving tech companies even more of children’s data."
    },
    {
      "author": "Wearing_human_skin",
      "timestamp": "",
      "body": "For a few of your points it sounds as if you are punishing teenagers for the faults of something else that could be isolated and dealt with.I'll reply to a few of your points to illustrate my point.2. It's true that Instagram has led to the sexualization of minors and that it leads to more sexual predation. However banning kids outright might not be the solution. Why doesn't the company tighten security for minors? They can offer better reporting services for children to use whenever a creep messages  them. They can implement more effective procedures to identify and punish the adults involved in sending creepy messages to kids. This way there is less harm from sexualization without punishing kids. Kids might still sexualize themselves, but at least there won't be serial rapists who lurk online in search for kids.Now to actually solve the sexualization issue there are far better methods which work than banning teens. For example the body positivity movement took platforms like Instagram by storm in order to educate teens to be comfortable with their bodies. Hard banning things like sex, drugs etc hasn't worked on kids to stop them engaging in such behaviors. Education done the right way has always proven far more effective in changing teenagers' minds.This whole point is also addressed at your 3rd point since 2 and 3 are similar.4. Just like how on Reddit there are moderators who can remove posts for misinformation, this can be implemented for insta scams. This way only products that are child safe are advertised to kids.None of the claims of these ads are verified for accuracy.I agree that disinformation on the internet needs to stop. But it starts at exposing and punishing the adults and companies who manipulate kids and perpetuate the harmful products to them instead of punishing the children who are genuinely just looking for content that will help them improve their body.Skipping back to your first point mainly because I needed to put my strong responses first and this is more of a question.Do you know how big the black market is for cosmetic surgery to teens? Just want to know in order to quantify how big an issue it is for these products to be sold to them. If it is a relatively small problem, it could be solved by countries tightening their law enforcement to identify where these markets occur and shutting them down. Or is it too huge a problem that it's utterly impossible for countries to take the right steps to solve the issue?If anybody has any idea on the stats around this please share if you can."
    },
    {
      "author": "zippideedoodaa1640",
      "timestamp": "",
      "body": "Why do we need to make rules when it’s really a parenting issue? Teach your kids to be critical thinkers and don’t believe everything they read on the internet. Develop a relationship with your kid so that they feel comfortable coming to you for questions and not creepy strangers on the internet. Teens should be able to enjoy social media, and it is up to them how they use and interpret it. It is up to parents and the education system to adapt their teaching material and style as technology advances... the basic issue is that our education system, in America at least, doesn’t teach you skills or knowledge about real life, we need more classes about sexual, mental, physical health, we need classes on how to use technology and social media ethically, efficiently, and safely, how to do taxes, how to invest, etc. I’ve gotten off topic, but my point can apply to many subjects that I think America is failing to teach the younger generation."
    }
  ]
}