{
  "subreddit": "deliveroos",
  "post_id": "1i56cvk",
  "title": "I've just got a warning about age verification how dumb is this.",
  "body": "I ask for ID at the door he looked 40 when I ask him he said \"give me my order in aggressively way he said I look older than 25.\n\nI said to the customer sorry but my account is warning from not checking ID properly deliveroo told me one more time and I will deactivated. I must put DOB that is matching your account so deliveroo know I checked properly.\n\nSo the guy said to me ok but my dob is wrong in The app.\n\nwhen I signed up it was my mistake. I said ok show me ID I saw it was different from the account but same name so I made a reference to the situation in my notes in case deliveroo ban my account.\n\nHeadquarters of deliveroo check the in app customers DOB when signing up and check if it matches with what you put in when you enter the DOB.\n\nThis means if the customer has a different DOB on the account but shows you a different ID but the  same name. Your account will be terminated.\n\nWhy can't deliveroo verify age restricted people on the account make them responsible for ordering.\n\nWhy are we risking our job for people. I will not do age restricted again.\n\nPeople have been terminated for this type of situation before be careful\n\nIM NOT ACCEPTING AGE RESTRICTED ITEMS AGAIN THANKS FOR OPINIONS EVERYONE.",
  "author": "Commercial_Travel_35",
  "comments": [
    {
      "author": "Bowman359",
      "timestamp": "",
      "body": "All apps NEED a \"customer looks over 25\" button. its embarrassing asking people old enough to be my parents for ID"
    },
    {
      "author": "StorageResident6219",
      "timestamp": "",
      "body": "It’s clearly a flawed system. Why do I have to ask a 50-year-old person for their ID?"
    },
    {
      "author": "EnvironmentSmooth542",
      "timestamp": "",
      "body": "I have quit doing age restricted deliveries about 2 years ago and everyone else should do too. We don't get paid extra for them and we risk getting terminated over some bullshit like wife ordering some wine but instead the husband opens the door and gives his ID and then we get a warning or worse, termination because the DoB does not match the one in the app. I'm aware that you have to enter a certain amount of DoB wrong before you get a warning but still, the policies and rules around it are ignorant and brainless to say the least.If enough riders boycotted age restricted deliveries then maybe Deliveroo would relax them. It should be challenge 21 or challenge 25 and fully up to our discretion when we ID someone or make a simple flowchart with questions in the app for example \"Does the customer look over 25?\" If you press yes then you can continue and ask for the code, if you press no then you have to ask for ID and enter their DoB so the app can check if they are over 18. Simple as, I've never heard of a store that has a policy that requires all employees to check IDs if someone is buying something 18+ no matter how old they look. I would like to see Will Shu ask a man who's clearly retired for his ID."
    },
    {
      "author": "PrincipleSuitable383",
      "timestamp": "",
      "body": "Sainsbury’s cashier told me to not forgot to ID if they looked under 25, told her Deliveroo has an ID everyone policy. She was gobsmacked “even a 60 year old lady, I’d be fuming if someone ID’d my mum”."
    },
    {
      "author": "ManTrynaLive",
      "timestamp": "",
      "body": "The way I treat it. Ask for ID. Any resistance or issue take DOB. Mystery Shoppers ALWAYS have id in their pocket. I simply ask “are you a mystery shopper” by using the words “Any id?” and never had an issue. Once I asked “any ID” out of habit to a 90 year old woman and the lovely woman got her passport out for me 😂"
    },
    {
      "author": "PrincipleSuitable383",
      "timestamp": "",
      "body": "This is a good strategy but I think you’re missing OP’s point. Apparently, if you enter too many DOB wrong you’ll get flagged. So the OP is saying, even if you ask you can’t guarantee if the dob matches with the one they signed up with and what if someone else opens the door. Personally I only ask if they look under 25, others I don’t ask at all, never had any issues."
    },
    {
      "author": "Glittering-Put-609",
      "timestamp": "",
      "body": "What If they put the wrong details in when they first signed up too?"
    },
    {
      "author": "selfy121",
      "timestamp": "",
      "body": "Exactly it's not good on us"
    },
    {
      "author": "Time_Engineer_5196",
      "timestamp": "",
      "body": "Simple. Reject all age restricted (if you can afford to). Not touched one in years and never happier."
    },
    {
      "author": "Commercial_Travel_35",
      "timestamp": "",
      "body": "I will no longer do alcohol orders for this reason. Young people are fine with ID, and usually have plenty of ID on hand.Older people especially boomers seem to think being asked for ID is against their human rights. Plus the long waits, at the door waiting for them to find a passport or a driving licence.Deliveroo etc should bombard their alcohol buying customers, stressing the need for ID as much as they bombard their riders.My next door neighbour has an alcohol order from the Coop almost every day from Deliveroo. Not one has asked him for ID!Before a customer can buy alcohol they should have to upload their ID to the app, to filter out those who have no ID at all, and there are plenty of those in my town.I've had people come out with letters from the DWP, bank cards etc... fine but not ID and I'm made to feel terrible.Also if its mixed in with general shopping you would have go into their shopping to remove the age restricted items. It really ought to be packaged seperately."
    }
  ]
}