{
  "subreddit": "Twitter",
  "post_id": "a3dnrb",
  "title": "Twitter Age Restriction Locked [UNLOCK METHOD]: Also for people who messed up the first time and need assistance.",
  "body": "UPDATE: Okay so it’s August 2021, 3 years since I made this thread, and people still asking me from this [I have gotten over 200 accounts for people unlocked now!]. Yes my method still works & if you need fast replies (as sometimes here takes me a couple of days, then my discord is vaz#1999). Best of luck with getting your accounts back! 😇 ———————-\n\nOkay, so yesterday I went through the experience of being age locked even though I'm 19 years old. And before checking online to see how to get around this [as some of you may have done], I clicked an option where I got locked and have to submit ID.\n\nIf any of you are in same situation or have your account fully locked then follow these steps [this also helps people who submitted ID that didn't work / was wrong the first time].\n\n1)Sign in on Twitter [you should be on the locked screen now or the form screen, it doesn't matter either way], you just have to make sure you're logged in.\n\n2)Open a new tab. Past and search this:https://help.twitter.com/forms/locked?u13_reason=entered_incorrectly. Ok you should be at the form screen now.\n\n3)If you haven't already submitted a form before, this is for you:\n\nMake sure you have put in correct username, correct e-mail and use ID [doesn't have to be you] but the ID has to be clearly visible with all the information and has to be of an age where you would have been 13 or older when signing up to Twitter. You should then be fine after submitting - it doesn't hurt to redo this a couple times but you don't really need to tbh [your own choice]. If you needed to use this step then you should be done [takes around 24-48 hours, sometimes shorter, sometimes longer].\n\n4)If you have submitted a form before and you had any information wrong or used the wrong ID [as I did] this is for you:\n\nThe first time I did this I used my actual ID thinking as I'm 19 now they will let me off.. Wrong, they don't lol. Ok so what you do is make sure your IP address is different than the first time is by either resetting your internet router or using a VPN. I reset my router. Next do exactly the same as the first 2 steps of this thread. Now you should be on the form screen. Make sure you have correct username in the box, a DIFFERENT e-mail address that you have access to & a different ID where you would be 13 or older [doesn't have to be you, I used my dads ID lol]. Now submit the form :) You can submit a couple more times this way again but one time should be enough [as it was for me]. It should take 24-48 hours to be unlocked, take in mind this can be slightly shorter or slightly longer. It took me just over 24 hours to have my account unlocked.\n\nOkay so this should be enough to get your account unlocked & deal with the intense stress oh having your Twitter privileges taken away from you! 😄👌🏽",
  "author": "[deleted]",
  "comments": [
    {
      "author": "roozbahani_s",
      "timestamp": "",
      "body": "thanks man ! will try ! hope work ! it's been 2 month for me ! :(("
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "danecek123",
      "timestamp": "",
      "body": "the link brings me back to where it says 'You've already selected \"I entered my date of birth incorrectly.\" Submit your request by completing the form.' i tried using vpn"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Kearneey",
      "timestamp": "",
      "body": "I used a different Email address when I filled in the form but I got an Email saying that they could not verify me as the account holder, any suggestions?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}