{
  "subreddit": "reddithelp",
  "post_id": "1cbdw3t",
  "title": "How do i report someone for being underage?",
  "body": "I found an account posting inappropriate questions and stating they are 12.  The only option when I click report account is “report username”.  Do I just report their posts?",
  "author": "greenbldedposer",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hello there,u/greenbldedposer! Thank you for posting tor/reddithelp!This subreddit is dedicated to providing assistance and support for Reddit users. If you have any questions or need help with anything, including cars, browsers, or Reddit, feel free to ask here. We have a community that loves to help each other.Is your issue resolved? Feel free to reply withResolvedso your post gets marked as Resolved.Do you have Discord? Come say hi to us in ther/reddithelpDiscord.We hope you find the assistance you need. Happy Helping!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "notthegoatseguy",
      "timestamp": "",
      "body": "I would not recommend selecting report reasons that do not line up with that specific content violation. That could be considered Report Abuse, which could get your account sanctioned.Honestly I wouldn't worry about it. Let Reddit police their platform in this case."
    },
    {
      "author": "HybridMoments4283",
      "timestamp": "",
      "body": "It’s against TOS to use Reddit under 13. Anyone who says they’re under 13 on a comment or post is enough evidence to ban them even if they’re really not.Source:  Former mod. All they have to say is “I’m (whatever age under 13)” and we insta banned them.Edit:  there were actual circumstances when we did not insta ban, but they’re very specific like someone asking for help with a potentially serious situation."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "SmhYou message the mods.But you do realize all that’s going to happen is that they’ll get banned and then create a new account?  I understand why people do this, and I guess it’s good thing but it doesn’t fix or deter anything."
    },
    {
      "author": "greenbldedposer",
      "timestamp": "",
      "body": "They need to be taken care of immediately.  They are asking extremely inappropriate questions and opening themselves up to danger"
    }
  ]
}