{
  "subreddit": "RobloxHelp",
  "post_id": "1dahzbr",
  "title": "Roblox Age Verification won't work",
  "body": "I've gone through the verification process maybe six times now, and I've gotten all the way to the Verification Successful screen each time. Every single time, the Verify My Age button remains in place and I remain unverified. I contacted support and they were literally useless. When I say useless, I mean:\n\nResponse 1: \"Hello there,Thank you for contacting Roblox Customer Support about the Age ID Verification feature.\n\nRoblox CS is not able to manually verify ID for any user, nor update account settings related to this feature. Age ID Verification must be completed through Persona via the prompts within account settings. For more information on how to verify your Age ID, please check out our Age ID Verification article.\n\nAlso, be sure to read our Age ID Verification FAQs for frequently asked questions and solutions on Age ID Verification.\"\n\nResponse 2: \"We're sorry but we're unable to provide you with any further information or response regarding this inquiry.\n\nWe encourage you to review the previous information sent to you as we have provided you with all that we can at this time.\"\n\nI'm just in awe at the whole thing to be honest",
  "author": "looking_at_birds",
  "comments": [
    {
      "author": "L_ow",
      "timestamp": "",
      "body": "same, if u have any updates please let us know"
    },
    {
      "author": "looking_at_birds",
      "timestamp": "",
      "body": "they were pretty much useless tbh. I waited a week and only after then did it finally work"
    },
    {
      "author": "chickencurrylmao",
      "timestamp": "",
      "body": "same issue with me, i still cant get it to work and ive been trying for about 3 months now, i get to the verfication succesful screen but when i return its just unverified and i cant even get access to voice chat because they wont let me have it with a verified phone number. Roblox support can not be real people"
    },
    {
      "author": "Traditional-Milk3064",
      "timestamp": "",
      "body": "Same bruh"
    },
    {
      "author": "ReslDark",
      "timestamp": "",
      "body": "So is there any solution? I got banned on an account that had vc and maybe they banned me from using vc"
    },
    {
      "author": "looking_at_birds",
      "timestamp": "",
      "body": "VC is always monitored, but they usually do a couple of mutes before banning accounts if you curse or whatever. I can only say good luck with Roblox support if you try to submit a ban appeal :("
    }
  ]
}