{
  "subreddit": "PiNetwork",
  "post_id": "jvls43",
  "title": "Name verification. Mine’s correct, but did anyone else get this?",
  "body": "",
  "author": "hijikataxmayo",
  "comments": [
    {
      "author": "neelothpal-vipparla",
      "timestamp": "",
      "body": "I verified with my phone number, which my father bought with his name, so what name should I use my father's name or my name??"
    },
    {
      "author": "-MercuryOne-",
      "timestamp": "",
      "body": "It’s on the home screen now, looks like it’s for everyone. Here’s the full statement:“One chance to fix nameAs communicated multiple times previously, we will offer one chance for Pioneers to correct their names on their accounts before the Mainnet. Due to the Pi Network policy of one account per person and the high importance of humanness of the network, Pioneers will only be able to claim their Pi on the Mainnet if they pass KYC, and the name on their Pi account and the name of their KYC must match. Thus, having correct and accurate names on your Pi account is of utmost importance.We’ve received many requests from real pioneers to correct their names over the past year and half. Some Pioneers did not enter correctly-spelled names during the signup process. It’s understandable that many people did not want to share their real correct official names when they first got to know Pi. In addition to the new-user mentality, there are also usual discrepancies such as middle names, maiden names, or names used in daily life versus names in identity documentation. Also, some KYC processes in some regions only contain native-language names, such as using a National ID card, whereas the name in Pi accounts may be in English only. So in order to ensure complete matching to the name from KYC, many Pioneers need to update the name. To further ensure the match, the Core Team designed the name update process to include entering your middle names or maiden names that were omitted in the signup process for simplicity. The name update process also provides the option to enter names in respective languages, when applicable.This is the only chance for all existing Pioneers to correct their names, and also this option has a short time limitation. The option just becomes available today for a limited time. Each existing Pioneer will have this option available for only 3 days after their next visit to the app. Once submitted, this option will no longer be available. The reason for such a short time window is to prevent bad actors or fake accounts from being able to be exchanged or sold to other human beings. Once the time expires, all existing accounts will be locked in whatever names they have, and if the future KYC of these accounts cannot match the names of the accounts, then the Pi mined in such accounts will not be migrated to the Mainnet. We understand the time pressure of this feature, but please understand the necessity of such a short time limit to ensure the health of the network and prevent unfairly mined Pi by fake accounts from getting onto the Mainnet. We also encourage all Pioneers who know about this feature and its time limit to urge your earning team members and security circle members to confirm their names are correct or make any necessary changes.For any new accounts created going forward, they will have a window of 2 weeks after signup to make name corrections once, hence they will not be offered a pan-network chance again to update their names. The individual name-correcting windows for any newly created accounts will not incur risk for fake accounts to be sold because these newly created accounts will barely have any Pi mined to be worth being sold.We want to emphasize here further that sales of Pi or Pi accounts for other fiat or crypto currencies are explicitly prohibited in Pi Network’s terms of service. This behavior violates Pi’s policy and harms the health of the ecosystem. Any such violation if reported or discovered will lead to the freezing of the account and the loss of all Pi mined in such accounts. We urge every Pioneer to stay away from selling or buying any Pi accounts.All name data collected through the name correction and update process will be used to verify Pioneer’s identity and to match with the KYC data to determine if a Pioneer is a real human being and ensure the humanness of the network.In the name update, we also added the option for Pioneers to enter their email address. This is meant to address any account recovery issues over the years, due to the loss of password, change of a phone number, or a Facebook-disabled account. Adding an email address provides Pioneers an additional way to prove their ownership of their Pi accounts or to recover their account if other signin methods are lost. It also provides us one way to inform you of major network events, e.g. the launch of the Mainnet or the creation of an address on the Pi blockchain, in case at the time you are no longer very active on the app. The email address you enter right now will need to be verified in the future, e.g. sending you a verification email and link, but for now you only need to enter it to associate it with your Pi account.”"
    },
    {
      "author": "Nhil29",
      "timestamp": "",
      "body": "I just got it. I filled mine out, all I did was add my middle name and email."
    },
    {
      "author": "CorrosiveBlueberry",
      "timestamp": "",
      "body": "it's just an option or promotion they are giving for the next 3 days to allow people to correct there names if not correct, it is offered to everyone on the pi network its not specifically saying your name is wrong"
    },
    {
      "author": "Onb3SkaAmD",
      "timestamp": "",
      "body": "How to get kyc verification? I dont see that option"
    },
    {
      "author": "JenovasChild666",
      "timestamp": "",
      "body": "Yup, just got it. Changed my name to what my passport says as I've already submitted KYC. Love how it gives the opportunity because I signed up with my alias name!"
    },
    {
      "author": "crazy_dr",
      "timestamp": "",
      "body": "Hello I am Turkish. We have Latin alphabet with some extra letters (ç, ş, ğ, ü, ö, İ, ı). So I have a Turkish g (ğ) in my name. What should I do? Should I write my name with normal g in the English section and with Turkish g in the native language section?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "My name is Abc and my surname is Xyz... My middle name is opq.. I have added my name as Abc Xyz but not added my middle name.. That's fine right"
    },
    {
      "author": "abcdeboy",
      "timestamp": "",
      "body": "Is correct name sensitive to upper and lower cases? Like Josef and JOSEF? Which one is correct here?"
    },
    {
      "author": "hijikataxmayo",
      "timestamp": "",
      "body": "I'm slavic. Do I put Š and ć or S and c? My documents are with Š and ć Please help"
    }
  ]
}