{
  "subreddit": "GenderGP",
  "post_id": "yp4j9f",
  "title": "Can't prove my age with ClearChemist",
  "body": "I've literally never been more irritated in my entire life.\n\nI've just had my prescription signed and sent to gendergp's online pharmacy, ClearChemist, and I'm all set to buy my testogel when WHAM! It asks for me to prove my age, obviously it should for safety reasons butGOD! I've never experienced worse age checking. It gave me five options to prove I'm 18 and older and ALL OF THEM do not work.\n\nOne option asks for personal details, name and birthday and email and it told me my details were wrong.\n\nAnother option is to log into an age verification website called 'AgeChecked' but it costs 35 pounds to create an account and that's a monthly fee! No way Hose.\n\nA third option is use a debit card because a debit card can only be used by people over 18 but opening a debit card account can affect your credit score and it takes a while to set up a debit card account.\n\nThe fourth option is with a driver's license which is useful for people who can DRIVE! If that allowed the option for people with provisional driver's licenses then that would be more accessible and still prove your age but no, it's only limited to official driver's licenses.\n\nThe fifth and final option is through text which SHOULD be fine but I have tried both my mobile number and my friend's number but the 'VERIFY' text didn't deliver through both of our phones and we both have unlimited texts! There's no reason for it to work!\n\nI just wanted to post this in case anyone had the same problem as me and can help me out. I will definitely be emailing gendergp for support, either way will it be easier to request a paper prescription instead? xoxo",
  "author": "venusdoesnotexist",
  "comments": [
    {
      "author": "Leila-Ilo",
      "timestamp": "",
      "body": "Age verification is so frustrating! Sorry to hear it’s giving you such grief. On the note of ‘AgeChecked’ is it possible you’ve managed to get to the wrong page? It was free to use when I used it, albeit that being a year ago.Looking  at their site they charge £35 a month (for 100 age checks) for businesses accounts to use their services so they can verify the age of their customers, definitely not a charge for individual customers.Regarding paper prescription, IF you’re from the UK be prepared to go on a pharmacy hunt as they’ve been known to be a bit hit and miss when submitting gendergp paper prescriptions, using clearchemist (without the verification frustrations) is definitely the more convenient and generally time saving route."
    },
    {
      "author": "venusdoesnotexist",
      "timestamp": "",
      "body": "It's literally impossible to find a free way to use it, I can't find a simple sign up for an individual costumer at all! Their website is literally so confusing.With paper prescription, I have a friend in the same city as me nine months on T and he knows the right pharmacies to go to for hormones in case I have to switch to paper prescription."
    },
    {
      "author": "theatricalmess",
      "timestamp": "",
      "body": "AgeChecked is free for me, I’ve definitely not had to pay £35 (and definitely wouldn’t since I’m paying like £75 a month for T as it is)"
    },
    {
      "author": "venusdoesnotexist",
      "timestamp": "",
      "body": "Have you used the website recently? I don't know if it's just me but it's impossible to navigate, there is no option for me to use it freely as an  individual and not a business account"
    },
    {
      "author": "digital_bloodbath",
      "timestamp": "",
      "body": "same issue, i emailed clearchemist, this is so frustrating"
    },
    {
      "author": "venusdoesnotexist",
      "timestamp": "",
      "body": "I have the answer! I ended up phoning clear chemist and this is how to sort it out. When you get to the check-out and then it asks you for age verification, click the 'x' at the top corner and don't worry with what it says, once you click off you can actually just click to buy it again and you can buy it. Just make sure to email clear chemist's email with the order number you'll later get as well as some proof of I.D. and age! :)"
    }
  ]
}