{
  "subreddit": "Vanced",
  "post_id": "mdmwti",
  "title": "[Suggestion] Bypass age verification",
  "body": "For most people in the EU, it has been decided that a picture of your ID or a linked credit card is now required to watch 18+ content. Lots of content gets flagged because imagine hearing someone say \"frick\" or \"heck\". I think this feature would bring many more users to the app.",
  "author": "hihellhi",
  "comments": [
    {
      "author": "Marvinx1806",
      "timestamp": "",
      "body": "Have a look at this:https://www.reddit.com/r/Vanced/comments/ma73v9/suggestion_a_way_to_bypass_the_new_and_bad_age/?utm_medium=android_app&utm_source=share"
    },
    {
      "author": "glitchmasterYT",
      "timestamp": "",
      "body": "I dont think that's possible, vanced is youtube but pretty much with some special adblock and sponsorblock code attached, I dont think they can get around somthing hard coded into the original app. Also wouldn't it break the law?"
    },
    {
      "author": "deoxysvirusman",
      "timestamp": "",
      "body": "Use a VPN that changes your location to somewhere outside of the EU like the US, it won't ask you to verify your age."
    },
    {
      "author": "eidir_ian",
      "timestamp": "",
      "body": "Have you tried New Pipe? It has that option."
    },
    {
      "author": "aKuBiKu",
      "timestamp": "",
      "body": "Pretty sure it already does that. I was able to watch an age locked video on it. Edit: Nevermind, it works on the normal youtube app too. Weird."
    },
    {
      "author": "mrandr01d",
      "timestamp": "",
      "body": "If this works that's great, but I don't want to have everyone flocking to vanced. Don't want to tempt the google overlords."
    },
    {
      "author": "shab-re",
      "timestamp": "",
      "body": "Use newpipe"
    },
    {
      "author": "Zaruzyn",
      "timestamp": "",
      "body": "There's porn on youtube?"
    },
    {
      "author": "hihellhi",
      "timestamp": "",
      "body": "Just show them your debit card. I'm nowhere near 18 but they took the debit card fine."
    }
  ]
}