{
  "subreddit": "IRS",
  "post_id": "10zuzix",
  "title": "ID verification process / timeline / what to do",
  "body": "ID verification process/refund help/timeline/\n\nHello I’m making this post to try and help everyone I can or who has questions.\n\nI filed my refund on 1/24 and accepted same day. I got my state refund a week later and thought it was weird this was my first time not getting my federal first so I came to this subreddit to see any answers that may helped me. I was led to check the irs website for the first time and I first had to sign up for IDME which what the IRS website uses to verify your login info. THIS IS NOT THE SAME THING YOU DO TO VERIFY YOUR ID FOR YOUR REFUND! This step is for everyone who first makes an irs account. So after creating my account I noticed on the home page under NOTIFICATIONS on the bottom it said verify your tax return information now. It will say it where it says to go paperless for certain irs notification. I had no clue what this meant so I researched it and anyone who gets this notification means that their refund has been flagged for fraud of some sort and they need to verify if you actually filed your return. It can be flagged because some one already filed for you, your employer didn’t send your w2 before you filed, change of address or info of yours, or just randomly selects people. After going through years of previous posts on this subreddit, I read that you will get a letter in the mail once you receive this notification and how to verify it was actually you. I’ve read that most people got this letter around 4 weeks after filing or being accepted. The letter will come with a 14 digit verification code that you need to use to verify yourself online or over the phone or in person if you fail to verify yourself online or over the phone. I found the number to call to verify yourself over the phone when you get the letter and took my chances even though I never got the letter yet. The phone number is 1-800-830-5084. The first few times I called it took around 10min for some one to answer and I told them I got the verification notice and needed to verify. They kept asking for the 14 digit code on the letter and refused to help until I got it. I don’t take no for an answer so I kept calling until someone would help me. After 3 days of calling and probably my 8th time I got someone to verify me without the letter on Friday (2/3/2023)!They asked for last years w2 agi, mother and fathers maiden name, where I worked and my personal info. Took 5min and they said now my return could take up to 9 weeks but usually takes 2-3 weeks. Nothing was wrong with my return and they said I was a random selection. They then put a code in my return and now it was a waiting game. I called a few days after to make sure the person actually verified me and they did. Yesterday 2/9/2023 the notification to verify on my irs account to verify my return finally went away so that gave me the idea my cycle code will be 05 probably which means I’d be a weekly since weekly accounts update on thursdays. Sure enough today (2/10/2023) my transcripts updated from N/A to producing a refund date of 2/15 just like how weekly accounts transcripts update on fridays and then wmr on Saturday’s. I was a single filer with one w2 and stock gains/losses.\n\nEdit: WMR update like I assumed today (2/11/2023)and refund has been approved.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Impossible_Rice8036",
      "timestamp": "",
      "body": "I had to do this as well. Two days after completing verification the transcript was up dated. I just received the notification today that I will be receiving a paper check and it should be mailed by 2/17."
    },
    {
      "author": "meighanu",
      "timestamp": "",
      "body": "Thank you for this."
    },
    {
      "author": "CapnSie",
      "timestamp": "",
      "body": "This has helped so much! I had to verify too and I’m going to call to make sure the person actually did it. I hope it updates tomorrow"
    },
    {
      "author": "Complete_Mode",
      "timestamp": "",
      "body": "I did the same exact thing last week. I didn’t get the letter and had to convince someone to verify me. Such an inconvenience.. I have been using the same bank account for my returns for years and they said that I would not be able to receive DD but instead a paper check because “it’s the policy”"
    },
    {
      "author": "BigponyRL",
      "timestamp": "",
      "body": "Yeah that’s really weird, I haven’t read that on anyones post from previous years and they didn’t even mention that to me and just asked if I wanted it DD still and I said yes"
    },
    {
      "author": "QuailAffectionate652",
      "timestamp": "",
      "body": "I just got the letter today, and it won't let me do it online, so I'm calling Monday. Any tips, please?"
    },
    {
      "author": "BigponyRL",
      "timestamp": "",
      "body": "Yeah you’re good! You got the letter so that’s a plus; like I said in the post I called and did it over the phone without the letter but took 8 tries because I didn’t have the letter! All the letter does is give you a 14 digit verification code they’ll ask for over the phone maybe and verify you in 5min with like 5 questions."
    },
    {
      "author": "Conclusion_Scared",
      "timestamp": "",
      "body": "Check your mailboxes. I'm in the state of Virginia and I called and they told me to verify myself via a letter they mailed me. I did that online and the gut said after they get it will be released.When I called back the lady said it could take up to 4 weeks even though I filed electronically and sent all my verifications via the website on the back of the letter.So, not sure if it's being held because of Pather as I am. I'm an 05er and last year I was a 06er. My process date was 2-28-22 issued on 2-24-22.I'm hoping this is the same 4 days early as my process date this year is 2-20-23. Hope it hits on 2-16-23 that's 4 days sooner. But who knows?"
    },
    {
      "author": "BigponyRL",
      "timestamp": "",
      "body": "Yeah the letter will tell you to go online and verify or call. They just don’t want to help you and they can actually do it over the phone, it just takes several calls or maybe two calls and get some one else to verify you"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}