{
  "subreddit": "Sparkdriver",
  "post_id": "1gxi16t",
  "title": "Identity Verification but never took my picture",
  "body": "I received the identity verification notice, hit continue,  and this is what I got. I called support and no help. I am still getting offers,but can't accept them!",
  "author": "Specific-Process6498",
  "comments": [
    {
      "author": "AlbatrossCurious4269",
      "timestamp": "",
      "body": "Happened to me. I signed out and signed back in and worked perfectly fine. Got past the verify"
    },
    {
      "author": "synch390",
      "timestamp": "",
      "body": "All I have to say is nobody sign out. That's when the identity problems started happening this afternoon. I was having problems this morning during a shop and the spark support wanted me to log out and log back in. I said no way am I logging out of this app, every time I log out and log back in something bad happens. Lol"
    },
    {
      "author": "Far_Application9779",
      "timestamp": "",
      "body": "I've never logged out. I typically try not to log out of anything lol"
    },
    {
      "author": "XInsomniacX06",
      "timestamp": "",
      "body": "I uninstalled and reinstalled and that worked for me"
    },
    {
      "author": "codyj81",
      "timestamp": "",
      "body": "I just tried, Just For Men hair color.. that worked for me!!"
    },
    {
      "author": "Hypknotical",
      "timestamp": "",
      "body": "Yep gotta do the whole relog. Did that to me two days ago."
    },
    {
      "author": "Masterr_Chief_11",
      "timestamp": "",
      "body": "Same bull 💩 this early afternoon I scroll up the app because I wanted to do face recognition on 5g instead of Walmart wifi then it tells me identity verification still pending even though it didn’t even scan my face!! wtf"
    },
    {
      "author": "XInsomniacX06",
      "timestamp": "",
      "body": "I uninstalled and reinstalled. It also reclaimed 1.6 gig in space."
    },
    {
      "author": "Specific-Process6498",
      "timestamp": "",
      "body": "Uninstall and reinstall. It’ll let you do it again"
    }
  ]
}