{
  "subreddit": "virtualreality",
  "post_id": "11ts2m4",
  "title": "Would you confirm your age through a 3rd Party ID Verification service if it got you access to an 18+ VR Community?",
  "body": "Every day I see the same posts across Reddit and Discord. Adults are looking for communities where they can engage and play VR games with other folks of a similar age. And who is to blame them. Often younger players (but not all) lack the ability to engage in teamwork and can often be overly talkative and sometimes rude.\n\nOf course, its very easy to lie about your age on the internet, but 3rd party ID verification for Discord does exist.\n\nMy question is this: would you go through the steps of verifying your age through your ID using a third party tool (meaning the owner of the server does not get to see any of our personal information) if it meant having access to a community with other 18 or 21+ individuals?",
  "author": "nat2r",
  "comments": [
    {
      "author": "SoochSooch",
      "timestamp": "",
      "body": "3rd party ID Verification Service - No. I can't imagine any set of circumstances where I would do that"
    },
    {
      "author": "CindyTroll",
      "timestamp": "",
      "body": "Yes and no. I was in an 18+ room with drunk college bros yelling at each other. I know they were over 21, but it was absolute chaos. They'd start yelling at anyone who wanted to have any input. Threatening to kick people who looked at them,  etc.. It was a dumpster fire, and even the screeching kids in Gorilla Tag were a welcome respite after that. I think it's more about heavy moderation than age verification. TL:DR Adults can be just as childish. IMO, kicking out the toxic people is more effective."
    },
    {
      "author": "cursorcube",
      "timestamp": "",
      "body": "No, i'd rather keep the entities i give out personal data to as few as possible. VR communities and discord aren't important enough to warrant the risk."
    },
    {
      "author": "MalenfantX",
      "timestamp": "",
      "body": "No, that would be pointless. Idiots are the problem with social media, and they come in all ages. Arrested development is extremely common, so we have a lot of people who are well over 18 who act like the dumbest teenagers."
    },
    {
      "author": "nat2r",
      "timestamp": "",
      "body": "Clearly it is not pointless given how often people are LFG with an age floor. Who are we to decide whether it's pointless or not, it serves a demand."
    }
  ]
}