{
  "subreddit": "VRchat",
  "post_id": "1hg3q77",
  "title": "Age verification is now out!",
  "body": "",
  "author": "DragonTamerWes",
  "comments": [
    {
      "author": "Smac3223",
      "timestamp": "",
      "body": "To clarify, it's out in \"BETA\". Only groups that have the link to verify are getting it.When this Age-Verification rolls out officially and not in beta, then we should all be able to verify much easier."
    },
    {
      "author": "GutsBoi",
      "timestamp": "",
      "body": "How do you know if you've gotten the link? is it through email or some other way?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "what group did you use? I'm in a group that made an announcement theyre in the beta but no link has been given and there's been no 18+ instances. Why does it feel like nobody wants to \"allow\" others to verify? xD"
    },
    {
      "author": "DrBlackRat",
      "timestamp": "",
      "body": "Age Verification is now available to a selected amount of VRChat Groups for testing! So you have to be in one of those to be able to verify."
    },
    {
      "author": "personman44",
      "timestamp": "",
      "body": "Did you get the blue VRChat badge on your profile by being one of the people who age verified during this testing period? Or did you already have that from something else? I noticed the badge when I got curious what groups had age verification and opened your profile to look at the groups"
    },
    {
      "author": "thatFurryTaran",
      "timestamp": "",
      "body": "Witch groups?"
    },
    {
      "author": "DrBlackRat",
      "timestamp": "",
      "body": "For everyone that’s curious about the privacy info in the email you get from VRChat"
    },
    {
      "author": "DrBlackRat",
      "timestamp": "",
      "body": "This is what it looks like in the client, it’s a bit cramped but it works. You have to set if you want to show it btw, it’s hidden by default currently!"
    },
    {
      "author": "SgtXotiic",
      "timestamp": "",
      "body": "im in a group that has the 18+ beta but im still confused what app I'm using to verify and how its connect to my vrc account"
    },
    {
      "author": "DragonTamerWes",
      "timestamp": "",
      "body": "I'm waiting for a discord group I'm to get it. I don't want to join a group for only age verification."
    }
  ]
}