{
  "subreddit": "Scams",
  "post_id": "1f8uc3o",
  "title": "OF Scammers on reddit - PSA (Kinda long, apologies)",
  "body": "Full disclosure before we start:Yes, I do OnlyFans. I know this in itself can make people very mad, but that’s why I know about this stuff and you should heed my warnings. When I started this around 5 months ago, I thought my main competition would be other women. However, it's become increasingly obvious that my main competition is actually bots, scammers, and agencies. And I'm here to warn you about them.\n\nAlso worth noting:If you already think OnlyFans is a scam, (i.e. think that the exchange of sexual material for money is inherently insidious) then this post probably isn't for you and you’re free to move on without saying hateful or degrading. Also, for the record, I’ve been on this subreddit a long time, and I’m familiar with pig-butchering and Jim Browning and all that good stuff.\n\nOkay - with all of that out of the way, here’s some information for anyone delving into the NSFW waters of reddit. The scam I see the most (and it breaks my heart) is as follows:\n\nHave nudes.They don't have to be your own. They often aren't - I've seen the same photos again and again and again on multiple accounts with multiple names. The names are always terrible. See further below for this.\n\nBuy an account that has been \"aged\" by an account farming company that builds up karma on easy karma-farming subs, liker/cute.This step is not necessary but helps. Older accounts can post on more subs without getting caught in the spam filter. But some accounts just focus on subs which allow new users to post comments, liker/askredditafterdarkorr/sexstorys\n\nPost on reddit. A lot.\n\nUtilize bots to get early upvotes on your threads to boost your posts to the front page of your chosen sub.Not enough to get noticed by spam filters, but enough to drag yourself out of “new” and into “hot”. From there, horny men will generate the rest of the upvotes. For an example of this, look at the speed of the traffic onr/boobs. The escape velocity needed to break free of “new” is something like 50 upvotes in the first two minutes. Most of the time it is not possible without bots, but these kinds of accounts do it regularly.\n\nLink people to an OnlyFans account that charges for subscription.This normally has a low media count. Because it costs to subscribe, you will not see the content until you’ve paid. Once you’ve paid your subscription fee, you cannot get it back.\n\nAnd that's the scam! Why do you care? Because…\n\nThese stupid scam idiots are ruining it for everyone - customers and creators alike!The only people who benefit are the scammers themselves. They are literally dudes in Indian call centres using stolen media and they are making the word \"OF\" synonymous with the word \"Scam\", which it isn't. Please please please stop giving your money to these people. As a consumer, you are being scammed. They will not speak to you once you have subbed. They do not own their content. They will not be able to fulfil custom requests. They will not “get to know you” (because they are actually a team of men).\n\n“Euurgh, OnlyFans is such a scam” - No, yougot scammedby practicing no due diligence when subscribing to an OnlyFans. Please do better.\n\nThings to look out for:\n\n✅Bad English\n\n✅\"Redditor for 3 days\"\n\n✅\"I just turned 18\"\n\n✅Paywalled page on Onlyfans with hardly any media\n\n✅Two posts pinned to profile. One is normally posing as “verification”, but in no way verifies them other than being a picture on a young woman’s face in close up. The other post normally indicates they would be willing to fuck you. This is a good example:https://i.imgur.com/K1AJBxf.png\n\n✅Bad English\n\n✅Generic lame names. “LustyAngel273”, “WetKisses22”, “CuteDancerGirl625”.\n\nAnd that's about it, really! I figure anyone on this subreddit will probably already be quite discerning with where they spend their money, but I speak to so many guys who \"got got\" that I thought it might be worth addressing on a larger scale! I hope you found it useful. Stay safe out there!",
  "author": "manwhoregiantfarts",
  "comments": [
    {
      "author": "RealGianath",
      "timestamp": "",
      "body": "This is pretty much 90% of the cosplay posts in any of the various gaming or anime subs, and every \"rate my profile\" post in the online dating subs.There's so many people that just keep interacting with these stupid posts and can't figure out it's an ad."
    },
    {
      "author": "CaliforniaSpeedKing",
      "timestamp": "",
      "body": "To be honest, I'm not surprised at all that NSFW spaces are so full of scammers. Far too many people think with their dicks and not with their heads, so desperation is already gonna be through the roof and critical thinking skills will have shut off nearly completely."
    },
    {
      "author": "coljung",
      "timestamp": "",
      "body": "\"5. Link people to an OnlyFans account that charges for subscription. This normally has a low media count. Because it costs to subscribe, you will not see the content until you’ve paid. Once you’ve paid your subscription fee, you cannot get it back.\"I've been curious about this one.. because more and more i see profiles linking to OF's 'free trial' pages, but then those links DON'T show the actual OF's name, and there is no way to know if there is any actual charge."
    },
    {
      "author": "yourdonefor_wt",
      "timestamp": "",
      "body": "this is actually very informative and I enjoyed reading it"
    },
    {
      "author": "OnlyFansThrowawayPie",
      "timestamp": "",
      "body": "Thanks!"
    },
    {
      "author": "SIN-apps1",
      "timestamp": "",
      "body": "Great post OP, great info, stay safe out there! Edit:typo"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "CharacterMammoth2398",
      "timestamp": "",
      "body": "Great post. 99% of your critics are either incels or jealous haters."
    },
    {
      "author": "manwhoregiantfarts",
      "timestamp": "",
      "body": "And if you wanna see the details of how to scam reddit with of ripped content, go check out blackhatworld forum. It's hilarious, they're quite professional. Most of them have been banned from reddit and are able to get around it using anti-detect browsers."
    }
  ]
}