{
  "subreddit": "AskAnAustralian",
  "post_id": "1hshrm4",
  "title": "When social media sites start demanding age verification, will you comply, abandon those sites, or find ways around it?",
  "body": "This time next year, sites like facebook, X, BlueSky, TikTok and even Reddit will have to verify that you're over 16.\n\nLooking at how Florida has done this to PornHub, it seems we'll need to scan our faces to some third party which verifies your age to the social media site\n\nWill this kind of process make you uncomfortable enough to stop using social media?\n\nFrom the senate hearings, we learned that social media sites will scan all your postings to determine if you're Australian. If you use a VPN to bypass the age verification, you'd need to start a new account (with new email) and abstain from posting anything that would reveal that you live in Australia.\n\nWill you be willing to do this?",
  "author": "Skydome12",
  "comments": [
    {
      "author": "Bobspadlock",
      "timestamp": "",
      "body": "Most likely send a few dick pics in as ID.Get kicked off for being 4yrs old."
    },
    {
      "author": "MaggieLuisa",
      "timestamp": "",
      "body": "I don’t use any of those sites except Reddit, and I’ll just stop using Reddit."
    },
    {
      "author": "Selina_Kyle-836",
      "timestamp": "",
      "body": "Me too"
    },
    {
      "author": "melmac77",
      "timestamp": "",
      "body": "It’s about time the government realized two things they can’t control the internet and parents need to parent instead of legislating us all up the wazoo which is not going to achieve didly"
    },
    {
      "author": "Car_Engineer",
      "timestamp": "",
      "body": "There will be a federal election in the next few months, and the legislation could be changed before it comes into force.Sadly, both the Labor party and the coalition support this invasion of privacy, and the chance of the minor parties getting control of parliament is unfortunately zero.Personally, I will likely cut back to the sites that are necessary for my work and quit all of the others.Accounts that are over say 10 years old should be exempt, but that would defeat the real purpose, which is connecting real identities to social media activity, and ultimately making \"optional\" government Digital ID impossible to avoid."
    },
    {
      "author": "Jaxley78",
      "timestamp": "",
      "body": "I've already abandoned most social media sites I was on as they've all gone to trash. Not that big of a deal to leave the last 2. If I really need to see something on one of them I can use a vpn. Having a 3rd party with everyone's info is just begging to be hacked, and lets face it the government wouldn't know decent cyber security if it slapped them in the face."
    },
    {
      "author": "VulonRogue",
      "timestamp": "",
      "body": "I'll abandon social media, I doubt I'll have much time for doom scrolling once my child has arrived anyway. Half the stuff are not accounts and ai generated content anyway now"
    },
    {
      "author": "AnonymousEngineer_",
      "timestamp": "",
      "body": "Probably abandon in all likelihood. As it is, reddit is already circling the drain in terms of content, and I'm starting to tire of the same narrative that \"the man\" and \"Boomers\" are somehow conspiring to oppress the youth of Australia."
    },
    {
      "author": "InadmissibleHug",
      "timestamp": "",
      "body": "I spend so much time here and I don’t even really know why, some good people but the rest is bleh.They’d be doing me a favour"
    },
    {
      "author": "Skydome12",
      "timestamp": "",
      "body": "that amount of overreach will go punished.there already isn't privacy on the net so why ad all this extra bs that won't help to solve any of the issues they are setting out to solve?gurrantee this 3rd party is owned by a government minister or said government minister only recommended it as his mate would benefit from it.reeks of corruption and insider trading if i am quite honest."
    }
  ]
}