{
  "subreddit": "ProlificAc",
  "post_id": "1cm3xps",
  "title": "ID Verification",
  "body": "Hello everybody, A couple of days ago I got my confirmation email, finally off the wait-list. However, I saw that they require newcomers to upload an ID. How did y'all feel about this? Because, honestly I feel a little bit uneasy sharing that kind of information. Is it really trustworthy/safe?",
  "author": "Technical_Nature3531",
  "comments": [
    {
      "author": "Rabid-tumbleweed",
      "timestamp": "",
      "body": "This group consists primarily of people who are currently active Prolific participants. Obviously we didn't have any serious concerns with the ID verification, since we went along with it. 😉"
    },
    {
      "author": "wielkacytryna",
      "timestamp": "",
      "body": "I don't remember giving my ID. When was this introduced?"
    },
    {
      "author": "Technical_Nature3531",
      "timestamp": "",
      "body": "You're right about that 🤣"
    },
    {
      "author": "btgreenone",
      "timestamp": "",
      "body": "Here's an FAQthatu/prolific-supporthad pinned for a while with an answer to your question:4) Prolific is asking for my ID, my PayPal details, and wants to know all about me. Is it safe to give them all this information?Yes. Prolific never sees your ID itself; they use a third-party service called Onfido to verify your identity and make sure you're old enough to be on the platform. They need your PayPal information to pay you, and your demographics are how you get selected for studies. Your identity is never revealed to the researchers - all they ever see is your general demographics, and an anonymous Prolific ID number. If researchers ever requestpersonally identifying information, especially usernames and passwords, return the study andnotify Prolific."
    },
    {
      "author": "Technical_Nature3531",
      "timestamp": "",
      "body": "Nowadays it is better to be safe than sorry, and seeing this helps a lot. So thank you very much!"
    },
    {
      "author": "Mundane_Ebb_5205",
      "timestamp": "",
      "body": "Might be a dumb question so feel free to tell me if it is LOL but since we only upload our ID once to the platform, there no renewal process we have to do to re-upload as our ID changes and we age, or we have a change in name or something like that?"
    },
    {
      "author": "Glum_Maintenance8985",
      "timestamp": "",
      "body": "I submitted my ID for verification on May 10th. It still says \"We're verifying your ID,this could take 10 days\" it's been over 10 days..I emailed support but no response. Has this happened to anyone else lately? 🤦🏻‍♀️"
    },
    {
      "author": "Sure-Wedding3823",
      "timestamp": "",
      "body": "same here. i submitted it may 8th, still waiting."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Thank you!! Honestly I don't know why your answer has been downvoted a lot but I appreciate your tips. After seeing that most people had a positive experience I decided to give it a shot! Now I just need to wait for up to 10 days and hope for the best"
    },
    {
      "author": "Technical_Nature3531",
      "timestamp": "",
      "body": "Thank you!! Honestly I don't know why your answer has been downvoted a lot but I appreciate your tips. After seeing that most people had a positive experience I decided to give it a shot! Now I just need to wait for up to 10 days and hope for the best"
    }
  ]
}