{
  "subreddit": "Tiktokhelp",
  "post_id": "1ij42jc",
  "title": "Does birthday matter?",
  "body": "Hello, I have a little problem: when I created my account I entered 1996 instead of 2003, but the date is correct because I didn't know it could make a difference. Now, if I join the program when I reach 10k subscribers, will there be any problems? Opinions are divided, but how is it really? Some say there is no difference, others say that verification will not be passed, meaning register a new account or what to do?",
  "author": "Logical_Year_7545",
  "comments": [
    {
      "author": "Ryoth_",
      "timestamp": "",
      "body": "It probably wont matter. Can’t you change it?"
    },
    {
      "author": "Logical_Year_7545",
      "timestamp": "",
      "body": "No, only write to support, I did, but if they don't change anything, I don't know if I should stay on this account or change to another new account while it's new."
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Trying to figure out how to get past the TikTok ban screen? Tutorial in our subs discordhttps://discord.com/invite/mediamaxxingPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Jazzlike_Trainer2211",
      "timestamp": "",
      "body": "I would say so. I just had issues getting my age verified to go live/ make money, I put in the correct age when signing up- but when I went to verify it like got stuck in limbo for a while. Finally got it sorted out but had to submit a ton of support tickets and emails to do so. So I’ve done the process twice.When you do the verification for it & want to make money on TT they require you scan in your drivers license or photo ID (and I think they give other options like passport etc). They also had me hold up my license to my face with a code written on a piece of paper and take a selfie to submit with it all.They seem to be kind of strict on it- or at least that’s my experience.Here is a very generic email response I got from them talking about age verification.Maybe using that link in the email can help you. Best of luck!"
    },
    {
      "author": "Logical_Year_7545",
      "timestamp": "",
      "body": "Thanks, I just don't understand if there will be a problem with the year - I put older, even though I'm already 18 years old, I didn't think about it, but my birthdate is my birthdate, is it worth doing something about it at all or is it much easier to post videos to a new account? what do you think?"
    },
    {
      "author": "Fit-Ant-9528",
      "timestamp": "",
      "body": "When you verify with your license it won’t match, why would that not matter ?"
    },
    {
      "author": "Logical_Year_7545",
      "timestamp": "",
      "body": "I just don't know how it really is, many people write that everything is ok, some wrote that they had problems, but how is it really? I repeat, the date and month are correct, the year is older than my real one."
    }
  ]
}