{
  "subreddit": "gaybros",
  "post_id": "1hvka1r",
  "title": "Sniffies now requires age verification to see nudes in my state??",
  "body": "Like I’m giving them my fucking drivers license?? “Personal data is deleted after verification” is some damn bullshit and it’s only a matter of time before Grindr requires the same shit.\n\nI’m sure this isn’t an unpopular opinion here but FUCK republican legislators. “Party of freedom” my ass. WHAT ABOUT MY FREEDOM TO SEE A DICK BEFORE IT GETS RAMMED IN MY ASS??",
  "author": "DMC1001",
  "comments": [
    {
      "author": "UnenthusedTypist",
      "timestamp": "",
      "body": "I uploaded a picture of nothing literally put the camera as close as possible and took a black photo. It said there was no readable ID but still have me access to everything"
    },
    {
      "author": "Szaborovich9",
      "timestamp": "",
      "body": "The republicans love nothing better than getting into everyone’s business. Especially if they can peek into your bedroom."
    },
    {
      "author": "Poolofcheddar",
      "timestamp": "",
      "body": "Nothing but a bunch of wannabe puritans jealous of other people having better sex.In pure Republican fashion, are they going to do anything to improve on themselves? Nope. It's easier to attackyou."
    },
    {
      "author": "Forsaken_Man1967",
      "timestamp": "",
      "body": "You can get the “sample” DL off line, use it and it will pass and allow the viewing, etc.  Works every time.  Here is one to use…. Save this and pull up for the verification process… Cheers!"
    },
    {
      "author": "shitassmoneyman",
      "timestamp": "",
      "body": "You’re a SAINT 🙏"
    },
    {
      "author": "JesusFelchingChrist",
      "timestamp": "",
      "body": "Yeah, be sure to keep voting republican until they take away all your rights and all your privacy."
    },
    {
      "author": "crazy_farmer",
      "timestamp": "",
      "body": "And money.  Wait until tariffs kick in and everything is 25% more expensive overnight."
    },
    {
      "author": "Impressive_Basis3954",
      "timestamp": "",
      "body": ""
    },
    {
      "author": "xaviersi",
      "timestamp": "",
      "body": "Lol welcome to Trump's America"
    },
    {
      "author": "DMC1001",
      "timestamp": "",
      "body": "This was coming. It’s from the red states. Pornhub requires ID checks for certain states only. At least with that you can bypass it with vpn. Sounds like there are going to be workarounds for the apps as well."
    }
  ]
}