{
  "subreddit": "questions",
  "post_id": "1gfvru6",
  "title": "EA Child Verification Is Real or Fake?",
  "body": "I gotten a email from my brother account telling me I needed to put a SSN or credit/debit card and if not the account would be disabled. I’m questioning if the email is real or fake. Background email was about needing to take actions toward the child account mentioning KWS and having until January 2025.",
  "author": "Varkanoid",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Message to all users:This is a reminder to please read and follow:Our rulesReddiquetteReddit Content PolicyWhen posting and commenting.Especially remember Rule 1:Be polite and civil.Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.Do not harass or annoy others in any way.Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.Youwillbe banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "OtisBurgman",
      "timestamp": "",
      "body": "Sounds super fake to me"
    },
    {
      "author": "Mondai_May",
      "timestamp": "",
      "body": "EA would not ask for these things. I've never had EA ask me about these. That seems like a scam."
    },
    {
      "author": "Maximum_Border2787",
      "timestamp": "",
      "body": "Definitely fake!!"
    },
    {
      "author": "cwsjr2323",
      "timestamp": "",
      "body": "EA would really like you to put your credit card info in your on line wallet so you can effortlessly make mini transactions, including accidental purchases.  They will not ask for your card directly.  I closed my wallet after EA stole a 99¢ transaction."
    },
    {
      "author": "Ezoterice",
      "timestamp": "",
      "body": "I don't respond to the emails like this, rather, contact the \"source\" directly for any confirmation.  i.e. \"email from brother\", contact brother and find out if he did send it.  If so, again don't click any link in the email.  There should be a  site from whatever official office to securely add sensitive information.  Basically, remove any direct interaction with the email from the process."
    },
    {
      "author": "Such_Manner_5518",
      "timestamp": "",
      "body": "You might want to check your credit score as a precaution"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Medwynd",
      "timestamp": "",
      "body": "The EA help page says they are using KWShttps://help.ea.com/en/help/account/set-up-child-ea-account/\"You’ll be taken to our trusted partnerKids Web Services(KWS). Complete the verification process.\""
    },
    {
      "author": "Varkanoid",
      "timestamp": "",
      "body": "I've just had the same email. It is genuine but you dont have to give your card details or ID details. The first option is for it to scan your face to confirm age. So just do that option if you have a camera."
    }
  ]
}