{
  "subreddit": "discordapp",
  "post_id": "199fq28",
  "title": "Age Banned.. legal issues",
  "body": "Discord banned me for being underage. I own a verified bot that brings in (small, but still some) revenue.\n\nIn order to have a bot verified, you must submit a legal ID (you cant just \"get\" a legal ID). I did this years ago. In order to receive payments from discord you also must be above 18. Which I am.\n\nStill banned for being underage. Why? Nobody knows. My support ticket was marked as \"solved\" 2 hours after it was submitted, without any emails sent to me ever. On top of that, its been over a week since i replied to the ticket, reopening it. No response.\n\nDiscord has completely abandoned its promise to keep us users safe. They dont even care what it means for anyone except for them.\n\nWhat will I do about it? I'm debating on filing against Discord in small claims for loss of revenue (my bot is now offline) and assets (discord nitro gifts worth over $50).\n\nHonestly it doesn't feel great to develop for a platform like this when discord can just take it all away for no reason. Its pretty upsetting to see that not even a verified bot carries any weight here. Just super disrespectful and disappointing.\n\n**EDIT JAN 20: Discord Trust and Safety reached out to me literally 2 hours before our deadline to them expired. They did not mention nor acknowledge anything about the legal trouble or the time it took to \"verify my age\".\n\nWe (my team and I) had talked to a lawyer, and drafted a letter to send to Discord but gave Discord another ticket so they had a chance to cooperate outside the courtroom. They have yet to respond to that ticket, but they have unbanned me.\n\nIm happy to be back, however its still meaningless if hundreds or thousands of people get banned for seriously no reason. Discord was unreasonable and they know it. Thats why they didn't admit anything or respond to our questions.\n\nHave a great day, internet stranger.",
  "author": "KhyanLeikas",
  "comments": [
    {
      "author": "Acceptable_Dot",
      "timestamp": "",
      "body": "this happens all the time. discord is tmk legally required to ban suspected underage accounts quickly, but the fact you had ID verified means that their internal systems are probably worse than I, or anyone else, previously suspected.I have yet to hear of someone who was able to recover s account banned for being underage, but I do hope you recover your losses."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Antique_Big8316",
      "timestamp": "",
      "body": "I was able to recover my account after being falsely banned for being underage, I even have tons of back and forth emails proving the same.Showed my license and birth certificate and examination result sheets and whatnot to them, they didn't accept it but in the end, I re-sent one of the images I had previously sent and added \"I give up\" and they unbanned me lmao (I was 1 day away from account deletion, discord takes 2 to 3 days to reply to emails)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "My account was recovered shortly after uploading my ID for proof, but they never sent me an email back saying it was unbanned 🤷🏽‍♀️ I just tried to log in and it worked. So could've been unbanned for ages just sitting there because they never told me"
    },
    {
      "author": "tnix100",
      "timestamp": "",
      "body": "I've seen people get banned multiple times for being underage, even though they've provided their ID to Discord before. It seems like they don't add a note, a flag, or anything to a user saying they've submitted ID in the past and to not ban them for being underage in the future."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Did you ever even so much as joke about being underage or send any message that would make anyone think so, sarcastic or not? If so, that's why."
    },
    {
      "author": "Low_cops",
      "timestamp": "",
      "body": "nothing i can remember. ive seen some NTTS videos on the topic and it looks like you can report anything out of context and they will just ban you automatically."
    },
    {
      "author": "Martinez_Majkut",
      "timestamp": "",
      "body": "Said im underage in joke terms, sent a ticket and waiting 10 days atm for the respond. 20 days left before they delete my account, Discord support is horse shit."
    },
    {
      "author": "SoPLyA_Dx",
      "timestamp": "",
      "body": "Dude, they also blocked me for allegedly being under 13. I sent them my photo with my ID, but I haven’t received a response for 14 days. Apparently, discord technical support is in no hurry to answer"
    },
    {
      "author": "KhyanLeikas",
      "timestamp": "",
      "body": "Support safety team is dead. You’ll get barely an answer then they will forget about your tickets, and your account will be permanently deleted in 14 days starting from the first day it’s been disabled (banned).They use an AI system to flag automatically account for :Underage users based on comment history;CP content sharing detection (which is 60% reliable, so 40% of banned users are innocent).What you can do is :create a new account so disrespecting discord rules, but who care since you’ve been banned wrongfully anyway.uninstall discord and not recommend the app anymoreuse discord free and never spend a dime anymore on itkeep sending ticket and be disappointed by being ignored.This is the worst support safety team I ever seen in a platform so you better never talk about age or nsfw stuff to keep your account safe.I don’t really understand what is going on but my guess is that they don’t bother with banned accounts anymore and want to fill a metric so they can be seen as a platform taking action against illegal activity, but it’s starting to be seen more and more so discord will be in trouble one day.I know there’s at least someone still working in the safety team but I don’t know what they are doing, looks like they just redirect people to send ticket which are only managed by an automatic answer bot. So discord maybe has no one working there other than unreliable AI and shitty automatic answer. Weird, right? We should have expected some human to check appeals but it seems it’s not the case. Oh and account are deleted in 14 days, so it’s even more fucked up.I lost a 7 years old account and a discord server with many boosts (~14) this way and I never got an answer other than a bot one despite my tickers being still opened. I did a lot of search regarding it and it seems a lot of users had similar experience with the support team. They don’t care about appeal even if you share proof and stuff of your innocence/age."
    }
  ]
}