{
  "subreddit": "Tiktokhelp",
  "post_id": "198ytlw",
  "title": "Re-verify identification on TikTok for TikTok Shop???",
  "body": "I’m trying to link my TikTok account as the official account on TikTok shop, but I won’t let me because it says I need to complete the identity verification. But I have no idea where to do that. I’ve been talking with TikTok shop support but they haven’t solved the issue.\n\nThey told me to complete the blue badge verification, but I know that’s not the same thing.\n\nI’ve linked and unlinked my account more than 3 times from TikTok shop. Is that causing a problem??\n\nDo I need to verify something through TikTok business center??\n\nWhere do I re-verify my identity? I don’t see an option anywhere in TikTok.\n\nAnyone else know how to do this?",
  "author": "testitperfumes",
  "comments": [
    {
      "author": "jtarver",
      "timestamp": "",
      "body": "PROBLEM SOLVED!Idk when this notification popped up, but I just randomly check my in-app TikTok notifications and I legit had one for the verification.I clicked on it and it had me fill out my name, address, and last 4 digits of my SSN. No ID needed. Approved immediately.Idk if this had anything to do with it, but my TikTok ads manager was suspended. I had that reinstated this morning but zero clue if that triggered anything. Worth mentioning if you’re in a similar boat."
    },
    {
      "author": "ktsurly",
      "timestamp": "",
      "body": "This worked for me too! I signed up for TikTok shop yesterday late afternoon, uploaded my driver's license, and got an email right away saying my TikTok shop was approved. Then I tried to link my shop account to my new TikTok account, but I kept getting the message about needing to complete identity verification. I messed with it for an hour before getting frustrated and giving up.I found this thread a few minutes ago and checked my TikTok notifications and I had a notification that just showed up about 10 minutes ago--which was about16 hoursafter I started this process. The notification looked exactly like it did in the screen shot above ^^When I clicked on that notification, I was taken to a page where I had to enter my full legal name, address, and last 4 of my SSN. I got a message saying identify verification was complete, so then I followed these steps:went back into TikTok shop seller central on my laptopclicked on the store icon in the top right corner --> My Account --> linked accounts. The page shows a QR code to scanopened the TikTok app on my phone with the new account openclick the Profile icon (bottom right corner)click the 3 lines (top right corner)choose \"My QR code\" optionclick the little square icon in the top right corner that looks like a box with a line through the middlescan the QR code on my laptop screenconfirm I want to link the accountAnd then I could see my new TikTok account in the linked accounts section of seller central. I hope this helps--let me know if I missed any steps or if you have questions about these."
    },
    {
      "author": "CraftValue",
      "timestamp": "",
      "body": "For anyone who got this far, have you had an issue with the verification form itself? It will not recognize anything I fill in the form. The full form is filled out, but every field has an alert as if they're all empty, so it won't let me submit."
    },
    {
      "author": "carsonphelps",
      "timestamp": "",
      "body": "I also have the same issue"
    },
    {
      "author": "transcending--",
      "timestamp": "",
      "body": "Same problem"
    },
    {
      "author": "Paxleee",
      "timestamp": "",
      "body": "Having the same issue, wrote a ticket but no response yet. Does someone solved this problem ?"
    },
    {
      "author": "Ok-Boysenberry-4792",
      "timestamp": "",
      "body": "I’m seeing everyone is having this issue"
    },
    {
      "author": "Ok-Storage4059",
      "timestamp": "",
      "body": "Struggling with this right now and nothing is working. I don't have the notification in the message center and the QR code they give you to scan if you don't have the pop-up just brings up a dead link. So frustrated! I spent so much time over the last week setting my up my TikTok shop and listings only to find I now can't even link it to my actual account. Does the account have to be set to \"business\" does anyone know? I currently don't keep mine set as that because it limits the audio you can use a ridiculous amount."
    },
    {
      "author": "LWSparrow",
      "timestamp": "",
      "body": "It's been 4 days since I was approved for the shop and still no notification in my Inbox from TikTok Shop. Any suggestions?"
    },
    {
      "author": "testitperfumes",
      "timestamp": "",
      "body": "Thank you sooooo much. I had this problem for a 4 weeks now and your are the first person who ever helped me to solve it. Thanks a lot"
    }
  ]
}