{
  "subreddit": "florida",
  "post_id": "1hsukw9",
  "title": "Porn in Florida: As age verification takes effect, some sites ignore it, some block access",
  "body": "",
  "author": "ohnoyeahokay",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Please note that only active users in the subreddit may comment in this discussion. If your comments are not showing up, please ensure you have active non-news/non-political contributions to the subreddit before contacting the moderators.See our posting guidelines for more information.Remember the following:Be Civil:You are welcome to debate, discussion, and argue ideas, but don't resort to personal attacks on other users.We do not allow any form of hate speech or any suggestion/support of harm, violence, or death.Must be related strictly to Florida:National News/Elections are not specific to Florida.Just because someone lives in Florida, doesn't mean their entire life is relevant to Floridians.If you see comments in violation of our rules, please report them.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "QuiGonColdGin",
      "timestamp": "",
      "body": "How is Ron accessing his now?"
    },
    {
      "author": "Enough-Scientist1904",
      "timestamp": "",
      "body": "VPN"
    },
    {
      "author": "CpnJackSparrow",
      "timestamp": "",
      "body": "I laugh every time I see the border signs that proudly declare “Welcome To The Free State Of Florida!”"
    },
    {
      "author": "Schuben",
      "timestamp": "",
      "body": "\"This state is proudly sponsored by ourlobbyistsfriends over at NordVPN! Have you ever wanted to access one of your favorite sites, only to find out that it's blocked in your region? Never have to deal with those sillylawsrestrictions ever again with your free trial to NordVPN.  Use our offer code through Honey to get a special extended trial!\""
    },
    {
      "author": "OwlPlenty4828",
      "timestamp": "",
      "body": "Absolute waste of time, energy and effort.   Good thing they are doing this and not addressing homeowners insurance prices skyrocketing, FEMA screwing residents, the sugar industry killing the glades, urban sprawl      Good thing we got these  asshats"
    },
    {
      "author": "doesitevermatter-",
      "timestamp": "",
      "body": "Can you imagine the kind of payouts and lawsuits that would come if porn sites started having to keep age verification documentation on their website?Do you have any idea what kind of trouble they would be in for if they had a data leak with everyone's porn preferences involved?Of course they don't want to deal with it."
    },
    {
      "author": "McRocketpants",
      "timestamp": "",
      "body": "Just use Proton VPN.. It's free and bypasses the great firewall of Florida."
    },
    {
      "author": "AltoidStrong",
      "timestamp": "",
      "body": "Florida got what it voted for!Decades of failure!(25 consecutive years of unilateral control by the republican party in Florida)"
    },
    {
      "author": "ohnoyeahokay",
      "timestamp": "",
      "body": "We're also seeing an undermining of the constituency.  These \"democrats\" flipping to Republicans before they even take a step in Tallahassee should be punishable.  Either a nonconfonidance vote or a something akin to the French revolution."
    }
  ]
}