{
  "subreddit": "amiugly",
  "post_id": "vlnb8c",
  "title": "19F hi y’all I’m just trying to figure out 1.If I’m ugly but also 2.Do I look my age??? I tried to do a 50/50 of makeup and no makeup but teenage grocery clerks call me ma’am and people assume I’m my 15 y/o sister’s mom sometimes and idk how to make myself look younger lol verification at the end :)",
  "body": "",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Eric142",
      "timestamp": "",
      "body": "I feel like the outfits on pics 3, 5 and 6 would make you look a bit older. Not saying it looks bad because you're rocking it but I just tend to see those outfits worn by people a bit older.Only because they're more fashionable (generally) and are more comfortable with their outfits. Not an aesthetic thing but a mindset.Other than that , nah you're good."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Well you look older than 19 especially in a 5th photo, but definitely not someone's mom. Be mindful about makeup and you style. Also I love your smile, it's yours supper power. :)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I’m surprised they think you’re her mom. The braces made you look younger than 19. Honestly, it’s probably just your outfits that make people think you’re older. They’re not bad outfits. They look great but just not what most people your age would wear. You definitely aren’t ugly though. Quite the opposite"
    },
    {
      "author": "Mediocre_Lie_9812",
      "timestamp": "",
      "body": "You’re most definitely not ugly and take people overestimating your age as a compliment (older people usually have their shit together) well that and when you get trained to do retail you get told to address people as ma’am and sir"
    },
    {
      "author": "TwoTeapotsForXmas",
      "timestamp": "",
      "body": "I think you look your age and you’re super cute. Your fashion comfortably goes from sleek to comfortable and you’ve got a killer smile - your verification is my favourite."
    },
    {
      "author": "ChickenXing",
      "timestamp": "",
      "body": "Not ugly.  Pretty without glasses. Cute with glasses.  Nice smile"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "you’re beautiful!^(idkifit’sjustthelightingbutyourfoundationmightbejustalillightforyou)"
    }
  ]
}