{
  "subreddit": "VRchat",
  "post_id": "1i0701o",
  "title": "World Verification is kind of ridiculous",
  "body": "I've been active in VRC since 2019 but I took a small break in the last year and only just returned. Is anyone else annoyed by the amount of \"Verification\" needed for public worlds?\n\nI've been in a few club/bar like worlds that I've had to verbally tell them my birthday to get through. I am well, well, over 18 but it's kind of strange. They've expected my exact birthday to test against my age and a few times I've been invited by friends to worlds that I couldn't get through because there was no one there to \"verify\" me. Will this go away with age verification??\n\nMaybe I've just been away from VRC for so long that this is just the norm now, but it seems like overkill.",
  "author": "Silly-Problem-2836",
  "comments": [
    {
      "author": "AdeonWriter",
      "timestamp": "",
      "body": "Even more hilarious is after you have the official 18+ badge on your profile.I heard this exchange with a very old man voice, that shouldn't have even been asked in the first place:\"Look at my profile. I'm officially age verified with VRChat.\"\"We don't trust that, they use an untrustworthy website to age verify, you have to tell us your birthday\"\"So let me get this straight, you don't trust a website that asks for my ID, but you're ok with me just saying some numbers to you without proof?\"They then banned him."
    },
    {
      "author": "ItsYaBoyBackAgain",
      "timestamp": "",
      "body": "This has happened to me at a few places too. I say the same thing too, about how silly it is to not trust the official badge over asking for age and date of birth which is very easily exploitable. Never works, insta ban every time lol. I think those people are a bit too addicted to the small feeling of power and authority they get when age verifying people."
    },
    {
      "author": "GentleGesture",
      "timestamp": "",
      "body": "Age verification becomes secondary to making sure you’re a rule follower. Will you comply and work with the current “authority” smoothly, or will you raise problems and make the job of moderating harder than they want? Also, don’t mind the 14 yo sounding girl they rush in behind you, before she could even finish answering the birthday verification question, after she stuttered out a fake birthday she wasn’t confident in. “You’re good, you can go.”"
    },
    {
      "author": "AmazingPomegranate83",
      "timestamp": "",
      "body": "They are rolling out 18+ verified badges soon for public release so asking for age and DOB should become a thing of the past with adult-only instances (not to mention it's unreliable)."
    },
    {
      "author": "Pokabrows",
      "timestamp": "",
      "body": "So far even with the verified badges I've still had to say my age and birthday because supposedly kids are getting their parents to verify accounts.The thing is I feel like it's easier to lie about your age and birthday than the verification thing.Sure some kid may have convinced a parent to verify but uh anyone can figure out a birthday and age."
    },
    {
      "author": "PlushySnake",
      "timestamp": "",
      "body": "If the dumbasses don't trust the ID verification badge, it is better to leave the world imo. Their excuse stating that it is easy for kids to get that verification is lying and it doesn't hold fruit when they trust someone to verbally say their age instead lol.People who do this are power tripping when they could easily allow the verified 18+ badge users inside."
    },
    {
      "author": "charlieblood_8",
      "timestamp": "",
      "body": "Those must be group public, not public instances. If an 18+ group is hosting, then they might ask you your age. I'm age verified but still have people ask for my age since it is not mainstream for now.Edit: And there is usually a bell to notify the staff if there is a barrier to let you in."
    },
    {
      "author": "Hellzer0",
      "timestamp": "",
      "body": "honestly i dont like it either, but its either this or every public world would just be like a daycare since most of the player base is now a 5 year old on quest...tho there are some group publics that dont directly ask you but will kick annoying kids whenever they find them, which seems a bit less awkward."
    },
    {
      "author": "Adventurous-Gold-964",
      "timestamp": "",
      "body": "I got kicked from blackcat  said am 32 was kicked"
    },
    {
      "author": "Silly-Problem-2836",
      "timestamp": "",
      "body": "I'm 33 and every time someone demands my age and date of birth I just tell them to eat my ass. I'm so fed up of it."
    }
  ]
}