{
  "subreddit": "Piracy",
  "post_id": "1gtbnud",
  "title": "Is there any websites to bypass The YouTube age restriction?",
  "body": "I know it’s not technically piracy but shut up. There’s a few comedy skits by creators like Filthy Frank and Brandon Rogers that I want to watch but their age restricted? Is there any websites I can bypass it or download the videos?",
  "author": "broodje_meloen",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Yarr! ➜u/dinoman1214, some tips about \"YouTube\":UseFirefox+uBlock Origin.Go toDashboard>Filters lists>Apply changes.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "aladuuu",
      "timestamp": "",
      "body": "cobalt.tools"
    },
    {
      "author": "Snoring4590",
      "timestamp": "",
      "body": "This userscript works BUT you need to be logged into YouTube, but you don't need to verify your age after being logged in. (At least in my case it's working like this)https://greasyfork.org/en/scripts/423851-simple-youtube-age-restriction-bypassHere is an example restricted video for testing:https://www.youtube.com/watch?v=ebrGsa73fzU"
    },
    {
      "author": "gajonub",
      "timestamp": "",
      "body": "HEY, IDK IF YOURE GONNA READ THIS BUT THANK YOU SO MUCH EVER SINCENSFWYOUTUBE.COMHAS STOPPED WORKING IVE BEEN FRANTICLY LOOKING FOR AN ALTERNATIVE AND IT WORKED BROTHER 🙏🙏🙏🙏"
    },
    {
      "author": "Kentuckyfriedmemes66",
      "timestamp": "",
      "body": "Why not just make a email that says your an adultAre you like 5 years oldBut yea you can literally find a hundred sites on google that downloads youtube videos"
    },
    {
      "author": "Svensk0",
      "timestamp": "",
      "body": "google wants you to manually verify your account with proof like a copy of your creditcard info or something its not just tick yes and you are good to go"
    },
    {
      "author": "Secret_CZECH",
      "timestamp": "",
      "body": "Just create a google account that was born in like 1999 or some shit"
    },
    {
      "author": "-________02________-",
      "timestamp": "",
      "body": "It wants verification."
    },
    {
      "author": "Impressive_Web_4220",
      "timestamp": "",
      "body": "Yea there is one just for this I don't know what it's called since it's been 2 years since I used it. I think the channel's mental outlaw mentioned it and that's how I found it.You can get around the age restriction by having an account which is over 18 what's the big deal regarding it.When YouTube made a lot of game trailers age restricted, also Japanese music videos I started an account citing I was over 18.FDM used to be able to download youtube videos not so much anymore."
    },
    {
      "author": "broodje_meloen",
      "timestamp": "",
      "body": "nsfwyoutube"
    }
  ]
}