{
  "subreddit": "AskFeminists",
  "post_id": "1ct9b30",
  "title": "Should or should not it be considered rape by deceit to lie about age",
  "body": "I’m not sure if it commonly is acknowledged as being rape by deceit, I know it isn’t in a legal sense and this post is about the moral idea of rape not the legal, I’m not asking about the legal definition. I’m talking specially about a minor lying to an adult about also being an adult knowing they wouldn’t had they known the person was underaged. Yes people ople should make sure they are talking to of age individuals before engaging in anything like that, but some later eens look old enough to where you wouldn’t think twice, if lying about being a different person entirely or stealthing is rape, where does lying about age fall?",
  "author": "fullmetalfeminist",
  "comments": [
    {
      "author": "BobBelchersBuns",
      "timestamp": "",
      "body": "No, children are not responsible for keeping adults from having sex will them. If an adult isn’t reasonable sure that a potential sex partner is of age then they have a duty not to have sex with them."
    },
    {
      "author": "Sensitive_Mode7529",
      "timestamp": "",
      "body": "using it against the children who’ve been victimized is completely wrong, for reasons you gave and other comments herethe only way i see that this could be ethical is adding it as a charge forthe predatorrather than the victim. if a 22 year old claimed to be younger so that a 17 year old would be less guarded around them, that is wrong. and if OP wants this to be law, they are the people who should be punished for it"
    },
    {
      "author": "Diligent_Mulberry47",
      "timestamp": "",
      "body": "It's not difficult to not have sex with someone. Why do some people make this seem like an impossible feat?Lying about age falls into the perfectly normal category of being a teenager, and it doesn't fall anywhere near the category of rape."
    },
    {
      "author": "GirlisNo1",
      "timestamp": "",
      "body": "The entire reasoning behind statutory rape is that someone under the age of 18cannot give consent.So, what they tell you does not matter. It is up to the adult to ensure everything is consensual AND legal.If in doubt, simply don’t have sex."
    },
    {
      "author": "ItsSUCHaLongStory",
      "timestamp": "",
      "body": "Think of it this way.I allow someone to drive my car. Theylook18. Theyact18. They assure me that they have their license and know how to safely operate a car.They proceed to negligently harm someone while driving. Maybe they hit a pedestrian, or rear-end someone. Maybe they back the car into my neighbor’s fence and destroy it.This person is actually 15. Not only can they not legally drive, but they aren’t legally insurable as a driver (so the “permissive driver” clause of my auto insurance won’t pay for any damages).Whose responsibility is the damage caused?If you say it’s mine, because it’s my car and I allowed this person to drive it, then you’re absolutely right.Part of what you’re missing in this argument as well is that statutory rape isn’t just a crime against the person/minor. It’s a crime against thepeople, usually represented by the state. The state has a vested interest in protecting minors from sexual activity with adults."
    },
    {
      "author": "MerakiMe09",
      "timestamp": "",
      "body": "The responsibility is 100% on the adult to make sure or avoid if not certain."
    },
    {
      "author": "wis91",
      "timestamp": "",
      "body": "No. If an adult wants to have sex with someone who may not be legally old enough then they should either A) establish to a high degree of certainty that the person is a legal adult or B) not have sex with that person."
    },
    {
      "author": "ArsenalSpider",
      "timestamp": "",
      "body": "An adult is responsible. They are the adult in the situation. It’s not that difficult to not have sex with minors. Children will act like children even ones who look old enough. Stop looking for validation for committing a crime."
    },
    {
      "author": "Jazmadoodle",
      "timestamp": "",
      "body": "No. With the exception of two people in their late teens, where one might be just over the age or just under--if you feel the need to ask whether they're legal, they're too young. Look elsewhere."
    },
    {
      "author": "fullmetalfeminist",
      "timestamp": "",
      "body": "How is it that men constantly pretend that \"just don't have sex with them\" is somehow an impossible or unreasonable ask?If you can't tell whether someone is of legal age, don't have sex with them.If you're not sure they're telling the truth about being of age, don't have sex with them.If they lie about their age and you think \"Well, that gives me plausible deniability, so I'm safe, let's do this!\" you haven't been raped, and trying to argue that you have is disgusting.If you're trying to have sex with young women and you decide your boner is more important than being sure they're of age, you don't get to pretend you've been the victim of some imaginary crime."
    }
  ]
}