{
  "subreddit": "BadRPerStories",
  "post_id": "1e93hvh",
  "title": "A Discussion on Age Verification",
  "body": "Hi,\n\nI wanted to start a discussion because I've seen it come up time and time again on this subreddit. Depending on your location, this can be a very consequential topic for you when engaging in NSFW role play with strangers on the Internet.\n\nExample posts:\n\nhttps://old.reddit.com/r/BadRPerStories/comments/1555by5/lets_talk_about_staying_safe_online_and_minors/\n\nhttps://old.reddit.com/r/BadRPerStories/comments/uh5sfo/whats_the_opinion_on_minors_who_lie_about_their/\n\nhttps://old.reddit.com/r/BadRPerStories/comments/154txax/extreme_anxiety_about_minors_and_lying_about_age/\n\nhttps://old.reddit.com/r/BadRPerStories/comments/vliu4s/im_tired_of_people_lying_about_their_age/\n\nhttps://old.reddit.com/r/BadRPerStories/comments/1dzb9d6/stop_lying_about_your_age/\n\nAnd on and on it goes.\n\nI wanted to start a frank discussion about age verification. What can we do about it? What's reasonable? How do we do so while respecting privacy and anonymity? Are there any method mods of subreddits might be willing to endorse?\n\nFor many people, the idea of someone asking to verify your age before engaging in sexual RP or conversation evokes the negative reaction assuming they're about to ask you to send a picture of your ID or something, which, outrageously, is something I've heard of Discord servers and Forums doing. I want to stress,under no circumstances should you ever do this.\n\nBut what option does that leave us? In my discussions, I've tried utilizing third party options for this. One idea I had was to use a platform like OnlyFans, not for discussion or exchanging content, but if both people could prove they had one capable of being followed for free, that would prove they verified their age with that platform right? The problem is that these platforms often have other requirements (in OF case, requiring images on a social media account aligning with your ID verification provided), which raises the bar too high.\n\nAs a starting point of discussion, I'll add an option I've found.This post is by no means an endorsementhowever I dug into the service a lot before considering linking it here.\n\nYoti\n\nThis is a platform made to provide companies (notable example,Instagram) a way to verify age of customers, however they also have an app (available for iOS and Android) called Yoti ID. This app can be used to verify with legal documentation your age. The app can then be used between two people that have the app to exchangeonlytheir DoB. Both can be confident that the information is independently verified, and there's no chance of further information being leaked (name, address, etc.).\n\nHowever, I'm still on the fence. What are the odds a person would actually be willing to do this process? What if this was more normalized? Right now, multiple subreddits for NSFW RP and discussion/sexting end up with vague statements of \"You'll know\" or \"Try to tell by how they write\" which, to me, is just untenable.\n\nPlease, any feedback? Any comments or thoughts? I'd love to start a discussion with as wide of a community as possible. Perhaps I'm out of line and we'd prefer to leave unsaid things unsaid, but I feel there's at least something of a path here.\n\nEDIT: Adding a blog post about peer to peer checks that might show what I'm talking about:https://www.yoti.com/blog/protect-yourself-with-peer-to-peer-checks/",
  "author": "StrawbieMilkshakes",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome to BadRPerStories! If you are new here, please take a moment to look at ourbanned words list on the wiki.We now have aGoogle docthat lists RP hubs, forums, and subreddits. If you know of a place for RP that isn't on this document, there is a link in the document to request an addition. Please be aware this is just a knowledge base, not a recommendations list, and the moderators of BadRPerStories do not condone anything that happens in the spaces listed here.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "AvailableAfternoon76",
      "timestamp": "",
      "body": "After what happened to the people on ashleymadison I'm never thrusting my personal info to a sight where I write/consume NSFW content. I don't know how to verify age.Honestly, maturity is something people haven't been able to fake well and immaturity isn't compatible with me. I've found that especially younger men use anime anatomy and that's incompatible with how I like to write so they filter themselves out.I just have to trust. Because there's no way I'd ask people to potentially compromise themselves in a way I wouldn't myself."
    },
    {
      "author": "Yandoji",
      "timestamp": "",
      "body": "Considering there are always going to be kids and teenagers who lie to get into adult spaces on the internet, the only way to win is to not play, lol."
    },
    {
      "author": "frogandmoon",
      "timestamp": "",
      "body": "I do not erp, but there is zero chance that I'd share any legal documents with some random app.  I'm old  and do not trust apps to keep my data safe.Underage me already used my older sister's id to get into bars (we look nearly identical).  I for sure would have done the same for an rp server.  All our important documents were in the same lockbox.  It'd be really easy for me.My rp partners thought I was 19 when I was 16.  We even met irl and they weren't suspicious because it was only a 3 years difference and it only takes minor tweeks in conversations to sound like a college kid.As long as you can write decently, people can't tell the difference.  I know at 40, I literally cannot tell a 16 and 19 year old apart by looking or by their writing.The ugly truth is, if you choose to erp with internet strangers, you are always taking the chance that you will erp with a minor and there's nothing you can do about it.  There is simply no system that is going to keep a determined minor from entering into adult spaces.  Any system you have in place is security theature."
    },
    {
      "author": "soup_for_soup",
      "timestamp": "",
      "body": "I have a set of rules that I use. One is a threshold on minimum age in the 20's. I trust zero people who tell me \"I'm 18\" out of all the people on the subreddits I think statistically it's not in their favor that they are actually 18.Two, I speak to people before we get into anything. Learn about their character, what they want out of the plot, ect. I use that to get an idea of their age and if I feel that they're immature or they might not be the age they say, I bounce.Also, No offense but instant no, I don't trust your age when I get \"gooning\" \"goonette\" \"edging\". From what I can tell those are Gen Alpha slang words...  While I like to write smut, The moment that your vocalization of pleasuring yourself comes into the pictures, I'm out!--edit--- Account age and number of posts made in a short period of time are also factors that I use."
    },
    {
      "author": "ThatsJustVile",
      "timestamp": "",
      "body": "Edging has been a thing in the BDSM community for a while as far as I know? Respect if you just don't like its use in general, just throwing that out there.I'm also approaching 30 and have found that, unfortunately,  love the word 'gooning' specifically for how awful it sounds LMAO"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "As I have been approaching the age of 31 and reflecting on my 20s, the idea that someone might have lied about their age just terrifies me tbh (I used to sext anonymously on Reddit, still do it here and there but MUCH less frequently). Doesn’t help my anxiety either at this point because for some reason, my brain has recently decided to hyperfixate on this one specific topic/possibility, even though I really have no evidence or a shred of proof that such a thing has happened. Having said all that, short of asking for ID (since I think people go on these platforms to stay anonymous and don’t want to share that info, it’s invasive to ask, and a minor can just grab someone else’s ID anyways), I just ask my sexting/RP partner their age right away and double check later (asking more than once maybe after the sexting session, or a day or two later in the context of a different convo). I also don’t trust people who say they just turned 18, but tbh the anxiety of this is starting to get too much for me, to the point where I’m thinking it’s not really worth it, since there is no way to actually know if the other person is lying or not."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "My personal method is the ultimate slowburn: I will RP with anybody but NSFW interactions between our characters will not occur until I've written and interacted with my partner for at least six real months. This has always been time enough for people faking their age to reveal themselves, particularly because very young roleplayers do not have the patience for that and will usually stop writing with me when it's clear I'm not turning our roleplay into ERP any time soon. Worked like a charm so far, and I've managed to write long, in depth and memorable stories with those who actually stuck around for it."
    },
    {
      "author": "ExactHedgehog8498",
      "timestamp": "",
      "body": "That's actually smart! And also gets rid of the people in it just for erp!"
    },
    {
      "author": "StrawbieMilkshakes",
      "timestamp": "",
      "body": "Mad respect for making this post.That app sounds great until someone mentioned they could use a fake ID.I guess where I am is I don't care enough about ERP to keep trying it when there's any kind of serious issue to negotiate. It's frustrating that it's not just easy but oh well."
    }
  ]
}