{
  "subreddit": "PiNetwork",
  "post_id": "ve6u6x",
  "title": "Yoti KYCd and now...",
  "body": "Hey guys I am a yoti KYCd person and today I got a pop up for KYC. Sadly they asked again for all data's, photos from my ID and from myself etc.\n\nI didn't complete that cause I won't accept this. I already made the KYC now they want me to do the whole thing again? I'm passing...\n\nAny other yoti people who got the same?",
  "author": "Lernikoooooo",
  "comments": [
    {
      "author": "Various-Law6658",
      "timestamp": "",
      "body": "Hi. I am a yoti kycd person as well and I got the KYC pop up yesterday. I just had to add my street address and this was it. Shortly after I received the message that KYC was succesfull"
    },
    {
      "author": "pixelwasp",
      "timestamp": "",
      "body": "I only had to confirm my address and ID number and got an instant pass. YOTI must have provided all the other relevant information."
    },
    {
      "author": "Groudad",
      "timestamp": "",
      "body": "There were problems with YOTI. Pi changed their verification system. You can boycott KYC, but your pi won’t be moved over to MainNet. Just do the verification again."
    },
    {
      "author": "MahereMarley",
      "timestamp": "",
      "body": "I will wait for the last possible day, and hope to see some more details get more infos and transparency I have no problem to wait to that day (:"
    },
    {
      "author": "-MercuryOne-",
      "timestamp": "",
      "body": "Exactly the same thing happened to me about an hour ago, I had to do the full KYC."
    },
    {
      "author": "unfknblvablem8",
      "timestamp": "",
      "body": "At least you got another shot a it. I’ve been waiting since June 2020 and I’m pissed off I gave YOTI all my personal data to be told it was invalid. The CT needs to focus on this as keeping us original pioneers in the dark for so long is hurting us original pioneers and Pi."
    },
    {
      "author": "ChristianRauchenwald",
      "timestamp": "",
      "body": "Submitted your data to YOTI != Passed the old KYC verification in Pi.If you passed the old KYC verification (being asked to grant Pi access to YOTI and verifying through YOTI) the new KYC inlay asks for your address and ID of your verification document. No pictures.If you, however, completed KYC in YOTI without being asked by Pi in the past to do so and to link YOTI with Pi, then Pi has none of that data and you have to compete the regular/full new KYC process."
    },
    {
      "author": "-MercuryOne-",
      "timestamp": "",
      "body": "I did my KYC with Yoti after being sent there by a popup in the Pi app. I was among the first 100,000 and was chosen on the first day it started. Today I found that KYC was available for me at kyc.pi and I had to go through the entire process: pictures of both sides of my driver’s license, a still photo and video of my face, had to enter my full name, address, and driver’s license number. Some Yoti Pioneers are reporting the same thing today, but some are also reporting that they only had to enter their addresses and ID numbers. So it seems that both ways are happening."
    },
    {
      "author": "MahereMarley",
      "timestamp": "",
      "body": "I will wait the last day people have the chance to KYC. Trust = 0 nowadays for PiThanks for your response"
    },
    {
      "author": "Lernikoooooo",
      "timestamp": "",
      "body": "Yes, even if your YOti passes, you still need to submit it again as an information supplement"
    }
  ]
}