{
  "subreddit": "Sparkdriver",
  "post_id": "1hvld9i",
  "title": "Got Deactivated for privacy violation.",
  "body": "I literally just finished a batched order (three drop-offs) when I got deactivated. I’m still in shock because the only real hiccup I had was with my second drop-off. The customer wasn’t home, so I had to wait around for them to come back and show their ID (since it was an age-restricted item). After waiting longer than they said (9–10 minutes, which turned into more), I followed Spark’s support instructions, picked the order back up, and left. Next thing I know, bam—my account is deactivated.\n\nI’m wondering if the second drop-off customer thought I was leaving the order for them (forever) and that I was doing something shady when I drove off the driveway? I had only pulled away to avoid blocking the entrance for when they arrived. But the driver support told me to return the order to the store after waiting. So I came back to retrieve it, and maybe they got upset or confused? Or was it something from the day before?\n\nI’m really annoyed because I only made 7 deliveries the day before, and I swear there was zero issue. The pictures I took were strictly for the app to confirm the delivery, which is totally normal procedure. Now I’m stuck here thinking: Did that second-drop-off customer file some complaint? Did they assume I was snooping around or something? Why do drivers always get the blame first?\n\nAnyway, now I’m deactivated, which (knowing how long appeals can take) means I’m losing income in the meantime. It’s frustrating to do everything by the book and still end up under suspicion. Anyone else have this happen or have advice on how to speed up the appeal process? Feels like we’re always in limbo waiting on these companies to reinstate us for things that often aren’t our fault.\n\nThanks for letting me rant—just needed to get this off my chest. Any tips or commiseration would be appreciated!",
  "author": "Apeter23",
  "comments": [
    {
      "author": "moitch",
      "timestamp": "",
      "body": "Customer could've lied and said anything. They'll say anything for a refund/discount. Customer was probably upset about having to pay whatever they were charged for the return."
    },
    {
      "author": "Apeter23",
      "timestamp": "",
      "body": "I waited for close to 25mins… the only time I get off my car was to drop d order n pick it up. It’s just crazy how spark just go with them without investigating anything. They literally wouldve seem in the app that I had returned the order!"
    },
    {
      "author": "Many-Afternoon6626",
      "timestamp": "",
      "body": "Customers dont get charged for returns, they get a full refund or will have their order repicked and dispatched a couple of hrs later. At most, its just an inconvenience to wait for the new order or waiting for the refund that could take up to 10 business days."
    },
    {
      "author": "Automaticlife1981",
      "timestamp": "",
      "body": "Tell spark your gonna sue the customer for false accusations and loss of wages. This should be the next step we all take against this evil company"
    },
    {
      "author": "joey_yamamoto",
      "timestamp": "",
      "body": "after reading this I'm no longer doing anymore orders that require the customer ID or alcohol or some sort of verifications etc. it seems too risky."
    },
    {
      "author": "Dynamicluxxxe",
      "timestamp": "",
      "body": "Literally"
    },
    {
      "author": "KrazyKryminal",
      "timestamp": "",
      "body": "I once took a photo of the customer holding her stuff for the photo....she was wearing a wife beater and you could CLEARLY see her nipples...and sent that in as proof lol.  Didn't get violation"
    },
    {
      "author": "Abject-Ad2072",
      "timestamp": "",
      "body": "Wtf?! This makes NO sense. I would be livid."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Nah, I’m gonna fight to get my account back. I did absolutely nothing wrong. It’s okay for them to say they want to let me go, but it’s a different thing to let me go on an absolutely made up accusation. I’m at a place in my life where the xtra income from spark makes all the difference…"
    },
    {
      "author": "Apeter23",
      "timestamp": "",
      "body": "Nah, I’m gonna fight to get my account back. I did absolutely nothing wrong. It’s okay for them to say they want to let me go, but it’s a different thing to let me go on an absolutely made up accusation. I’m at a place in my life where the xtra income from spark makes all the difference…"
    }
  ]
}