{
  "subreddit": "japanresidents",
  "post_id": "1gll89q",
  "title": "How do y'all feel about having to send a pic of your ID for verification for so many apps?",
  "body": "I feel like so many apps ask you to send a picture of a valid ID to verify your account. Some I can understand, like my banking apps, or something like PayPay, (I think I had to, can't remember), but I wanted to give some stuff away for free on Jimoty awhile ago, but still had to send in a picture of my ID. I also reinstalled Bumble after like 2 years of not using it, and I have to now send in a picture of my ID. I think recently I had to send in a picture of my ID to rent gear from a camera shop.\n\nBanking apps, and apps that's deal with money, I can understand, and while I do understand the need to age verify, I don't feel comfortable sending my private info over to a dating app for example. Even if they say \"we don't keep anything.\"\n\nThere have been some other Japanese apps that asked to send in a picture of my ID, that I just didn't bother with cuz, while I'm not paranoid, Japan doesn't exactly have the best track record with cyber security. Or maybe I am just thinking about it too much. I know all of our information is out there up for grabs, but I just hate feeling like I have to send out my personal ID to all these random apps just to use them.\n\nThoughts?",
  "author": "illuminatedtiger",
  "comments": [
    {
      "author": "alizou",
      "timestamp": "",
      "body": "Im a bit concerned by this tbh. In japan (not only) there is a serious lack of cyber security awarness.So I really try to not open that kind of account in order to limit the access and hopefully the exposures of the infos I sent :(I didnt open Paypay because of this for exemple"
    },
    {
      "author": "Indoctrinator",
      "timestamp": "",
      "body": "Same. I can’t remember, but there’s definitely been a few apps that I just didn’t use because I didn’t feel comfortable sending them a picture of the front and back of my ID.I will say, that sometimes I think I worry a bit too much about it, because, like I said, all my information is out there for sale already I’m sure. But if I can limit my exposure as much as I can, I’d like to.I also feel like there should be way easier ways to verify me. Like, in Japan, I should just be able to give a phone number, and the company can check the phone numbers registration, see who is registered, and all my information is probably there anyways."
    },
    {
      "author": "nihonhonhon",
      "timestamp": "",
      "body": "there is a serious lack of cyber security awarnessThis is my biggest issue with this. Only in Japan did I start getting an insane volume of spam calls and texts, and even a fake package sent to my address. I'd never had such massive problems with data leakage before.You get maximum inconvenience with none of the security."
    },
    {
      "author": "jamar030303",
      "timestamp": "",
      "body": "I didnt open Paypay because of this for exempleI just stuck to the limited version. Open with just a phone number and no ID and you can still load cash at ATMs and spend up to 100k a month."
    },
    {
      "author": "dontstopbelievingman",
      "timestamp": "",
      "body": "Not even just ID.I do not know why so many services require my residential address. They are NOT going to send me anything. They won't give me discounts if I live in a certain city. And yet they continue to make it part of signing up to anything.Then I get bombarded by these stupid scam calls and text messages LIKELY because of this BS."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "SupSoapSoup",
      "timestamp": "",
      "body": "They are required by law to identify the users correctly.Famously, dating apps (or マッチングアップ)is now required to keep record of the user's MyNumber card, to prevent misuse and romance fraud, aka catfishing.Of course, depending on the country, what people consider as their main concern differs, and in Japan case, fraud prevention takes first place."
    },
    {
      "author": "admiralfell",
      "timestamp": "",
      "body": "Awful. The amount of information you have to give to random services is absurd. For a society that takes privacy so seriously it is astonishing how little people care about this, but then again, the corpos and the government are both incompetent when it comes to IT and cybersecurtiy, and that might just be a reflection of the population's general knowledge."
    },
    {
      "author": "smokeshack",
      "timestamp": "",
      "body": "I ain't doing that shit. That's an easy uninstall for me."
    },
    {
      "author": "illuminatedtiger",
      "timestamp": "",
      "body": "Was involved directly with this in a previous life. Japanese companies are required to implement a law to ensure they're not doing business with \"anti-social\" forces. They have to confirm your identity and then screen your details against some BS database (whatever is cheapest to get a license for) yielding all kinds of bogus matches which someone has to reconcile. Massive drain on resources for companies and the wider economy."
    }
  ]
}