{
  "subreddit": "legaladviceofftopic",
  "post_id": "194uvqu",
  "title": "How do age verification laws (or any other law really) actually work on the internet",
  "body": "There are a number of states that now have age verification laws for online porn. Why are porn companies complying with these state specific laws. For example why does pornhub block Utah. Assuming that Pornhub doesn’t have any employees or servers in utah what jurisdiction does Utah have over Pornhub. If someone from Utah visits a porn site without age verification I guess Utah could enact some penalties on that person but how can they penalize an out of state entity. Even if Pornhub took money from people in Utah I don’t see how Utah would have any jurisdiction against the website.",
  "author": "mtgguy999",
  "comments": [
    {
      "author": "jeroen-79",
      "timestamp": "",
      "body": "Even if Pornhub took money from people in Utah I don’t see how Utah would have any jurisdiction against the website.Pornhub doing business with Utahians in Utah would be why Utah may assume jurisdiction over Pornhub.If Pornhub has no physical presence in Utah at all exercising that jurisdiction would rely on the assistance of other states or countries.If Utah issues Pornhub a fine and Pornhub is heaquartered in California then Utah could ask California to enforce the fine.Then California would have to decide if it prefers having good relations with Utah or the business Pornhub brings to the state.Pornhub may also decide that playing nice with states it is not in may benefit them in the future if things change and they want to do more business there.That may be easier if they have been trying to abide by their laws than if they have never respected any of these laws."
    },
    {
      "author": "gnfnrf",
      "timestamp": "",
      "body": "There is a broad and not entirely consistent set of case law about jurisdiction in case involving commerce over the Internet.But the prevailing test right now is the Zippo test, (from a case involving two companies named Zippo) which says that if you have a website with an ongoing and interactive relationship with customers, there is jurisdiction in the locale of those customers.  If your website simply offers information without creating a commercial or interactive relationship, there is not.So, extending that to online porn, those sites are trying to make money by selling premium accounts or making referrals to other sites that sell premium accounts.  It is certainly arguable that is an ongoing and interactive relationship under Zippo (though a purely advertising supported site is probably not, from other rulings, unless the advertising is targeted to the specific jurisdiction).An entirely free and non-commercial site that said \"here are pictures of naked ladies/men, have at it\" would probably not be in the same situation.But these things are complicated, and it is likely that the fear of an expensive court case is enough to have a chilling effect on businesses, even if they would prevail against the law in the end."
    },
    {
      "author": "mtgguy999",
      "timestamp": "",
      "body": "Very interesting I just read the Wikipedia about zippo. So does that mean that in theory if someone from Utah gets around Pornhubs block, say by using a vpn, Pornhub could have some liability?"
    }
  ]
}