{
  "subreddit": "VRchat",
  "post_id": "1jif423",
  "title": "Age gating issues",
  "body": "Is there a list available for 18+ groups that still don’t accept vrchats age verification? I’m tired of wasting my time going to these instance when the staff think “age and date of birth” is more accurate than the system.\n\nIf there’s not, the community should work on putting one together.",
  "author": "maxsunshine0",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It's safe to assume that groups not making age-gated instances are not using the age-gated verification system. Instances that are age-gated are given priority at the top of your instance list."
    },
    {
      "author": "LizaraRagnaros",
      "timestamp": "",
      "body": "a lot are not using the age gated instances yet, because not everyone has the verification yet and they'd lose attendance. I've been to a few instances yesterday that want only adults there and they let me in after pointing out the tag. some even saw the tag and said that they see I'm 18+ verified"
    },
    {
      "author": "Fair-Snow-6201",
      "timestamp": "",
      "body": "they will still ask by the sounds of it because apparently kids can slip through... which is bs imo"
    },
    {
      "author": "Chambers1041",
      "timestamp": "",
      "body": "Basically just avoid any of those bar worlds that have security checkpoints, 90% I join just power trip it and refuse to look at the badge.Optimised FBT club I've had good success with so far, I don't go often but out of the last 3 times, 2 of them accepted my age verification (1 of which did so without me telling them to look!)"
    },
    {
      "author": "Sansa_Culotte_",
      "timestamp": "",
      "body": "IME it depends not on the world but on the group that's hosting the instance."
    },
    {
      "author": "Icy_Bed5219",
      "timestamp": "",
      "body": "I genuinely do not understand why all these groups still ask for that when you're already ID verified. HELL EVEN IN AN ID VERIFIED ONLY INSTANCE"
    },
    {
      "author": "GCAmazingBR",
      "timestamp": "",
      "body": "There's still places that ask for that despite you being 18+ verified, but the quacking instance being restricted tho those who had verified prior as well!? Take my honest KEKW"
    },
    {
      "author": "Recent-Comb9066",
      "timestamp": "",
      "body": "I hate that..... I agree I honestly just leave the server when people ask me that because it's just gotten to be too much"
    },
    {
      "author": "nick_the_fox",
      "timestamp": "",
      "body": "I propose a Automatic turnstile system where If players are verified then they can just walk through the turnstile.If not then They would just go up to a booth with a manual gate and verify with the bouncer traditionally.This would hopefully be a free prefab vrchat gives or if I can find help I would create it and post it for free."
    },
    {
      "author": "maxsunshine0",
      "timestamp": "",
      "body": "I mean there's a few ones I've gone to that accepted the 18+ verification tag just gotta find em"
    }
  ]
}