{
  "subreddit": "modhelp",
  "post_id": "670owa",
  "title": "How best to verify user age?",
  "body": "I'm the sole mod ofr/gaybrosgonemild. One of the rules we have is that anyone who is underage must keep their clothes on in their submissions. So we don't just prohibit underage pornography but even things like shirtless photos.\n\nEvery now and then I get reports of underage users posting pictures which would violate this rule.\n\nHow can I go about verifying a users age? Do I ask for some kind of ID?\n\nI don't want to just remove posts on suspicion without giving an option to prove they're over 18.",
  "author": "r1243",
  "comments": [
    {
      "author": "kent_eh",
      "timestamp": "",
      "body": "Perhaps the best you can do is add to the rules \"if youappear to beunder-age in your image, we will remove it. If you really want it re-approved, provide ID to the mods (and if you aren't comfortable doing that, then the removal stands).\""
    },
    {
      "author": "Algernon_Asimov",
      "timestamp": "",
      "body": "How can I go about verifying a users age? Do I ask for some kind of ID?That would be the only way to verify a user's age, but it's not going to happen.For example, even though I'mwayover 18, there's absolutely no way I'm sharing my IDanywhereon Reddit. I'm anonymous here, and I intend to stay anonymous. I have no idea who's on the other side of thisu/popstar249account or your fellow moderators' accounts, and I'm not giving you my personal details.So, you can certainlyaskfor ID, but that doesn't mean people will give it.And all you can do then is remove all shirtless photos from people who don't provide you with an ID - which will be most submitters."
    },
    {
      "author": "broadwayguru",
      "timestamp": "",
      "body": "About the only thing you can do is make the whole sub 18+. Of course, people will lie about their age, but then at leastr/anattemptwasmade."
    },
    {
      "author": "CWinthrop",
      "timestamp": "",
      "body": "All you can do is rely on the honor system, unfortunately.We have similar issues inr/alcohol. If we have a suspicion of them being underage, we check their posting history. But that's still far from perfect."
    },
    {
      "author": "r1243",
      "timestamp": "",
      "body": "I've seen some nsfw subreddits that ask for an image of ID, with everything but the face and date of birth blocked out, with the person's reddit username written next to it. it's a hassle, but I haven't seen a better method."
    }
  ]
}