{
  "subreddit": "dfsports",
  "post_id": "zwvet5",
  "title": "Does anyone know of any loopholes for those in “illegal” states?",
  "body": "This is the final week of (weekly) fantasy fb, and with only 20% of my absurd number of leagues left, I’m already itching for something else. Sports betting is great, but I struggle with player props and daily fantasy (football or basketball) is calling…\n\nI live in Washington (state) where daily fantasy has always been illegal. I was able to get by Yahoo servers (which only had a fraction of the contests offered by DK/fan duel) a few years back using a fake VPN app, but I remember trying last year and they improved their security and were as stringent as the other two sites. Haven’t tried since..\n\nI really don’t want to drive to Oregon to play, but my gut tells me this is my only option. I would really appreciate anyone reaching out if you happen to know of any other alternatives.\n\nThank you.",
  "author": "ActivityUnable",
  "comments": [
    {
      "author": "spaldingclan",
      "timestamp": "",
      "body": "I'm in Oregon and I can only get Fan Duel to work here"
    },
    {
      "author": "sirdrippykkk",
      "timestamp": "",
      "body": "Draftkings? Prize picks?"
    },
    {
      "author": "Effnlogic17",
      "timestamp": "",
      "body": "Bovada.com works in all states I think"
    },
    {
      "author": "WillBBack",
      "timestamp": "",
      "body": "They don’t have daily fantasy, do they?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "ever wanted to cash outI did that exact oregon drive for a while and then had a big 5 figure win and then they immediately flagged my account lolAre you certain that your account was \"flagged\" because of residency or was it simply the typical verification process that goes with any win of that magnitude?From a legal standpoint your residency shouldn't matter, only that you placed your entry from a legal jurisdiction. It's little different than cashing out a futures bet you made while on vacation in Vegas - sports gambling may be quite illegal in your state, but you weren't in that state when you placed the bet.I've been doing the sort MA to NH drive to use the DK sportsbook for a number of years now (its even tacitly encouraged by my DK rep as a loophole to play) and have never had a problem - whether that be with cashing out or with tax implications. If you're physically located in a state where DFS or wagering is legal then your residency really shouldn't matter."
    },
    {
      "author": "georgethethirteenth",
      "timestamp": "",
      "body": "ever wanted to cash outI did that exact oregon drive for a while and then had a big 5 figure win and then they immediately flagged my account lolAre you certain that your account was \"flagged\" because of residency or was it simply the typical verification process that goes with any win of that magnitude?From a legal standpoint your residency shouldn't matter, only that you placed your entry from a legal jurisdiction. It's little different than cashing out a futures bet you made while on vacation in Vegas - sports gambling may be quite illegal in your state, but you weren't in that state when you placed the bet.I've been doing the sort MA to NH drive to use the DK sportsbook for a number of years now (its even tacitly encouraged by my DK rep as a loophole to play) and have never had a problem - whether that be with cashing out or with tax implications. If you're physically located in a state where DFS or wagering is legal then your residency really shouldn't matter."
    },
    {
      "author": "WillBBack",
      "timestamp": "",
      "body": "Of course I plan on cashing outCongrats! How did that turn out? I could’ve sworn they just sent it to the card you deposited from, no?I have a friend in Oregon, what if I did his address?"
    },
    {
      "author": "knowtoriusMAC",
      "timestamp": "",
      "body": "Your loopholes will work fine until you try to withdraw or win a large sum and need to go through their verification process. Then they'll lock your account and take the winnings"
    },
    {
      "author": "godsocks",
      "timestamp": "",
      "body": "I drive to Oregon all the time to play. Sucks not to be able to play DK anymore but I get by with FD. Never had any issue with any payouts. It’s no different than if you place a bet in Vegas and win. As long as you were there when you placed it, it’s legal."
    },
    {
      "author": "ActivityUnable",
      "timestamp": "",
      "body": "Get a friend in a legal state to open up the website for you on their desktop. There after teamview into there and play your dfs on sundays. I did this a few year backs when I was out of the state. You just got to find a friend to use their computer or a spare computer on the side."
    }
  ]
}