{
  "subreddit": "CharacterAI",
  "post_id": "1hd0das",
  "title": "PLEASE fix the age verification!",
  "body": "(Before I can begin I would like to point out that my grammar might not be the best, I have struggled with grammar since I was really little, so if I have any grammar mistakes please let me know)\n\nOk, so for a start, I am twenty years old and next year I will be twenty-one next year, I like going on Character.Ai sometimes (Not a whole lot but so,times) and talk to the bots, anyhow, earlier today, when I went on Character.Ai, it asked me to verify my age (AKA put in my birthday), I already knew what to do though since I have gotten that message two times already and so far I had never had and issue with it till now, anyhow, so that’s what I did, now I was born in 2004, which means that the system should’ve tell that I was an adult…\n\nNOPE! Instead a message popped up saying that my age wasn’t valid and well long story short, I had to sign into my account again. Luckily I was able to sign in, but after talking to the bots, I kinda felt like they were talking to me like I was a child or something.\n\nOr at least that’s what it felt like to me, I closed out of the app afterwards and just read a book, anyhow, if any developers see this…PLEASE FIX THIS! I don’t know why it doesn’t see someone being born in 2004 as an adult and I am honestly confused by this, maybe it was a glitch but if it wasn’t please fix this!\n\nThank you.",
  "author": "BusyBee_227",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "?"
    },
    {
      "author": "BusyBee_227",
      "timestamp": "",
      "body": "?"
    },
    {
      "author": "Powerful-Price3951",
      "timestamp": "",
      "body": "Had this issue too, haven't gotten to fixing it yetI'm 19 and in Europe and I didn't have any issues with it myself before just now... Well that's shittyFeels like they (developers) can't do their stuff right a lot of the times now..."
    },
    {
      "author": "BusyBee_227",
      "timestamp": "",
      "body": "Yeah…all I want is for the dev to listen to the community, is that too hard to ask!?"
    }
  ]
}