{
  "subreddit": "GenZ",
  "post_id": "1bex9ek",
  "title": "Are Age restrictions morally good for society?",
  "body": "",
  "author": "[deleted]",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Did you know we have a Discord server‽ You can join by clickinghere!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "black-schmoke",
      "timestamp": "",
      "body": "It’s not about the age restriction on its own, it’s the fact that they want people to upload their ID online"
    },
    {
      "author": "Low_Parsnip5604",
      "timestamp": "",
      "body": "Yea F that noiseI don’t even get 23 & me’s so the feds can’t have access to my DNA"
    },
    {
      "author": "iltwomynazi",
      "timestamp": "",
      "body": "Exactly this. It means everyone’s porn searches will be tied to their identity, and will no doubt be bought and sold by corporations, stolen, and subject to data breaches.Pornhub should not be the parent."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Age restrictions: Fine.Government wanting a paper trail of everyone who looks at adult content: Not fine."
    },
    {
      "author": "4tolrman",
      "timestamp": "",
      "body": "Fair point, but then how else is a valid age restriction supposed to be implemented? I see a ton of people in this thread agreeing that restricting age is good, but then don't offer an alternative way to do so(Not saying this in a combative way, but a genuine question)"
    },
    {
      "author": "THEMEMETIMMEME",
      "timestamp": "",
      "body": "Ain’t no way my state is making it harder to view porn than it is to buy a gun 💀"
    },
    {
      "author": "Low_Parsnip5604",
      "timestamp": "",
      "body": "Yes on some things.I don’t want a 13yr old behind the wheel of a car for example.I can see both sides of the argument on this one"
    },
    {
      "author": "goner757",
      "timestamp": "",
      "body": "I think what pornhub is protesting is not the concept of age restrictions but rather the way states are implementing them. They don't want to be the responsible party."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Some of you guys who want to ban porn don't even realize how authoritarian you are.  Not everyone who watches porn develops \"unrealistic\" expectations - whatever the fuck you mean by that."
    }
  ]
}