{
  "subreddit": "onlyfansadvice",
  "post_id": "nmji6c",
  "title": "Question on Age Verification",
  "body": "Hey y'all. I've got a quick question. And I've asked some other models that I follow on Twitter the same question, and everyone has a slightly different answer or process.\n\nSo, when you sell content outside of OnlyFans (i.e. direct through Reddit, Snapchat, etc.), do you have an age-verification process? Or do you require people to follow you on OnlyFans before selling them anything?\n\nThanks in advance\n\nxx Kat",
  "author": "INFP_Jenius",
  "comments": [
    {
      "author": "rylerkitty",
      "timestamp": "",
      "body": "Subscribers on Onlyfans don’t have to verify their age, only creators do. So if you don’t verify on other platforms, OF isn’t any “safer”."
    },
    {
      "author": "katrinamonroe",
      "timestamp": "",
      "body": "Yeah that’s the major downside and yet another pitfall of OF. I mainly use that as a means of “you’re legally agreeing to your age being 18+ by subscribing” kinda thing if they don’t want to send ID and are trying to buy elsewhere."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "So how do you verify"
    },
    {
      "author": "sweetnpetite20",
      "timestamp": "",
      "body": "If im selling outside of OF i ALWAYS ask age before payment, ive only had one eprson tell me they were under 18 and they were just spamming \"hello?\" \"You there?\" Like dude.."
    },
    {
      "author": "katrinamonroe",
      "timestamp": "",
      "body": "If they tell me straight up they’re under 18, I tell them I’m blocking them. But good to know. It’s frustrating bc “legal” in the UK and some other places is 16 or 17. So I always have to say legal by means of the states, which is 18."
    },
    {
      "author": "AdFeeling9058",
      "timestamp": "",
      "body": "Now everyone with an only fans is required to register id not just creators..this is stupid"
    },
    {
      "author": "INFP_Jenius",
      "timestamp": "",
      "body": "I want to verify my card and I’m going through age verification. And it’s always age verification failure"
    },
    {
      "author": "INFP_Jenius",
      "timestamp": "",
      "body": "It doesn’t matter if there is light or whatever"
    }
  ]
}