{
  "subreddit": "fourthwavewomen",
  "post_id": "1i20s3n",
  "title": "Supreme Court to review pornography age verification requirements - Washington Examiner",
  "body": "This is monumental. Of course, pornography ceasing to exist is my dream. Just because minors don't have access to it doesn't change things for adults. However, since porn influences impressionable teenagers, who are the adult men of the future, I would like to see this nationwide. (Not to mention that teenagers still have girlfriends who can be affected by this, and porn influences the way society sees women in general, irrespective of age.) This is, of course, IF the Supreme Court decides it's constitutional to have age verification.\n\nNote: We must remember, as radfems, the expression \"the enemy of the enemy is not my friend.\" Often, conservation politicians believe that porn is exposing children to homosexuality. Some of them do not gaf about how porn affects women. The intentions can differ from person to person. That being said, that doesn't change my mind on whether this should be implemented.",
  "author": "Silly-Magazine-2681",
  "comments": [
    {
      "author": "Overall_Future1087",
      "timestamp": "",
      "body": "I also hope some of them think twice before doing it, since they wouldn't be anonymous anymore"
    },
    {
      "author": "sapphisticated413",
      "timestamp": "",
      "body": "true, this will really cut down on viewership of more harmful content due to the shame."
    },
    {
      "author": "goddamitletmesleep",
      "timestamp": "",
      "body": "While age verification is a necessary step, it is far from a solution. The broader issue remains the same: pornography is a billion-dollar industry built on the degradation, exploitation and objectification of women. Until that reality is confronted head-on, no legal restriction will be enough to counteract its damage.The widespread normalization of pornography has fueled a culture where sexual violence, misogyny and exploitation are dressed up as \"entertainment.\" Porn isn't just harmful to children - it's harmful to everyone, particularly women. It shapes how men view sex and relationships, warping their expectations and increasing demand for violent, degrading content. It shapes how women perceive themselves, their bodies and their boundaries. Studies have shown links between porn consumption and increased male sexual aggression, yet the industry remains largely unregulated. The bigger fight isn't just about restricting access...it’s about dismantling the lie that pornography is harmless, empowering, or just another form of entertainment."
    },
    {
      "author": "sapphisticated413",
      "timestamp": "",
      "body": "removing a relatively large demographic of viewers, teenage boys, will still be a large hit to the industry. any drop in production is a good thing"
    },
    {
      "author": "Pretty-Year-7197",
      "timestamp": "",
      "body": "in Italy and there was a gang rape in Palermo in which the boys said \"I've only seen something like this in porn\". The shocking chats: \"He wanted to screw everyone, in the end we got him over his tantrum\" \"I shouted enough, enough, but they laughed."
    },
    {
      "author": "chaoticfia",
      "timestamp": "",
      "body": "Not feeling confident about the level of understanding - one of the older justices asked if Pornhub had essays on its website like Playboy used to(yes there's technical legal reasons behind the question but i'm still finding it hilarious he even asked regardless)"
    },
    {
      "author": "yellowblpssoms",
      "timestamp": "",
      "body": "Lol! It is hilarious"
    },
    {
      "author": "chaoticfia",
      "timestamp": "",
      "body": "clarifying some of the legal technicalities: the SC isn't evaluating if it's constitutional to have ANY age block, or judging 1A stuff, (at least as far as I'm aware), but rather evaluating if the Texas standard (more than 1/3 adult content) is too broad (which tbh it might - they don't define what constitutes 1/3: 1/3 of pages, 1/3 of bytes, 1/3 of user traffic? plus it will apply to sites w up to 2/3 non-adult content, so there's a decent chance it might be struck down for being too broad, and the law may be passed with a revised scope (ie. more than 1/2 of user traffic))"
    },
    {
      "author": "yellowblpssoms",
      "timestamp": "",
      "body": "With greater access to technology and AI, I think it's going to get easier to create porn...abnormal and weird porn especially. While I think the age requirement is overall a good step, we still should be educating young women and girls and instilling healthy values and self worth into them as much as we can."
    },
    {
      "author": "Silly-Magazine-2681",
      "timestamp": "",
      "body": "I would love for there to be steps against the porn industry. I'm sure the right views this as preserving the moral purity of the nation or whatever, and I view it as a necessity for women's health and livelihoods, but I'll take a win where I can get it I suppose."
    }
  ]
}