{
  "subreddit": "discordapp",
  "post_id": "1k03k0y",
  "title": "discord is asking me to verify my age to see stuff my gf sends me. It's asking for a god damn face scan or my ID. I'm not giving it my ID, and the face scan doesn't seem to work at all.",
  "body": "It just sits there giving me instructions to open my mouth and close it and centre the cam for ages, over and over. wtf discord",
  "author": "ThePrimeDragon",
  "comments": [
    {
      "author": "VishieMagic",
      "timestamp": "",
      "body": "Hahaha maybe it knows how your gf feels =LKidding aside, I just tried again a couple days later and it sorted it for me. I had to go into daylight as it needs very specific exposure instead of my ring light which is very annoying indeed.Hope it gets sorted 💪"
    },
    {
      "author": "advaith1",
      "timestamp": "",
      "body": "are you in the UK or aus? users in those countries have age verification, probably due to legal requirements"
    },
    {
      "author": "FreakedOutPlant",
      "timestamp": "",
      "body": "FOR THE LOVE OF GOD DONT USE THE FACE SCAN, I did it and it suddenly detected I’m 11, idk if I have a young face or what but I’m literally battling with their support to get my nearly 4 year old acc back 💔 (For context, I’m 16, haven’t been 11 for what feels like decades)"
    },
    {
      "author": "Im-Emma-Smith",
      "timestamp": "",
      "body": "The face scan didn't work for me either. I'm 20 and it detected me as a teen and locked me out of almost all of the servers I reguarly speak in."
    },
    {
      "author": "pm-pussy4kindwords",
      "timestamp": "",
      "body": "I genuinely don't believe it's possible or would ever be possible to tell a person's actual age from a face scan no matter how good the AI is"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "DiceRuinsBattlefield",
      "timestamp": "",
      "body": "discord are making sure they're not saving nsfw pictures of people under 18 this way. they're saving them up."
    },
    {
      "author": "SignificantRanger190",
      "timestamp": "",
      "body": "just use the ID"
    },
    {
      "author": "godspeedfx",
      "timestamp": "",
      "body": "Hmm, weird..  let's do a test.  Tell your girlfriend to try sending them to me and we'll see what happens."
    },
    {
      "author": "ThePrimeDragon",
      "timestamp": "",
      "body": "Use Telegram"
    }
  ]
}