{
  "subreddit": "GorillaTag",
  "post_id": "1geg1gv",
  "title": "This game is asking for an age verification and sending me to some website for parents to verify children. I'm 40, if I put in my birthrate under new child after entering the code it gave me it says my child is 2 years old.",
  "body": "",
  "author": "little_brown_bat",
  "comments": [
    {
      "author": "ElectronicWall",
      "timestamp": "",
      "body": "We disabled the k-ID system for now, it should not be asking you for this. This is Gorilla Tag you are running. (I only ask as there are rips/clones out there)?"
    },
    {
      "author": "av3ncreeperYt",
      "timestamp": "",
      "body": "No idea if this is an actual thing but maybe they hadnt played since it was disabled so it just gave the pop up anyway (or they just posted this really late)"
    },
    {
      "author": "little_brown_bat",
      "timestamp": "",
      "body": "Using the regular gorilla tag on the oculus 2. I checked my account on meta and confirmed it does list my brith year correctly."
    },
    {
      "author": "StellaLikesGames",
      "timestamp": "",
      "body": "Hello Electronic! When is Gorilla Tag releasing for FreeBSD? - Much love, Stella"
    },
    {
      "author": "Ok-Employee-587",
      "timestamp": "",
      "body": "Hello electronic I’ve been having issues with gorilla tag this started happening on November 1st where when I logged in it asked me for my age I put in 14 which is my real age and as I usually do I go to computer to go in a private to practise but i couldn’t because it said I was on a managed account which my parents have not managed it and it also said put in code at the k-Id website but there was no code on computer so now I’m just really concerned I can’t change my name or see people’s names I can’t buy anything and my cosmetics are gone I also can only play in pubs please help thank you"
    },
    {
      "author": "ElectronicWall",
      "timestamp": "",
      "body": "Can you make sure you are on the latest verson.?One way to ensure it is the latest version is to remove the game and reinstall and see if there is any popups."
    },
    {
      "author": "little_brown_bat",
      "timestamp": "",
      "body": "yes. I uninstalled then reinstalled. Version is 1.1.91 still asking to verify my age."
    }
  ]
}