{
  "subreddit": "yahoo",
  "post_id": "17003ae",
  "title": "Is ID Verification the Only Method of Recovery?",
  "body": "I haven't used Yahoo in a while so my phone number connected to it is out of date, I'm able to log in but get stopped by two step verification that I can not get past. So I call support and was instructed to use ID verification to recover my account. I have done this process more than once and every time they say the system can't verify. I don't understand since it is in fact me. I was told to call back within 30 days and more option should open up when it comes but that seems to not be the case. So is there ANY HUMAN element of recovery my account??",
  "author": "plutonix9",
  "comments": [
    {
      "author": "Yahoo-CustomerCare",
      "timestamp": "",
      "body": "Hi there. Our team can verify your account ownership only by the info they are being shown by the system. If the system does not read anything else on the account that is eligible for verification, then the ID verification is your only hope."
    },
    {
      "author": "CaptainXDank",
      "timestamp": "",
      "body": "It’s not like multiple levels, there is literally only one method that relies on a computer and what am I to do if I give you my ID and that’s still not enough. I can log into my account, get stopped by two step verification, give my ID, AND STILL BE DENIED?! Everytime I called I customer support didn’t say “let’s see what options are eligible for you” no it’s straight to ID. And I don’t understand how I can give my ID and it still not work"
    },
    {
      "author": "Yuurikd",
      "timestamp": "",
      "body": "ID verification is the only method ONLY IF its the same first and last. I had an email that accidentally had a different name tied to that email and I was denied getting help.They would tell you to call back every other day but it's only going to be the same process. I've called them 5 times in different days to see if there was anything else but it's just the same."
    },
    {
      "author": "CaptainXDank",
      "timestamp": "",
      "body": "So u were simply shit out of luck then?"
    },
    {
      "author": "avidreader_1410",
      "timestamp": "",
      "body": "Yahoo issues have been cropping up on a lot of forums lately, mostly from people who have had long time accounts at the time when they didn't require phone numbers. Now, it seems like they are making a grab for additional information or steering people toward an upgrade that involves a fee. I am currently locked out of my account for the second time this year for no reason - something seems shady to me."
    },
    {
      "author": "sternhowardbooeybaba",
      "timestamp": "",
      "body": "were u ever able to access it again?"
    },
    {
      "author": "CaptainXDank",
      "timestamp": "",
      "body": "Nope, going to call again today, but at this point I don’t think I’ll ever recover it. Everytime I call they ask for ID and everytime they say they aren’t able to verify. What’s sad about it is that I’m able to log in, I just can’t get passed two step verification"
    },
    {
      "author": "plutonix9",
      "timestamp": "",
      "body": "https://www.reddit.com/r/yahoo/s/Dlih26Xa3a"
    }
  ]
}