{
  "subreddit": "VRchat",
  "post_id": "1icgnpg",
  "title": "Age verification is now open to VRC+ subscribers",
  "body": "You can now also create age gated instances.",
  "author": "Breaker1ove",
  "comments": [
    {
      "author": "dandy443",
      "timestamp": "",
      "body": "It’s just early access people. They can’t just dump it at once and either cause issues on the other companies server, or it could cause financial damages. Since they are paying for the service themselves. If anything this likely means it will be out in general soon.Plus imho limiting it to groups was dumb, as most of those were not going to distance themselves from their audience for a test."
    },
    {
      "author": "RadElert_007",
      "timestamp": "",
      "body": "Hijacking the top comment because some people here are straight up spreading misinformation about age verification being \"paywalled\" or VRC+ exclusive.Please see the below from the official VRChat twitter.https://x.com/VRChat/status/1884393142293573764Its not gonna be a VRC+ exclusive feature. It never was going to be a VRC+ exclusive feature and if you watched their videos on the topic. You'd know that.They did the same thing with the Android client roll out."
    },
    {
      "author": "saikouyua",
      "timestamp": "",
      "body": "I am so appreciative of this feature. I often find myself annoyed and wanting to get away from the kids but find very few monitored lobbies and when I do find them I’m often mistaken as a child due to my voice. Can’t wait to see how the how age verification possibilities in game play out."
    },
    {
      "author": "SmallTownLoneHunter",
      "timestamp": "",
      "body": "shouldnt age verification be a basic feature in this game?"
    },
    {
      "author": "ancoigreach",
      "timestamp": "",
      "body": "It will be. I feel like a broken record at this point, but as I say pretty much every time I visit this sub, Age Verification is in testing, the plan was always to roll it out slowly, it is not fully implemented yet."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It is.Like Android access, it's early access to VRC+ first."
    },
    {
      "author": "sesor33",
      "timestamp": "",
      "body": "It costs VRChat money every verification they do. The cost of your VRC+ subscription is offsetting it"
    },
    {
      "author": "Ambitious_Singer5519",
      "timestamp": "",
      "body": "Yes"
    },
    {
      "author": "NessieNep",
      "timestamp": "",
      "body": "Afaik VRC are the only ones pay walling ID verification in this manner.Roblox doesn't do this (they also use Persona btw).Neither does Fetlife.Neither did Second Life when it supported ID verification afaik.I really hope this is temporary like a lot of people are getting the impression of and it just becomes a basic feature for everyone eventually.Edit: What I fear is that other companies that don't paywall ID verification might start doing so if they think they can get away with it."
    },
    {
      "author": "Breaker1ove",
      "timestamp": "",
      "body": "where do you find this?"
    }
  ]
}