{
  "subreddit": "Iowa",
  "post_id": "1bfg4et",
  "title": "Porn age verification",
  "body": "Iowa SHOULD obviously follow Texas lead on porn websites verifying the age of its consumers.\n\nIn fact it’s disturbing that so many people fight for the right of minors to look at this explicit content.\n\nThere is NOT 1 good argument against it. “Just parent harder” might be the worst. I don’t see the  “just parent harder” crowd complaining about age verification when it comes to alcohol, tobacco, gambling, tattoos, sex shops and adult only venues\n\nHell back in the day when they sold porn physically you had to be 18 to purchase.\n\nI’d like to hear one valid argument why in Gods name predatory porn sites that have a history themselves using minors IN porn, why they shouldn’t be forced to verify the age of the viewers.",
  "author": "GimmeJuicePlz",
  "comments": [
    {
      "author": "Voltage_Z",
      "timestamp": "",
      "body": "This law violates a 7-2 SCOTUS ruling against California from 2011 where one of the Liberal Justices was one of the dissents. With the way the current Justices tend to rule, an 8-1 ruling wouldn't be unlikely.When Scalia and Ginsburg were in agreement, that's pretty solid precedent."
    },
    {
      "author": "ubix",
      "timestamp": "",
      "body": "I’m on a diet, so no one can eat cake personified 😂"
    },
    {
      "author": "Dayseed",
      "timestamp": "",
      "body": "The good answer is that mainstream sites like PornHub comply with laws to review for uploaded CP, or revenge porn takedown requests, and take them seriously.If you mandate user identification, persons who don't want the government to be able to match their porn preferences with their identities are going to go the less reputable sites.And anyone with a VPN can avoid the requirement entirely."
    },
    {
      "author": "Indystbn11",
      "timestamp": "",
      "body": "Username 100% checks out.Shut up Meg."
    },
    {
      "author": "Baruch_S",
      "timestamp": "",
      "body": "If you’re so anti-privacy, then I’m sure you wouldn’t mind sharing your full name and address here. Or you’re a fuckwit who actually falls for that “protect the children” malarkey.Also, my computer looks like it’s in California right now, and it’s literally the easiest trick to pull off. Your law is ineffective posturing, not a solution. That alone is enough reason to dump it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "3EEBZ",
      "timestamp": "",
      "body": "OP: \"Give me one valid argument\"People:Give valid argumentsOP: \"GRRR NO THAT'S WRONG BECAUSE I SAY IT IS. WHY WON'T ANYONE GIVE ME A VALID REASON????\""
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yep.  Can’t reason with these people.  Block and move on, you’ll be so much happier."
    },
    {
      "author": "ImNotTheBossOfYou",
      "timestamp": "",
      "body": "Has it ever occurred to you that you're a dumbass"
    },
    {
      "author": "GimmeJuicePlz",
      "timestamp": "",
      "body": "Lol this is hilarious coming from the \"we won't co-parent with the government\" crowd. It's really not that hard to prevent minors from looking at adult content, at least on your own devices. Kinda sounds like conservative parents want their strict morality shoved on to everyone else.\"There is NOT 1 good argument against it\"Sure there is: privacy. Stay the fuck out of my business and parent your goddamn kids better you lazy fuck."
    }
  ]
}