{
  "subreddit": "MetaQuestVR",
  "post_id": "1fx1wpc",
  "title": "Meta Quest 3: Locked Out After Age Verification Update £500 Paperweight Due to Parent Account Setup Nightmare! How can this be legal?",
  "body": "I’m absolutely livid with Meta and the steaming pile of **** they’ve turned my son’s Meta Quest 3 into. After a recent software update and some ridiculous change to their user agreement, my 12-year-old can no longer use a SINGLE feature on the £500 device we bought him. Why? Because apparently, he’s “too young” to even access his own goddamn games, and we have been stuck in an endless, bureaucratic, cluster**** trying to verify my account as his parent.\n\nWe’ve spent HOURS attempting to connect his account to mine, jumping through Meta’s asinine hoops—being hit with baffling error messages like “this endpoint is already in use,” and constantly redirected to useless help pages. NONE of their systems work. Every single step is more convoluted than the last. It’s a never-ending cycle of absolute incompetence, with Meta’s own systems contradicting themselves. This is supposed to be cutting-edge tech? Right now, it’s nothing more than an overpriced paperweight.\n\nWhat the actual **** is Meta thinking? Why is it so hard to verify my own goddamn age and set up a parent account? For a company that sells itself as a tech giant, their processes are a joke. It’s like they’ve actively made it impossible for parents to help their kids use a product they PAID for.\n\nMeta/Facebook or whatever the hell they call themselves now, has clearly forgotten that people expect their products to WORK. I’m done giving them the benefit of the doubt. Has anyone else had to suffer through this incompetence? Did you find a way around it, or is this headset just another example of a billion-dollar company screwing over their customers?\n\nThis should capture the frustration and no-holds-barred tone you’re going for. It calls out Meta directly while inviting others to share similar experiences.\n\nAt this point, I’m seriously wondering if Meta’s gross incompetence and failure to provide a functional product, due to their labyrinth of bullshit account verification steps, could actually be grounds for legal action. We’ve paid hundreds of pounds for a device that is now completely useless because their system blocks us at every turn. I’d love to hear from anyone with experience in consumer rights or data protection law who thinks this could fall under the UK’s Consumer Rights Act or GDPR violations. If Meta can’t get its act together, this might not just be a rant, it could be the start of a formal complaint or legal claim. Thoughts?\n\nTL;DR: Meta’s latest update turned my son’s £500 Quest 3 into a useless brick because he’s under 13, and their convoluted age verification process for parent accounts is a complete failure. Hours spent, endless errors, no support, and zero solutions. Wondering if this is grounds for a legal case due to breach of consumer rights. Any advice?",
  "author": "leprajon",
  "comments": [
    {
      "author": "Desertbro",
      "timestamp": "",
      "body": "Methinks you were supposed to set up a parent account the first time around, as instructed, not let a 12-year old sign into the device - and that's the root of all your issues.  So....back to square one."
    },
    {
      "author": "Tomsot",
      "timestamp": "",
      "body": "Did you use AI to generate this rant?"
    },
    {
      "author": "SFAdminLife",
      "timestamp": "",
      "body": "You violated terms of service and you come here all enraged? What kind of example does that set for your kid? Follow the rules and you won’t have issues. You couldn’t do that though. It’s easier to break them and blame a company.Numerous people on this post have given you viable options of how to proceed, but instead you keep arguing and acting like a literal child. It’s wild."
    },
    {
      "author": "zomboscott",
      "timestamp": "",
      "body": "Lol. Just let the Internet babysit your kids."
    },
    {
      "author": "W00lph",
      "timestamp": "",
      "body": "Not a paperweight.  Factory reset it and use new correct age accounts."
    },
    {
      "author": "severanexp",
      "timestamp": "",
      "body": "Create a new account with your name and be done with it."
    },
    {
      "author": "3-DenTessier-Ashpool",
      "timestamp": "",
      "body": "it's funny that people doesn't use reddit to find new info or to learn something from others mistakes, but when shit is already done they come with posts like this. and it's definitely not the first post like this in every vr sub.stupid games, stupid prizes, you know."
    },
    {
      "author": "Amens",
      "timestamp": "",
      "body": "Just buy him a cigs as well as you don’t follow age restrictions."
    },
    {
      "author": "bob101910",
      "timestamp": "",
      "body": "Wait less than a year for him to turn 13?"
    },
    {
      "author": "leprajon",
      "timestamp": "",
      "body": "I'm in the hell verification loop now.. I created a adult account. Now I get a notification I have to verify my age. I try but I can't because I get a error message when adding the credit card. Works fine in the shop. The support tells me to send a picture of and ID.. WTF. I don't want to send an ID to meta"
    }
  ]
}