{
  "subreddit": "discordapp",
  "post_id": "1k3okd8",
  "title": "Discord begins experimenting with face scanning for age verification",
  "body": "",
  "author": "Tiny_98",
  "comments": [
    {
      "author": "ItsRainbow",
      "timestamp": "",
      "body": "I will never give a social platform my ID. I don’t care if they claim it’s not stored."
    },
    {
      "author": "Peppermint-pop",
      "timestamp": "",
      "body": "I don’t like this. I just look a lot younger than I am and I’ve done face scanning online where it says I was younger."
    },
    {
      "author": "deprevino",
      "timestamp": "",
      "body": "Maybe just use AI software that makes you look like an elderly man?If everywhere is going to force lazy AI solutions on us then you might as well use the same wave of tech to help against it."
    },
    {
      "author": "dontquestionmyaction",
      "timestamp": "",
      "body": "Once again: local laws force them to. Your anger should be directed at your government."
    },
    {
      "author": "Bobvankay",
      "timestamp": "",
      "body": "Entire world forced to babysit because parents can't be bothered to supervise their kid internet usage."
    },
    {
      "author": "Ctmeb78",
      "timestamp": "",
      "body": "Yep. Thank New Jersey for suing them and contributing to this, for one."
    },
    {
      "author": "AnotherPlanetReset",
      "timestamp": "",
      "body": "I'd like to stay private, DiscordP.S. how do i get enough karma to post here? I'm new to reddit"
    },
    {
      "author": "xx_bloodcor3_xx",
      "timestamp": "",
      "body": "when you comment and make posts, and ylu get a upvote  is how you get karma :)(you can also lose karma if you get down voted)edit: sorry for the typos lol"
    },
    {
      "author": "zomvi",
      "timestamp": "",
      "body": "Yeah, I didn't risk this because I look young. Scanned my driver's license instead. Heard of people getting banned due to the face scan being unreliable.It's a shame this had to be implemented, but I know Discord's hands were tied."
    },
    {
      "author": "Tiny_98",
      "timestamp": "",
      "body": "Yep just did it to me last night lmao did NOT help the self esteem issues 😂"
    }
  ]
}