{
  "subreddit": "technology",
  "post_id": "1iihooq",
  "title": "Senator Tries Bringing Anti-Porn Age Verification Law to New York",
  "body": "",
  "author": "Mountain_rage",
  "comments": [
    {
      "author": "Y0___0Y",
      "timestamp": "",
      "body": "These laws aren’t to protect minors. They are to keep adults from accessing porn. Who would send a scanned image of their ID to any porn website?"
    },
    {
      "author": "what_JACKBURTON_says",
      "timestamp": "",
      "body": "I personally don't believe it's that simple. It's much worse. It's setting up a system by which information can be controlled to the masses. Porn is an easy gateway, specifically because it puts them in the \"protect the children\" moral high ground.  Once the control system is in place, I would expect them to expand into other topics of division (sexual identity, CRT, evolution, etc..).  Who gets to decide what is classified as \"controlled information\"?"
    },
    {
      "author": "x86_64_",
      "timestamp": "",
      "body": "I would go just a little farther than that.  It's a way to track what adults do (legally) and to maintain a database of blackmail-ready information on citizens."
    },
    {
      "author": "rnilf",
      "timestamp": "",
      "body": "When age verification laws are enacted in states, searches for VPNs spike, people go to less-moderated non-compliant websites, and adults’ rights to privacy and speech are infringed upon.The only real results of these laws:People are using free VPNs that are 100% stealing their data.People are using sketchier, less safe websites that don't give a shit about following US law.People are getting fucked (not in a good way)."
    },
    {
      "author": "Gr1ml0ck",
      "timestamp": "",
      "body": "Oh look another page from Project 2025.Pornography, manifested today in the omnipresent propagation of transgender ideology and sexualization of children, for instance, is not a political Gordian knot inextricably binding up disparate claims about free speech, property rights, sexual liberation, and child welfare. It has no claim to First Amendment protection. Its purveyors are child predators and misogynistic exploiters of women. Their product is as addictive as any illicit drug and as psychologically destructive as any crime. Pornography should be outlawed. The people who produce and distribute it should be imprisoned. Educators and public librarians who purvey it should be classed as registered sex offenders. And telecommunications and technology firms that facilitate its spread should be shuttered."
    },
    {
      "author": "Accomplished_Act943",
      "timestamp": "",
      "body": "In New York of all places. Talk about desperate"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Infinite-Process7994",
      "timestamp": "",
      "body": "Republicans have separated themselves from democracy so much they should just change their party name to the republic of Gilead and be done with it."
    },
    {
      "author": "RevolutionaryShock15",
      "timestamp": "",
      "body": "Under his eye.Sorry America, but you need to get this shit under control before these wackos take over."
    },
    {
      "author": "Mountain_rage",
      "timestamp": "",
      "body": "And the land of thefreeengaged home of thebravemeek"
    }
  ]
}