{
  "subreddit": "VRchat",
  "post_id": "1hgv7hj",
  "title": "Hey guys I’m not sure but I think age verification is out and we need 900 more posts about it.",
  "body": "Including this one.",
  "author": "Background_Fudge_798",
  "comments": [
    {
      "author": "GlitchPhoenix98",
      "timestamp": "",
      "body": "Hey it's my turn to post about it! Check the wait-list and wait your turn!"
    },
    {
      "author": "PinkLithium",
      "timestamp": "",
      "body": "Wooot Woot"
    },
    {
      "author": "Foxyr_",
      "timestamp": "",
      "body": "We need more post! Ppl must know that I got age verified! Its not like half of playerbase will be in a few weeks lmaoThen we also need the other side of hating on it!Jokes aside, its really great that we got age verifications, yet I do wanna know what is the \"minimum requied\" data they use to generate the hash they are going to store. (they didnt specify)"
    },
    {
      "author": "Maverick23A",
      "timestamp": "",
      "body": "guys i've tried creating an account on the persona website and calling their number but they won't return my calls or emails what do i do??? /s"
    },
    {
      "author": "Pokabrows",
      "timestamp": "",
      "body": "Right now you need to be in one of the groups involved in the early roll out and click a link they give you (likely in their discord). Otherwise you'll just need to be patient, it's not out to everyone yet."
    },
    {
      "author": "Embarrassed-Touch-62",
      "timestamp": "",
      "body": "You got it, gonna do some more"
    },
    {
      "author": "Kitsune257",
      "timestamp": "",
      "body": "My main question is what is really the use of age verification? I’m not really in public worlds, and I don’t ever engage in NSFW stuff. So not exactly sure why at least in my case I would have to do age verification."
    },
    {
      "author": "CommunicationSad6246",
      "timestamp": "",
      "body": "The age verification is for group 18+ worlds not public since 18+ content is not ment to be in the public’s"
    },
    {
      "author": "Background_Fudge_798",
      "timestamp": "",
      "body": "anyone got any groups with this verification that still have slots?"
    }
  ]
}