{
  "subreddit": "programming",
  "post_id": "uo8c52",
  "title": "EU wants online age verification by 2024 possibly with digital ID",
  "body": "",
  "author": "Z1ggyba",
  "comments": [
    {
      "author": "a_false_vacuum",
      "timestamp": "",
      "body": "The EU wants websites to implement verification of age and identity by 2024, possibly using an as yet to be developed digital ID.Websites deemed to serve harmful content will have to verify their visitors identity before letting them continue. The EU says this is to protect children online, but at the same time it will strip away any remaining anonimity a user might have left. Porn websites will be required to use this new system, as will other websites deemed to serve harmful content."
    },
    {
      "author": "emax-gomax",
      "timestamp": "",
      "body": "Why do they keep lobbying for this. Every few years there's a bill that basically amounts to this. It saps peoples personal freedoms and anonymity in the interest of blocking people from content they should already be restricted from. News flash, if you're worried your kids are watching porn... don't give them free access to the Internet and actually do your job as a parent. It's the same BS with parents basically refusing to have the sex talk, ever. And then just demanding schools do all of it for them, but not until the child is at an age every parent agrees is old enough (which none of them do)."
    },
    {
      "author": "CodeJack",
      "timestamp": "",
      "body": "https://i.imgur.com/4KvN4Ot.gif"
    },
    {
      "author": "my_password_is______",
      "timestamp": "",
      "body": "Websites deemed to serve harmful contentTHAT is the problemwho the hell determines what's harmful ?"
    },
    {
      "author": "SkooDaQueen",
      "timestamp": "",
      "body": "Oh fuck no. The eu does not need to know when I'm watching porn"
    },
    {
      "author": "Voltra_Neo",
      "timestamp": "",
      "body": "I hate the EU sometimes"
    },
    {
      "author": "am9qb3JlZmVyZW5jZQ",
      "timestamp": "",
      "body": "It's as if the EU is bipolar sometimes. Privacy and consumer protection for everyone until they remember that kids exist and then it immediately turns into surveillance state."
    },
    {
      "author": "Canadian_Infidel",
      "timestamp": "",
      "body": "I refuse to get a license to read."
    },
    {
      "author": "WickedMonkeyJump",
      "timestamp": "",
      "body": "When you read the text it's just the usual EU vagueness. They will look into this in the next couple of years. It is non binding for the states, voluntary for the companies and in no way is anything decided. In short: the only thing this promises is tax payer money going to some research firm to then be ignored. Like always."
    },
    {
      "author": "Z1ggyba",
      "timestamp": "",
      "body": "As opposed to parents using any of the currently available methods to keep kids off adult sites…"
    }
  ]
}