{
  "subreddit": "PiNetwork",
  "post_id": "j4w9ev",
  "title": "How safe is Yoti?",
  "body": "Today I got KYC invitation and I really want to do it but they require ID scans from 3rd party app. That concerns me a little. Does anyone have any experience with Yoti, should I trust them with my personal info?",
  "author": "BlackRadius360",
  "comments": [
    {
      "author": "glebary",
      "timestamp": "",
      "body": "Everyone is wondering if they can trust Yoti. I wonder if we can trust Pi. Yoti is clearly a professional company designed for identity verification. A little bit of research is enough to trust them. What about Pi? They are the ones receiving documents such as your passport. What guarantee do we have to make sure that data is safe? I can’t find any information from Pi that indicates that my data is safe. What they should be doing is deleting your data after confirming your identity since they don’t need it anymore. I just want some sort of confirmation from them that the KYC process is secure."
    },
    {
      "author": "zagabria1",
      "timestamp": "",
      "body": "I've heard that Yoti is only sending confirmation to Pi network that it is a real person behind the Pi account, not all the private data and documents."
    },
    {
      "author": "ProfErick",
      "timestamp": "",
      "body": "I think it's safe.  I've had to provide the same info for buying crypto and signing up for financial  accounts.  They seem to have a good reputation."
    },
    {
      "author": "LunaProjectCrypto",
      "timestamp": "",
      "body": "In my opinion..I do not trust the Pi Network team or their project. To this date, there isn't much information still on the pi project. I would think a big project like pi would draw alot of attention but I just don't see any evidence of that (on the internet). What turned me off of this project was the implementation of ads.. which seems very sketchy imo for a crypto project."
    },
    {
      "author": "glebary",
      "timestamp": "",
      "body": "I don’t think that the Pi project has any ill intentions and is genuinely trying to make a new crypto currency. They provide a lot of information but not a lot of action. For someone who doesn’t understand much about how this project is meant to work, the only progress I see is a number counter and a promise that the number will be worth something eventually. I don’t see why the ads are at all sketchy for two reasons. Youtube isn’t “sketchy” for having ads. A LOT of people use ads to make revenue and I simply don’t see why Pi can’t do the same. The other reason is that, unlike nearly all sources of advertising out there, you can turn it off. Why would they add that option unless they are trying to build trust with their users? Why go through the effort of building trust if they don’t intend on a professional project?Personally I hope this project succeeds and if ads increase the chance of success then I’m happy with it. If this is some sort of cash grab (which is highly unlikely for many reasons) then so be it. Being a skeptic isn’t going to help in any way if that is the case. They won’t magically change their mind. Being optimistic and helping the project is the best option here.The only thing I am concerned with is their ability to pull this off. Good intentions are not near enough to make sure that we end up with a new functioning crypto currency. They talk a lot about WHAT they want to achieve and not HOW they are going to achieve it. Maybe its a secret so that no one steals their idea. Maybe the project is too ambitious. All we can do is wait patiently and keep pressing that button every 24 hours."
    },
    {
      "author": "EAYSON24",
      "timestamp": "",
      "body": "A data breach is inevitable. Who knows what they doin with our info. We do know our data is worth more than this project."
    },
    {
      "author": "wk8x",
      "timestamp": "",
      "body": "If your worried about data breaches a Microsoft or google would be a lot worse as they have way more personal info on you"
    },
    {
      "author": "koenigsburg-20",
      "timestamp": "",
      "body": "I don't trust it. There are other ways to verify me as a human, and the fact they are using 3rd party apps to have people upload photos of personal information should be a huge red flag. Might as well send that prince in Africa your bank account information 💁‍♀️...The only companies require by law that needs copies of identification, at least in the United States, is Bank Accounts and Brokerage Accounts. Anything else, you are trusting a unknown company with your identification that they really do not need.BLUF: Don't give your information out. Demand Pi Network to use other verification methods."
    },
    {
      "author": "BlackRadius360",
      "timestamp": "",
      "body": "Good to know I'm not alone.  They invited me to a free KYC slot today, but it's through a 3rd party app.  I've been turned off recently by PI because of all the spammy gaming ads.  I'm not comfortable with biometrics.  For what?  Don't use my images to test your apps.  I don't trust where this \"project\" is going.Haven't seen much that tells me I shouldn't uninstall it and move on.  All you need is my ID for KYC.  If that's not enough than it's your problem."
    }
  ]
}