{
  "subreddit": "CreatorsAdvice",
  "post_id": "1ejatna",
  "title": "How do I confirm the age of a buyer?",
  "body": "How do I ask someone to confirm their age on a site that doesn’t require age verification. Like snap for example\n\nSo far I’ve been doing no proof no sale kind of thing",
  "author": "Tension-queen",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This is what I send:I’d need you to age verify first. All you need to do is send a pic of your id with all info blocked out except birthday and expiration date. Next to it I’d need a note that says hi Alix, your username and todays date :)"
    },
    {
      "author": "Tension-queen",
      "timestamp": "",
      "body": "That’s so helpful!!! I normally have been asking for pictures of face and anyone who looks underage will be blocked. I look for tattoos, facial hair, eyes, features like wrinkles and stuff"
    },
    {
      "author": "masquenana2",
      "timestamp": "",
      "body": "You can ask them for a photo of their ID without personal information except birthday and photo (eyes covered if want to remain anonymous) and they holding the ID (with a paper of their username/date etc)Or they can verify through Yoti app"
    },
    {
      "author": "Tension-queen",
      "timestamp": "",
      "body": "Lovely thank you 🙏"
    },
    {
      "author": "Allies_Innoncence",
      "timestamp": "",
      "body": "Hi I know this is a super old post but I’ve been trying to find information on Yoti for age verification :) is this something commonly used in this industry for age verification? I haven’t seen it mentioned anywhere else."
    },
    {
      "author": "sunshinedarlinn",
      "timestamp": "",
      "body": "I don’t do it!! I only sell on adult websites"
    },
    {
      "author": "ShannonOShannon",
      "timestamp": "",
      "body": "What are the possible issues with not age verifying? And further, if they send a photo with everything you asked for, but they photoshopped it, THEN what's your liability?"
    },
    {
      "author": "Tension-queen",
      "timestamp": "",
      "body": "I have been asking for pictures of their face up until now. As it’s been a good way to determine whether they are over 18 or not. It has proven extremely helpful.No one has sent me any form of ID, and looking at their face has been a good way to start. I’ve found that so far I’ve only had 2 people under age (determined by face) And the rest have been all older than that. I have been basically doing this by seeing what facial features, tattoos, hair (colour and texture) and all kinds of other things.But now I’ve got an OF set up, I’m going to direct people there and follow other commenters advice by directing people to a site with age verification"
    }
  ]
}