{
  "subreddit": "technology",
  "post_id": "1k22w11",
  "title": "Discord begins experimenting with face scanning for age verification",
  "body": "",
  "author": "ceiffhikare",
  "comments": [
    {
      "author": "w1n5t0nM1k3y",
      "timestamp": "",
      "body": "How does that work? If someone is a minor, wouldn't there be legal problem with them collecting the images to begin with?Also,  it's really hard to judge someone's age by their face, even for a human.  I've seen 12 year olds that look 20 and 20 year olds that look 10."
    },
    {
      "author": "McMacHack",
      "timestamp": "",
      "body": "If there is anything I learned from going to Conventions it's that it's impossible to judge someone's age from their appearance.  I've seen a Woman that I was swore was only 15 turn out to be in her 30's and a Dude I thought was 40 turn out to only be 17."
    },
    {
      "author": "The_Captain1228",
      "timestamp": "",
      "body": "Edit: Turns out the below is incorrect. I'm not sure why they are doing face scans as an option...Original comment: The face scan is to make it match to ID card, which has the date on it. Same as when you get ID'd at a liquor store. They check the age, and they check that you look like the image.I don't support this, just clearing up that point."
    },
    {
      "author": "Festering-Fecal",
      "timestamp": "",
      "body": "When there's a data breach and there will be all those images and information will be everywhere.This is all just a test run for them to roll out national IDs to connect to the Internet at all.They always test the waters and sell draconic laws withthink of the children"
    },
    {
      "author": "ryanbtw",
      "timestamp": "",
      "body": "This was posted a few days ago. They’re doing this because the UK and Australian governments are making them. If you hate this and live in one of those countries, write to your MP."
    },
    {
      "author": "Blasphemous666",
      "timestamp": "",
      "body": "We lived through the death of TeamSpeak and Ventrilo. Time to live through the enshittification of Discord.I knew I was tired of it with the last UI update. Happened sometime in the last month but the PC version is fucking annoying now. It takes focus from the game I just booted to tell me about their overlay I don’t give a fuck about and also the little place in the lower left hand corner where my name is is now bigger than the discord window for some reason.I say let it die. Something else will take its place until that turns to shit."
    },
    {
      "author": "No-Adhesiveness-4251",
      "timestamp": "",
      "body": "This is due to law compliance, any future alternatives would have to do the same thing.If you hate it, tell your government to not introduce it."
    },
    {
      "author": "toolkitxx",
      "timestamp": "",
      "body": "Both nations of this test are part of a direct sigint link to the US though. This could lead to another massive data collection and makes surveillance of people a piece of cake."
    },
    {
      "author": "YamDankies",
      "timestamp": "",
      "body": "Discord begins experimenting with being uninstalled."
    },
    {
      "author": "ceiffhikare",
      "timestamp": "",
      "body": "I would rather see these American companies be banned outright in other countries than to see them comply with this dystopian scheme. People are getting fed up with sacrficing rights and added hassles in the name of protecting the children. Parent your GD kids yourselves, stop forcing this crap on the rest of us cause you spawned an ego baby."
    }
  ]
}