{
  "subreddit": "PiNetwork",
  "post_id": "gzxtxf",
  "title": "Who is \"Yoti\"?",
  "body": "Yoti is the company Pi is paying for KYC checks.\n\nCosts£1 / $1.27 per check\n\nWhat is KYC?\n\nKnow Your Customer.\n\nKYC is the digital equivalent of presenting identification to open a bank account.\n\nA company that engages in financial transactions uses KYC to prevent itself becomming complicit in money laundering.\n\nYoti is a british company who provides KYC checks and is approved by manyregulators and organisations.\n\nIt's one of only 5 companies certified by the British Government to issue Proof of age ID cards.",
  "author": "venicerocco",
  "comments": [
    {
      "author": "TheWelshOne83",
      "timestamp": "",
      "body": "What sources do you have that Pi will be using the services of Yoti?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Arceus10230",
      "timestamp": "",
      "body": "This is the reason i never did KYC. I don't trust my local company with my details, why should i give it to an international organisation"
    },
    {
      "author": "Cameronjames06",
      "timestamp": "",
      "body": "I’ve already verified my identity through Yoti. I haven’t been chosen for KYC yet though. I’m patiently waiting."
    },
    {
      "author": "BenSherman_LAPD",
      "timestamp": "",
      "body": "I dont have an option for kyc verificiation just facebook and number"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "glocket27",
      "timestamp": "",
      "body": "Wait, we have to pay £1 to do kyc??"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Biffcheesey",
      "timestamp": "",
      "body": "Does nobody else wonder why they need to know your drivers license, passport, photo, address, and other personal identifying information? I thought part of the whole appeal of crypto was the anonymity?"
    },
    {
      "author": "venicerocco",
      "timestamp": "",
      "body": "Pretty crazy that the pi devs will know the identities and locations of every single pi whale by the time this thing hits a blockchain. Although, pi devs will likely make damn sure they print themselves 100 times the number of pi than the biggest whale has on top of having his name, address, and hair color. Pretty creepy when you think about it."
    }
  ]
}