{
  "subreddit": "technology",
  "post_id": "1g3sds8",
  "title": "It’s not just a ‘teen social media ban’, it’s a national age verification scheme",
  "body": "",
  "author": "wasaguest",
  "comments": [
    {
      "author": "thereznaught",
      "timestamp": "",
      "body": "Governments everywhere want everyone uploading extremely personal data on insecure servers for some reason. It's the dumbest thing ever. IDs should be hard copies. Everything else can be stolen. Privacy is becoming a thing of the past even more so than it was before."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Because politicians know literally nothing about any of this.  The \"system of tubes\" guy had a better grasp on the subject than half his peers."
    },
    {
      "author": "ChiggaOG",
      "timestamp": "",
      "body": "Because money. The face verification system the IRS uses for log-in was created by another company. It's all contracts and stuff."
    },
    {
      "author": "Wearytraveller_",
      "timestamp": "",
      "body": "Yeah how do we stop this? I will not be giving my ID details to any social media company."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "Contact your mps.https://www.aph.gov.au/Senators_and_Members/Contacting_Senators_and_Members"
    },
    {
      "author": "Friggin_Grease",
      "timestamp": "",
      "body": "Facebook asked me for a picture of my ID once to verify my middle name and I sent them a picture of dog shit. Got my account back somehow."
    },
    {
      "author": "BevansDesign",
      "timestamp": "",
      "body": "Simple: just have a whole lot of money you can throw into a counter-movement. Oh, and don't forget to do that forever, because the people pushing for this crap never ever stop."
    },
    {
      "author": "parker_fly",
      "timestamp": "",
      "body": "\"For the children!\" has been used to usher in government control since time immemorial."
    },
    {
      "author": "Robbotlove",
      "timestamp": "",
      "body": "aside from that, it's also just another example of old dudes who know jack about technology passing laws governing technology."
    },
    {
      "author": "wasaguest",
      "timestamp": "",
      "body": "Your (anyone) information needing to be uploaded removed anonymity from the Internet. The average Reddit user might not ever see your real name, but under a fascist or communist regime, criticizing \"Dear Leader\" equals a government request for your real data so you can receive proper \"education\".\"It can't happen here, we have the 1st Amendment!\"Laws are only viable when followed, upheld with consequences & not simply ignored. & our current system is not prepared for the level of criminal that simply ignores whatever law they feel like on any given day, then infinitely delays any judgement in a court of law."
    }
  ]
}