{
  "subreddit": "VRchat",
  "post_id": "1jyor3p",
  "title": "It's been talked about into the ground, but just had my experience with it finally. The whole \"The verification could be faked.\"",
  "body": "Yes I know this is post #10000000 about this. But if theres an issue with something, it should be brought up until it is resolved. The new excuse to deny the age verification is that \"Well if you have VRC+ it's easy to fake\". I asked for elaboration, got none. Also, spoiler, I don't have VRC+, got my verification through the beta. These no life- I mean Virtual Reality Bouncers, really do just wanna hold some sense of authority and power, that's all it is. And I know I'm bout to get some people telling me that they had a seven year old who got through with also ten alt accounts all also verified. (Actual response I've seen on these type of posts.) Sure, yeah let's pretend that's possible at all.\n\nWhat I've noticed though, and this isn't really noteworthy anymore but I'm seeing it in person, the same groups who do it are barely getting traffic over time, can't imagine why though.",
  "author": "Udongien",
  "comments": [
    {
      "author": "Dr_Vodka9987",
      "timestamp": "",
      "body": "we are at a point in time where if i am asked my age i simply leave the instancei will not cater to those who want to feel in control, considering they already have said control if they're actually supposed to be thereedit- got a hate dm earlier for this so let me clarify: no i am not anti authority, please do not assume i am because i dislike being interrogated for joining a world i have spent frankly too many hours on"
    },
    {
      "author": "VrchatBurner",
      "timestamp": "",
      "body": "This is the way. It’s not just a power trip. I feel like these groups have a handful of minors they like that they don’t want to exclude. Lock down the instances and remove the door security. Things would be so much better than letting in a new user in a meme avatar because they said they were 18."
    },
    {
      "author": "TheShortViking",
      "timestamp": "",
      "body": "Vrchat or Persona cant really solve the issue that parents verify for their kids. We kinda just have to live with that it is not 100%. But I can promise you that it is a LOT better than just asking people their age. If a kid has gotten someone to verify for them then they will also lie when getting asked."
    },
    {
      "author": "VrchatBurner",
      "timestamp": "",
      "body": "I don’t think this actually happens much. I think it’s a rumor spread by kids who know they’re about to get the age gate ban hammer. The last time someone asked me my birthdate and didn’t accept my verification … I looked around and someone asked me why I was pixelated. I realized everyone was on Quest alone and most seemed young and newer users. I’m giving a hard pass on groups that refuse to accept verification as I suspect they’re harboring minors. Most parents are not dumb enough to fully attach their identity to their kids behavior in a game that requires ID verification. It would be like loaning a kid your ID to buy booze."
    },
    {
      "author": "FemBoyGod",
      "timestamp": "",
      "body": "What’s funny is I got age checked by someone who sounded underage.So I was gave a birth year like 17-1800s and was like I’m 225 years old. Just to mess with them and let them know like we find you annoying and we don’t respect your age checking.Plus I’m age verified so fuck all the way off"
    },
    {
      "author": "Sansa_Culotte_",
      "timestamp": "",
      "body": "Them not getting traffic is the system working as intended. Let's keep it working that way by not giving these clowns any traffic."
    },
    {
      "author": "CeriPie",
      "timestamp": "",
      "body": "Take the offensive and help us eliminate this problem.If you're age verified,report the \"bouncers\"!They violate Section 13.2. which lays out prohibited conduct that violates the ToS, paragraph G, clause (III)attempting to collect personal information about another User or third party without consentThey also violate Section 8.10.If you create a world or instance, you may not collect or create features that collect information that provides the real identity, address, phone number, or government identification number of any User using such world or instance.It explicitly starts with \"real identity\". VRC resides in the US, and US law says that DoB is classified as PII.For anyone that's gonna try and pull the garbage \"you consent when you give them your age\" argument, it's only consenting if you WILLINGLY give it to them. If you say \"I'm not comfortable giving out my personal information\" or \"I'm already age verified\" and they persist by threatening you with a kick/ban if you do not give up your personal information, that is textbook coercion and is no longer considered consensual from a legal standpoint. Even if the threats are minor, the fact that they are being made at all, or even just implied, changes the whole situation.You always have the option to leave, of course, but it's very possible that the same thing will happen in the next instance as well, and you didn't join the instance just to turn around and leave because some pretend bouncers want to try and coerce personal information out of you. They are disrupting others' time in VRChat, which is also arguably against TOS, and breaking TOS with their blatant attempts to coerce personal information out of people.When asked to clarify about whether or not \"bouncers\" trying to gather birth dates is against TOS, Tupper said that he would not interpret the TOS for other people, but that if we feel they are breaking TOS he encourages us to report them! He would not encourage us to do so unless he felt that they SHOULD actually be reported, otherwise he would be encouraging a huge number of false reports!Take the fight to them andreport!! Let them know that their skeevy behavior will not be tolerated!"
    },
    {
      "author": "Jetcyclonus",
      "timestamp": "",
      "body": "Dayum can’t even be mad or make an argument, this person is just correct, they aren’t allowed to operate unless doing so for a group"
    },
    {
      "author": "Udongien",
      "timestamp": "",
      "body": "It shouldn’t have to be said enough but don’t give your personal information. That includes your DoB. Vrchat terms of service also include not asking others for personal information."
    }
  ]
}