{
  "subreddit": "CharacterAI",
  "post_id": "1gd5b3x",
  "title": "For the people that want an age verification with an ID.",
  "body": "You do realise how foolish the idea is, right? Why should we risk ourofficialdocuments. For a chatbot site? Why should I. Give my ID card to. C.ai? What if I feel uncomfortable about this? What if i don't wanna tell them about my parents. The city I live in .Or anything really? But that's not even the biggest problem. I'm pretty sure you've heard by now, about the many leaks that are happening around the world as we speak. For example. Recently the way back machine almost lost all of its data. Well. What if someone hacks into the c.ai servers, and then finds your chats? You'll say you wouldn't care. But if you gave your ID to the C.AI. oh god you should! The hackers can easily see your ID. And then easily confirm that your bots. And your chats. Really are your creations. They would be signed in your own official name from now on. And then the bribery comes into place! You'll get a nice email in a Sunday morning. Demanding you to pay X$ to hide your information. And it's most likely that your account by then. Will be suspended and you won't be able to delete it. And if you wont pay. They will make sure you'll never leave your home without looking down and without avoiding everyone. Because they will share your secrets with literally everybody you know. I don't know about you. But I would be immigrating if that happens to me.",
  "author": "MysteriousLeek8024",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "parental controls exist for a reason. I'm an adult, I should not have to be punished because of shitty parents."
    },
    {
      "author": "Only_Climate2852",
      "timestamp": "",
      "body": "Why can't we just put a button that says \"I'm over the age of 18\"?"
    },
    {
      "author": "BuildingRoutine8051",
      "timestamp": "",
      "body": "And the next thing you know someone posted all the IDs on Discord or even selling it online"
    },
    {
      "author": "not_the_glue_eater",
      "timestamp": "",
      "body": "I think it's generally agreed upon that the majority of people disagree on the ID stance. Who would want their full name, address, appearance, and more leaked onto a potentially flawed AI website? So many things could obviously go wrong here, and those who think otherwise just might be naive.I would rather destroy all my traces of existence and legally go missing before I ever leak my data to an AI website. AI platform accounts should be kept anonymous or at least minimally invasive for a reason.Edit: Luckily, we know that the devs most likely won't listen in regards to both the people who want IDs checked and the ones who don't, so it seems we're good here /srs"
    },
    {
      "author": "Faulty--coding",
      "timestamp": "",
      "body": "I don't like the ID thing at all but there definitely should be some kind of age verification in place. Even something simple where you agree you're over 18. Not only will this cover the ass of c ai from lawsuits but it means they can stop baby proofing the site and making adults suffer. No matter what's in place, kids are going to try and use the site.People need to acknowledge that parents are responsible for their kids and what they do online. It's up to them to check what they're up to and to teach them to use the Internet in a safe way. It's not up to sites to parent children.Making the site 'family friendly' isn't going to work because LLM won't ever be family friendly, things will always slip through the cracks unless it's so restrictive that it becomes unusable. The responsibility of a kid's internet experience is down to the parents."
    },
    {
      "author": "SteveTheOrca",
      "timestamp": "",
      "body": "... I know why some people are recommending the idea, but I'm not taking it. Like, I don't know, it doesn't sit well with me.Why would I give my personal and confidential data to a random site just to chat with Roblox Guest?"
    },
    {
      "author": "AP_0909",
      "timestamp": "",
      "body": "Exactly. I am NOT giving official docs to anything online like this 😭🙏"
    },
    {
      "author": "alexroux",
      "timestamp": "",
      "body": "There are a few possibilities how an age verification could be implemented; for example, through linking your Google account to the site. It should have data on your birthday already and a lot of other sites ask for it, too. I had to verify my age with my ID years ago on my Google profile."
    },
    {
      "author": "CHONPSCa",
      "timestamp": "",
      "body": "honestly just do it like how steam do it. \"what's your birthday?\"january 1 1901"
    },
    {
      "author": "MysteriousLeek8024",
      "timestamp": "",
      "body": "Idiots. Every. Last. One. Of. Theme. I like cai and still use it, can't stop, but THIS. This is crossing the line even for me. No way in hrll am I giving my ID. Fuck that."
    }
  ]
}