{
  "subreddit": "gamingnews",
  "post_id": "1k1umwy",
  "title": "Eugh: Discord is scanning some users' faces and IDs to 'experiment' with age verification features",
  "body": "",
  "author": "Nino_sanjaya",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »HelloControlCADThanks for postingEugh: Discord is scanning some users' faces and IDs to 'experiment' with age verification featuresinr/gamingnews. Just a friendly reminder for every one that here atr/gamingnews), we have a very strict rule against any mean or inappropriate behavior in the comments. This includes things like being rude, abusive, racist, sexist, threatening, bullying, vulgar, and otherwise objectionable behavior or saying hurtful things to others. If you break this rule, your comment will get deleted and your account could even getBANNEDWithout Any Warning. So let's all try to keep discussion friendly and respectful and Civil. Be civil and respect other redditors opinions regardless if you agree or not.Get Warned Get BANNED.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "FrozenSoul326",
      "timestamp": "",
      "body": "sounds like a great reason to avoid discord."
    },
    {
      "author": "Practical-Aside890",
      "timestamp": "",
      "body": "It’s not even a just discord issue thing. There complying with uk and Australian child protection laws. It’s not like discord decided were just going to do this just because. You can probably expect lots of other online and gaming things to do what discord did for Uk and Australia"
    },
    {
      "author": "RobbSol",
      "timestamp": "",
      "body": "No. Just no. No face scanning and most of all no ID scanning unless extremely needed and the institution asking it is trustworthy. Don’t give in to these practices."
    },
    {
      "author": "big_chungy_bunggy",
      "timestamp": "",
      "body": "Ya ID scanning is already pushing it, I get where it’s coming from but fucking FACE scans absolutely the fuck not"
    },
    {
      "author": "StockyCoder",
      "timestamp": "",
      "body": "They are doing this because people are saying they haven't done enough to protect children from getting targeted and harassed, but from what I remember it's only being rolled out in like UK and AUS or something like that?if trolling and harassments is this bad, it can't be discord thatfixeshumansppl just need to be not shitty"
    },
    {
      "author": "ControlCAD",
      "timestamp": "",
      "body": "Some Discord users are now being asked to scan their faces or IDs to verify their age group when they attempt to view sensitive content. While some might call this a chilling advancement of the global surveillance apparatus, Discord says these new \"features\" are \"an experiment\" that only applies to users in the United Kingdom and Australia, which recently passed laws requiring more rigorous age verification on platforms that might expose children to harmful content.On its support page describing the new verification procedure, Discord says users may be asked to verify their age when they either encounter \"content flagged by our sensitive media filter\" or try to modify their sensitive content filter settings.When asked, users will be presented with two methods for age verification. First, they can allow Discord to scan their face with their device's camera. If, hypothetically, the user finds it disagreeable to let the gamer group chat app analyze their facial features, they can instead scan a QR code with their phone, which leads to a page where they can upload a scan of their government-issued identification as proof of their age group.After providing either a face or ID scan, the user will receive a notification about their age verification status via a DM from Discord's official profile. Discord says the process \"typically takes just a few minutes.\" Users will only need to verify their age once, but can retry the process or submit an appeal if they believe their age has been verified incorrectly.Recent years have seen the UK and Australia join a trend of governments adopting stricter age verification requirements for web platforms with the intent of protecting children from harmful content. In 2023, the UK's Online Safety Act entered into law, requiring websites and platforms that might host explicit content to enforce \"robust\" user age limits. Last year, Australia's parliament passed a ban preventing children under 16 from using social media. The ban is due to take effect in December 2025.While the purported intent of these measures is to protect children, digital rights groups like the Electronic Frontier Foundation say that they undermine online privacy, security, and free expression, going so far as calling the Online Safety Act \"a blueprint for oppression around the world\"—in part due to their reliance on \"unreliable tools like biometric scanners.\"Discord, at least, says it won't maintain a record of age verification scans.\"The information you share to power the age verification method that you choose is only used for the one-time age verification process and is not stored by Discord or its vendor,\" Discord says. \"For Face Scan, the solution our vendor uses operates on-device, which means there is no collection of any biometric information when you scan your face. For ID verification, the scan of your ID is deleted upon verification.\"Based on screenshots on the support page, the age verification vendors in question are k-ID and Veratad.The k-ID website says it provides technology that \"enables publishers and platforms to stay compliant with the latest global privacy and safety regulations.\" It's also got a lot of imagery with that pseudo-Pixar AI-generated stink on it, including one boy with truly inscrutable footwear.Veratad, meanwhile, says it provides \"customer identity verification solutions\" by \"bringing together the World's most disruptive IDV tech.\" To soothe the fears of anyone who might be wondering what \"disruption\" entails when it involves processing your facial geometry, Veratad provides a reassuring image of a computer spraying fluorescent dots all over a guy's face like it's calculating a targeting solution for its onboard ordnance package."
    },
    {
      "author": "Festering-Fecal",
      "timestamp": "",
      "body": "Countdown to a data breech now"
    },
    {
      "author": "AntiGrieferGames",
      "timestamp": "",
      "body": "r/assholedesign, not gonna lie."
    },
    {
      "author": "Nino_sanjaya",
      "timestamp": "",
      "body": "I mean china already done this, sooner or later the west also gonna follow. I HATE IT tbh, but kids should not be online"
    }
  ]
}