{
  "subreddit": "virtualreality",
  "post_id": "1h1zmi2",
  "title": "Introducing Age Verification | Developer Update (VRChat)",
  "body": "",
  "author": "Ylar_",
  "comments": [
    {
      "author": "chaosfire235",
      "timestamp": "",
      "body": "Long overdue, but glad to see it happen finally. Finally, I can go to a bar world without aggressive squeakers barging in all the time. (Or at least a lot less of the time)Those bouncers can finally retire lol."
    },
    {
      "author": "DriftWare_",
      "timestamp": "",
      "body": "Thank God it's about time"
    },
    {
      "author": "JapariParkRanger",
      "timestamp": "",
      "body": "The Oculus Quest and its consequences have been a disaster for VRChat."
    },
    {
      "author": "quajeraz-got-banned",
      "timestamp": "",
      "body": "A lot of games, really. The cost of entry prevented a lot of children for a long time"
    },
    {
      "author": "jj2446",
      "timestamp": "",
      "body": "No way am I uploading my ID to anything. I get the reasons, but it’s a slippery slope towards further privacy disasters."
    },
    {
      "author": "Vimux",
      "timestamp": "",
      "body": "for those not sure - they do store all that data:https://withpersona.com/legal/privacy-policy#:~:text=Persona%20securely%20stores%20all%20photos,upload%20in%20an%20encrypted%20format.And you sign a big ass waiver... As if they were expecting possible trouble."
    },
    {
      "author": "JorgTheElder",
      "timestamp": "",
      "body": "That is your choice, but there are also a lot of people that will choose to only go to worlds that are limited to verified people.The EU is working on a solution that will give everyone an account that will let companies know your age group and such, without giving them any real personal information."
    },
    {
      "author": "JDawgzim",
      "timestamp": "",
      "body": "And then kids jump on their parent's age verified account like they usually do. 😟"
    },
    {
      "author": "metaxzero",
      "timestamp": "",
      "body": "Every barrier reduces the amount of kids getting into places they shouldn't be in. Any kid can convince their parents to give them a VR headset, but its a different story when it comes to getting their ID to make their existing account for adults."
    },
    {
      "author": "Ylar_",
      "timestamp": "",
      "body": "Even small blockages can be good deterrents. See: bike locks. Any determined thief can break one, but it’ll dissuade the most average thieves."
    }
  ]
}