{
  "subreddit": "technology",
  "post_id": "1djkexq",
  "title": "Pornhub to block two more states (Indiana & Kentucky) over age verification laws",
  "body": "",
  "author": "PolyDipsoManiac",
  "comments": [
    {
      "author": "TheRedGerund",
      "timestamp": "",
      "body": "Everybody says VPN laughing. But we are witnessing the early death of the internet. And it's not a theory. The laws have passed. It's starting."
    },
    {
      "author": "Alaira314",
      "timestamp": "",
      "body": "Used to be that we heard about this happening in China, and shook our head at the authoritarian government and those poor people who let it happen. I've been shocked and saddened at how quickly it's been embraced by people in my own country(US), with just a little spin on it. Of course it's starting with kids and porn. Italwaysstarts with kids and porn. Once you carve out those exceptions, that's used as a basis to come aftereverything else, and pretty soon you're only allowed to play in a walled garden...it'll be corporate-owned rather than government-owned here in the US, but either way it's shit."
    },
    {
      "author": "Scavenger53",
      "timestamp": "",
      "body": "the early death started when everyone put their apps on aws or gcp or azure. the internet is supposed to be decentralized, and were centralizing it"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What is that? New law?edit after reading comments: that's kind of nuts. I usually don't tune into the news at all. Hard to imagine people that go outside even support this kind of stuff. I guess it's easier to be a nutjob behind closed doors."
    },
    {
      "author": "sturdy-guacamole",
      "timestamp": "",
      "body": "What is that? New law?edit after reading comments: that's kind of nuts. I usually don't tune into the news at all. Hard to imagine people that go outside even support this kind of stuff. I guess it's easier to be a nutjob behind closed doors."
    },
    {
      "author": "Tumblrrito",
      "timestamp": "",
      "body": "Party of small government."
    },
    {
      "author": "BiBoFieTo",
      "timestamp": "",
      "body": "Any government official that tries to pass porn verification laws should have to first release their personal computer files and browser history."
    },
    {
      "author": "Daimakku1",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "davster39",
      "timestamp": "",
      "body": "Do these age verification laws apply to redditt? Asking for a freind."
    },
    {
      "author": "PolyDipsoManiac",
      "timestamp": "",
      "body": "Of course not, these laws are meant to apply to pornographers and queers, not upstanding businessmen like the Reddit owners. The porn here isn’t porn at all!"
    }
  ]
}