{
  "subreddit": "Living_in_Korea",
  "post_id": "1jos5b7",
  "title": "PASS age verification without an ARC card? (US military spouse)",
  "body": "I'm a US military spouse living in Korea. I am legally able to temporarily reside here through my SOFA stamp on my passport. So I do not have an ARC card/Korean citizenship number. This is an issue because I'm a gamer and EVERYTHING seems to be locked behind age verification. To verify my age with the PASS app do I need an ARC card? My husband and I have a phone plan, we signed papers, if we have Korean phone numbers shouldn't I be registered somewhere??\n\nI'm TIRED of dealing with this. I've tried a VPN but some online games have anticheat (so no VPN) or can still tell I'm in Korea. I don't want to pay for something that only works half the time and I'm here for 2 years so I have to figure something out. Is the only solution trying to get an ARC card? Am I even allowed to get one if I'm a military spouse? I'm so frustrated and lost- and I'm baffled that it even works this way.",
  "author": "Embarrassed-Bowl-272",
  "comments": [
    {
      "author": "Spartan117_JC",
      "timestamp": "",
      "body": "Do you live off-base, thus you have a Korean address which appears on a document such as your lease?A-3 is exempted from the obligatory registration and issuance of ARC, but NOT prohibited from voluntarily getting registered. Any and every online transaction is tied to one's ID number by law, and Korean mobile numbers are used as a proxy in identity checks - through PASS or otherwise - at the infrastructure level.If you have the documents, you'll be able to apply at the Osan AB Passenger Terminal, pick up the physical ID later from the Pyeongtaek Immigration Office."
    },
    {
      "author": "Embarrassed-Bowl-272",
      "timestamp": "",
      "body": "Yes, live off base and have our lease. I guess I should just go and apply! Do you think my husband who is active military is able to apply too? Might as well at this point."
    }
  ]
}