{
  "subreddit": "XboxSupport",
  "post_id": "1h0xdno",
  "title": "MS/XBox Account S. Korean Age Verification Blcok",
  "body": "I’ve been using Xboxes my entire time in Korea (almost 20 years), but over the past two years, I’ve switched to a Windows PC.  While on the PC, it’s basically physically impossible to log in to my Xbox account, because after inputting my correct email address and password, it automatically redirects me to a prompt to verify my age through one of four local Korean telecom companies.  Specifically, it seems to want me to input basically a Korean SSN/national ID number, which is impossible, because while I have a nationally-issued foreigner ID card from the government of South Korea, I am not, and will never be confirmed in their systems as, a Korean citizen with a legally verifiable age.\n\nThis means that games that I’ve purchased through Steam and the Microsoft store (Minecraft, State of Decay 2, etc.) are effectively unplayable on my PC (although I have played both of them in the past on Xbox 360s and Xbox Ones.)\n\nAfter extensive searching on Google and Reddit, I’ve seen that other people have had the same problem as me in the past and people offer suggestions like, “Click on your profile and try to edit the…etc” but the problem with this advice is that I cannot actually even get logged in to the point where I can access my own profile UNTIL I verify my age, which is also seemingly impossible.  All of these threads and posts eventually seem to be abandoned without solutions because, a) Korean citizens aren’t having this problem because they can simply supply the required information and go about their business, and, b) all you Xbox geniuses back in the States or wherever may be computer literate and good about knowing how to operate within the English language website and legal framework, but you’re almost universally unfamiliar with and incredulous about the South Korean government internet controls and how rigid they can be.\n\nI would try calling Xbox Korea hotlines or something, but I am nowhere near fluent enough in Korean to adequately explain the issue, nor understand whatever instructions they may be able to give me if they’re even aware of the problem, in Korean.\n\nI appreciate any help/advice people can give here.  If we can solve this issue once and for all in my case, then maybe the record of it can be a real help for the small niche of others in the future who find themselves trapped between American/English Xbox account and the Korean governments “what about the children?!?” pearl clutching laws!  So thanks in advance if you can help me!",
  "author": "BigDaddyChaCha",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Welcome tor/XboxSupport, some important reminders:You can mark your post as 'solved',andaward a helpful user point by replying directly to a comment with \"!thanks\" (no quotes).A green user flair containing a number indicates the number of times a user has been awarded for a helpful reply.Do not ridicule other users for their inquiries - keep it civil. If you dislike a post, simply skip it or move on.Did you use a descriptive title? Doing so greatly impacts your chance of receiving assistance.Are you a member of the Xbox Insiders preview program? Your issue could be specific to a feature in testing. You can learn more by visitingr/xboxinsiders- that should be your first stop in troubleshooting and reporting issues with preview builds.Are you aware of an issue that is widespread and could benefit from a Megathread? Suggest an issue worth highlighting viamodmailI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What do local telecommunications companies have to do with your identity. Why has this changed overnight"
    },
    {
      "author": "BigDaddyChaCha",
      "timestamp": "",
      "body": "It hasn’t changed overnight.  I first encountered this problem probably over a year ago, and I see posts on Reddit from 3-5 years ago describing the same problem.“What do local telecommunications companies have to do with your identity?”  You, my friend, appear to be unfamiliar with our modern cyberpunk dystopia.  I mean, I don’t know, but to verify your identity and age, you usually have to confirm via an email account or something that eventually connects to you as a person, who you really are.  It seems like in Korea they do that through a cellphone that 99.9% of people have.  I’ll attach an image of the “Pass” block website that somebody else posted from 3 years ago:"
    }
  ]
}