{
  "subreddit": "YouthRights",
  "post_id": "1bi3ums",
  "title": "Well this is terrifying. It looks like Pornhub cut off access to all of Texas to avoid pressure to verify the age of users under new age-verification laws. I hope Indiana isn’t next.",
  "body": "",
  "author": "halfeatentoenail",
  "comments": [
    {
      "author": "Vijfsnippervijf",
      "timestamp": "",
      "body": "Anything done “to protect the children” that restricts them is totally useless bullquack unless it’s done to prevent physical injury or to prevent people from coercing or restricting kids in such a manner. The actual solution to whatever the reason is is pretty much exactly the opposite. Let kids do whatever they want to, as long as they don’t hurt others."
    },
    {
      "author": "halfeatentoenail",
      "timestamp": "",
      "body": "Right!! I get so worn out saying this to adultists"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Just use a VPN. They are free and easy to use"
    },
    {
      "author": "bigbysemotivefinger",
      "timestamp": "",
      "body": "Look at how the searches for VPNs spiked in Texas as soon as this bullshit hit."
    },
    {
      "author": "Sel_de_pivoine",
      "timestamp": "",
      "body": "Some will relaunch the industry of fake documents."
    },
    {
      "author": "ozushikunotisu",
      "timestamp": "",
      "body": "remember that its not jews, nazis, right wings, politicians that are behind thisthe main culprit are the Anti pedosbecause they seem to have a mutual connection  behind every restriction agenda and anything against youth rightsI know this because I've been in twitter threads and communities that do talk about killing pedophiles or even project their hatred against pedophilesthey also do talk about banning porn, they all infantilize minors and even threaten them to not speak up about something personal on the internet, most importantly they also get minors into believing lies and forcing them to not admit their being manipulated by the people who are against pedophiles for the wrong intentions"
    },
    {
      "author": "halfeatentoenail",
      "timestamp": "",
      "body": "You’re very right. They just want to collectively hate on maps because they feel uncomfy."
    },
    {
      "author": "cruisethevistas",
      "timestamp": "",
      "body": "Porn exploits women. If you care about exploitation you shouldn’t support porn.I am not a RWinger btw"
    },
    {
      "author": "halfeatentoenail",
      "timestamp": "",
      "body": "It’s not porn itself that exploits people of all genders and gender identities (yes, some may be women) but rather the problem is in the system and also in sexism."
    }
  ]
}