{
  "subreddit": "parentalcontrols",
  "post_id": "1jrupx6",
  "title": "Are social media age restrictions actually protecting children, or just protecting platforms from legal trouble?",
  "body": "Is social media the new playground, and are kids under 13 already playing without supervision?\n\nWe always hear that social media age restrictions exist to protect children from harmful content, cyberbullying, and privacy risks. But let’s be real—kids under 13 are already on these platforms, often bypassing age verification with ease.",
  "author": "Watermelonster",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It might just be an attempt for controlling the kids, or just a safety feature, since almost every social media has a few NSFW pages or people."
    },
    {
      "author": "ESTLIN-EESTI",
      "timestamp": "",
      "body": "I think your right"
    },
    {
      "author": "rifting_real",
      "timestamp": "",
      "body": "It's to sway people politically and make more money. I would say that a major portion of the results of the 2024 United States election are due to people being uneducated. Most of those voters couldn't point to Europe on a map. Without a platform for communication, without free speech, these <13 year olds will grow up to be redpilled because they were forced into echo chambers. Look at the people trying to implement these restrictions -- almost all politically right leaning. What will these companies and lawmakers get from that?More votesMore moneyMore powerCritical thinking and free speech are two important parts of social media. Israel was called out on TikTok, a platform of primarily adolescents and teens (hence why they tried to ban it entirely). Since they couldn't do that, they want to redpill these kids another wayAnyone who tells you it's to \"protect the children\" is in on it, or just plain stupid"
    },
    {
      "author": "Sufficient_Risk_8127",
      "timestamp": "",
      "body": "gotta love how tiktok was used as an example 💀"
    },
    {
      "author": "throwaway20102039",
      "timestamp": "",
      "body": "Cyberbullying is a farce. The majority of kids could not give a single shit about being called mean words over the Internet.Though it's less about protecting them, and more about protecting their brain from brainrot which would turn them into lobotomised social media addicts."
    },
    {
      "author": "Watermelonster",
      "timestamp": "",
      "body": "You are a cyber bully and the second paragraph describes you as a person.  Thanks for your input Mr throw away"
    }
  ]
}