{
  "subreddit": "roblox",
  "post_id": "1ccnwjm",
  "title": "I need ideas to convince my parents to let me verify my age",
  "body": "I am over 13 years old so I want to get voice chat, but I live in Israel so I have to verify my age to get it.\n\nMy parents think that Roblox will steal my identity, they don't let me verify something with my id anywhere, please help.",
  "author": "coolgamerboi23",
  "comments": [
    {
      "author": "JinxMoth",
      "timestamp": "",
      "body": "I suppose you can just say that there are lots of people that have done it and nothing has happened. Not sure how far that'd go though.But if you're young enough where your parents still have that power over you, you should probably just listen to em anyway lol"
    },
    {
      "author": "superdave100",
      "timestamp": "",
      "body": "Just saying… Voice Chat isn’t really that great. I turned it off because nobody uses it unless they’re being annoying on purpose."
    },
    {
      "author": "Siyar16Boi",
      "timestamp": "",
      "body": "Voice chat isnt really that great, i have it enabled but i never actually talk lol. Also, shouldn't you already have your own ID?"
    },
    {
      "author": "Siyar16Boi",
      "timestamp": "",
      "body": "Oh sorry I just realized you cant verify your ID. Well honestly I would just wait until Voice chat gets out of the Beta phase, since you can get banned quite easily with voice chat"
    },
    {
      "author": "hae129",
      "timestamp": "",
      "body": "\"Hi [parent], i would like to give my private information to a multibillion company, so i could scream at other kids like me\" /j"
    },
    {
      "author": "Ryangaminggames",
      "timestamp": "",
      "body": "Voice chat isn't that great. Its not worth it imo. I have it enabled but never talk beforeAnd some people been complaining that they have been getting suspended or even there roblox account getting banned for a couple days due to moderation being shit."
    },
    {
      "author": "Godzillahuh32ded",
      "timestamp": "",
      "body": "Escape Israel"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "If they think it will try to steal your identity come up with a way to make them realize its a large, trusted platform."
    },
    {
      "author": "coolgamerboi23",
      "timestamp": "",
      "body": "I have a similar problem. I have a pass card, but my grandpa keeps it, and I can’t really bring my devices to my grandparents, so idk how to get it, especially bc my grandma hates screens"
    }
  ]
}