{
  "subreddit": "sugarlifestyleforum",
  "post_id": "18cb4sa",
  "title": "Account on hold? Now wants ID???",
  "body": "hi, so I've been on SA for a few weeks now and I logged in to find suddenly....\n\nthey FROZE my account (put ON HOLD) and are now asking for PROOF OF ID?\n\ni prefer to remain discreet. I dont want to give them my ID etc.\n\nIs there a way around this? Has anybody had to deal with this before? what did you do?\n\nthanks!",
  "author": "[deleted]",
  "comments": [
    {
      "author": "BinghamtonSD",
      "timestamp": "",
      "body": "Is there a way around this? Has anybody had to deal with this before?This issue is popping up more and more. I haven't had it happen to me (yet). If Seeking ever asks me for my photo ID, I would stop using Seeking."
    },
    {
      "author": "HunginCA10",
      "timestamp": "",
      "body": "agreed!"
    },
    {
      "author": "RiskyRewarder",
      "timestamp": "",
      "body": "This isn't a ban, this is either they think you may possibly be fake or underage.  Do the verification or move on."
    },
    {
      "author": "HunginCA10",
      "timestamp": "",
      "body": "correct! it's NOT a \"Ban.\""
    },
    {
      "author": "Johnnysmitt",
      "timestamp": "",
      "body": "Unfortunately, if you don't want to provide your ID, you'll have to create another account with a different email address."
    },
    {
      "author": "HunginCA10",
      "timestamp": "",
      "body": "gotcha. thank you.you'd think they'd at least give a REASON for it?and / or give you a warning for whatever it was that you were \"doing wrong?\"this site is SO crazy and infuriating."
    },
    {
      "author": "GirlyPopMod",
      "timestamp": "",
      "body": "My first account was banned because I would jokingly tell men to send me $20 if they requested to view my private photos without even saying hello 🤣 When I made a new account with a different email I was placed on hold until I provided an ID.I imagine that means they are banning the entire IP address, so even if you use a separate email I’m not sure there is a workaround. Plus I’ve been hearing that they are now banning profiles that use VPNs— therefore I’d assume you can’t escape the IP address fiasco and ID requests :("
    },
    {
      "author": "HunginCA10",
      "timestamp": "",
      "body": "this is insanity! what's the point?!?!"
    },
    {
      "author": "AgreeableGuidance841",
      "timestamp": "",
      "body": "I just want to delete my picture and account but it wont let me do that until i verify with my id? What should i do? Will my picture still show if i dont verify it? Please help meee😭"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}