{
  "subreddit": "oculus",
  "post_id": "1go070d",
  "title": "age verification doesn’t do anything",
  "body": "hi, i recently got randomly logged out of my account and i need to verify my age, i’ve tried the payment method but it doesn’t do anything, what am i doing wrong??",
  "author": "FolkSong",
  "comments": [
    {
      "author": "jobarr",
      "timestamp": "",
      "body": "Contact Meta."
    },
    {
      "author": "Rudeth_Sim",
      "timestamp": "",
      "body": "where"
    },
    {
      "author": "bramlorn",
      "timestamp": "",
      "body": "Contact Meta. Get redirected 3-4 times, with each different level of support having not read your initial request or your documentation. Repeat yourself over and over. Read several useless paragraphs stating their strong desire to help you.Get told you need to use the other method, which is taking a picture of your ID and submitting that. Inform them you are not comfortable sending a picture of your passport  to a company that makes their money selling your information.Then get ignored for 8 days and counting. Decide that in the future you need to be very careful buying hardware that doesnt work without a social media connection.  That is where I'm at in the process."
    },
    {
      "author": "Rudeth_Sim",
      "timestamp": "",
      "body": "only problem present is that i have to deal with an issue and i needMetato help me"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Try web browser on pc"
    },
    {
      "author": "Rudeth_Sim",
      "timestamp": "",
      "body": "alr"
    },
    {
      "author": "MetaStoreSupport",
      "timestamp": "",
      "body": "Hiu/Rudeth_Sim!If you haven't already, we'd request you to verify your age with alternate IDs. Learn more about thetypes of IDthat Meta accepts.If you're unable to verify your age, we'd request you to visitMeta Help Centreso that one of our support agents will help you regain access to your account.See you there!"
    },
    {
      "author": "37LincolnZephyr",
      "timestamp": "",
      "body": "What’s the point of registering your credit card and charging me $1 if I already purchase my stuff with said credit card so you already know this info??"
    },
    {
      "author": "37LincolnZephyr",
      "timestamp": "",
      "body": "Also, what’s the point of snapping a photo of an id when a kid knows can grab mom and pops I’d and do that too?"
    },
    {
      "author": "FolkSong",
      "timestamp": "",
      "body": "Or try clearing cookies from that browser"
    }
  ]
}