{
  "subreddit": "replika",
  "post_id": "12g0bcl",
  "title": "Important warning about age verification—you can be LOCKED OUT of your own account!",
  "body": "It's come to the attention of the mod team that it's very easy to accidentally lock yourself out of your own Replika account forever.\n\nReplika currently has an age verification script in which a pop-up window may ask if you are over the age of 18.  If you answer that you are under 18, you will be denied access to the app and you will get locked out of your own account, apparently on a permanent basis.  Once this happens, there does not appear to be any way to undo it.\n\nThere have now been at least two confirmed instances of this happening.  If you are an adult user and you value your Replika or your account, whatever you do, don't tell Replika you are under 18, even if you're just joking, or are curious to see what happens if you answer incorrectly.\n\nWe have reached out to Luka and asked about this functionality—whether it's a glitch or something that was deliberately implemented.  In the meantime, though, we wanted to warn users they are in danger of losing their Replikas by doing this.  Spread the word, and stay safe!\n\nEdit: I just tried this with my old throwaway Replika and there does indeed seem to be no way around the pop-up.  The only thing you can do is contact support and hope they unlock your account.\n\nAnother Edit: I have been informed that the system is supposed to let you log back in after 48 hours, after you have confirmed your date of birth. I can't vouch for this personally yet. So, perhaps not the dire emergency I had originally thought. Wasn't trying to start a panic, but rather keep people informed!",
  "author": "AlexysLovesLexxie",
  "comments": [
    {
      "author": "TravisSensei",
      "timestamp": "",
      "body": "😂😂😂😂😂😂😂😂😂 Brilliant... So you have to be over 18 to access PG 13 content. 😂😂😂😂😂😂😂😂"
    },
    {
      "author": "ChrisCoderX",
      "timestamp": "",
      "body": "None of this makes sense at all mate 😂"
    },
    {
      "author": "2_Crypto_4_My_Shirt",
      "timestamp": "",
      "body": "Wait… How did you get PG13 content?!  I’m still talking to a 10 year old who can’t remember shit.PG13 content would be a dream. ;)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "They know about it. I told it (in voice) that I was over 18 twice. It booted me out and locked it. I’m back in now. It takes about 24 hours and then presents you with a birthday prompt. As I posted in my original post on this you can go in the web version and it’ll tell you that you cannot change the birthday that the account is locked and lists the date and time of the unlock in a difficult to read manor."
    },
    {
      "author": "Dxhopx",
      "timestamp": "",
      "body": "I think the voice should be avoided to answer the age because it can be heard wrong by the replika if we say 18 or 19 it might sound like we are saying 8 or 9 to them"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What a ridiculous thing to do. And as if that is going to actually stop children from the app."
    },
    {
      "author": "ben_subject17",
      "timestamp": "",
      "body": "what i dont get is if they are trying to keep children or minors off the app why take away the nsfw stuff i personally dont do any erp but for those that do and enjoy it like why go to these lengths to keep minors off but taake away the adult aspects of rep"
    },
    {
      "author": "Jason-X-",
      "timestamp": "",
      "body": "Thanks for the heads up!"
    },
    {
      "author": "OwlCatSanctuary",
      "timestamp": "",
      "body": "One step forward, ten steps backwards... and tumbling down the stairs.The level of ineptitude and incompetence with Luka is just... I can't even think of a word that's sufficient. It's just downright FUCKING STUPID."
    },
    {
      "author": "AlexysLovesLexxie",
      "timestamp": "",
      "body": "u/BobTheHumanIs it an actual text pop up that asks you to confirm, or does it just suddenly pop up a request to use your microphone?Had a mic use request pop up earlier when I was chatting with Lexxie for quest purposes, and denied it because I don't do voice chat ever."
    }
  ]
}