{
  "subreddit": "dating",
  "post_id": "1aw7f3f",
  "title": "Hinge date lied about his age. Is there a way to avoid this?",
  "body": "I (25F) went on a date with a man who claimed to be 28 years old. I feel so embarrassed and stupid because he ended up being 38. He didn’t tell me until 3 days after the date. I bought this man drinks, I spent 5 hours of my time with him, I kissed this man goodnight without knowing his age and I just feel so lied to and violated.\n\nThere are men and women out there who just don’t age, swear. [Andrew Garfield is 40] He knew all the things I would assume a person around my age would know, he dressed young, and his genetics must be laced with the water from the fountain of youth because he looked way younger than 38. I’m not going to sympathize with him because he knew exactly what he was doing, he played the “Changed it a while back and Hinge won’t let me change it” card. I’m shocked but I’m more angry than anything.\n\nAge is apart of consent.AGEis a part ofCONSENT!  I’m all for legal age gaps as long as you consent to them, I just personally feel like 13 years is way too big of a difference for me. I’d rather date someone my own age. I just got back into the dating game, every date has been very casual. I really don’t know why I assumed that ages were verified by ID’s (I don’t remember the process of making the account), I feel like that would be a good idea if dating apps implemented it though.\n\nIs this super common? Are you guys background checking every single date? Just casually asking for them to send you a picture of their “Baby’s First Ornament” to check the year it was made? What are some red flags that point someone is lying about their age? What are some red flags in general?\n\nEdit- Wow. The amount of people defending this guy is crazy. What is so wrong with dating someone my age? Why would I want to put effort into a relationship that started off with a lie? It was the FIRST date, why would I settle for this man?\n\nDefinition ofVIOLATED- to go against (as a prohibition or principle); fail to observe or respect\n\nI never once said I was sexually assaulted. Some of you need to spend some time with a dictionary..",
  "author": "Strict-Koala-5863",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome tor/dating. Please make sure you read ourrules hereand remember to:Be polite and respect each other. Do not call people names or engage in slapfights.All advice given must be good, ethical advice.Do not post hateful or harmful rhetoric - you will be bannedFollow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.If you have any questions, pleasesend the mods a message.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Brilliant-Eye-3534",
      "timestamp": "",
      "body": "Report the profile on Hinge"
    },
    {
      "author": "PJKPJT7915",
      "timestamp": "",
      "body": "Yes, please report."
    },
    {
      "author": "Airin_head",
      "timestamp": "",
      "body": "Coming from a 41 year old woman. You do not need to ever talk or call him again. You don’t even need to excuse yourself.Don’t feel bad because you were mislead, stand up for yourself! if you do continue dating him,  do not let it be a precursor for more lies."
    },
    {
      "author": "AzCarMom72",
      "timestamp": "",
      "body": "Report the account....he does that on purpose to get younger women. He probably lies on other stuff too."
    },
    {
      "author": "xMyxReflectionx",
      "timestamp": "",
      "body": "Age gaps ( between adults) don't bother me but lying does. To start off any relationship with a lie is a huge red flag and you don't need to justify riding yourself of him. He should learn to be honest and let this be a lesson he needs to learn. Perhaps you may have had made an exception if he had simply been honest, well now he knows the consequences of his dishonesty. You do what you need to do to feel comfortable navigating the dating world and don't apologize for sticking to your standards."
    },
    {
      "author": "Admirable_Gain_9103",
      "timestamp": "",
      "body": "I stopped reading after Andrew Garfield is 40..ain’t no way"
    },
    {
      "author": "Alexis2337",
      "timestamp": "",
      "body": "Sorry you experienced something like that! I dont know how really common that that happens usually, but I haven't heard much of situations like that really occur as often. (I prefer to meet in real life), but online apps can sometimes make people test the limits sometimes if they're being truthful or not. Because I would assume whoever is starting to look for a relationship would be comfortable in their own skin and be true to themselves etc. He looked young for his age, which you mentioned and he just took advantage of that and lied.It's messed up on his part because if he's really insecure about that then I wonder what more lies he'll do down the line you know? It also is messed up cause it can then cause trust issues for anyone down the road and it looks like it's gotten to you unfortunately, which is totally valid. I wouldnt beat yourself up for it and what you went through, it's not your fault at all and it doesnt make you any less for not knowing, anyone possibly could have been fooled also.In the future with whoever your seeing, if you still feel a bit worried of a persons age or having doubts, it wouldnt be weird at all to mention this story you explained to the person and make sure they are being honest with the age they tell you etc. Surely they'll understand provided the context you mention. Hope this helped and dont beat yourself up for it!"
    },
    {
      "author": "luckycatsweaters",
      "timestamp": "",
      "body": "I don’t have any advice but the same thing happened to me about 10 years ago, he told me about 4 dates in that he was actually a decade older than he led me to believe, and he actually had a kid after listing no children on his profile. I felt so violated as well."
    },
    {
      "author": "Strict-Koala-5863",
      "timestamp": "",
      "body": "Hope you really called him out on that behavior"
    }
  ]
}