{
  "subreddit": "supremecourt",
  "post_id": "166umkz",
  "title": "Court Rules in Pornhub’s Favor in Finding Texas Age-Verification Law Violates First Amendment",
  "body": "",
  "author": "taterbizkit",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome tor/SupremeCourt. This subreddit is for serious, high-quality discussion about the Supreme Court.We encourage everyone toread our community guidelinesbefore participating, as we actively enforce these standards to promote civil and substantive discussion. Rule breaking comments will be removed.Meta discussion regardingr/SupremeCourtmust be directed to ourdedicated meta thread.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "TrueBombs",
      "timestamp": "",
      "body": "So did this not matter?"
    },
    {
      "author": "Longjumping_Gain_807",
      "timestamp": "",
      "body": "They’re gonna appeal to the circuit on this matter I assume since the lawmakers defied the court"
    },
    {
      "author": "thethirdmancane",
      "timestamp": "",
      "body": "As long as the porn industry shovels money to politicians they'll be fine"
    },
    {
      "author": "GeorgeCostanza1958",
      "timestamp": "",
      "body": "Do we get the 80% videos back?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This comment has been removed as it violatescommunity guidelinesregarding low quality content. Comments are expected to engage with the substance of the post and/or substantively contribute to the conversation.If you believe that this submission was wrongfully removed, please or respond to this message with !appeal with an explanation (required), and the mod team will review this action.Alternatively, you canprovide feedback about the moderatorsorsuggest changes to the sidebar rules.For the sake of transparency, the content of the removed submission can be read below:Just remember kids, porn gave us VHS or Betamax, Blu-ray instead of HD, and seriously funded VR.For porn itself? Canada went through something similar battling child porn. All posters had to be verified or were supposed to be. Just surfing porn? Do you. Want an ugly clown, crooked dick sex orgy with midgets in your home while watching Nailing Palin? Go for it.Moderator:u/SeaSerious"
    },
    {
      "author": "scotus-bot",
      "timestamp": "",
      "body": "This comment has been removed as it violatescommunity guidelinesregarding low quality content. Comments are expected to engage with the substance of the post and/or substantively contribute to the conversation.If you believe that this submission was wrongfully removed, please or respond to this message with !appeal with an explanation (required), and the mod team will review this action.Alternatively, you canprovide feedback about the moderatorsorsuggest changes to the sidebar rules.For the sake of transparency, the content of the removed submission can be read below:Just remember kids, porn gave us VHS or Betamax, Blu-ray instead of HD, and seriously funded VR.For porn itself? Canada went through something similar battling child porn. All posters had to be verified or were supposed to be. Just surfing porn? Do you. Want an ugly clown, crooked dick sex orgy with midgets in your home while watching Nailing Palin? Go for it.Moderator:u/SeaSerious"
    },
    {
      "author": "taterbizkit",
      "timestamp": "",
      "body": "Hey now, be careful with that kind of comment.There's at least achancethat Rule 34 is prescriptive, not descriptive.  And if it is, you justcaused\"Ugly Clown Crooked Dick Sex Orgy With Midgets\" to exist somewhere on the internet.I'm convinced that this is how \"Girls Licking Doorknobs\" became a thing.  Someone got a little careless with their analogies and BAMmy new obsessiona new category exists."
    }
  ]
}