{
  "subreddit": "DataAnnotationTech",
  "post_id": "1e93l4l",
  "title": "When did DA start doing ID verification?",
  "body": "Got accepted three days ago. I actually had to do a government ID verification through Persona (just like Outlier AI does). Luckily it was an easy and quick process, but just a heads up, since searching this subreddit shows this wasn't the case before. I am located in Canada btw",
  "author": "Ariellograms",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I'm in Australia and also had to do identity verification last week. I've been working at DA since May this year. I think someone in one of the DA subreddits mentioned recently that they had to do identity verification a while back and they got downvoted."
    },
    {
      "author": "vbs221",
      "timestamp": "",
      "body": "Yes I remember seeing that. Them being downvoted was kind of the reason I decided to post this."
    },
    {
      "author": "maxthrux",
      "timestamp": "",
      "body": "I had to do it shortly after I was accepted over a year ago."
    },
    {
      "author": "PumpkinBrain",
      "timestamp": "",
      "body": "Hasn’t happened to me yet. I’m frankly shocked at how little they’ve asked for. I’ve had video games that demanded more personal info than DA before they let me start playing."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I got accepted over a year ago and had to verify my identity and do a background check less than a week after I was accepted."
    },
    {
      "author": "upvotesplx",
      "timestamp": "",
      "body": "Same here in the US. A bit shocked that it isn’t everyone. I didn’t mind at all, it’s a work opportunity, but it did happen."
    },
    {
      "author": "_cosmicsurgery_",
      "timestamp": "",
      "body": "I believe it was added very recently. It might coincide with the planned downtime."
    },
    {
      "author": "FedoraPG",
      "timestamp": "",
      "body": "What planned downtime?"
    },
    {
      "author": "Maleficent_Wasabi_18",
      "timestamp": "",
      "body": "It's probably because a lot of \"scams\" try and get people to create accounts for them?"
    },
    {
      "author": "Ariellograms",
      "timestamp": "",
      "body": "I’ve been on the platform since May of last year. I went through a background check, but it was part of a qualification for a specific project"
    }
  ]
}