{
  "subreddit": "technology",
  "post_id": "1jbio7h",
  "title": "First Porn, Now Skin Cream? ‘Age Verification’ Bills Are Out Of Control",
  "body": "",
  "author": "Intelligent-Feed-201",
  "comments": [
    {
      "author": "RedNeckPizzaMan",
      "timestamp": "",
      "body": "If the age verification is more than a \"Are you 21 or older?\" with a yes/no click box...I just close the site page"
    },
    {
      "author": "mmavcanuck",
      "timestamp": "",
      "body": "That’s what they’re banking on"
    },
    {
      "author": "Thelk641",
      "timestamp": "",
      "body": "California’s AB-728 mandates age verification for anyone purchasing skin care products or cosmetics that contain certain chemicals like Vitamin A or alpha hydroxy acids. / New York’s A3323 bill mandates that online dating services verify users’ age, identity, and location before allowing access to their platforms. / Washington State’s SB 5622 takes aim at diet pills and dietary supplements by restricting their sale to anyone under 18.As a curious European, can you go to a pharmacy in California or Washington State and buy these products as an underage person legally, or are they just extending an existing rule to the internet world ?I get that it goes against the free internet and it's a privacy issue and all of that, but at the same time I think most people would argue that there are things that underage people shouldn't be allowed to buy, physically or virtually so I don't see this as that big of an issue ? If anything, isn't the US in a big health crisis because of overdosed, easily accessible medication ?"
    },
    {
      "author": "JimC29",
      "timestamp": "",
      "body": "That's a good question. You have to verify age for alcohol and tobacco purchases online.I kind of understanding the verification for dating sites as well. To much catfishing."
    },
    {
      "author": "moconahaftmere",
      "timestamp": "",
      "body": "Skincare products are also fueling a massive body dysmorphia crisis among kids, as well as having them waste money on \"anti-aging products\" that they don't need because they're still 15 years away from their first wrinkle."
    },
    {
      "author": "chemicalreaction52",
      "timestamp": "",
      "body": "What is tech really doing to societies with the help of the MAGA/GOP/P2025 Hostile takeover of the US!?"
    },
    {
      "author": "No-Builder-1038",
      "timestamp": "",
      "body": "Making it easier to identify you"
    },
    {
      "author": "Fairwhetherfriend",
      "timestamp": "",
      "body": "Hey so uh... we actually already have a way to restrict access to skincare products that are strong enough to be dangerous. It's called a prescription. Stop reinventing the wheel :)"
    },
    {
      "author": "WatRedditHathWrought",
      "timestamp": "",
      "body": "I foresee a resurgence of Sear’s catalog type publications."
    },
    {
      "author": "Intelligent-Feed-201",
      "timestamp": "",
      "body": "These things are labeled \"age verification\" bills, but in reality they're just expanding the surveillance state.Keep good track of the people who sponsor them; they need to be removed from power."
    }
  ]
}