{
  "subreddit": "VRchat",
  "post_id": "1jpfvnr",
  "title": "I cannot stand “age verifiers”",
  "body": "I’m 21 years old, says it in my bio, and I still get hounded for my age whenever I join a non +18 instance. I cannot count on two hands how many times I’ve been kicked for asking why I need my age verified to play something like spook em up. It’s always someone who sounds like they’re 16 too. Am I going crazy?? Are other people getting tired of it too??\n\nI know that just saying my age would fix the problem, but I just get so irked when I join a normal (non +18) instance and am questioned immediately. Not to mention, if you hesitate slightly you’re gone. I’m half tempted to get vrc+ just to get into +18 instances without the power trip.",
  "author": "kwizyvr",
  "comments": [
    {
      "author": "NIX-FLIX",
      "timestamp": "",
      "body": "I once joined a public server and was immediately asked my age and DOB. I asked him if this was a group world, he said yes. So then I asked him why he didn't make it 18+. He froze for a second before kicking me."
    },
    {
      "author": "Appropriate_Ad5089",
      "timestamp": "",
      "body": "Yup, sounds about right"
    },
    {
      "author": "drhurtzftw",
      "timestamp": "",
      "body": "its more annoying when your a medical mute and they kick you for not speaking"
    },
    {
      "author": "Mr_SunnyBones",
      "timestamp": "",
      "body": "The whole thing is pointless , anyone can just give a fake age and year of birth if they wanted. Even if a kid doesn't have a deep /older sounding voice they can fake it or use a voice changer . I've seen people getting mutes to type out the age and dob which is , well it's great they support mutes , but makes the whole thing even more pointless."
    },
    {
      "author": "-peas-",
      "timestamp": "",
      "body": "I went to public Just B Club for the first time in like a year to test something this morning on US West servers because I noticed huge lag spikes with about 40 other people seeing the same thing. EVERY SINGLE ONE was locked and had eboys sitting at the front desk asking for age and date of birth. I stood there for like a minute in silence and they thought I was going to \"do something\" and threatened to kick me. It was one of the most cringe things I've seen in this game. They don't care about your VRC+ age verification either."
    },
    {
      "author": "Appropriate_Ad5089",
      "timestamp": "",
      "body": "Yeahhh, I’ve been actively avoiding B club since the age verification update because of this. I hope you survived the cringe 🫡"
    },
    {
      "author": "Masked_Majora64",
      "timestamp": "",
      "body": "Vrchat TOS 8.10. To make a long story short, they CAN NOT ask for age, date of birth, or any other form of Identification “On Platform”"
    },
    {
      "author": "TheRealWoldry1",
      "timestamp": "",
      "body": "They're also allowed to kick you for any reason they deem worthy in a group instance they have perms in. TOS really doesn't matter when no one is actually breaking the rules, regardless of how stupid it may seem"
    },
    {
      "author": "Sorenchell",
      "timestamp": "",
      "body": "I once joined an instance, got asked for age, and after telling em \"my account is verified, check my bio if you want\" got asked to leave, cuz this instance were for minors only. Maybe that's the case?"
    },
    {
      "author": "kwizyvr",
      "timestamp": "",
      "body": "I mean that's literally the only situation where that behavior would be sensible."
    }
  ]
}