{
  "subreddit": "roblox",
  "post_id": "1hy2obj",
  "title": "Age verification for voice chat absolutely SUCKS imo.",
  "body": "What kind of idiot thinks a 13 year old would pull an ID out of their ass? & hackers are more common too. It's so stupid, I couldn't even get through with my own identification card that's how ridiculous it is. School cards I think would be better if they're gonna make voice chat13+since usually High Schoolers are 13+ (at least where I live).",
  "author": "flappydragonJR",
  "comments": [
    {
      "author": "Hugz40",
      "timestamp": "",
      "body": "u dont even need to verify with idif u got a phone number attached to ur acc roblox might just decides to give u access to vc"
    },
    {
      "author": "TheFingerCircle",
      "timestamp": "",
      "body": "lmao that is so dumb"
    },
    {
      "author": "Roteplayz",
      "timestamp": "",
      "body": "I'm pretty sure that's only in a few countries.EDIT: Yep this is true.Voice chat is currently available to all 13+ phone number verified users in these countries:  United States, Canada, Great Britain, Ireland, Australia, New Zealand, Spain, Mexico, Chile, Costa Rica, Puerto Rico, France, Italy, Austria, Switzerland, Germany, Japan, South Korea, Argentina, Colombia, Peru, Dominican Republic, Guatemala, Uruguay, El Salvador, Honduras, Paraguay, Nicaragua, Ecuador, Bolivia, Venezuela, Panama, Portugal, and Brazil . Users not in these countries should use ID verification to enable voice chat.https://en.help.roblox.com/hc/en-us/articles/4405807645972-Voice-Chat"
    },
    {
      "author": "Calyp_1",
      "timestamp": "",
      "body": "That's the thing, I have my phone number & my profile even says \"13+\" because I've been on Roblox for a long time.they just don't like me🥲"
    },
    {
      "author": "GuestDiamond",
      "timestamp": "",
      "body": "i have seen 10 years old kids used voice chat so 13+ id isnt good enoughmake it 17+"
    },
    {
      "author": "Catcraft6679",
      "timestamp": "",
      "body": "Ten? I’ve run into kids that have like 5 words in their vocabulary… lol"
    },
    {
      "author": "Calyp_1",
      "timestamp": "",
      "body": "Then how tf is it not letting me in? Goddam Roblox has favourites 😭 how are 10 year olds getting voice chat more easily than me? That makes me more frustrated with Roblox ngl"
    },
    {
      "author": "Xecular_Official",
      "timestamp": "",
      "body": "School cards won't work because Roblox needs a federally recognized ID to verify whether or not it's actually legitimate. They can't verify a school ID without manually contacting the school it belongs to.Voicechat was also originally only an 18+ features which (in my opinion) worked better since it didn't require the moderation algorithms we have now that are prone to false positives"
    },
    {
      "author": "involuntary-nerd",
      "timestamp": "",
      "body": "i think it was asmart decison but bad execution, many people use their parents ids to bypass the vc requirements, i dont understand why they didnt do something similar to other websites, either your id with a picture of you and roblox username all in 1 image, or een 2 forms of id, would just make roblox alot more safe"
    },
    {
      "author": "flappydragonJR",
      "timestamp": "",
      "body": "young children on vc is a supervision problem, not a roblox problem imo"
    }
  ]
}