{
  "subreddit": "gaming",
  "post_id": "3tlv8j",
  "title": "In October, my PSN account was stolen. This is the story of how he did it. (spoiler) I chatted with the hacker and he used Sony's customer service.",
  "body": "Update 11-23: I just had a conversation with Sony and they restored my PSN state. In addition, they claim to be reviewing their protocols. I'll call this a provisionally successful resolution. Thanks reddit!\n\nAfter seeing a recent redditIn August, my PSN account was hacked and I found $500 in charges made on my card. Sony strings me along for a month, promising a full refund, but ultimately tells me that my only recourse is a chargeback. I issue the chargeback, but Sony disputes and inexplicably wins. Details inside., it was time to share my story. Unlike the story shared, I have at least some idea how they did it - especially after chatting with the hacker. I also have a fairly strong evidence that the incident is not isolated.\n\nHopefully, these two stories will be enough of a black eye that Sony fixes the root issue rather than ignoring it as they have to date.\n\nThis is the story of a hack that was enabled by policy changes at Sony Computer Entertainment that allow a social engineering hack to transfer control of a PSN account from the original owner to another without the owners knowledge or consent. In addition, Sony lacks the procedures to adequately address fraud when it occurs.\n\nMy story begins in October when I sat down to take a break from work and play some games. Oddly enough, I was logged out. That seemed strange, but a system update had just happened so I assumed it might be related. Attempts to log in were denied. Attempts to reset the password were similarly denied when I couldn't answer a basic security question – namely my date of birth.\n\nAbout this time, I recalled an email that I assumed to be phishing regarding a customer service interaction with Sony. I looked up the case number and with great trepidation, I opened a chat with customer service.\n\nJosue: Hello, My name is Josue how may I assist you today?\n\nMe: i think my account has been stolen. the password seems to have been changed and reset password links don't accept my personal info.\n\nMe: i had recieved a \"how was your customer service\" email a couple days back.\n\nMe: Case #: *********\n\nJosue: I completely understand ******, I will be more than glad to assist you with your account today.\n\nJosue: Although you have entered information about a SEN account before this chat, could you please provide the following to confirm theexactaccount you need assistance with?\n\nFirst and Last Name on account\n\nSign-In ID (email address)\n\nOnline ID\n\nMe:  *********redacted for my privacy\n\nMe:  *********ditto\n\nMe:Thor\n\nThat's right, while online I was aGOD–though with an odd aversion to hammers. Over the past decade, I had grown quite fond of the id and would prefer not to lose it.\n\nJosue: Thank you ****, one moment while I access your account.\n\nMe: thanks. i'd originally ignored the email as i figured it was just phishing.\n\nJosue: Thank you for waiting! Could you provide me with the serial number of the console where the account was created on, please?\n\nMe: hold on...\n\nJosue: OK, take your time!\n\nMe: actually... probably not. the ps3 i have now was a waranty replacement for a ps3.\n\nMe: and it was created via playstation network pre-ps3 release.\n\nJosue: I completely understand ******, however without this information we are not able to verify that you are the ownership of this PSN account since it's compromised. I will recommend you to look for that information and once you have it we will be more than glad to assist you with this PSN account.\n\nJosue: I'm sorry ****** but without the proper information we are not able to further assist you.\n\nJosue: May I know if there is anything else that I can further assist you with today?\n\nMe: can you look up the contents of the case # provided?\n\nMe: how can I go up the chain?\n\nJosue: No, ****** I'm sorry.\n\nMe: no really. you have no idea about that case number?\n\nMe: i've had this account since before day one and you say \"i'm sorry?\".\n\nJosue: ****** I have provided you with the correct information, if you don't have the serial number of the console where the account was created on we are not able to further assist you.\n\nJosue: If there is not anything else that I can further assist you with today I will disconnect this chat session today.\n\nMe: and you can't see anything about that case number?\n\nMe: yes or no.\n\nJosue: I can check that case number, and there says that you did not provide with the serial number.\n\nSo the previous customer service request didn't have a serial number either. Nothing here to suggest that fraud may have happened yet?\n\nJosue: I have provided you with the correct information, our intention is to help you, however without the proper information we are not able to further assist you. Since there is not anything else that I can assist you with today I will disconnect this chat session, thank you for contacting us have a nice day!\n\nSo the customer service agent blew me off as a hacker. If they did this the whole time there would never have been a breach. At least I knew at this point that a hack had occurred and Sony's customer service was involved in the transaction. Having little recourse, I started a new conversation which went only slightly better. Mind, I started the conversation with “I think my account has been stolen”. If he had legitimately checked, he would have seen the recent account transfers. However, it appears that their customer service protocols to not include the possibility of previous fraud.\n\nMiguel: Hello, My name is Miguel how may I assist you today?\n\nMe: My playstation account password and info were changed without my permission. Now I can't get in.\n\nMe: See case number ******* for the likely change time.\n\nMiguel: Our most sincere apologies for the issues you are experiencing when trying to sign in to PSN. We’ll be glad to look into this to have you back online as soon as possible. Could you confirm the following info:\n\nFirst and Last Name\n\nOnline ID (Nickname used on PSN)\n\nSign-In ID (Email on the account)\n\nMe:  *********redacted for my privacy\n\nMe:  *********ditto\n\nMe: *********\n\nMiguel: Thank you so much, just allow me a couple of minutes to check the information.\n\nMiguel: The information is not matching, could you please double check the information?\n\nMe: Is there a change log on the account?\n\nMe: If it was stolen, they would likely have changed first/last name.\n\nMiguel: Do not, worry the Online ID can not be change it. Just double check the information.\n\nMe: can you look up by online id? i vaugly recall getting a \"new account created\" email which i had deleted.\n\nMiguel: Could you please provide me your Online ID in this case?\n\nMe: Thor\n\nMiguel: Thank you so much, just allow me a couple of minutes to check the information.\n\nMiguel: By any chance do you have access to the first email you used on this account?\n\nMe: it's always been *********\n\nMe: and yes.\n\nMiguel: Great! just allow me a couple of minutes to send you an email to change your password.\n\nMe: thank you.\n\nMe: are there two accounts with the same sign-in?\n\nMiguel: I do apologize for the inconvenience but in this case we are unable to send you the email becuase you use that email in another PSN Account.\n\nMe: thor should be the real account, the new one is bogus.\n\nMe: verify by age of account if needed.\n\nMe: and if there are two, can you file a bug report? didn't PSN prevent creation of duplicate online ids previously?\n\nMiguel: I do apologize for the inconvenience, but in this case in order to recover your PSN Account, I will need the serial number of the first console that you used to create your PSN Account, then we will be able to change your Sign ID for a new one.\n\nMe: the account was created pre-release, but the earliest serial i have is - **********\n\nMiguel: May I know if that serial number is the console that you used to create your PSN Account?\n\nMe: likely not. think it was created on a dev unit which has since been returned.\n\nMiguel: I understand, let me see if there is any other option we can try in order to recover the account.\n\nMe: thank you.\n\nMiguel: Have you ever used a Credit/Debit Card on this account to complete a transaction?\n\nMe: yes.\n\nMiguel: Perfect. Would you mind confirming the FIRST four and LAST four digits of the last Credit/Debit Card  you used on the account to complete a transaction?\n\nPlease keep in mind that if the information match you will need a new email account that is not associate to another PSN Account.\n\nMe: ********\n\nMe: kk. i've got a gmail account i can kick it over to.\n\nMiguel: Thank you so much, just allow me a couple of minutes to check the credit card.\n\nMe: mind, if you could verify at least older than 1 week, that would be helpful.\n\nMiguel: Thank you so much for waiting, I really appreciate your patience, I am truly sorry for the inconvenience. Unfortunately, the information we received doesn’t match with the one on file, we are unable to make any changes on the account without this information. We recommend you to verify this information to make sure you have the correct one at hand. In this case I would recommend you to look for the Serial Number of the first console that you used to create your PSN Account. In case you are unable to locate this information, you are always welcome to create a new account, you will be able to create a new PSN on the following link:https://account.sonyentertainmentnetwork.com/liquid/reg/account/create-account!input.action\n\nMe: there's clearly been a hack or there wouldn't be two accounts with the same email. how would you suggest i proceed to recover my original account? i have quite a bit of money invested there in psn downloads.\n\nMiguel: I do apologize for this inconvenience, I totally understand your situation, I did everything on my hands in order to recover your PSN Account. But is something out of my hands.\n\nI would like to know if is there anything else I can assist you with today?\n\nMe: i understand you are limited, but is there an escalation procedure? if there is an existing hack, wouldn't you want to know how it happened to prevent reoccurance?\n\nMe: i'm willing to come by the psn offices in san diego if necessary.\n\nMe: (yes, i know they exist)\n\nMiguel: In this case unfortunately we are unable to escalate over the chat your case, I really apologize for the inconvenience.\n\ninconvenienceis he kidding?  Inconvenience is having to walk further because you lost a parking spot.  Inconvenience in NOT getting hacked and having quite a bit of personal data stolen.\n\nBesides this is there anything else I can assist you with today?\n\nMe: phone? in person?\n\nMiguel: In this case unfortunately without the information that I asked you, we are unable to help you, for that reason I would recommend you to verify the the serial number of the console that you used to create your PSN Account, once you get the information please contact us back and we will be more that happy to assist you with your request.\n\nMiguel: My most sincere apologies, we have ran out of options to proceed with the security verification. We are unable to make the changes you need at this moment. Please try to acquire the correct information so we can recover the account for you. At the moment there are no other options I could offer, besides this request is there another question or issue that I can assist you with before I disconnect the chat?\n\nMe: like i said, it was a dev unit and i no longer work for scea so it's unlikely....\n\nMiguel: This conversation it’s running in circles, if there’s nothing else I will disconnecting the conversation.\n\nThank you for contacting PlayStation Chat Support.\n\nTwo things became clear in this conversation\n\nThe hacker was good. He'd transferred the account, created a new one and made a transaction to prevent me from reestablishing ownership.\n\nSony's customer service is crap. Even with a likely fraudulent transfer, they had no criteria to escalate the issue. As I was only asking that the account be restored to it's previous status with respect to password and sign-in id, I should have been given the benefit of the doubt.\n\nAt this point, I panicked. My credit card was attached to the account. I had made a lot of PSN purchases over the years that I no longer had access to. I had a handful of game saves that I really didn't want to start over from scratch. The account was linked to my facebook profile, so the hacker now knew more about me than I wanted to consider. So I asked for a favor from a friend who works at Sony. She gave me the tips needed to adequately authenticate myself as the actual owner of the account. (Note: I owe her a beer – and probably lunch too.)\n\nTo make a long story slightly shorter, the next chat still refused to fix the problem but at least provided me with a direct phone number. After a conversation with the representative, he asked me some billing information in order to authenticate myself. While happy that he accepted it, it still struck me as odd that he would consider a piece of data that the hacker could currently access.\n\nFiguring that the hacker would attempt to reestablish ownership, I went poking around looking for any information that would lead to his identity. Looking at some of the messages sent, he was clearly looking to sell the account. In addition, he had deleted all my friends, added his own, and downloaded a number of games from PSN. Best of all, he provided a Kik messenger account to contact him to one of the people he solicited to sell the game.\n\nShortly after installing the kik client, I received an email notifying me of a password reset request. With nothing to lose and knowing the hacker was awake, I texted him. To my utter surprise, he responded.\n\nI bantered with the person for a bit only to learn that they had acquired the account by responding to a bulletin boardpost. Just as I thought it was another dead end, another person joined in the chat. The real hacker decided to make an appearance.\n\nHe was a piece of work. Like some kind of Bond villain, with a little encouragement, he admitted to the entire thing.composite screenshot\n\nJake: do you even know how your account was taken lol\n\nMe: Nope. Guessing social via customer service\n\nJake: yeah\n\nJake:  there's no solution\n\nJake:  you can't fix it\n\nJake:  this isn't a single account that is safe\n\nMe: At least until they notice and change procedures\n\nJake: no see that's where they fucked up\n\nJake: their “changes” made everything worse\n\nJake: they should've kept the serial number as the only way to swap the email\n\nMe: Transferring email accounts\n\nMe: That doesn't work either. To many returned playstations\n\nJake: what?\n\nJake: the serial number?\n\nMe: Warranty returns don't get the same box back\n\nJake: yeah i know\n\nJake: but they didn't give a shit before\n\nJake: you either had it or you didn't\n\nJake: keep in mind the accounts would've never been taken in the first place without it\n\nJake: their new procedures ruined it\n\nJake: they made to many options to recover your account\n\nAt this point, the conversation degraded into threats if I didn't return the account to him. Unwilling to be bullied, I ended the conversation.\n\nThe conversation did highlight some key points, namely:\n\nSony's security ID questions are weak.\n\nSony has no escalation procedures for cases of fraud and isn't able to identify that it may have taken place.\n\nI have since made repeated requests to Sony, but as yet have not had my account restored to it's original state. There is still a fake account connected to my primary email, and the primary console is still attached to the hackers PS4. Probably not coincidentally, there have also been attempted breaches of my email, ISP, phone and banking accounts since.\n\nAs for my belief that others have been hacked, one of new friend PSN accounts broadcast a message to around 80 others soliciting the sale of an online id. All of them had one word online ids which, in the world of gaming, is like seeing a flock of dodos.prudence and a lack of desire to antagonize multiple hackers means I won't be posting screenshots of that message thread\n\nNotes: Conversations have been modified to protect privacy, but not to change the flavor or content therein",
  "author": "SepticCupid",
  "comments": [
    {
      "author": "DJKrafty",
      "timestamp": "",
      "body": "Holy shit man, Sony needs to address this, especially if you used a dev unit. You obviously have enough info of the inner workings and have been a loyal consumer. They need to make this right."
    },
    {
      "author": "InterimFatGuy",
      "timestamp": "",
      "body": "If hackers are trying to breach your bank account you should probably talk to the police/FBI"
    },
    {
      "author": "ABetterKamahl1234",
      "timestamp": "",
      "body": "I do just want to comment on your \"Inconvenience\" thing. CS reps are NEVER allowed to say an issue is beyond that. It means their jobs.We know it's worse than that. But we are restricted by things to keep our compliance to ensure we're not fired.(not commenting on any abilities for them to help or whatever, just the inconvenience thing)"
    },
    {
      "author": "Mystical_17",
      "timestamp": "",
      "body": "This is why on any gaming account I own I never attach credit card or personal info (or as little personal info as possible). I only use prepaid and I prefer hard copy game discs over digital so if in the catastrophic event my account gets nuked I can make a new account and my biggest worry is re-installing games as opposed to having an entire digital library stolen. People seem to think when someone gets hacked on PSN or xbox they \"gave their account info away to phishing scams\". This isn't the case. There are ALWAYS loopholes, they may not be as easy to see by they can exist. Several years ago there was some stupid xbl EA loophole where hackers could steal accounts with the use of emails that were attached to the origin thing and use the money on accounts for some piece of crap FIFA microtransactions. Sadly my account got stolen despite the fact I never played a fifa game in my life but I had played battlefield 3 (and EA game). I was quick to recover because I checked my email one day and noticed a request for password and I got my account back since I have several safeguards in place.They stole all my 4000 ms points but I only use prepaid cards. I heard of others who had hundreds of dollars spent because of attached cardsHackers are nothing but a bunch of low life losers who apparently have no morals when it comes to stealing other people's stuff. They are willing to steal money from other people who are fellow gamers and demolish friends list (sometimes leaving nasty messages before removing the friends) only for the benefit of themselves. It sucks what happened to you and after reading that chat log of the hacker you posted it makes me mad how much of piece of work he thinks he is."
    },
    {
      "author": "SomnambulicSojourner",
      "timestamp": "",
      "body": "Welp guess I need to write down my serial number now. Not that I have really ever made any purchases on PSN or anything, but having someone else have my account would suck."
    },
    {
      "author": "newman1311",
      "timestamp": "",
      "body": "I actually work for the Xbox escalated support and reading this shocked me that they really have little in place to help these kind of customers. Xbox actually takes these very serious and if there is any sign of possible UA or account theft they send it to the ua escalations team to fully investigate. Can't get to much into it without potentially crossing confidentiality stuff, but just wow.Also want to try and correct something. These are in no way hackers, they are phishers and there is a big difference. Phishers know the questions to ask for social engineering to get the answers they need and once they have them they call back in to support and provide the right info to gain access. Hackers don't need to do this. Not trying to be that guy, just helping people better understand how it works."
    },
    {
      "author": "Woollykillerz",
      "timestamp": "",
      "body": "Same exact thing is happening to me right now and i don't know what to do."
    },
    {
      "author": "AsthmaBlows",
      "timestamp": "",
      "body": "Someone hacked into my profile and spent 100 dollars on NBA VC, I had to call them and get my password changed but because I didn't have the original serial number from the very first PS3 I had (in 2009 it got YLOD so I threw it in the garbage) they couldn't do anything but ban the account and I lost everything I purchased.I gave them my email, password, he'll, I even sent them my ID picture and verified the credit card and they still wouldn't give me my account back.So I'm locked out if I ever want to use my account again which has hundreds of dollars of purchased content on it. Fuck Sony and their customer service. I think I'll stick to my xbox and never use credit cards again."
    },
    {
      "author": "MrFix-it",
      "timestamp": "",
      "body": "Sony customer service might be the worst of any company I've ever come in contact with. If I were you, I would seriously consider some form of lawsuit. Maybe go onto Twitter and spam some execs. I've seen issues on Microsoft's side where Major Nelson has stepped in and provided some help. Just reading your post pissed me off. I love my ps4, but not enough to risk my personal information. Sony should be better than that; especially after that big hack a year ago."
    },
    {
      "author": "SepticCupid",
      "timestamp": "",
      "body": "The \"is there anything else I can assist you with today?\" is so frustrating to get. It's double-speak for \"I'm done with your ass.\""
    }
  ]
}