{
  "subreddit": "texas",
  "post_id": "1214841",
  "title": "Texas Senator and Representative Introduce Age Verification Legislation",
  "body": "Texas Senator Bryan Huges (District 1) and Representative Terri Leo-Wilson (District 23) have introduced SB 2164 and HB 3585 respectively that seek to force any online provider that publishes adult content to enforce an age verification system.\n\nSB 2164 Text\n\nSec. 120.203.  REASONABLE AGE VERIFICATION METHODS.\n\n(a)  In this section, \"digital identification\" means information stored on a digital network that may be accessed by a commercial entity and that serves as proof of the identity of an individual.\n\n(b)  A commercial entity that knowingly and intentionally publishes or distributes material on an Internet website or a third party that performs age verification under this sub-chapter shall      require an individual to:\n\n(1)  provide digital identification; or\n\n(2)  comply with a commercial age verification system that verifies age using:\n\n(A)  government-issued identification; or\n\n(B)  a commercially reasonable method that relies on public or private transactional data to verify          the age of an individual.\n\nSB 2164 -https://capitol.texas.gov/BillLookup/History.aspx?LegSess=88R&Bill=SB2164\n\nHB 3585 -https://capitol.texas.gov/BillLookup/History.aspx?LegSess=88R&Bill=HB3585\n\n\n\nEdit: Fixing my horrid spelling.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "We have this law currently in Louisiana.  The MindGeek sites comply (e.g, Pornhub, etc.), and every other porn site on the internet doesn’t pay it any mind. The author of the bill is so frustrated with the law not being taken seriously that she’s pushing another law to impose civil penalties for not complying, which most porn sites will also ignore."
    },
    {
      "author": "DaddyDollarsUNITE",
      "timestamp": "",
      "body": "mindgeek is a pretty evil company that works to keep sex workers' pay low by reuploading their content to their own sites and skipping out on paying the actors.if you're a fan of sexually explicit material, consider supporting your favorite workers directly through only fans or other services where models can directly own their labor."
    },
    {
      "author": "jumpofffromhere",
      "timestamp": "",
      "body": "I sent a message explaining what a VPN is, there has been no response from their office."
    },
    {
      "author": "MysteriousDudeness",
      "timestamp": "",
      "body": "And how long before this information is hacked and people are blackmailed over the porn categories they watch?"
    },
    {
      "author": "DaddyDollarsUNITE",
      "timestamp": "",
      "body": "wait are you telling me we could use this to find out which anti-trans legislators are chasers? maybe i am in favor of this after all"
    },
    {
      "author": "FenrirLokison88",
      "timestamp": "",
      "body": "Leave it to Texas to care more about preventing teenagers from looking at porn as opposed to fixing their shitty electrical grid."
    },
    {
      "author": "85hash",
      "timestamp": "",
      "body": "Better take away the Bible too. There’s some fucked up stories in there that kids should not be exposed to."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "How long before the law is used to stop minors from accessing fact based sex education online?"
    },
    {
      "author": "shadow247",
      "timestamp": "",
      "body": "Less than 24 hours."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}