{
  "subreddit": "nationalparks",
  "post_id": "18u2q10",
  "title": "Age Verification when Camping. Is it checked/required?",
  "body": "I recently planned an overnight front country camping trip to the great smoky mountains park. I know to reserve a campsite you're supposed to be at least 18 so I found a friend who meets the requirement to put the reservation under. Now due to some medical conditions he may not be able to go and I'm not sure if I'll be able to find another friend who is 18 or older. Is this rule enforced and/or do they check id's and age when I check into the campsite? Is checking into the site even required? We will be very respectful and are not going to trash the place, we just want to enjoy the mountains and hike.",
  "author": "No-Lunch4249",
  "comments": [
    {
      "author": "procrasstinating",
      "timestamp": "",
      "body": "I don’t think I have ever had an id checked in a campground. If you pay and are quiet I don’t see why anyone would care.Would be a bummer on your trip if every time someone came by to check you sick buddy was off poopin. Or if they arrived in a different car later than you did."
    },
    {
      "author": "TomGraphy",
      "timestamp": "",
      "body": "It can depend on the vendor. Xanterra in Yellowstone does (and they gave me grief for not updating my address), but I don’t think they checked it in Colter Bay."
    },
    {
      "author": "twoeightnine",
      "timestamp": "",
      "body": "Your biggest problem is that some NPS campgrounds require the person whose name is on the reservation to be present at check in and they're often not transferable."
    },
    {
      "author": "Jerri2406",
      "timestamp": "",
      "body": "I thought of that and checked last night. I can modify it on the recreation.gov website"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I’ve camped at Cades Cove and Elkmont and they never asked for an ID. A while back I camped at Cosby Campground and you just pay an honor box. Not sure if it’s still that way or not. The rangers are usually pretty chill, you can even camp before checking in if it’s later in the afternoon, just check in the next morning. All they give you is a piece of paper that says when you’re leaving so they know to check/clean up your site if needed."
    },
    {
      "author": "magiccitybhm",
      "timestamp": "",
      "body": "Checking in for frontcountry campsites is absolutely required. You can't just drive up and take over an empty site. If you arrive after the check-in office is closed for the day, your space assignment will be posted. Go to your site and check in first thing the next morning.Which campground are you planning to use?"
    },
    {
      "author": "Jerri2406",
      "timestamp": "",
      "body": "well yes we've already booked a site as of a couple months ago. We're staying in Cades cove."
    },
    {
      "author": "Flat-Lifeguard2514",
      "timestamp": "",
      "body": "Make sure that whomever the reservation name, number, and address is up to date and there. That’s the bare minimum. Specific policies and procedures will probably vary depending on where or when you’re camping."
    },
    {
      "author": "211logos",
      "timestamp": "",
      "body": "Some places do check; often it's the campground host who'll inquire as they make their rounds. Some state and local parks I've been at required I show ID at the check in—not specifically for age, but to make sure I was the person who reserved, as the reservations are not transferrable and so hard to get they've clamped down."
    },
    {
      "author": "No-Lunch4249",
      "timestamp": "",
      "body": "I’ve never had it checked at GSMNP, as long as you don’t cause problems you can probably get away with it. Just don’t draw too much attention to yourselves"
    }
  ]
}