{
  "subreddit": "BadRPerStories",
  "post_id": "1df5oc1",
  "title": "Newbie2RP Asks: Age Verification, Your Private Data, and Mods' Training",
  "body": "A few questions that have surfaced and percolated over the last couple of days from various other posts, comments and discussions. With the OP's direct permission to mention this, it was their original post that inspired this post and (I believe IMPORTANT) question - their original post is hidden below, but I will STRESS that you do not need to bring that topic back into this one. It's just for your context and reference should you want it.\n\nhttps://www.reddit.com/r/BadRPerStories/comments/1ddwl97/feminineidentified_people_a_reminder_to_be/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\n\nAge-verification is important and it is vital we can do it safely and securely.\n\nQuestion 1 is to everyone wanting to contribute.\n\nQuestion 2 is aimed at anyone with mod/admin experience\n\na) Specifying your exact real life birth age? 21 this year, 22 the next, 23 after that... OR\n\nb) Confirmation that you are over 18 or 21 (depending on the required threshold)?\n\nc)What other practical methods are there that we could use for age-verification (beside government issued identification)?Surely this is something that should be done at the Discord/Reddit level not on the individual server/subreddit level?\n\nI've read mentions of linking to a post-secondary email account, a LinkedIn, a business profile.Are there any other safe options out there?\n\nYou are volunteers, giving up your spare time to do this role, a thankless task - I get it. But are you set up for success? Are you given the tools to perform your role successfully?\n\nAs a mod, what training do you have for ensuring proper handling of sensitive personal information? What knowledge do you have of Data Privacy laws?\n\nUltimately, it'd be nice to have a stamp of some sort that simply says 'This user is over the age of 21 (or 18, whatever...)'\n\nI would like to be able to age-verify, I am much older than 21 and don't want to be seen as anything other than that - but I will not consider risking sharing my personal government identification to a privately run server/sub-reddit, and especially not to some Random Person Called 'TheMod'.\n\nIt is one thing to verify with Discord, they are a legally run registered business entity. If they compromise my personal data, leak my information I go after them with lawsuits and sue them to high heaven.\n\nWith a private server/subreddit, if they compromise my data, I have no recourse. No protection, no compensation, nothing. They have no legal obligations to secure my data - why the fuck would I want to risk that?\n\nIt's not even showing the government ID that's my major issue, it's that they'd have a digital copy/screenshot of it. \"Your data will be destroyed after verification.\" Sure... With your super secure, virus and malware free laptop... In your basement home office. Not on a VPN. With 'Wifipassword1' as your WIFI password.\n\nYeah... no. Not happening.",
  "author": "FelandShadow",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome to BadRPerStories! If you are new here, please take a moment to look at ourbanned words list on the wiki.We now have aGoogle docthat lists RP hubs, forums, and subreddits. If you know of a place for RP that isn't on this document, there is a link in the document to request an addition. Please be aware this is just a knowledge base, not a recommendations list, and the moderators of BadRPerStories do not condone anything that happens in the spaces listed here.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "YouveBeanReported",
      "timestamp": "",
      "body": "For A/B. Legally, the responsibility is age of majority. With few exceptions, that is 18. Hence why most places are 18 \"or age of majority in your area\" While I'd like to know the person I'm playing against isn't 18 but older, the exact age doesn't really matter beyond are you a legal adult.Discorddoesoffer age-gating (at 18) for marked servers or specific channels, requiring you to provide them ID to confirm it if challenged. Personally I think most servers should be using that.I've read mentions of linking to a post-secondary email account, a LinkedIn, a business profile.... Are there any other safe options out there?Isthis safe though? As someone who's grown up with various fandom communities, we had tons of doxxing over the years. Do you really want your place of work provided to a random internet stranger, so they could just walk in to yell at you over ghosting them? Discord only allows one account, and requires a phone number, so what happens when you graduate college and lose that email and can't make a new one?But are you set up for success? Are you given the tools to perform your role successfully?Majority of mods get no tools or training. Perhaps this is different in larger servers, but I've never seen anything beyond informal advice.In my case, privacy law knowledge is purely from working a few jobs where North American privacy laws were a major thing and people regularly got fired over it.\"Your data will be destroyed after verification.\"Adding onto this, it's onlyVERY RECENTLYDiscord stopped keeping image links live. Copy and paste any random image into Discord, click open in browser and you'll get a URL anyone can access. They were used for image hosting, and never went dead.Open your old chats, and you can search back to like 2017 and find images still.Nothing ever dies online.There's no end to end encryption in sending this ID, or real protection from Discord or the other person.Alsou/WetWhiskers00mentioned questions (sorry for the @) which I'm going to use to mention the issues of Culture.I have memories of a forum once using when are taxes due and put in 'CRA due date is Date' and getting someone messaging me back 'wtf is the CRA' because no one considered international answers.And also limits you to a very specific age band. In my 30s I can't tell you which teachers taught me cursive, and people in their 20s weren't even taught cursive. My almost 60 year old DM did not care about Team Jacob and won't remember Twilight. My 80 year old Grandma had to learn Latin in school. And these are all very similar people growing up in the same areas with vastly different life experience. Location, class, income, and so many things will change these answers.Even with ID, there's an issue. I've have issues with jobs in other provinces because my ID doesn't match exact expectations and that's literally the next province. I've had cops in the US yell at me why my driver licensee and passport is bilingual if I'm not from Quebec.Many IDs have different markers, like barcodes or random numbers which can communicate info and no random server owner is going to know every country and territories ID style and whats important.And, on the snarky side, any adult knows how sucky identity theft is and would be smarter then sharing this so forcing IDs only proves you got idiots or children stealing others IDs.We really can't guarantee peoples age, online or in real life. When I ID'd people at work I was told what to look for, but if the cops came in with a fake ID I wouldn't be fined and arrested for selling someone booze if the ID was the correct year. Even if it was a lie. They tested for did you read the fucking year and did you flag the printer paper ID.The risk to people it too high and frankly, if people are determined to get ID gating contact your representatives working on various bills which will require government issued ID for online interactions which may have inappropriate content."
    },
    {
      "author": "pasaniusventris",
      "timestamp": "",
      "body": "You said everything I wanted to. The idea of putting anything close to personal identifying information in the hands of strangers who could do anything with it unnerves me- these aren’t healthcare workers who are beholden to HIPAA. There will also inevitably be people who censor information poorly- look how often things get reposted in this very sub with apologies that information wasn’t redacted properly the first go around, and then imagine that with things like drivers licenses and ID cards. Yikes!I come from a time on the internet where it was generally unthinkable to put your real name or face out there, and while I may have relaxed on that here and there, I still hold a ton of caution about giving out anything that could lead to someone stalking me. I see kids on TikTok posting their whole faces, where they go to school, their addresses, and all I can think about is how dangerous that is."
    },
    {
      "author": "Runepup",
      "timestamp": "",
      "body": "The \"Enter your birthdate\" works for Steam and porn sites. I'm fine with utilizing it for my boards.I mod for one server that will (rarely) ask for ID and I refuse to do it. I would rather just boot the person if something seems sketchy.Asking for ID, even with things blocked out, is way too much effort. Blocking out information on my ID to submit it to some random to verify that I'm not a teenager? Not worth the time or energy it would take to do it when I can go to a dozen other places and get the exact same thing I was there for."
    },
    {
      "author": "bald4bieber666",
      "timestamp": "",
      "body": "i would love a way to reliably verify info without violating personal privacy. im someone who values my privacy a lot while at the same time wanting to be sure im interacting with adults. theres gotta be a better way to do this."
    },
    {
      "author": "faithiestbrain",
      "timestamp": "",
      "body": "Hi there, OP from the linked post here.I definitely made my original post while I had a lot of feelings happening, and while I stand by making it and by my decision to not share sensitive info I want to clarify a few things that I think are important to this discussion.First off, age verification of any kind is theoretically fine as long as it's clear from the onset of joining that sub/server/whatever that you're going to need to verify in the way that the staff of that place want you to. I will personally not join such a place, because of reasons stated by OP here amongst others, but that doesn't mean it can't be for someone else. I don't need access to everywhere, and I don't make the rules of other spaces.That being said, I don't think there is an acceptable age verification system that can be implemented by your average reddit and discord mods that isn't going to pose an unacceptable (in my opinion at least) risk to users.Let's say common sense for basically anyone would be to black out their name and address because that's fair enough. On some forms of ID your name may be in multiple places, and you may not realize. Your date of birth is also sensitive info, but clearly it can't be blocked out or it defeats the purpose. You also need to have your picture visible, to match with a selfie they ask for, and (in my case) no one even mentioned blocking out my ID number which is definitely another important piece of sensitive info to cover up.So points of failure already include;Mods not telling people all the info they need to block out to protect their privacyPeople making mistakes with what they block, creating a situation where they're effectively doxxing themselvesMods not having secure accounts/internet, leading to breeches that wayAny and everything in the associated selfie that could further betray locationThis is just an unacceptable amount of risk, and that's before you get into the potential for malicious behavior from staff with access to this verification system because let's be honest, some reddit and discord mods are amazing people but there is a set of stereotypes that exist for a reason."
    },
    {
      "author": "Runepup",
      "timestamp": "",
      "body": "People can't censor a reddit post with guides posted on where all the information is. They sure as shit can't censor everything on an ID.The number of people that use the highlighter feature on their phone in black and assume that did it is too high."
    },
    {
      "author": "MadamMarielle",
      "timestamp": "",
      "body": "Agreed.Malicious behaviour from staff is one of my main concerns.I've known a few (one in particular) disgraceful admins, who have used information against members to cause considerable amounts of harm.These people luckily didn't have access to further data beyond email, handle, and other details willingly given. However, the sheer level of psychotic (literally, I am not exaggerating here) behaviour from them? Jesus Christ. I'd not put anything past them if they'd had more.The problem is we don't know who these mods are. What their mental state is. They might seem fine! But people like that are very good at hiding their shitty side, for the most part. Giving random access to information that could be misused (in the ways you say) is just dangerous and asking for trouble."
    },
    {
      "author": "FelandShadow",
      "timestamp": "",
      "body": "I have no solutions to this question, unfortunately. People value their privacy, but there isn't a way to reliably prove someone's age on Discord ( yet ). Linking a social media or business account is a no-go, as is posting a photographic identification card. Minors can own Paypal ( or similar ) accounts to exchange money, as long as they have access to a bank account.I would love to hear potential solutions ( that are feasible ) as I plan on making a server for a horror fandom soon, where minors are strictly prohibited due to the explicit content. However, minors pretty much saturate the fandom even though it isn't advertised for them."
    }
  ]
}