{
  "subreddit": "RecRoom",
  "post_id": "lcmx45",
  "title": "Parental Consent for Age Verification?",
  "body": "Hi,\n\nI was looking at the rec.net age verification page and saw this quote:\n\nWhat if I believe my account was mistakenly made into a Junior account?\n\nIf you believe your account was mistakenly marked as a junior account, you can use this form to verify your age which will restore your account to one with full access to all of Rec Room's features. The most common method allowed by COPPA is by charging a small amount ($1) to a credit cardtoverify that the user is over the age of 13 or has parental consent.This fee is only intended as a way of verifying age, it is not a way that Rec Room makes money.\n\nSeeing this, I was wondering:\n\nCan a parent give a junior account consent to be a normal one for players under 13?\n\nAnyofficial support staffresponse would be appreciated.\n\nPage link:rec.net/age\n\nThanks, Zaps",
  "author": "ZapsAttaxx",
  "comments": [
    {
      "author": "JayRecRoom",
      "timestamp": "",
      "body": "Yes, a parental figure is allowed to give consent to let a junior player play on a regular account after age verification is done."
    },
    {
      "author": "RealHunter08",
      "timestamp": "",
      "body": "Oh my goodness I'm super relieved! My siblings setup an age that wasn't their's for privacy reasons before we knew about the whole age limit thing and it was stressing me out alot, can you explain how this works?"
    },
    {
      "author": "Teamperrin4",
      "timestamp": "",
      "body": "But why do I have to pay $1 to verify the age of my already 13 year old son because recroom has made a mistake??  That doesn’t make sense. His age on the age is 13"
    },
    {
      "author": "Safe-Carrot3798",
      "timestamp": "",
      "body": "I’m not a staff member but yes that is it. It is there so a parent can themselves decide to change a junior account into a normal one it saysor has parental consent"
    },
    {
      "author": "Kittenish21",
      "timestamp": "",
      "body": "Yes they can, I asked Star about this in a Dm on discord, he said if you are underaged, and have parental consent you are allowed to."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yes, you technically could, but you can get reported by others if they suspect you're under 13 or sound under 13, and then you're banned"
    },
    {
      "author": "JayRecRoom",
      "timestamp": "",
      "body": "Juniors who have gone through the age verification with consent don't get juniored, even if reported."
    },
    {
      "author": "ZapsAttaxx",
      "timestamp": "",
      "body": "Wow, that was fast. Thanks for the helpful responses!"
    }
  ]
}