{
  "subreddit": "facebookdisabledme",
  "post_id": "xrmq62",
  "title": "Here is (almost) everything you need",
  "body": "Hello guys.\n\nThis is a huge follow-up post to this thread:I work as a Facebook customer support representative.\n\nI am sorry to those who's comments I missed as with 250+ comments and 20+ DMs, it's starting to get difficult to keep track which ones I already answered. I believe most of the common issues were addressed in that thread, so please read through it if you can to find answers for your issues that are similar or identical to some of the other people. Please know that I will not be answering any support questions in this thread, as I've already done a lot of that in the previous thread.I wanted to make one big thread with all the self-appeal forms that we have available and some quick basic guidelines what you can do.(Shout out to my colleague friend who also often lurks here and who let me steal all his saved links.)First, let me tell exactly what we Support Agents (the people you contact for FB support) can do when we first make contact with a client (you). We can investigate, see into your assets and view the basic restriction information on them, the reason why something got restricted in the first place (though for Instagram, we can't even see that). We can see if you've passed your Identity Confirmation form. We can troubleshoot together with the client, see what's gone wrong, guide them through Account Quality to submit self-appeal. We can escalate, but a huge amount of Escalations are either automated, the Internal Team doesn't read our requests/explanation or takes literally M O N T H S to reply. Oh, and we can perform manual payment on client's behalf if they have a failed payment on their Ad Account. For literally everything else, we depend on the Internal Team to help us help you. This includes re-enabling your accounts and removing restrictions.As Agents, we can't enable your account for you, remove the restrictions, or submit another appeal for your behalf if the asset has already reached the maximum amount of appeals (which is usually 1, rare cases 2). For some issues, we don't even have escalation paths to submit. 2FA for unmanaged clients is unsupported, most \"organic\" things as well, and they only care if you are a paying advertiser. We don't have any forms we can fill in for account access issues. Literally for every decision that must be done on your assets, we have to rely on the Internal Team who are so frustrating to be working with, because I swear, half of the time they are just looking for excuses not to do THEIR job.So if you contact the support and your appeal is rejected, or your request cannot be fulfilled, please know that this is not the fault of the Agent, or from lack of trying to help you, but the fault of the Internal Team who are supposed to be \"backing\" us, but more often than not come across as heartless cold monsters. We have to BEG them for updates about the escalation cases. And majority of the time, they will simply ignore us.\n\nI've encountered countless of cases where people are losing their livelihoods, their documented memories, friends, connections, their social platform and place to keep in contact with their family. They lose these to hackers, and ridiculously broken AI / BOTs which flag accounts falsely and disable them because of false flagging. I've seen the CLEAR evidence of them and I've explained it in great detail with screenshot proofs to the Internal Team, showing them that the restrictions are not the fault of the user and could prove it... And then the Internal Team either replies with an automated message of \"these type of restrictions need to be self-appealed through this form:(link to extremely broken form)\" or template answers saying things like \"This account violated advertising policies/community guidelines and we will not be re-enabling it. This is out final decision.\" Or even if they DO answer by some miracle, over half of the times it feels like they don't even read what we are saying!\n\nAnd then they leave us Agents to take the blame for those decisions, when we had nothing to do with it. I've been yelled at, called incompetent, threatened to be killed, been threatened with client suicide, all because the Internal Team refuses to do their job properly and help me help the clients.\n\nNot to mention, many of these \"self-service\" links are broken to the core, especially the one to appeal the decision on disabled Instagram. They either leave users encounter errors, don't go through at all, or when they do go through, the non-existent review team will let those appeals expire, leaving many accounts \"permanently\" disabled, which then can only be recovered by a competent AG by what I've now witnessed in this subreddit.\n\nSorry, this was not meant to turn into a rant, but I, as a soon-to-be-ex-employee, am so incredibly angry and frustrated with this company as well. It's one of the main reasons I am now quitting this job.  It's caused me stress, mental health breakdowns, chronic Insomnia. I've sobbed because I had to log into work. And why I wanted to bring some insight on how messed up the internal works are as well. So my request for you would be to treat those support Agents with just a bit of kindness, as we are literally powerless to do anything properly. We're not given the proper tools to do our job. Even the surveys you get in the end of your cases is not about the company, but about the Agent itself. If they get too many \"No\" surveys, they will lose their bonuses and if the scores get too bad, will be fired. They are making us \"honey talk\" through the surveys or make us desperately hide the surveys so we don't get a \"no\" that literally takes more money off our already minimal wage.\n\nAnyway, to contact with the Support directly, you'll want to do it viahttps://www.facebook.com/business/help/support. If you don't have access to it, you can ask a friend or colleague if they do, as they may be able to reach out on your behalf. But please know that the Internal Team is only really interested if you are a paying advertiser and 95% of the times refuses to help with anything that's not advertising related, so personal user profiles, groups, non-advertising Pages, personal Instagram accounts, everything not connected to advertising...\n\nHere's all the external forms that we have access to:\n\nBANNED, DISABLED & RESTRICTED ACCOUNTSRequest Review of Restricted Ad Accounthttps://www.facebook.com/help/contact/2026068680760273Restricted Advertising Accesshttps://www.facebook.com/help/contact/956571484692817Disabled Payments & Ads Managerhttps://www.facebook.com/help/contact/391647094929792Request Review of Restricted Business Accounthttps://www.facebook.com/help/contact/2166173276743732Request Review of Restricted Pagehttps://www.facebook.com/help/contact/2158932601016581\n\nMy Personal Facebook Account Was Disabledhttps://www.facebook.com/help/contact/260749603972907My Instagram Account Was Deactivatedhttps://help.instagram.com/contact/606967319425038Monetization Policies Appealhttps://www.facebook.com/help/contact/151371415454526\n\nPAYMENTS SUPPORTPayments Supporthttps://www.facebook.com/help/contact/1937556639801443Facebook Ads Paymentshttps://www.facebook.com/help/contact/649167531904667Instagram Ads Paymentshttps://help.instagram.com/contact/973016909714428Facebook Payout Supporthttps://www.facebook.com/help/contact/1540812909361378Facebook Payment Support for Monetizershttps://www.facebook.com/help/contact/478646722539653Facebook Payment Support for Media Monetizershttps://www.facebook.com/help/contact/2318408381781894Ads - India TDS Supporthttps://www.facebook.com/help/contact/816921465360613Get Games Supporthttps://www.facebook.com/help/contact/146600035918755\n\nBUGS & PRODUCT SUPPORTReport an Issue with Facebook Pageshttps://www.facebook.com/help/contact/164405897002583In-Stream Ads - Bugs and Product supporthttps://www.facebook.com/help/contact/367451123589196Give Us Feedback About a Facebook Featurehttps://www.facebook.com/help/contact/268228883256323\n\nHACKED / IMPOSTOR ACCOUNTS & OTHER LOGIN ISSUESReport Compromised Facebook Accounthttps://www.facebook.com/hackedReport an Impostor Accounthttps://www.facebook.com/help/contact/295309487309948Facebook Locked - Ineligiblehttps://www.facebook.com/help/contact/378730658849959Facebook Email Already in Usehttps://www.facebook.com/help/contact/255904741169641Instagram Email Already in Usehttps://help.instagram.com/contact/151081798582137Didn't Receive Confirmation Emailhttps://www.facebook.com/help/contact/221689587951755Report Problems With Creating a Facebook Accounthttps://www.facebook.com/help/contact/730681660635800Report an Issue with Facebook Mobile Textshttps://www.facebook.com/help/contact/352512044767949\n\nCOPYRIGHT, TRADEMARK & PRIVACY REQUESTSCopyright Report Formhttps://www.facebook.com/help/contact/copyrightformReporting a Violation or Infringement of Your Rightshttps://www.facebook.com/help/contact/634636770043106Trademark Report Formhttps://www.facebook.com/help/contact/trademarkformCounterfeit Report Formhttps://www.facebook.com/help/contact/628238764025713Copyright Appeal Formhttps://www.facebook.com/help/contact/1653629651334864Legal Removal Requesthttps://www.facebook.com/help/contact/319149701968527Report a Privacy Violationhttps://www.facebook.com/help/contact/144059062408922\n\nID, AGE, PROFILE & PAGE VERIFICATIONConfirm Your Identityhttps://www.facebook.com/help/contact/515009838910929Please Verify Your ID Informationhttps://www.facebook.com/help/contact/199052956872279Changing Your Namehttps://www.facebook.com/help/contact/1417759018475333My Name Wasn't Acceptedhttps://www.facebook.com/help/contact/237843336274237Instagram Help Us Verify Your Agehttps://help.instagram.com/contact/730583250290732Instagram Request to Change Your Birthdayhttps://help.instagram.com/contact/735502576838983Verify Your Facebook Page or Profile (Blue Badge)https://www.facebook.com/help/contact/295038365360854\n\nAPPLICATION, CONSENTS & SPECIAL REQUESTSOnline Real Money Gaming Onboarding Application Formhttps://www.facebook.com/help/contact/691814950897009Prescription Drug Advertiser Applicationhttps://www.facebook.com/help/contact/794928850913577News Registration Supporthttps://www.facebook.com/help/contact/625258228876857Get Donations Supporthttps://www.facebook.com/help/contact/162031714239823Get Fundraiser Supporthttps://www.facebook.com/help/contact/495873587559429EU-U.S. and Swiss-U.S. Privacy Shield Inquirieshttps://www.facebook.com/help/contact/1125116460909330Special Request for Medically Incapacitated or Deceased Person's Accounthttps://www.facebook.com/help/contact/228813257197480Memorialization Requesthttps://www.facebook.com/help/contact/234739086860192\n\nREPORT CONTENT & ACCOUNTSReport Suicidal Contenthttps://www.facebook.com/help/contact/305410456169423Regulation on Dissemination of Terrorist Content Online (EU) Removal Orderhttps://www.facebook.com/help/contact/265974195717630Report an Underage Childhttps://www.facebook.com/help/contact/209046679279097Report An Inmate's Accounthttps://www.facebook.com/help/contact/564493676910603\n\nThank you.~ Your friend.",
  "author": "Arnie1701-D",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I realized now I forgot the \"Basic guidelines\" I promised, but the thread was already getting very long.My recommendation to you would be to not give up. Do not pay money to the hackers. Don't go quiet. Speak out and loud, and if needed, get the legal help you need to make Meta listen. If you give up from the first \"pushbacks\" from the Internal Team, they will never give you back what you are owed.Please stay strong. And remember to be kind, even if it's to yourself."
    },
    {
      "author": "DoDoAllTime",
      "timestamp": "",
      "body": "Anyway, you have been a great help to us.Your answers to some difficult things really help me.I will always remember you and be grateful."
    },
    {
      "author": "Azuuue14",
      "timestamp": "",
      "body": "Thank You for all the help, we will do our best for not to give up😁"
    },
    {
      "author": "FakuAkuTv",
      "timestamp": "",
      "body": "Thank you for your help. and good luck with your next job!hopefully you get what you want :P"
    },
    {
      "author": "wildmstie",
      "timestamp": "",
      "body": "First, let me say that I really appreciate you being human and decent enough to come forward and tell us what you have.My personal account of eleven years has been disabled. They said I was disabled for violating intellectual property rules, but they never told me what post(s) they had a problem with or gave me a chance to correct it. I lost eleven years worth of personal photos and data because the download data button doesn't work. Like others here, I contacted the California AG and got an email from Rupert saying that my account would be restored if I supplied a new email address. I did. Over a month later, I got a response saying that the correct decision had been made and my account would remain permanently disabled.Is there anything left I can do? Or at least some way to get my photos?Again, even if you can't help, I really appreciate that you are talking to us."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "DMed you. Pls view"
    },
    {
      "author": "1TimeT00Many",
      "timestamp": "",
      "body": "I was hacked by someone across the world, they posted CP and got my account  instantly disabled.Most of the Facebook links require an active Facebook account to use though.Or ones that a submitting forms say this \"We Cannot Review the Decision to Disable Your Account Your Facebook account was disabled because it did not follow our Community Standards. We have already reviewed this decision and it cannot be reversed.\"Instagram route says this. \"Your Form Couldn't be Sent Log into your Instagram account for more information about how to request a review.\"In less than 20 hours my account was permanently disabled."
    },
    {
      "author": "valencupherrada",
      "timestamp": "",
      "body": "That's exactly what happened to me, i even pay ads to talk with different agents but none of them could help me, even when I found agents who were really trying. Even the forms listed here say the same, ''too much time has passed''  My account has been disabled for 4 months now."
    },
    {
      "author": "MoYuki1223",
      "timestamp": "",
      "body": "Thank you for taking the time to give us your insight"
    },
    {
      "author": "Arnie1701-D",
      "timestamp": "",
      "body": "Thank you for helping us understand what is going on back there. Appreciated."
    }
  ]
}