{
  "subreddit": "TalesFromYourServer",
  "post_id": "rgwr3m",
  "title": "Checking IDs for people obviously of age.",
  "body": "This is a thing that drives me nuts. Had a table today of (probably) a mother father and their adult kids. So I card the 20 something and not the woman who’s clearly in her mid to late 50s.\n\nAnd I get the standard “oh why didn’t you card me you want to check my id lolololol”.\n\nNo lady you’re obviously old enough to have birthed communism stop making this weird for me.\n\nThis is a thing I gotta do to comply with the law not a fun little game at the beginning of dinner. And if your fucking license was expired and I saw it you wouldn’t be drinking so settle down.",
  "author": "Snargleface",
  "comments": [
    {
      "author": "MMorrighan",
      "timestamp": "",
      "body": "My brother had this happen to him, he carded the younger woman and when her mom made a joke he said ok so let's see yours then....she didn't have it on her which meant they couldn't be seated in the bar and had to move."
    },
    {
      "author": "Dgnslyr",
      "timestamp": "",
      "body": "I had this happen to me as well. Mom was like \"oh didn't ID me?\" Alright mam, can I see your ID? Oh don't have it with you? No Bud Light for you. I know your clearly of age but the thousand dollar fineable law says I can't if you don't have it. It's in your car? Ok, see you soon."
    },
    {
      "author": "Lavanger",
      "timestamp": "",
      "body": "Haha same, mom wasn't to old but clearly over 21 (prob mid 30's), I Id her daughter, she says she just turned 21 but doesn't have an Id, ok no drink for you, then the mom turns around \"oh you need mine too?\" I said, no I just need hers, she's like \"how old do you think I am?\", you know women hate to be told they are old, so I just said \"okay show me you id\",.. \"Oh I don't have one\".. okay lady you just lost your drink for trying to pretend you're a teen.Of course they didn't tip."
    },
    {
      "author": "Kmic14",
      "timestamp": "",
      "body": "LOL play stupid games"
    },
    {
      "author": "sweetpotfryfill",
      "timestamp": "",
      "body": "idk what your state laws are, but my go-to when carding someone young-but-of-age is telling them “you’re not 16 but you’re not 40 either.” if there’s ever like a parent or someone with them that’s clearly above 50 i always throw in “you’re like a cool 41,” which almost always works. but i have learned the hard way a few times that sometimes it’s easier to just card them all."
    },
    {
      "author": "somethingcomforting",
      "timestamp": "",
      "body": "Someone else on a similar thread commented something like “I just carded you last week on your 21st birthday, did you think I could forget you?” And it’s so genius I’ve been using it since"
    },
    {
      "author": "Arokthis",
      "timestamp": "",
      "body": "My sister works at Mal-Wart. She cardseverybodythat wants anything age-restricted. Her line is\"I don't care if someone has white hair or a walker and have more wrinkles than an elephant's ass. I'm not getting stuck with the fine for not getting a valid ID.\"They don't put her on the checkout lane where the cigarettes are any more."
    },
    {
      "author": "alexia2390",
      "timestamp": "",
      "body": "I used to card everyone and when they got mad, I told them my computer doesn’t care what you look like so I still need that ID. (Grocery store where we had to scan in the IDs instead of just look at them)"
    },
    {
      "author": "LeprosyMan",
      "timestamp": "",
      "body": "I’m 37. I don’t care if you card me or not. What I do have, though, is my ID on me at all times because I’m a fucking grown-ass semi-responsible man."
    },
    {
      "author": "Snargleface",
      "timestamp": "",
      "body": "I go with theoreticals and card everyone. \"If a police officer came in here and was having a bad day, he could check the ID of everyone in here drinking. If you didn't have a valid one on you, I could still get in trouble even if you're over 21.\" Also, holy shit am I glad I left alcohol service behind."
    }
  ]
}