{
  "subreddit": "HelpMeFind",
  "post_id": "1jh2iil",
  "title": "Browser/Desktop Age Verification?",
  "body": "Looking for a website, web application, or computer software that can verify users' age as 21+. I know of Yoti ID and other Android/Apple apps, but I'm trying to find something that works for people who don't have access to phones. Would prefer something that isn't a \"solution\" because I'm not a business owner",
  "author": "niineofswords",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »u/niineofswords,you must add a comment in this post before anyone will see it.   Your commentMUSTinclude the word \"searched\" and detail what searches you've done.   Your post will not be visible until you do so.  Your inbox should have more details orhere are general  instructions.Supply as many details as you can.  These include, if applicable, but are not limited to: size, origin (store, geographic location, country), age/year acquired, and any writing on the item. Additional pictures can be added as a comment in this post.If you are actively asking for help searching for this elsewhere - another sub or website - link to that search as well to avoid duplicating efforts.Remember to replyFound!(include the exclamation point) to the comment that gives the answer. If looking for an item to purchase,do not click on links sent to you in private messages, and report such to the moderators.For all participants, remember that all comments must be civil and helpful toward finding an answer.If you're working off someone else's comment to build on an answer, reply to that comment, do not make a reply direct to the post.Jokes and unhelpful responses will earn you a ban, even on the first instance. If you see any comments that violate this rule, please report them.Click here to request a reminder for this postI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "niineofswords",
      "timestamp": "",
      "body": "I've searched and scoured Google, so I'm hoping I'm just missing something and this actually exists. I've been using Yoti ID for age verification so far, but it seems impossible to find anything similar that isn't for businesses"
    }
  ]
}