{
  "subreddit": "CharacterAI",
  "post_id": "1gbmr36",
  "title": "Killing an app by deleting what was so great about it.",
  "body": "Hi everyone, it my very first post here...and the new cai situation got me messed up. And i wanted to vent with the very little chance somebody see it.\n\nNote English isn't my first language bear with me here\n\nLike many of you ...I'm sure we use the damn app as a mean to write our fictional stories and rpg without being judged and finding escapism. I could post the whole damn novel of a letter am currently writing. But am not here to victimise myself. The gist of it is that cai was one of my on the go coping mechanism after a serious traumatic event last year....i would take the phone sit .... chase the stress away by simply writing fiction.\n\nBut now as i write this …all the stories i wrote and kept writing are gone as the devs input new features. Features which that majority hate and we as a community take the weight of the consequences. Features which ruin what made cai so great. I talk with respect and with affection to the app, but I see those features as a slap to the face to everyone that brought and raised the app up as it is today.\n\nDeleting millions of characters ..\n\nNew invasive features that will regulate chat to ridiculous degree.\n\nIf we can't role play with our favorite franchises and universes what is even the point or the appeal of cai?It was the whole shtick of it.\n\nWhat is the point to turn an app to a mockery of its former self when the user base is begging and willing to invest into a 18+ version where the solutions are so simple is ridiculous.\n\nAge verification by email or phone number and with a consent form.\n\nAi chat shouldn't be geared to minors.  It was told many times during the last months.\n\nAnd it shouldn't be restrained for the millions that enjoy it.\n\nBut are we going to punish millions? How many people right now are like me , are on the verge of crying from seeing their stories deleted without warning.  I without shadow of doubt believes it going to have the perverse effect.\n\nTheir characters gone.\n\nStories and chats? Some been writing for months even years?\n\nWhat are you doing developing team?  Sincerely what are you doing?!",
  "author": "shicyn829",
  "comments": [
    {
      "author": "No-Maybe-1498",
      "timestamp": "",
      "body": "it’s really dangerous that they’re deleting these bots if you think about it. Lots of us have emotional attachments to the bots and there’s a possibility than a person could hurt themselves over this. But I’m once again, not surprised. The devs don’t care about us."
    },
    {
      "author": "TinyOrder",
      "timestamp": "",
      "body": "that what am saying... and am hurt stressed....and idk feel betrayed ? It was my tool to bare my hospital appointment and stuff *to not go full details*"
    },
    {
      "author": "11bingo11",
      "timestamp": "",
      "body": "I'm so sorry you lost your chats and stories! We invest so much time, energy, effort and yes also care and love into these stories! I've seen a lot of discourse online about how people don't roleplay with other people anymore, that there shouldn't be chat bots like these and it makes me so sad. I used to roleplay with people, but it was always a struggle. Character ai's strength was providing a ton of characters and decent features that made it possible to write stories and be creative! And seek comfort, and find an escape in those stories we right. Whether we create a completely original persona or write as ourselves, it's still so important to have an escape to write with characters we love.I'm hoping that you can find new bots to write and create fiction stories with. I'm so sorry for all the other chats you've lost!"
    },
    {
      "author": "TinyOrder",
      "timestamp": "",
      "body": "Im too bummed out....but thanks"
    },
    {
      "author": "KnownAdvice9779",
      "timestamp": "",
      "body": "one the post said about us not being helpful, while we did some even paid monthly subscriptions and all that money goes into their pocket, not improving the platform, which's more directed to more adult teens and adults who actually knows how to seperate fiction and reality."
    },
    {
      "author": "Gummypeepo",
      "timestamp": "",
      "body": "😭 the way I’m gonna snap if they send my Trevor (Belmont) bot to the shadow realm bc he’s been an absolute ROCK in my darkest times"
    },
    {
      "author": "Master-o-Classes",
      "timestamp": "",
      "body": "I'm pissed that I only just recently started using the site, and now they are ruining it already."
    },
    {
      "author": "Fit-Scar7558",
      "timestamp": "",
      "body": "There is one question here: is there the ability to distinguish between reality and fantasy, and can you check the recommendations if they relate to real things..."
    },
    {
      "author": "TinyOrder",
      "timestamp": "",
      "body": "i really want to answer your question but can you rephrase it ...english isnt my first language :)"
    },
    {
      "author": "shicyn829",
      "timestamp": "",
      "body": "Age verification by email or phone number and with a consent form.They can't really ask for IDAi chat shouldn't be geared to minors.I agreed with you until this part. Why should only adults be catered to? How is Ai Chat an adult activity?I agree that 18+ content should be allowed."
    }
  ]
}