{
  "subreddit": "Mercari",
  "post_id": "1azwy7q",
  "title": "Id verification",
  "body": "So I recently sold two items both approximately for $40 they were delivered and I got rated. However when I try to transfer my balance it says activity not allowed and to verify with an ID however, I don’t have an ID is there a way to get around this and get my money or do I need to have an ID or drivers license to get the money out of Mercari",
  "author": "Prior_Teacher4583",
  "comments": [
    {
      "author": "Environmental-Sock52",
      "timestamp": "",
      "body": "If you get an ID yes."
    },
    {
      "author": "Ccdynamite23",
      "timestamp": "",
      "body": "Are you under age? I’m guessing that’s why you don’t have any sort of ID. Most people 18 and up have something, driver license, state ID, passport, military ID, etc. if you are under age, you are screwed. You won’t get that money because you have to be over 18 to sell on Mercari & have ID to make the deposits & get tax info sent to you"
    },
    {
      "author": "ShitpostCentral423",
      "timestamp": "",
      "body": "Posts like this are why I hate that Reddit is flooded with children now. It’s policy… not some conspiracy, and if you’re under 18 why are you selling to begin with?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "what are you talking about? no body a kid and if you dont like the app or what you see then it aint for you so you can delete the app and stop crying 😂"
    },
    {
      "author": "Isoldmykidforagram",
      "timestamp": "",
      "body": "You need some form of ID. I used my permit, it works. Drivers license, permit, passport, State ID card, or Military ID"
    },
    {
      "author": "AffectionateCup8812",
      "timestamp": "",
      "body": "Go to the DMV and get an ID or learners permit, it's like $15, you'll need an ID eventually anyway"
    },
    {
      "author": "Longjumping-Chef-936",
      "timestamp": "",
      "body": "If you don't have the money to get a temporary driver's license (not every state has them but in mine you can get at 16 years old and you have to take a test on the bmv computers) you can see if your state has free state ID's. It's not a driver's license but it is a good alternative if you don't drive. I think in Ohio they're issued for either 5 to 10 years or 4 to 8 years. It's been a minute since I looked at the website."
    },
    {
      "author": "Isoldmykidforagram",
      "timestamp": "",
      "body": "Permits work as well"
    },
    {
      "author": "girlfuckyou",
      "timestamp": "",
      "body": "I received this same prompt after taking a break from selling for almost year. Didn’t want to bother with sending my info again since my account has always been in good standing. A few days later, the prompt completely disappeared on its own and I was able to sell again! Maybe just wait a few days."
    },
    {
      "author": "Prior_Teacher4583",
      "timestamp": "",
      "body": "It's Bull shit  a way for identity to be stolen ,merceri is on some BS lately and the instapay bs that take 3 dollars for you to get paid as if they aren't receiving enough money !!! They have so many red flags I've had 2 items lately that they said I didn't do shipping correctly and kinna funny cause buy paid shipping but merceri stole over $100 in shipping fees from me !!!  Caution they are under investigation too with USPS"
    }
  ]
}