{
  "subreddit": "technology",
  "post_id": "1fy53ep",
  "title": "EFF to Fifth Circuit: Age Verification Laws Will Hurt More Than They Help",
  "body": "",
  "author": "EmbarrassedHelp",
  "comments": [
    {
      "author": "Bad_Habit_Nun",
      "timestamp": "",
      "body": "Yeah but it would easily link people's browsing habits and data to their real identity, saving businesses who sell that data a ton of time and effort. That's the real point."
    },
    {
      "author": "dethb0y",
      "timestamp": "",
      "body": "Don't forget letting the government snoop even easier on what citizens are up to."
    },
    {
      "author": "EmbarrassedHelp",
      "timestamp": "",
      "body": "That's the real point.A major driving force behind these age verification laws are companies selling age verification services. They want to get richer quicker by having the government mandate their services."
    },
    {
      "author": "Voxbury",
      "timestamp": "",
      "body": "The government would never allow that info to be sold. What’s that? It’s been “hacked” for the fourth time?Just its existence is a hazard to privacy."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It also opens up a whole new avenue of scamming, because you are training people to identify themselves for things they shouldn't have to."
    },
    {
      "author": "EmbarrassedHelp",
      "timestamp": "",
      "body": "It also opens up a whole new avenue of scamming, because you are training people to identify themselves for things they shouldn't have to."
    },
    {
      "author": "ConfidentMongoose",
      "timestamp": "",
      "body": "Parents just need to be better parents. Allowing your kids to browse the web unsupervised, not tracking what they are doing online, what they are watching, who they are talking to.Parents these days are so proud that their babies know how to swipe on tablets and smartphones..."
    },
    {
      "author": "BearlyIT",
      "timestamp": "",
      "body": "A surprisingly number of people think parents are too busy to supervise the internet or devices they purchase, and too busy to even learn how to…. but somehow think a weak law will keep kids safe on the ‘World Wide Web’."
    },
    {
      "author": "Tumblrrito",
      "timestamp": "",
      "body": "Especially love how I get age verification checks for states I do not reside in that totally lock me out"
    },
    {
      "author": "EmbarrassedHelp",
      "timestamp": "",
      "body": "People may try to argue that verification is already successfully used for financial services and alcohol, but nobody cares if you are caught doing either of those things. Plenty of people do however care way too much about what you view online, and what you do with your genitals."
    }
  ]
}