{
  "subreddit": "BORUpdates",
  "post_id": "1ief4x9",
  "title": "A child faked her age to go out with me",
  "body": "Originally posted inr/IndianTeenagersby user No-Quarter-8559\n\nOriginal: Jan 11, 2025\n\nUpdate (in post itself)\n\nStatus: concluded\n\n*** Editor's note for context:\n\nThe sub is for teenagers in India. So users are all under 20.\n\nMarco -- Malayalam language (South Indian) film. Rated 'A' (18+) by censor board for violent gore content. Some theatre chains like PVR require ID (called Aadhar) to watch such films.\n\nOOP wrote without any punctuation. So added full stops/periods for better read.\n\n-----------------------------------------------------\n\nOriginal -- a child faked her age to go out with me\n\nI have been talking to girl for about 2 weeks and for context im 19 this year. im goona be 20 and the girl told me her age is 19. now we went to the first date yesterday and we went to restaurant. and she was nice and all. and we even started holding hands and all. but we went to watch the movie macro but it was \"A\" rated. and it was booked in pvr and the guards had to see our id , i showed them i got clearance but when she took out her phone and showed the guards her Adhar they told her she cant enter cuz she is below 18. i mean she was 15 for fuck sake. i mean my niece is elder than her . i was like wtf dude and for obvious reasons. i dunno why she started crying. then i booked a cab for her and ghosted and blocked her , i mean what the fuck was that\n\nComments:\n\nbloodypetal-- You dealt with it maturely, just like an adult should.\n\nI sometimes wonder, how some parents are so absent in there children's life that they don't know whats going on and it's a shame.\n\nOOP -- first of all why the fuck a 15 yr old have iphone 16 and bumble/hinge on her phone\n\nWaste_Locksmith_2193-- Even her iphone is 16😭\n\nFuriousFoe1001-- \"Even her iphone is 16\"This cracked me up 😂\n\nAbdul9-11:Craziest shit --- she's sixteen, have an iphone ( ohk) but hinge and bumble in her phone.. wtf man L parents failed her\n\ncallmethelonewxlf-- Who tf watches Marco at a date 😭😭\n\nOOP -- we were out for atleast 7 hour. so for timepass had to book a movie\n\nUnluckyPriority8880-- Actually Marco saved you...\n\nKING_Gamer_YouTube-- Good decision, she had no reason to fake her age\n\nEdit: 15!? 💀\n\nHow the hell did you not get suspicion?\n\nOOP -- nowadays 30 yr old like like 20 and 20 yr old looks like 30 . what can i do ?\n\nOmnipresentDonut123-- You dealt with it super maturely op. I doubt most other people would've handled the situation well (me too, probably, I'm phenomenally stupid). Could've turned out much worse if you'd found out even a few days later. Would recommend that you atleast check-up on her to make sure she doesn't do anything like self-harm, or try to frame you wrongly for taking out a minor.\n\nI'm guessing you probably met her on a dating app? If yes then that's even more fucked up, they should seriously add age verification. Stay safe op, and other bois too\n\nOOP -- yup anyone can put any age. man dating app should a age verification\n\n-----------------------------------------------------\n\nUpdate\n\nthe girl tried to contact me several times. and just 1 hour ago i thought of talking to her. and first of all idk man why girls start crying without any reason , goddamm i hate it. i explained her that whatever she did is not right. like lying about your age then roaming around with a guy who is 19yr old , i told her if there was any other guy could have taken advantage of you. and told her she have block me and leave me alone cuz this is not right to which she agreed\n\nREMINDER: I am not OOP. Do not comment on original post or harass OOP.",
  "author": "Hobbit_Lifestyle",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Reminder: There is a ZERO tolerance policy for brigading or encouraging others to brigade. Users caught breaking this rule will be banned immediately. No questions asked.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "kriever7",
      "timestamp": "",
      "body": "I gotta say...The \"Even her iPhone is 16\" comment did crack me up."
    },
    {
      "author": "gardengeo",
      "timestamp": "",
      "body": "I found that comment really hysterical and it was what prompted to put a BORU. I also found it amusing how exasperated OOP was in reaction to a girl's tears. Teenage reactions can be really funny looking back as an adult. 😂😂😂"
    },
    {
      "author": "Vey-kun",
      "timestamp": "",
      "body": "Lets wait for iphone to release legal model, 18."
    },
    {
      "author": "xloHolx",
      "timestamp": "",
      "body": "I remember an Indian kid from one of my freshman classes in high school- bro had a full beard and mustache at 14. Easily could’ve mistaken him for 30 lol"
    },
    {
      "author": "kriever7",
      "timestamp": "",
      "body": "If a 15yo girl who looks 15yo told me she was 19 I would believe her. Because there are older people who look younger.I don't know if the dude should 've asked her id or something, I muself don't think he did anything wrong."
    },
    {
      "author": "Hobbit_Lifestyle",
      "timestamp": "",
      "body": "Yes, when I was 20 I looked like a teenager, I was so frustrated by people asking me \"so, you're in high school right?\""
    },
    {
      "author": "LindonLilBlueBalls",
      "timestamp": "",
      "body": "I'm glad he told her other men would have done \"other things\" to her once they found out her age.Kids always want to act like adults, but don't realize that can lead to adult consequences."
    },
    {
      "author": "Hobbit_Lifestyle",
      "timestamp": "",
      "body": "That's a good man here. The girl was very, very lucky."
    }
  ]
}