{
  "subreddit": "Superstonk",
  "post_id": "rqmdyc",
  "title": "Lets talk about NFTs, DAOs, Web3 and the metaverse. How does it work for DUMMIES?",
  "body": "\n\nHi everybody,\n\n\n\nWith the current hype, lets talk about NFTs, DAOs, Web3, the metaverse and why is this the future.\n\nI would like to put emphasis on NFTs being mostly value (and will be calculated according to their fundamentals, depending on the project and service is providing, what is backing it) can be swapped, exchanged and transformed into currency (could be into fiat currency, but more like a smart bank check that is flexible) for the next era, a middleman facilitator to exchange a product, service, fulfil a need. NOT the main product (as is being used currently in form of \"art\", as the first way to use it, but no the future potential of it.\n\nNFTs have the potential to be the internal currency of a DAO (decentralized autonomous organization), just like dollars are to a business like GameStop to trade items from the website. NFTs are a new better version of bank checks since they are smart.\n\nCan be used like currency (after is traded, since is value), but also I think is better to see them as smart checks (a check which individually has a separate value).\n\nLets dig a bit more into this amazing world :)\n\nNote that NFTS have many different application and not just this, but this in particular is the one that will help changing the current corrupted financial banking system (fractional banking based in fiat).\n\nEdited: thanks to an ape in the comments to help me clarify this part.\n\n\n\nSince most of those concepts are hard to grasp and tend to be misleading or a tough to understand.\n\nLet’s me smooth it out for you :)\n\n\n\n\n\nThis has been around lately, so what is Web3 and how is it different to the internet we know it?\n\nRight now we are living in the Web2 world and what means is that the current state of the internet as a whole is basically in an interactive read only (web1 was static read only information), with interactive means that you are able to upload content like videos, photos, chat and interact in reality time.\n\nYou can upload information, read it, make copies of it, but you can’t verify it to the internet and no one is able to “verify”, \"validate\" or  \"own\" the information.\n\nThe era ofinformation (read only interactive) is web2, without an external source to confirm any of this data.\n\nhere is a bit more in depth information and comparisson between Web1, Web2 and Web3\n\nhttps://www.geeksforgeeks.org/web-1-0-web-2-0-and-web-3-0-with-their-difference/\n\nNow imagine that there is a way that a third party is able to confirm andvalidatepieces of data, confirming that the data is correct and assigning it a unique space in a blockchain.\n\nThat third party is a ledger-based blockchain, the one best suited to perform this duty currently is Ethereum (that’s why GME is working based on etherium).\n\nBut what do I care about validation? How is that affects me in the real world?\n\nThis opens a huge door of opportunities, let’s explore some.\n\nWeb3 will evolve systems like a country registration of IDs for example.\n\nCurrently there is a project calledENSEthereum Name Service, this project allows anybody to link their Crypto Wallet to their Ethereum identity (ENS), your name is minted in an unique block (NFT) and no one else can have that name, you will have effectively anunique validated and verifiable IDon the blockchain.\n\nSo far it’s your name.eth (example, Melon.eth).\n\nThat ledger can effectively replace Passports and mint your Identity as anNFT (Holberg, principal engineer at GameStop) design this NFT application called HODLBERG.\n\n\n\n\n\n\n\n\n\nNow imagine you been able to **validate** (verified by the entire Ethereum network) yourdrivers license online, the equivalent of having millions of people looking at your driving license and saying Yep Yep that’s real, or Nop Nop is not.\n\nCreating that UNIQUE block (no one else can have your same license number or document) is an NFT, you can link it to your wallet and all browser will be able toconnect with your wallet and confirm you identity and your drivers license, on the internet, for anyone to see and verify, decentralized.\n\nNo more queues on the airport, you can easily sign any document with your ENS Melon.eth and be as valid as your passport, country ID or driving license, it’s verified by a decentralized authority.\n\nLet’s go to a another example.\n\nWith this you can create a UNIQUE entry of every single car, every car has an unique manufacturing VIN number, I can create an UNIQUE block NFT with those unique features and name my car, but also I can link it with a proof of ownership such a receipt or another registries.\n\nThere can’t be two cars with the same VIN number and characteristics (physically), also now I can link that NFT to my wallet and trade my ownership online.\n\nValidated. With the security of the entire Ethereum blocks chain network.\n\nThis are just 2-3 examples. But the limits….. no limits. The future.\n\nAnother word that needs to be understood is Metaverse.\n\n\n\n\n\nIt’s basically abridge between reality and web3 using Augmented reality or virtual reality, the attempt to replicate real life experience but digitally, like going to the movies, or a concert or shopping at the mall.\n\nWith web3 you can validate your identity (yourself) online and use your NFT to trade for a ticket, pair of shoes, a car, electronics and anything you imagine digitally and real life.\n\nSo you would be able to go to a virtual GameStop store and talk to a customer rep or an NPC and preview items on a digital form in 3D, it will evolve into looking like reality itself, not far from ready player one hu?\n\nLet’s continue.\n\n\n\n\n\n\n\n\n\n**DAO stands for (Decentralized Autonomous Organization) pretty much like a regular business/project but the intention is not to have a single controlling party/owner. Hence decentralized and autonomous.**\n\n\n\n**This projects will have a set of rules (smart rules) set by the creator (taylormade thinking about the community and shareholders to serve). The people that wants to participate will follow those guidelines according to the project.**\n\n\n\nMarkets are based on trust, so the Creator needs to make sure that the rules are fair for everyone and also that the project purpose can attract and benefit a community of shareholders with a common interest; could be anything.\n\n\n\n**The more people and bigger community, more value and resources are throw into the DAO, more brains giving feedback and helping, faster and bigger expansion to similar or new ventures by the entire community, not  just the creator, more trades happening so everyone gets their share from more pies, the project will grow and so is the Value of their NFTs, the tokens.\n\n\n\nThe opposite can happen if the project is not up to the standards, if doesn’t satisfy a need, low quality products and just like a bad managed company or a scam, I’ll eventually go down, so it’s about trust.\n\n\n\nWhere to put money in? That’s up to you to find out according to each project fundamentals and purpose, which one adapts to your knowledge, expertise, hobbies, likes, feeling or however you make decisions. Then you can support your DAOs, each NFT you will have will be part of a DAO, so dig on what the project is about before deciding to invest or not.\n\n\n\nAlways educated decisions are problemless decisions :) that’s my opinion\n\n\n\nRemember that these are smart contracts/projects, means that the idea is to Taylor made each contract according to the creator, the community is aimed for and  the project itself to survive and be sustainable.\n\n\n\nA more fair market. So the bigger the project and more value/currency is inside, the more valuable the DAO will become, the more will grow and expand.\n\n\n\nJust like companies work in real life right now, just that doesn’t have to answer to a government first too.\n\n\n\nit’s going to be easy for everyone to adapt since it’s pretty similar, just clean and transparent.\n\nLets go to nfts.\n\n\n\n\n\nLook at it as smart \"money\", a money that is smart and can change in value constantly (thats also why is so important to get into a \"money\" with strong fundamentals that the DAO provides for good value and stability), just like you rather to have US dollars or Euros backed by a bigger goverment (DAO) rather than for example a peso that might lose value overtime faster.\n\nWhere all this come from? From a need for decentralization.\n\nLet me explain in a simple version about the future of markets, finance and GME.\n\nPeople are often seeing crypto as a casino to go in there and bet to make money, not actually basing themselves on the project fundamentals.\n\nFundamentals in a project is what makes the project (their approach to solve a need), the service/product they are providing, how is gonna perform towards the future and how is providing the solution for that need.\n\nRight now everyone has a need for a different financial sector due to the current market being corrupt and manipulated based mostly in politics and whatever the fed, HF, whales and central banks do with it (I recommend you to read my other posts about markets and The Infinite Money Glitch).\n\nThat completely disconnect the market from the fundamentals and performance of the projects/companies.\n\nSo there is an urgent need to move to decentralized and bring back more democracy and global consensus instead of the 0.00001% controlling everything.\n\n**Cryptos L1** (like Bitcoin or Ethereum or basically all cryptos) have 2 big problems.\n\n1: **Transaction speed** (Bitcoin can do 7 transactions per second, Etherium 30 per second), compared to **MasterCard that does 5000 per second**, can’t be a viable option to use for a lot of people or a lot of transactions, will create a massive queue of transactions that also bring to number 2.\n\n2: **Transaction fees** (gas fees) are priced based on supply and demand, transaction queues will leave to have a constant high demand but low supply of transactions, making them too expensive and a lot of the time even more expensive than the digital/real asset you with to purchase.\n\n\n\n\n\nSo basically, **Loopring created a winzip like tool by creating a off chain copy of a blockchain with massive scale ability (up to 400k transactions per second)**.\n\n**Bundle all the transactions that happen on that L2 blockchain and send it to Etherium in massive batches, splitting the cost to all the transactions, make in it super cheap.**\n\n**Transactions in L2 are super fast since is in a off chain blockchain while zkrollups allow to be that bridge to get the L2 constantly verified and validated by the entire L1 of ethereum everytime those batches occur.**\n\n\n\n-------------- To  know more in depth info, here is some material\n\nWatch this youtube video on the link bellowof Vitalik (creator of Ethereum) talking about Zkrollups and how he thinks Loopring is the solution for Ethereum problems of scaling and gas fees (fees from using etherium).\n\n**https://youtu.be/XW0QZmtbjvs**\n\nWatch from 1hr:14:00 to 1hr:17:40 to understand Loopring and ZkRollups from his words.\n\nThe whole Rollups section is very interesting.\n\n**To know more about Zkrollups (in depth, I recommend to watch This video by Finematicshttps://www.youtube.com/watch?v=7pWxCklcNsU)**.\n\n**Finematics video about Liquidity pools s also amazing to undertand, thats in my other GME squeeze for DUMMIES.**\n\n--------------------------------------------------------------\n\n\n\n\n\n\n\nThis is the **future of currency, finance and economy, all in NFTs.**\n\nBasically what finance can do, this can do it much better, while keeping the transparency and high security of a blockchain consensus based of Ethereum, also while maintaining democracy and avoiding creating bubbles or synthetic shares.\n\nKeep in mind that there is something so beautiful on those projects and marketplaces, the market place doesn’t work for one institution or person (like a bank and CEOs), they work for the system itself.\n\nLet’s say you are a singer or have a band and your band releases your album but instead of selling it using dollars (fiat), decided to sell it using their tokens in L2. They split that song in 1million pieces, first songs are sold for $1 worth of the token at the start.\n\nOut of that $1 80% will go back to the entire network of owners of that band/album tokens, 70% of those are spread across everyone and 10% is burnt to keep reducing the supply increasing the net worth. The last 20% will go to the creator/artist, always, always that ratio. **(Right now the standard I might say is 80-10-10).**\n\nSo if you are part owner of any piece of that song/album, every time someone comes in or transaction that specific song, **EVERYONE WILL BENEFIT from it.**\n\nThat is decentralized finance. That’s based on fundamentals, and that true value of investment, you believe in the band/artist, and the more sales and transaction and more popular becomes, more value will bring back to the entire network.\n\n\n\n\n\n\n\nNot only bringing top expertise on blockchain and NFTs, but seen ahead to the future **(I based this on Ryan Cohen long friendship with finestone).**\n\n**GME is gonna be the first massive project of this, already been tested and working on Loopring L2 (you can check yourself).**\n\nThe possibilities are endless, but let’s keep it simple with one example.\n\nLet’s say that there is a new Mario Bros battle royale, they decided to create 10 million copies of it and release them as an NFT.\n\n$10 worth of GME coins in the GME L2 marketplace.\n\nWith those $10 you can play the game, but also you own part of the project, you can decide and participate in new updates and items released so give you more power towards the game.\n\nBut also, if the game succeeds, the tokens you have by selling the game (if you decide to do so) will be more valuable against those initial ($10), because now the game market cap is gonna be bigger and we know decentralized market spread the spoils of sales to everyone that has that coin.\n\nAlso, limiting the amount of copies will create that when all the copies at base rates are sold, a auction market for the copies will be the only way to purchase that game and getting into the project, then when there is higher demand and little supply, boom! The price of the copies are gonna increase.\n\nThe NFT can store data, so in your copy of the game you can have the items you unlocked or purchased in game or save files, making your game unique and more/less valuable.\n\nAlso, if this copy was owned originally by Ryan Cohen or any person that is famous, you can see it and confirm it on the blockchain and that will also will give added value to those transactions in the market place, making those copies more valuable.\n\nFor every of those transaction no matter the prices are trade on, benefits THE ENTIRE NETWORK OF FANS and owners of the game.\n\nAlso keep in mind that this system is lot more intelligent than any other financial transaction, these transactions are smart contracts, meaning that you can set specific rules for the transactions.\n\nFor example, I can limit a copy of the game to be sold only 5 times and if sold a 6th time will self destruct, or can be only trades once every 5 days, or that the increases on price can only go up by 5 tokens at the time (controlling volatility) and so on, the list goes on with unlimited possibilities.\n\n- **NFTs are the new currency just like the dollar (but smarter), governments are forms of DAOs (centralized ones) and its gonna be very important to support DAOs with strong fundamentals that will gain value overtime (just like you rather to have USD or Euros than pesos)**\n\n- **Web3 is knocking our doors, the new age of validation.**\n\n- **the mix of technologies Opens new possibilities from creating your new Online/offline identity, create your assets as NFTs to turn them into a digital asset and be able to trade it.**\n\n- **The Metaverse is the bridge between the internet and reality (Using augmented and virtual reality to give a real life like experience while validating your virtual identity).**\n\n- **This is the future, and true financial democracy. GME is set to be the pioneers of this new technology that Vitalik himself (Ethereum creator) sees as the future.**\n\n- **Zkrollups is the current best solution to use Ethereum ledger for validation and security, while keeping gas feed to less than a dollar and scaling the Transactions per second TPS to a better and faster  functionality than current banking.**\n\n\n\nAbove you will find a very easy to understand explanation of what is happening, why and how is happening with real examples.\n\nPlease share for people that don’t understand what blockchain is and educate a bit about the future of possibilities.\n\nThis is what I think they meant by\n\n**POWER TO THE CREATORS POWER TO THE PLAYERS POWER TO THE COLLECTORS**\n\nIf any of you guys have any questions, I’ll be more than happy to answer. :)\n\n🍉 **is out.**\n\nDisclaimer: Nothing in this post, comments or any thoughts/opinions I might is or should be taken as financial advice. This is educational purpose only. Use your critical thinking and evaluate your particular situation with your financial advisor or professional, always ask questions, seconds opinions and educate yourself before any decision.\n\nCommon asked questions: Talk about scarcity and value increase. Why would that be desirable and sustainable?\n\nMy answer :\n\nThe point is not about the actual increase or decrease of your value, in reality this is a replacement of banks.\n\nLet’s say you have $100 in your bank account sitting in there, that money goes to the market cap of the bank as an organization since they can “use” that money for themselves and you trust them with the keeping it, they don’t keep it.\n\nWith inflation today (6.2%) your money by sitting still “in the bank” is actually losing value at that rate.\n\nThat’s why the more money you have the most likely is for you to invest it in things that at the very least give you that 6.2% of your losing value back. Usually invested in government bonds which suppose to be “safe” and “low risk” since they are backed by the government and the government haven’t default ever yet. So you put your trust that at the end they will give you your money back plus your yield (6.2% or more).\n\nSo even tho you have your $100 in your account, anything else around is going up at an inflation rate (6.2%), and suddenly your buying power is less, less things you can buy with the same $100 dollars.\n\nThe bank used your $100 And let’s say they doubles that money (the on average get lot more than double), but doesn’t give you back anything really, probably a very tiny % of returns for you storing your money in the bank, a lot of the time they charge you fees and actually take even more money and value from you.\n\nThis is the current system, helps the banks and big institutions with your money. Increasing the value of everything else also by printing counterfeit “legal” money at the FED and they call it QUANTITIVE EASING.\n\nSo there is a reason and need for a currency to grow in value to keep up with everything growing in value around it.\n\nThe token L1 will need a counter party currency to be exchanged (most common is US Dollar that use the fiat system). Blockchains have limited supply of token (a set amount of tokens), and the more currency injected to it (US dollars for example), the more market cap of that blockchain of tokens (ethereum cap is currently 250 billion) and the number of tokens supplied for ethereum is 117.7 million tokens/pieces. You divide those numbers and should give you the price per piece.\n\nThe more people get into buying ethereum for example the bigger the market cap so bigger the price discovery.\n\nBonus: Another example :)\n\nLet’s imagine this situation.\n\nIn the current world we have:\n\nThe singer will go to a label to promote his album, manager, Spotify, YouTube, etc, and they usually take the larger amount of the deals.\n\nNow let me explain better how the model would work with NFTs DAOs.\n\nA singer make one song and sell it to me in let’s say $1 and put in the contract that each time that song is resold the singer gets 80% of the profit and 20% goes to the seller.\n\nSo I sold the song to somebody else, then in this case the singer get $1 from my original sell plus $.80 from my sell. I get 20% of it. everytime the song is resold, 80% goes to the artist and 20% goes to the seller in the network. No middle man like Spotify or Apple Music and the artist always gets its part and 20% for the seller. You can do it on and on and on with always 80-20. You had the song, listened to it and when you sell that. The owner will be the singer but everyone can listen to the song which is the product, like games.\n\nThere are other models in which you can do 70% to the singer, 20% for the reseller and burn 10% of the albums with that extra 10% of money to reduce the amount of supply of copies and making it more exclusive. Increasing the amount of sales :)\n\nYou can make it 50-50, 40-50-10, it’s up to the project and the project goals. (Most standard currently is 80-10-10). No one is forced to buy anyway and if the project is too greedy or doesn’t benefit everyone so you are free not to join.\n\nI think this explains it better so I’m gonna add it to the post :)\n\nThis are smart contracts and you can customize it according to what you need. Don’t forget that.\n\nIn comparison to the financial system we currently have, you put money in the bank and they use it for their market cap to make more money for themselves, giving you crumbs and you never owned a piece of the bank, but you did “invest in them” by putting your money in for them to play with.\n\nWith blockchain you put your money in, you actually own a part of the project and the project success is shared with everyone equally and proportionally of your stake of course. So makes it easier to beat inflation and not letting others benefit from using your money to trade.\n\nAnother frequently asked question:\n\n**What's the fundamental difference  between Bitcoin and Ethereum?**\n\nBoth networks have a scaleability issues. Both have high gas fees (not efficient) and both are solving those issues in different ways.\n\nThe fundamentals of Bitcoin are to be Nothing more than a coin.\n\nThe fundamentals of ethereum is a ledger technology that companies use to build programs/projects in it.\n\nSo fundamentally speaking, Bitcoin would need to change their own fundamentals to be on par with Ethereum in order to provide a ledger and  have rollups and similar ethereum based structures.\n\nFundamentally speaking.\n\n\n\n**Why Loopring? What LRC has to do with all this?**\n\nThis is my answer:\n\nThey are the ones and first that created a Zkrollup, that is a key component on how the interaction between L1 and L2 works, it’s the tool that compresses the off chain interactions from L2.\n\nLike Vitalik explained in the video, takes only the validation part of the NFT taking just a minimal part of data to verify in the L1 of ethereum which is the most secured one and will be even more secure the bigger it gets with the coming of eth 2.0 and sharding (multiplying eth 1.0 multiple times and connecting all in the network making huge scaling).\n\nThen they take all the minimal parts together (of each transaction in L2 off chain) and compressed them into lot less, making the cost of each transaction also be reduced by that amount of compression.\n\nThat’s how you can make a L2 transaction of NFTs (of everything that has value in them and are validated of ownership in the ethereum blockchain ledger) cost cents, I’ve seen the current Loopring L2 in developments and tested constantly cost cents, I haven’t seen a transaction of a dollar yet and I’ve been monitoring it, and big movements transactions to Ethereum and fiat (US dollars).\n\nHope that clears your mind and expand it ;)\n\nBuy only on CS, Hold, DRS (if needed)\n\nI like to keep it simple stupid - DFV a value investor based on fundamentals.\n\nSource for the 30TPS for Ethereum, some other courses claim 13TPS, still pretty low for the needed demand in eth 1.0\n\nhttps://www.google.com/amp/s/www.thestreet.com/crypto/.amp/ethereum/ethereum-2-upgrade-what-you-need-to-know\n\nI’m a Melon, this is not financial advice and shouldn’t be taken that way. This is me sharing my opinion and views.\n\nPlease do your own research, develop and use your critical thinking and look things objectively. Think for yourself.",
  "author": "johnnyfuckinairforce",
  "comments": [
    {
      "author": "ishred5",
      "timestamp": "",
      "body": "Thank you, very well done"
    },
    {
      "author": "Additional-Ad5055",
      "timestamp": "",
      "body": "You are welcomed. I will continue doing my best to help"
    },
    {
      "author": "INKWENSU_Wocha",
      "timestamp": "",
      "body": "Damn skippy compadre!"
    },
    {
      "author": "Additional-Ad5055",
      "timestamp": "",
      "body": "Ohhh damn! Thanks for the award! That’s a pro one! Now I can gift other posts yeiiihh"
    },
    {
      "author": "allthefeelz_forrealz",
      "timestamp": "",
      "body": "Amazing! It'll take a while to digest all of this, looking forward to it"
    },
    {
      "author": "Additional-Ad5055",
      "timestamp": "",
      "body": "It’s the future. Can’t stop, won’t stop. This is the GameStop!"
    },
    {
      "author": "oneTonguePunchman",
      "timestamp": "",
      "body": "Could this be taken to a debit card basis? Where you go to a store to buy something and you transfer L2 of some sort of $ to the company to receive goods or services? Would that benefit buyer/seller by not having to pay the 3%? Could you establish credit on the ledger? So many possibilities and so many questions."
    },
    {
      "author": "Additional-Ad5055",
      "timestamp": "",
      "body": "This is gonna be the next credit card and banking system. You won’t need to convert anything in the future. Imagine going to a GameStop store and paying with your L2 wallet, using your phone. Simple as that, if you want a card, then they will be card forms too. L2 transactions are almost gas free right now, it’s gonna be even better in the future. This is banking but 100x better at least."
    },
    {
      "author": "Sandoozlez",
      "timestamp": "",
      "body": "No wonder RC is pooping in the metaverse. I might never want to leave! 💩"
    },
    {
      "author": "johnnyfuckinairforce",
      "timestamp": "",
      "body": "This will take a bit to understand but I get the gist of it."
    }
  ]
}