{
  "subreddit": "VRchat",
  "post_id": "1hehgro",
  "title": "How do you handle checking if someone is 18 before Age Verification goes live?",
  "body": "I hope I'm not kicking the hornets nest here, but I ask this question out of curiosity, not malice. In the group I help moderate, when checking if a person is over 18 we use the honor system. You say you're over 18? Cool. As long as you don't make an ass out of yourself, have fun!\n\nSo, yeah. Group mods, how do you handle it, and why? How do you handle other forms of  ID for people from countries who don't do it the way Americans do? I know age verification is coming, but I'm just genuinely curious what methods people have come up with.\n\nEdit: Since it seems to be unclear, I am not asking for advice or sass. I'm asking out of curiosity. Please be excellent to each other :(\n\nEdit 2: Please stay on topic, read the full post, and quit being rude to each other. I know this is reddit, but I expect better from adults.",
  "author": "josephlucas",
  "comments": [
    {
      "author": "gLu3xb3rchi",
      "timestamp": "",
      "body": "Depends on the Group. If its clearly NSFW group ask some form of ID or a trusted Person to vouch for them.If its not NSFW and semi serious, ask some stupid question like „what musik was popular in your highschool years?“ and guestimate the age from there. Or another fun one is „what was your favorite game you played as a kid‘"
    },
    {
      "author": "Polar_Bean",
      "timestamp": "",
      "body": "Not vrc, but in a discord I had with nsfw channels, when someone requested access, I'd send a picture of a floppy disk and ask them to identify what was in the picture. If they said it was the save icon, I knew they were under 18."
    },
    {
      "author": "Cinnaki",
      "timestamp": "",
      "body": "I tip my hat to you, that's hilarious."
    },
    {
      "author": "Embarrassed-Touch-62",
      "timestamp": "",
      "body": "Genius xD"
    },
    {
      "author": "Mentally-Ill-Ladybug",
      "timestamp": "",
      "body": "Like other comments said, depends on the group. Most sfw bar groups and such just ask for DOB at the door and use the honor system, but most NSFW clubs (like lap dance clubs) use discord to ID verify people before they're let into the event, which ik sounds sketch but imo it's better than finding out ur stripping for a minor 🤷‍♀️"
    },
    {
      "author": "Aggravating-Wafer-32",
      "timestamp": "",
      "body": "I asked one guy how old he was and he said, \"Eighteen?\". I had my doubts and asked what year he was born. He responded with, \"I think I've made a big mistake \" and disappeared."
    },
    {
      "author": "UwU_Incognitus",
      "timestamp": "",
      "body": "Guess what, they normally just use the same method. Ask people for their age, there are some groups that use a discord bot or other websites a person can use to verify their actual ID card to get into group private instances. Some just have a guy who runs the group, askes people for their ID in a Discord DM, the sketchiest way of doing it."
    },
    {
      "author": "SansyBoy144",
      "timestamp": "",
      "body": "I’m not a group mod, but as someone who erp’s with a lot of people, often who I’ll meet that day, I can share my many methods. In no particular order.I always start by checking their bio, not just for age, but also seeing if their bio checks out. While this is never 100% I have no issues being wrong about assuming someone who puts Roblox in their bio is underage.Start a conversation about jobs. Even an adult who has never had a job will have something to say about this, and honestly this is a super easy way to discern between the two. It’s not just about them having or not having a job, but any adult knows what I mean when I say you can tell who is a child or an adult based on how they talk about jobs. This is by far the best piece of advice I have on figuring it out. Us adults come across the conversation all the time, and kids will rarely talk about it.College is another talking point, although I don’t always do this one, I prefer talking about jobs.Judging based off of voice is never perfect, but can be helpful. Yes there’s some adults who sound like children and a lot of children who sound like adults, never rely on this on its own, but use this with the others. Like if there’s someone who sounds like a kid, has a bio that says he loves fnaf and Roblox, and didn’t seem to relate to having a job, I’m immediately saying that’s a kid.Don’t be afraid to ask questions. I always ask for Age. Which sometimes they will lie, and expect that if they are a kid then they will lie. But it helps to double check. Also if they say they are 18, or even 19, I honestly just wouldn’t touch it unless you’re also around that age. But if you are, one thing I used to ask when I was 20 was if they are still in highschool. Often times they’ll answer truthfully and I think everyone agrees that even doing stuff with an 18 yo in hs is weird and creepy.Obviously this is not perfect. Which is why if you are not 100% sure, then don’t do anything, it’s not worth it. But there are times when you can be 100% sure. And these can help you get there."
    },
    {
      "author": "Cinnaki",
      "timestamp": "",
      "body": "I also have a series of seemingly random questions I ask that sometimes help. First one I ask is who were the presidential candidates the first time you voted. Not who you voted for, just who they were. But a lot of the questions center around subjects you already talked about. I agree, talking about jobs is the best way I've been able to be more confident a person who sounds young is an adult."
    },
    {
      "author": "josephlucas",
      "timestamp": "",
      "body": "We just ask people. If they say they are 18+ we believe them. We have a small chill group so it hasn’t been a problem."
    }
  ]
}