{
  "subreddit": "FAFSA",
  "post_id": "wkty93",
  "title": "Here's How to Answer the FAFSA Homeless Questions",
  "body": "I'm not a financial aid administrator. What I am is an expert on federal funding streams that relate to homelessness. My job is essentially \"decoding\" those policies every time they're revised, so they can be explained to agencies that provide services. I stumbled upon some of the questions posed here about how to navigate the FAFSA's questions regarding homelessness, so I'm here to shed light on this for anyone who sees this, in perpetuity.\n\nThe short version is, if it applies to you,say YES.There's no way it's going to hurt you to disclose this, and it might just help you out a whole lot.\n\nIf you can't verify that with third party documentation,SAY YES ANYWAY.\n\nYou DO NOT need to provide ANY documentation. None.\n\nThere's a lot of misinformation about this floating around, probably rooted in assumptions. It's completely untrue. If you think about it for a minute, the fact it's not true is actually pretty obvious. Who, in a moment of extreme crisis like homelessness, imagines they'll ever need to PROVE they experienced that? Most homeless people can't prove they have nowhere to sleep at night, even when it's currently happening. It's absurd to imagine everyone who goes through this ordeal has a third-party agency who will vouch for them. I cannot emphasize this enough: whoever told you that you need to have documentation was wrong.\n\n(If youknowyou were never homeless, do not mistake this for a loophole you can exploit to get extra financial aid. Intentionally lying on the FAFSA is a federal crime. They catch it all the time, they do prosecute, and that felony will follow you for life.)\n\nShort answer: if it seems like the \"unaccompanied and homeless\" applies, it probably does.\n\nThe FAFSA assumes at least one of your parents: A) has you in their physical custody, B) makes sure you have \"fixed, regular, and adequate housing,\" and C) takes responsibility for ensuring both are true from the moment of your birth until your 25th birthday.\n\nIf your parents don't, can't, or refuse to provide you with a safe, stable, and appropriate living environment, you've met the definition of \"homeless.\" If you are not in their custody – meaning your living arrangement does not include them – you've met the definition of \"unaccompanied.\"\n\nBoth of these factors are necessary to qualify for this designation on the FAFSA. That's because this designation isn't actually about the extreme financial hardship of homelessness – it's about the clear fact your parents are not in the picture, and the FAFSA can't legally pretend they're supporting you.\n\nNormally, everyone under age 25 who files a FAFSA is processed as a \"dependent student,\" which means they have to provide lots of detailed information about their parents, and the amount of financial aid they get is limited based on their parents' incomes. This is a really screwed up system, because it assumes everyone's parents can and will financially support them in college. Obviously millions of people can't relate, but the FAFSA doesn't make exceptions – the only way out of this is waiting until you turn 25.\n\nUnaccompanied homelessness is one of the only exceptions to that rule. If your parents have let you go without stable housing and are not physically in your presence on a regular basis, the federal government admits that you are not able to depend on them financially. Your FAFSA is processed as an \"independent student,\" like it would be if you were 25 or older – it does not require any information about your parents or their incomes, and your financial aid amount is based solely on your income (if you have one).\n\nSleeping on people's couches, in a spare room at a friend or relative's house, in your car, or paying for your own place under the table (like CashApping a roommate who had the actual lease), because it's your only option. Even if it's a temporary situation, or happens on and off.\n\nYou always technically have a roof over your head, but that's because someone other than a parent \"lets you\" live there. Aunt or uncle, sibling, grandma, etc., all count, unless they're a court-appointed legal guardian. If they told you to leave, could you just move right back in with Mom or Dad? If the answer is no, it counts.\n\nYour parents, at least one of them, definitely has a place to live, and technically you could live there, too. Instead, you stay somewhere else for days or weeks at a time to avoid violence, abuse, neglect, or other unsafe circumstances happening in your parents' home. If fear of parental punishment/harassment about your gender or sexual identity causes you to leave, it counts. If your custodial parent is in active addiction and there are people using/dealing drugs and making you feel unsafe, it counts. If someone in that household punishes you with physical violence or emotional abuse and you conclude that sleeping anywhere else is a safer option, it counts. If you left, we trust your judgment –it counts.\n\nYour parent(s) are actually fine people and they're doing their best, but the \"home\" they live in is an RV, car, or other unsuitable space not meant for human habitation. You probably could live with them in that place, but they arrange for you to stay somewhere else, or you find somewhere else to stay until your parent(s) can get back on their feet. That counts.\n\nIf you are or were homeless and have no way to prove it,a financial aid administrator at your school \"verifies\" that you were homeless by having a conversation with you.This conversation is not about scrutinizing your story to decide if you're lying, or passing judgment on your decisions. The purpose of the conversation is just to confirm that your situation fits the legal definition of \"homeless\" and \"unaccompanied.\" Don't be intimidated by this! It's just you and some person in the financial aid office sitting down to talk. The official term for this is a \"documented interview.\"\n\nThisresourcesums it up very well:\n\nThe goal of this conversation is to determine IF you meet the definition of an unaccompanied homeless youth, not to determine or assess the reasons WHY you are experiencing homelessness. The most common question financial aid administrators are likely to ask is the timeline of your living situation. It is inappropriate for them to ask for the reasons for your homelessness, and, according to federal guidance, they may not base determinations on these reasons.\n\nGetting that documented interview requires you to take the lead and be proactive, but you got this. Here are the steps:\n\nStep 1:Fill out the FAFSA honestly.\n\nStep 2:If you see a notification that says your school needs more information,use the template belowand send an email the financial aid office.\n\nStep 3:If you don't hear back from the financial aid office within about a week, pick up the phone and call them about it.  Yes, really. Remember, they aren't doing you a favor; it's their job. They might not be familiar with this process, so be polite but persistent. The person answering phones is not a financial aid administrator, so they very likely won't know anything about this process. That's fine. Don't be self-conscious – this about is your entire future.\n\nStep 4:Show up to for the appointment with the financial aid administrator on time. You want to have already thought through how you want to explain your situation. It's important to be clear about the fact you were/are separated from your parents while unstably housed. Be honest and straightforward. Stick to facts. You don't need to share personal details that make you uncomfortable. Remember, you're not on trial, and this isn't some kind of forced therapy session. They're just getting the basic info they need so they can fill out some paperwork. When in doubt, let them guide the conversation, and don't be afraid to ask questions.\n\nStep 4:As soon as the conversation ends, open your notes app and jot down some quick bullet points. Include the name of the person you just spoke with, what they asked about and what you told them, any next steps they mentioned, and the time frame for when you can expect to hear from their office again. This can end up helping you out a LOT down the road, especially if you get anxious in situations like that - you might not remember any of it clearly a few days later, but any of those details could be important if there's a hitch later on.\n\nSend this to the general email address for the financial aid department.\n\nDear Financial Aid Administrator,\n\nMy name is [insert name] and I am emailing to request a documented interview to determine my independent status as an unaccompanied homeless youth.\n\nI do not have and am unable to obtain documentation from any of the legally authorized entities.\n\nTherefore, as described in Chapter 5 of the2025-2026 Federal Student Aid Handbook, (\"Homeless Youth Determinations\"), I am requesting to receive a determination from my Financial Aid Administrator through a documented interview.\n\nI am available during these times [insert availability] and can be reached at [insert email address and phone number].\n\nThank you for your assistance in this matter. I look forward to hearing from you soon.\n\n[Full name & Student ID Number]\n\nGood luck out there, folks!",
  "author": "ComfortablePrint637",
  "comments": [
    {
      "author": "AnvyAviary",
      "timestamp": "",
      "body": "This is really helpful and I really appreciate the effort you put in this post. I was in technicality \"homeless\" for almost half a year after I left my parents house and stayed at a friend's after my home situation almost resulting in myself ending my life. Despite all this I was 21 at the time so I'm still unsure if this would apply still,,, what do you think?"
    },
    {
      "author": "Shinigami_Jedi",
      "timestamp": "",
      "body": "Any updates on what happened?"
    },
    {
      "author": "cooplover",
      "timestamp": "",
      "body": "Going through the same thing and i’m so nervous, any updates?"
    },
    {
      "author": "MavisLeno",
      "timestamp": "",
      "body": "Would \"at risk of being homeless\" include someone who lost their job and could become unable to pay their mortgage?"
    },
    {
      "author": "JulieO717",
      "timestamp": "",
      "body": "So I don’t live with my parent and I file as single (independent) I live with my sister I’m 24 would I be considered as homeless?"
    },
    {
      "author": "Embarrassed-Wrap-616",
      "timestamp": "",
      "body": "Yes right I am kind of on the same boat and would love to know how to answer this question I’m 22 now but became homeless right after high school and starting college. Lived in my van for a lil bit now I just crash with a friend I pay him rent but he can kick me out whenever he wants. And it’s gotten close"
    },
    {
      "author": "Lumpy-Step-5355",
      "timestamp": "",
      "body": "This is really late so idk if you’ll see this but I submitted my Fasfa stating I was homeless and they’re telling me to redo it without that because apparently that’s for only unaccompanied youth? I’m so confused right now and do not know what to do."
    },
    {
      "author": "Fun_Barber_8227",
      "timestamp": "",
      "body": "Hey, I know this post is kind of old but I could use some guidance. I believe myself to have been at risk for homelessness, but I'm not sure if it counts, like you say. I only have my mom, no dad involvement, and she cannot afford to support me at all. She made around 40k for the 2023 tax year, but has to take care of my grandfather, bills, and other expenses. So she doesn’t and my boyfriend & I work together to support ourselves. My boyfriend wasn't working for some time and we were barely paying rent, but it always got paid. Even when he was working, paying rent was a struggle and continues to be an issue. However, we have never been evicted or been threatened to be evicted. He does not receive support from his parents either and we have a huge debt load. If he doesn't get a better paying job by the time his loan payments begin, we will not be able to afford rent. I am 23, so not quite old enough to qualify as independent on age only. Should I consider myself at risk of homelessness? Every time I try to mark it, FAFSA rejects my claim"
    },
    {
      "author": "LoveBunni101",
      "timestamp": "",
      "body": "THANK YOU!"
    },
    {
      "author": "ComfortablePrint637",
      "timestamp": "",
      "body": "References for risk of homelessness fafsa"
    }
  ]
}