{
  "subreddit": "Steam",
  "post_id": "7z1yxn",
  "title": "Constant age verification. Why?",
  "body": "Im logged into my account. My account has my b-day info. Why am I always verifying?",
  "author": "[deleted]",
  "comments": [
    {
      "author": "CallMeCygnus",
      "timestamp": "",
      "body": "Yeah. It was saved previously, now it resets every time I log in to Steam. It's getting really quite irritating as almost every store page I look at requires a verification."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Same as the whole \"this has mature content not suitable for everyone\" warning. Sometimes for games I already own. If I'm old enough to buy It, I'm old enough to see it."
    },
    {
      "author": "ParisGreenGretsch",
      "timestamp": "",
      "body": "99.9% of us were born on January 1st."
    },
    {
      "author": "Nisstrx",
      "timestamp": "",
      "body": "They save it to cookies Everytime you login."
    },
    {
      "author": "munttheasker",
      "timestamp": "",
      "body": "The interesting part is that steam knows it - a year ago, if you were under the age, you would get stuck. Then steam patched it, now you can skip the higher age games."
    },
    {
      "author": "Timinator01",
      "timestamp": "",
      "body": "they just want to make sure you didn't get any younger since the last time you entered it"
    },
    {
      "author": "guyver_dio",
      "timestamp": "",
      "body": "It's weird that even when everyone knows something is pointless, we still do it anyway. Like everyone knows age verification by birthday doesn't stop anything, you just click the years scroll, click on a random year and press enter.Just to satisfy some legal shit probably, which still doesn't make sense. I can't do an 8 year old and say \"but she told me she was born in 1957\"."
    },
    {
      "author": "mr_shooty_shoot",
      "timestamp": "",
      "body": "It's a pain when you're WiFi is on the blink and takes 20 second to load a page and this exta step is just a pain"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}