{
  "subreddit": "virtualreality",
  "post_id": "18linpy",
  "title": "Meta wants my underage kid to provide picture ID!",
  "body": "I know letting your kids use VR is a discussion of its own, but what do you do when your 13 yo kid, to whom you just bought their own headset, is asked to provide picture ID or his account will be suspended?\n\nI mean who asks a 13 yo to upload birth certificate? META does!\n\nI am furious! We were gonna play a few games together during Christmas, but now his account is suspended and they say it will take some time to look into, before they will decide whether to unlock it again. What kind of business model is this? Sell your product and then lock it up so the consumer can't use it!",
  "author": "Metaismean",
  "comments": [
    {
      "author": "Prophetic_Reaver",
      "timestamp": "",
      "body": "I don't have kids but this may be what you're looking for.Meta Child Account Creation Guide"
    },
    {
      "author": "Ryuuzen",
      "timestamp": "",
      "body": "It sounds like a security measure for something. Maybe the information on the account seemed too fake?"
    },
    {
      "author": "JorgTheElder",
      "timestamp": "",
      "body": "An account for a 13 year old should be tied to the another account managed by an adult. Period.In my opinion Meta should make anyone under 18 have their account approved by someone over 18 because of the legal risks.Those under 18 in the US cannot even legally accept the terms of a contract so their accounts should be tied to someone that is not a minor that takes legal responsibility for them.https://www.upcounsel.com/contracts-signed-by-minors#google_vignetteContracts signed by minors, those under the age of 18, do not have the same legal status as contracts signed by adults because minors are seen as not having the same legal understanding as adults. Because of that, when minors sign contracts, the contract is not valid, and minors are under no obligation to honor that contract. There are exceptions, which include contracts for food, lodging, medicine, and other necessities. Otherwise, minors are required to have a parent or guardian to give consent in order for the contract to be legally binding.Because of this, store purchases and such should benotallowed by any account tied to a minor that is not also tied to an adult."
    },
    {
      "author": "Kev-Series",
      "timestamp": "",
      "body": "Thanks for reminding me why i put up with HTC's and Steam's bullshit OP."
    },
    {
      "author": "ManWithoutUsername",
      "timestamp": "",
      "body": "What kind of business model is this? Sell your product and then lock it up so >the consumer can't use it!When your country does not create (or no create enough) laws to limit corporations and give rights to the consumer is what happens"
    },
    {
      "author": "frankvagabond303",
      "timestamp": "",
      "body": "Sounds like your crotch goblin was being a little shit in VR and got reported to many times for saying the N word and/or being annoying in a place where children are not welome.Meta knows children don't have IDs, and parents aren't gonna upload their birth certificate. So, the problems take care of themselves."
    },
    {
      "author": "CursedTurtleKeynote",
      "timestamp": "",
      "body": "He was checkpointed somehow, either by getting reported or trying to change his birthdate."
    },
    {
      "author": "zeddyzed",
      "timestamp": "",
      "body": "For people to avoid this issue, how did you create his account?  Did you enter his underage birthdate or an adult birthdate?You said he hasn't even started using the headset yet, how do you think Meta knows he was underage?Did you try creating a child account instead?"
    },
    {
      "author": "Crafty_Individual_47",
      "timestamp": "",
      "body": "They have absolutely no right to do this. Also they say on another page they do not save any information and another one they say they save it on encrypted format. Also they apply same rules no matter if you are on EU or in US when completely different laws apply. Would you trust a company whos business model is to collect as much information about an individual as they can and use this to target ads."
    },
    {
      "author": "Metaismean",
      "timestamp": "",
      "body": "I’ve had the same problem but Ik how to fix it I’ve emailed meta support team and they told me how to fix without a id you can do it as long as your  email is not linked with facebook or instagram"
    }
  ]
}