{
  "subreddit": "PAX",
  "post_id": "rb2rm0",
  "title": "Anyone else having problems uploading your ID to CLEAR?",
  "body": "I've tried with my passport and VA driver's license, in different lighting, and no matter what, CLEAR says it doesn't recognize my ID. Anyone else having problems? I assume I can also just show up with my vaccine card?",
  "author": "orange-luma",
  "comments": [
    {
      "author": "Nuttyturnip2",
      "timestamp": "",
      "body": "I've already got my card uploaded to the Health app in my iPhone, which is also verified. It'd be awesome if they just accepted that rather than making me download another app."
    },
    {
      "author": "Nuttyturnip2",
      "timestamp": "",
      "body": "Finally got it to work by doing the exact opposite of what it recommended. I put my DL directly under a bright lamp, there was definitely glare in the photo, but the stupid app took it."
    },
    {
      "author": "LoserxBaby",
      "timestamp": "",
      "body": "I've never been and never thought of going to PAX, but I had to thank you because I've been trying for 30 minutes to get my ID added to CLEAR and after doing some light googling, this was what finally got it through- directly under a lamp, glare in the photo. Thank you so much for posting this, I can finally get on with my day"
    },
    {
      "author": "ConspirHerSee",
      "timestamp": "",
      "body": "I'm having the exact same problem.  I think it's because I've aged 11 years.  In Florida we only have to renew every 7 years and you can skip retaking your photo ever other renewal so the picture in my licesnce is now 11 years old and still good for another 3 years.  It keeps giving me a list of reasons it's not accepted none of which are the problem.  And since it's not specific i'm at a loss because the image is valid, unexpired, no glare and crystal clear front and back.  The only thing I can think of is their Artificial Intelligence can't see that I've just aged 11 years.  My hair is completely different and my face is a little chubbier."
    },
    {
      "author": "markus1028",
      "timestamp": "",
      "body": "System asks for my id, immediately says Flip your ID and Unable to scan.  Unable to contact anyone.  What a shit company"
    },
    {
      "author": "Yourhighness77",
      "timestamp": "",
      "body": "I can’t get any CLEAR agent or machine at airports to figure out how to verify my ID. Also tried my passport. Happened at multiple different airports over the last few months. Today heard someone ask for a supervisor for the same issue, a supervisor doesn’t even exist."
    },
    {
      "author": "spleenmuncher",
      "timestamp": "",
      "body": "I had that issue where it said something like \"Document not found.\" But, I just hit continue and everything worked fine."
    },
    {
      "author": "Nuttyturnip2",
      "timestamp": "",
      "body": "Nah, mine thinks for a minute or two (with a blue screen), and then says \"please scan your ID again\". I can't get past that screen."
    },
    {
      "author": "yourwhiteshadow",
      "timestamp": "",
      "body": "yep, and then i linked my electronic health record and the whole thing is just completely broke and useless."
    },
    {
      "author": "orange-luma",
      "timestamp": "",
      "body": "My friend had the same exact issue with Clear when we went to comic con. She showed vaccination card and ID to the staff and was able to pick up the wristband."
    }
  ]
}