{
  "subreddit": "uber",
  "post_id": "1jgfyxi",
  "title": "How to avoid id verification",
  "body": "Uber keeps asking me for an id, i however am unabble to provide an acceptable one. I am a minor without a drivers license/permit, my mother got me the app so i can get to school and back more easily. It worked well for the first few times i used it, but now it wont let me get a ride without id. I dont have a passport ethier, at most i have a school id, but that isent listed as 'acceptable'. What do i do?\n\n(All adults are unnable to drive me to school due to weird work schedules. Buses recently decided to only pick up kids on the edge of town this year, insted of all over the city as thry did previous years)",
  "author": "NickFabulous",
  "comments": [
    {
      "author": "mikeymo1741",
      "timestamp": "",
      "body": "Your mom needs to make an account for herself and add Teens and then add you to her account.   As a minor, you cannot order a ride for yourself, so there is really no workaround.  As a driver, I am glad the app is working as it should."
    },
    {
      "author": "migmultisync",
      "timestamp": "",
      "body": "Uber offers an UberTeens product that’s linked to a parent’s account and shouldn’t require any ID from you to book a ride"
    },
    {
      "author": "mzd202",
      "timestamp": "",
      "body": "You need to have a parent make you an account and then they can set up teen Uber. Otherwise, if you don’t have a teen Uber Account, the driver can say unaccompanied minor and refuse to take you and they’ll still charge your credit card and eventually kick you off of Uber’s platform. It is better to do it the right way"
    },
    {
      "author": "UberPro_2023",
      "timestamp": "",
      "body": "Drivers are not supposed to take unaccompanied minors unless you have an Uber teen account. Personally as a driver I never take teens, we get paid next to nothing to take a kid to school."
    },
    {
      "author": "targuard843",
      "timestamp": "",
      "body": "Most states will issue an ID that looks identical to a drivers license at 12-14 years old."
    },
    {
      "author": "gadgetvirtuoso",
      "timestamp": "",
      "body": "Minor IDs are often in portrait or put minor in bold."
    },
    {
      "author": "YouAmazeMe",
      "timestamp": "",
      "body": "Was that Uber Teens?"
    },
    {
      "author": "sweetx3",
      "timestamp": "",
      "body": "Perhaps have your mother set it up under her name and information - ride under her name"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "\"My kids often walk the six miles to school or back\" We got Facebook parents without the Facebook. No kid is walking 6 miles to or from school."
    },
    {
      "author": "NickFabulous",
      "timestamp": "",
      "body": "\"My kids often walk the six miles to school or back\" We got Facebook parents without the Facebook. No kid is walking 6 miles to or from school."
    }
  ]
}