{
  "subreddit": "VRchat",
  "post_id": "1dnx0gf",
  "title": "How can an older person enjoy this game.",
  "body": "I have tried playing this game for a while to escape my shitty little life and mabe meet some chill ppl. I have an extremely rare chronic disease called Glossopharyngeal Neuralgia, that causes constant nerve pain, and because of this I'm not working at the moment while doctors figure out a treatment. I use vrchat as a way to stay social while I'm at home trying to manage my pain. I stay in the 18+ rooms to avoid all the kids dropping racial slurs everywhere. so I'm visiting mostly the bars. As soon as im asked my age for verification to enter, and I respond 34, 99% of the time I get shit on for my age. Ppl have called me a loser, a pedo, tell me I should get a life, and several times I've been told that I'm wasting my life and I should just kill myself already all this before i even get to introduce myself. Wtf is wrong with ppl in this game? I'm friendly to everyone and get treatef like shit. I've joined Discord and tried joining groups like the ancients of vr chat, but there are never any instances happening when I'm online. I just want to have fun without getting told to off myself because I'm too old.",
  "author": "crabrangoondevotee",
  "comments": [
    {
      "author": "rci22",
      "timestamp": "",
      "body": "I’m in my 30s and have a great deal of good VRC experience and a lot of connections to great people both in their 30s and 20s in VRC who don’t treat people poorly. I’d love to help you figure things out so feel free to DM me if you want.I’d be more than happy to personally show you around VRC or introduce you to good people.Regarding Ancients of VRChat,you’re able to propose events so if you’re having a hard time getting on when they’re having events, you could always request an event.If you’re in the Uk there’s a sister server to Ancients that has better time zones for youAnyways, feel free to DM me. I won’t be available this particular weekend but I often am available in general."
    },
    {
      "author": "TaranSF",
      "timestamp": "",
      "body": "I'm 37, I've never had that sorta experience but wow, that's awful. I've never been to a public though so maybe that's part of it? Or the real suggestion from me, hang out with furries."
    },
    {
      "author": "Sitto78",
      "timestamp": "",
      "body": "Easiest community to hang with tbh."
    },
    {
      "author": "Queen-Skadi",
      "timestamp": "",
      "body": "Yeah to be honest I don't get why Furries get so much hate, I mean they are just doing their own thing and are usually fairly chill"
    },
    {
      "author": "Fenhault",
      "timestamp": "",
      "body": "I was literally about to suggest this. Furries have an entire subculture of reverence for older furries which they refer to as graymuzzles. By in large furries will never shame you for your age."
    },
    {
      "author": "Anthonyg5005",
      "timestamp": "",
      "body": "Only 34? Honestly I think you're probably going into the wrong groups if you're being called old"
    },
    {
      "author": "SapifhasF",
      "timestamp": "",
      "body": "I would say u should go in spaces for adults, like the music and rave scene and communities. Im 31 and one of the younger peeps. I know Djs and Organisers who are 40, 55, 60 and a lot ppl over 30. If u be in an environment with 20 year old fuck head teens then sorry, u should seek places in vrc with more mature ppl. They exist, but not in puplic lobbies, or places with young gen z adults. They often not better then kids and imature, like u describe. Not all ofc, but those u describe seem to be mental and should touch grass. ❤"
    },
    {
      "author": "Yukarie",
      "timestamp": "",
      "body": "You’re unfortunately joining some bad servers, depending on when you’re trying to get on it’s very likely to keep happening. You could try world hopping to find cool worlds that aren’t frequented often by large groups and hang there and meet and befriend passersby but idk, sorry you’re meeting such bad groups friend"
    },
    {
      "author": "wasting-time-atwork",
      "timestamp": "",
      "body": "I'm 31 and that experience you described is rare for me. it does happen, but like... maybe one of every 20-30 play sessions.just block those people instantly and mentally move on from the situation. there's good eggs out and about. no need to bother with the rotten eggs."
    },
    {
      "author": "crabrangoondevotee",
      "timestamp": "",
      "body": "Hey, I’m 22f and also suffer from chronic pain, would be nice to have some friends on vrc that can relate. I recommend just taking it with stride and blocking people that get annoying about it. i mostly hang around the dance scene and there’s a lot of 30+ people there who get zero shit."
    }
  ]
}