{
  "subreddit": "DataAnnotationTech",
  "post_id": "1fdtjb7",
  "title": "Identity Verification",
  "body": "Did anyone else just log on and get an identify verification screen? They want a picture of my ID. I’ve been on the platform since the beginning of May and have never seen this.",
  "author": "Bostonlg81",
  "comments": [
    {
      "author": "Interrogatus",
      "timestamp": "",
      "body": "Guess I gotta dig out the old ring light. ;)"
    },
    {
      "author": "dragonsfire14",
      "timestamp": "",
      "body": "Yep! Super easy. As soon as I finished it let me back on. Hope this helps get rid of the account sharers and people working from unauthorized countries. May help with the drought!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I feel like perhaps this is the reason there was even a drought in the first place. I think too many people were on there submitting data that wasn't usable, from places and accounts that weren't legit and they had to do an overhaul. The projects have been slowly trickling back in for me, thankfully!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Nope, haven't gotten that notice at all."
    },
    {
      "author": "xSarabean",
      "timestamp": "",
      "body": "I haven't either, but I still have access to projects"
    },
    {
      "author": "trexboob",
      "timestamp": "",
      "body": "Real pain in the ass if you have glasses and the screen tells you to take them off. They're giving you directions on the screen where to turn but I'm too blind to see it."
    },
    {
      "author": "VanessaSeaWitch",
      "timestamp": "",
      "body": "I feel your pain. I had to do this for three different jobs I was applying to earlier this year and I had the same problem. I had to keep retrying until I memorized their directions lol."
    },
    {
      "author": "Jazzlike_Problem_489",
      "timestamp": "",
      "body": "Yes just popped up for me too. It states that it will be rolled out to all active members. Only took me 2 minutes. The loading time afterwards took about 5 minutes to verify but it's all done and I'm back to working 👌"
    },
    {
      "author": "No_Parsley5801",
      "timestamp": "",
      "body": "Is it bad that I did not get this? I still have projects and the chat"
    },
    {
      "author": "Bostonlg81",
      "timestamp": "",
      "body": "I recently lost my ID but have backup photos, I'm concerned about this as I'm waiting for a replacement.  Is it an upload or a live photo?  just so I'm prepared."
    }
  ]
}