{
  "subreddit": "AnythingGoesNews",
  "post_id": "1hr88jl",
  "title": "Pornhub Is Now Blocked In Almost All of the U.S. South | As of today, three more states join the list of 17 that can't access Pornhub because of age verification laws.",
  "body": "",
  "author": "ControlCAD",
  "comments": [
    {
      "author": "Z80Crazy",
      "timestamp": "",
      "body": "Ah yes, the Land of Freedom"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "SeeeYaLaterz",
      "timestamp": "",
      "body": "Freedom of speech.  If they don't want to watch it, why do they have to force others?  Religious fascism?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Don't want to hear any MAGA closet pervs complaining.Remember, You Voted For This.This applies to ALL the ugly shit that is about to come down the pipe."
    },
    {
      "author": "diethyl2o",
      "timestamp": "",
      "body": "People who didn’t vote also voted for this. They don’t deserve a pass. The choice and consequences were clear."
    },
    {
      "author": "MyDamnCoffee",
      "timestamp": "",
      "body": "Why do these people care so much about what other people do?They don't want kids accessing the site? Thats the parents responsibility.Also love how they can band together to shut down a fucking porn site while I worry every day about my kids being shot up at school, or the trauma of an active shooter drill. Can't do shit about the stuff that really fucking matters, apparently"
    },
    {
      "author": "nicspace101",
      "timestamp": "",
      "body": "Idaho has to re-think its state motto, \"Cum for the Potatoes\"."
    },
    {
      "author": "beavis617",
      "timestamp": "",
      "body": "That explains why my videos stream better now. No longer are they freezing up...😁"
    },
    {
      "author": "JJJAAABBB123",
      "timestamp": "",
      "body": "Because suppressing porn in the Middle East has made their young men so chill."
    },
    {
      "author": "ControlCAD",
      "timestamp": "",
      "body": "Almost two years ago, Louisiana passed a law that started a wave that’s since spread across the entire U.S. south, and has changed the way people there can access adult content. As of today, Florida, Tennessee, and South Carolina join the list of 17 states that can’t access some of the most popular porn sites on the internet, because of regressive laws that claim to protect children but restrict adults’ use of the internet, instead.That law, passed as Act 440, was introduced by “sex addiction” counselor and state representative Laurie Schegel and quickly copied across the country. The exact phrasing varies, but in most states, the details of the law are the same: Any “commercial entity” that publishes “material harmful to minors” online can be held liable—meaning, tens of thousands of dollars in fines and/or private lawsuits—if it doesn’t “perform reasonable age verification methods to verify the age of individuals attempting to access the material.”To remain compliant with the law while protecting users’ privacy, Aylo—the company that owns Pornhub and a network of sites including Brazzers, RedTube, YouPorn, Reality Kings, and several others—is making the choice, state by state, to block users altogether.In Louisiana, sites in the Aylo network direct visitors to use the state’s LA Wallet, a digital driver’s license for Louisianans, before they can enter the site. That system has been in place since January 1, 2023. But the law is not working as the lawmakers would have us believe they intended it. Instead of protecting children from “harmful material,” it’s sending visitors elsewhere across the internet. An Aylo spokesperson told me that the number of visitors in Louisiana “instantly decreased by 80 percent” when the platform introduced age verification in the state. Instead, visitors go to sites with worse moderation practices and no requirements on identity verification for uploaders—just a few of the security and safety practices Pornhub started putting into place in late 2020 amid allegations of abusive imagery on the site and a campaign by religious conservative groups to have the whole platform shut down.Even if someone wanted to visit Pornhub from Florida today, they could easily get around any age verification barriers with a VPN, which we consistently see searches for spike when these laws go into effect.Aylo sent 404 Media a statement about the age verification laws’ progress across the country:\"First, to be clear, Aylo has publicly supported age verification of users for years, but we believe that any law to this effect must preserve user safety and privacy, and must effectively protect children from accessing content intended for adults. Unfortunately, the way many jurisdictions worldwide, including Florida, have chosen to implement age verification is ineffective, haphazard, and dangerous. Any regulations that require hundreds of thousands of adult sites to collect significant amounts of highly sensitive personal information is putting user safety in jeopardy. Moreover, as experience has demonstrated, unless properly enforced, users will simply access non-compliant sites or find other methods of evading these laws.\"In place of the homepage, in several blocked states, Aylo-network sites show a message read by adult performer and activist Cherie Deville: \"The safety of our users is one of our biggest concerns. We believe that the best and most effective solution for protecting children and adults alike is to identify users by their device and allow access to age-restricted materials and websites based on that identification,\" DeVille says. \"Until a real solution is offered, we have made the difficult decision to completely disable access to our website in your state.\"2025 will be a year of intensifying legal battles against the creep of age verification laws. As such, there is some hope: Not every state where bills were introduced rolled over and allowed their constituents to face more censorship with less safety. In Arizona, governor Katie Hobbs vetoed the copycat bill there. “Children's online safety is a pressing issue for parents and the state,” Hobbs wrote in a letter announcing her decision. “While we look for a solution, it should be bipartisan and work within the bounds of the First Amendment, which this bill does not.”The Free Speech Coalition filed a challenge to the law in Florida earlier this month, along with several co-plaintiffs, including the sex education platform O.school, sexual wellness retailer Adam & Eve, adult fan platform JustFor.Fans, and Florida attorney Barry Chase. “These laws create a substantial burden on adults who want to access legal sites without fear of surveillance,” Alison Boden, Executive Director of the Free Speech Coalition, said in a press release published in December. “Despite the claims of the proponents, HB3 is not the same as showing an ID at a liquor store. It is invasive and carries significant risk to privacy. This law and others like it have effectively become state censorship, creating a massive chilling effect for those who speak about, or engage with, issues of sex or sexuality.”And in Texas, Free Speech Coalition v. Paxton continues and will be heard this month.Age verification bills like the ones flooding the south and beyond are regressive at best, and actively harmful at worst. They’re not just ineffective, they’re worse: they push people to sites where piracy is rampant and moderation—meaning, protection from actual harmful material—is almost nonexistent."
    }
  ]
}