{
  "subreddit": "Virginia",
  "post_id": "14mae2p",
  "title": "Virginia's Age Verification On Adult Websites Is Worse Than You Think",
  "body": "Starting today in preparation for the piece of legislation unanimously passed by the VA house you will no longer be able to access pornhub and if you go to other websites such as xhamster below you will get this message.\n\nhttps://i.imgur.com/ajsuhql.png\n\nSo in order to watch adult materials you need to have the website TAKE A PICTURE of you which is then used by an unspecified third party provider.  Anyone in tech must realize how insanely stupid this is and inevitably there will be a hack linking people's pictures with their adult website habits.\n\nRegardless of whether or not you consume adult content I think everyone can agree this is a gross overreach of the state government and could lead to some seriously embarrassing hacks and scandals in the future.\n\nEdit:  Since this has blown up and many users suggested using a picture of Glenn Youngkin I made a brief video going over that for your enjoyment:https://www.youtube.com/watch?v=amVHu2mTAtM&lc=UgyweLpCHuVVie-6ZNl4AaABAg",
  "author": "[deleted]",
  "comments": [
    {
      "author": "dnext",
      "timestamp": "",
      "body": "Or as I like to call it 'lets enrich the VPN industry' act."
    },
    {
      "author": "Foolgazi",
      "timestamp": "",
      "body": "My first thought was “which VPN company does Youngkin have an interest in?”"
    },
    {
      "author": "Front-Newspaper-1847",
      "timestamp": "",
      "body": "Can you just show the camera a picture of the governor?"
    },
    {
      "author": "IguaneRouge",
      "timestamp": "",
      "body": "\"Welcome back Glen! We've curated a playlist based on your repeated search for \"sweater vests and missionary position no eye contact with a firm handshake finish\""
    },
    {
      "author": "HowardTaftMD",
      "timestamp": "",
      "body": "Someone has got to try this..."
    },
    {
      "author": "WarningOdd7515",
      "timestamp": "",
      "body": "So /NSFW about to have a thread of people beating it with pictures of youngkin taped to their faces?"
    },
    {
      "author": "TheresALonelyFeeling",
      "timestamp": "",
      "body": "My...friend...used a VPN just a little while ago to get around this pesky little requirement.Worked like a charm.According to my friend.ETA: Thanks to the anonymous redditor who decided to award this comment!My first award ever...and it's from a comment about internet porn. Amazing."
    },
    {
      "author": "WhatIsThisSevenNow",
      "timestamp": "",
      "body": "Good thing I am \"in\" Finland.😉"
    },
    {
      "author": "tastickfan",
      "timestamp": "",
      "body": "\"Just use a VPN\"They will come for VPNs next folks."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}