{
  "subreddit": "KotakuInAction",
  "post_id": "8jk7xf",
  "title": "Daily Mail: Newsagents to sell 'porn passes' so adults visiting X-rated websites can prove they are over 18 when age verification laws come in to force | Stewart Paterson, 13 May 2018",
  "body": "Basically, those in the UKcanbuy 'porn passes'in personat a newstand for the Digital Economy Act 2017. EDIT: Not the only option,\n\nAfter appearing in person (captured on CCTV for the duration of the journey, then also inside the store itself), then handing your details to the news guy (record of sale kept by store like any other transaction I assume), who hands it to a third party provider, who hands it to the porn site - this is supposedly more anonymous and secure than verifying yourself at the porn site online?\n\nPorn sites that \"don’t comply (age verification) risk being blocked by internet service providers, and would face fines of up to £250,000 ($350,000)\". So free sites like pornhub would probably block UK IPs to save on the bother.\n\nAnd “implementing some of the strictest data protection laws in the world,” doesn't mean it is secure, it only means that someonemightbe finedafterdetails were hacked.\n\nhttps://archive.fo/XhNAz\n\nDaily Mail: Newsagents to sell 'porn passes' so adults visiting X-rated websites can prove they are over 18 when age verification laws come in to force |  Stewart Paterson, 13 May 2018\n\nAdults who want to watch online porn will be able to buy codes from newsagents proving they are over 18.\n\nNew age verification laws that are introduced this year will require viewers to prove they are not underage.\n\nOne option available to the estimated 25million Britons who regularly visit such websites will be a 16-digit code - or 'porn pass'.\n\nWhile porn viewers will still be able to verify their age using methods such as registering credit card details, the 16-digit code option would be a fully anonymous option.\n\nThe cards will cost around £10 and could can also be used to purchase other age restricted products such as alcohol and knives.\n\nIt is hope he method will be popular among those wishing to access porn online without having to hand over personal details to X-rated sites.\n\nWhile the new rules are designed to protect children, it will mean that an estimated 56 per cent of UK adults who in 2014 admitted to watching porn 'occasionally' will still have to prove their age.\n\nDavid Austin, BBFC chief executive, said age verification was 'simpler than people think' and has been in use for other adult-only purchases.\n\nHe said viewers could expect to see a choice of age-verification options, typically from third party providers, meaning they will not have to share personal details with an X-rated site.\n\nA spokesman for the Department of Culture, Media and Sport, the department which is introducing the legislation, said: 'We are in the process of implementing some of the strictest data protection laws in the world.\n\n'A wide variety of online age verification solutions exist, or are in development, and they will have to abide by these high standards. We expect data security to be a high priority in the BBFC's guidance on age verification arrangements.'\n\nThe BBFC will not create the new age verification systems but will oversee their implementation.\n\nThere is an article from The Verge covering the same issue with a different, more reassuring tone:\n\nhttps://web.archive.org/web/20180513225321/https://www.theverge.com/2018/5/13/17349910/uk-newsstands-porn-pass-age-verification-digital-economy-act-2017\n\nThe Verge: UK newsstands will sell ‘porn passes’ to verify ages under new laws |  Andrew Liptak, May 13, 2018\n\nA slightly more anonymous option than an online database\n\nLast year, Britain approved the Digital Economy Act 2017, which included strict new rules regarding access to pornographic websites. When the law goes into effect later this year, regulators have suggested that users will be able to purchase a so-called “porn pass,” from their local newsstand to verify their age.\n\nThe law will require websites to verify the users ages, or face stiff penalties. Those who don’t comply risk being blocked by internet service providers, and would face fines of up to £250,000 ($350,000).However, the implementation of those rules have been delayed to give the British Board of Film Classification (BBFC) more time to draft its guidelines. Once it does so, those new guidelines will require approval from Parliament.\n\nThe government has said that industry will be responsible to create the verification software, with platforms such as MindGeek’s AgeID cited as one way to verify a user’s age. However, there are concerns about the implications for privacy under such a framework, and The Telegraph reports that the BBFC is suggesting a more anonymous option: their local newsstand. The stores would sell a “porn pass,” a 16-digit code for around £10, and would require a driver’s license or passport to verify the buyer’s age. That method wouldn’t require someone to enter their personal information into an online database. In 2015, the Digital Police Alliance suggested that websites utilize “information already on the books” to carry out these checks, such as post offices or wireless providers.\n\nA spokesperson for the Department of Culture, Media and Sport, which is responsible for the legislation, said that it is in the process of “implementing some of the strictest data protection laws in the world,” and that the range of verification options will have to abide by those standards.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "evilplushie",
      "timestamp": "",
      "body": "Why wouldn't I just use a VPN"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "tnr123",
      "timestamp": "",
      "body": "I guess VPN providers are going to be happy about this :-)"
    },
    {
      "author": "GirlbeardJ",
      "timestamp": "",
      "body": "The law will require websites to verify the users ages, or face stiff penaltiesPenalties so stiff you'll need to verify your age to know what they are."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "vivianjamesplay",
      "timestamp": "",
      "body": "Lol what's next, a wanking licence?"
    },
    {
      "author": "retsudrats",
      "timestamp": "",
      "body": "I'm confused....Is it really that bad for a 14 year old to look up porn and wank off? We grew up just fine watching porn 10 minutes before bed when we became teenagers....Holy shit I sound like my parents.Anyways...Hasn't porn been shown to have positive results on society, like a reduction in sexual based crimes with the rise of easily accessible porn? I'm fucking baffled by shit like this.Is it really that fucking bad that little jimmy watches some girl get it from some guy while the minecraft server restarts? How to we go from a house with no fence, to a house with a fucking 18th century stone wall, mote and draw bridge?Ya know what UK government. Keep doing it. I'm in the US, I'll chill the fuck out and let you keep fucking your citizens over. They'll get fed up with it eventually, and I'll eat my popcorn while they burn your fucking special buildings and newsstands to the ground."
    },
    {
      "author": "Drakaris",
      "timestamp": "",
      "body": "While the new rules are designed to protect children...ha...haha...AHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHA...Jesus Christ, can't stop laughing, I'm literally laughing sooo fucking hard right now, my colleagues in the office are looking at me funny and are starting to panic.Oooh, UK...  Wait, gimme a second to regain my composure... Oh, gawd, my stomach hurts.So, UK... Are you telling me that you just became a country where it's more difficult for a child to watch porn because it's \"harmful\" than it is for untold number of adults to RAPE THOUSANDS OF CHILDREN WITHOUT ANY CONSEQUENCES?!? Wait, wait, wait, let me try to wrap my head around this... So in UK there are consequences and requirements even for adults to watch porn... But instead of watching porn, all I need to do to actually have sex with thousands of underaged girls is to shout \"Allahu Akbar\" and no one will even care what I'm gonna do to the very same children you're trying to \"protect\" from seeing porn... because they will participate in porn... literally... against their wishes......ha...haha...AHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHAAHAHAHA...Even Sweden is not that retarded with their 40 year old migrant \"children\" and community service \"punishment\" for raping little girls. Congratulations, UK, you mind-bogglingly demented fucks."
    },
    {
      "author": "DDE93",
      "timestamp": "",
      "body": "So free sites like pornhub would probably block UK IPs to save on the bother.Why? It’s not terribly easy to serve a fine to a website, especially extraterritorially. That’s why you have the Russian approach (blacklist) or the Chinese approach (whitelist) to pick from."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I'm pretty sure everybody will abide by the law and use their jumping-through-hoops system instead of, y'know, torrenting the pornflics for their wank-a-thon."
    }
  ]
}