{
  "subreddit": "facebook",
  "post_id": "1g8kz3j",
  "title": "Facebook age verification, ID method not working, can i please get some tips to help?",
  "body": "Facebook has revoked the Marketplace from me, i (18+) had to do a video selfie to confirm my age, which didn’t work, so i figured id just do the only other option presented, which was upload a photo of my ID. However i cannot for the life of me figure out how to do this, i cant figure out where to go to even begin the process of uploading the photo, the Facebook help center and google weren’t any help, i am not a marketplace seller and i don’t plan to be but i like looking on there in my free time and id like to get the issue fixed it anyone can provide me with some helpful insight\n\n(Sorry if the flair is wrong, im new here)",
  "author": "AdviceTough4093",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Thank you for posting tor/facebook. Please read the following (this does not mean your post has been removed):SCAM WARNING: If you are having a problem with your account, beware of scammers who may comment or DM you claiming they know someone who can fix your account, or asking you for money or your login information. If you receive a message like this, block and report them.Here is an example of me making a fake hack post and all the scammers who flocked it it, lol.  THERE IS NO REASON FOR SOMEONE TO HAVE TO TELL YOU IN PRIVATE HOW TO GET YOUR ACCOUNT BACK.  If you check the sub there are PLENTY of high karma posts that gives some tips should your account be hacked/locked.r/facebookis an unofficial community and the moderators are not associated with Facebook or Meta.  DO NOT MESSAGE THE MODS ASKING FOR HELP WITH FACEBOOK.Please read the rules in the sidebar (or the 'about' tab if you're on mobile). If your post violates any of them, delete it.If you notice your post has multiple replies but you only see this post, the reason is due tobots and scammers already being removed trying to steal your info/moneyI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "snooping_around",
      "timestamp": "",
      "body": "Have the same problem, no luck"
    },
    {
      "author": "DiamondDepth_YT",
      "timestamp": "",
      "body": "Same thing has happened to me."
    },
    {
      "author": "Fire-and_anvil",
      "timestamp": "",
      "body": "Same here, the selfie app says it's 99.8 percent accurate but obviously not."
    },
    {
      "author": "One_Morning_226",
      "timestamp": "",
      "body": "I am in the EXACT same boat and I have no clue how to upload my ID. It keeps saying \"use the on-screen instructions to upload your ID\", but there is none. If anyone has any advice, PLEASE HELP."
    },
    {
      "author": "Fickle_Elderberry345",
      "timestamp": "",
      "body": "same lmk"
    },
    {
      "author": "AKAiden2974",
      "timestamp": "",
      "body": "Same here."
    },
    {
      "author": "Alienjenna",
      "timestamp": "",
      "body": "Same this is so annoying"
    },
    {
      "author": "Perfect_Effective676",
      "timestamp": "",
      "body": "My sister, 15, did the age verification and it let her into Facebook marketplace. That technology doesn’t discern anything"
    },
    {
      "author": "AdviceTough4093",
      "timestamp": "",
      "body": "me too. now when i try to even access the “learn more” tab under marketplace the screen goes blank like it’s glitching out. so annoying"
    }
  ]
}