{
  "subreddit": "canada",
  "post_id": "1afji4d",
  "title": "Bill S-210 is Just the Beginning: How a Canadian Digital Lobby Group is Promoting a Standard to “Foster Widespread Adoption of Age Verification Technologies in Canada” - Michael Geist",
  "body": "",
  "author": "onegunzo",
  "comments": [
    {
      "author": "Crenorz",
      "timestamp": "",
      "body": "We don't do this with books. Grow up, allow adult content on the internet. This will defeat the purpose of the internet and put walls up. You would need to \"log into the internet\" to do this correctly - and that is not a small feat to accomplish - and really easy to defeat."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "seanwd11",
      "timestamp": "",
      "body": "Pornhub and basically every other top tier porn outfit is a Canadian corporation.Why cripple our best export domestically?"
    },
    {
      "author": "jmmmmj",
      "timestamp": "",
      "body": "A government department was just hacked into, but I’m sure this will be completely secure."
    },
    {
      "author": "redditonlygetsworse",
      "timestamp": "",
      "body": "Worse: the people pushing for this (mostly conservative religious groups) are also in bed with a bunch of private companies that sell - surprise surprise - age \"verification\" services.So it won't even be the government with your browsing data, it will be some rando third party. A rando third party with a great incentive to gather every bit of data about you they can in order to resell it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Govern us harder"
    },
    {
      "author": "Key_Mongoose223",
      "timestamp": "",
      "body": "Why are we even bringing this up right now?Every bill this session should be focused on tangible benefits to housing and cost of living.We can fuck up the internet after we can afford to pay for it again."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This was my first thought on reading the post title. Who are the UBO's of the companies that own it, and silent partners of these companies.Are they the one's lobbying, and what connections so they have to politicians pushing it.All important questions when weird shit's being rammed through."
    },
    {
      "author": "IAccidentallyCame",
      "timestamp": "",
      "body": "This was my first thought on reading the post title. Who are the UBO's of the companies that own it, and silent partners of these companies.Are they the one's lobbying, and what connections so they have to politicians pushing it.All important questions when weird shit's being rammed through."
    },
    {
      "author": "onegunzo",
      "timestamp": "",
      "body": "Ah yes, the nanny state. Let's not have parents do their job of managing their children's activities partake in. Let's have the nanny state do it for us.That's exactly what we need right at this moment. Nothing is more important, at all... /s"
    }
  ]
}