{
  "subreddit": "privacy",
  "post_id": "1fmycfj",
  "title": "Age Verification in A teorical \"metaverse\"",
  "body": "(during the meetup we all got drunk af and i can remember half of it so dont take to heart what i will say)\n\nok so me and some friends we're just yapping about games and how roblox and vrchat had been plagued with pdf files yet roblox wanted to become the \"metaverse\" every single accionist was so desesperated to get in before the new ai \"revolution\" so as whe spoke we came to the conclusion that while useful to have age verification trough I.D cards  it wasnt used for the potential that it could be and so we made up a game based on a method to separate 3 age groups C (children 0-12) B (teens 13-17) A (Adults 18+) in this way we could just allow each age groups to just play with each other on servers without contact with any other But we hit a wall as soon as we realized on how it would work as i tried to make it private because the idea of a game to have that information and to verify it would be hard so  a hash that was made from the identity and biometrics so that the person could verify their age each 3-6 moths and be able to keep playing and being in the correct age group and so i could not think of an all infallible way to have an age verification without documents and face id that would 100% need another external company to verify so i tought about asking about this here, so i am doing\n\ncreddit card verification could work but several countries allow for children to have debit cards wich could also be even harder to verify due to having to research the name in order to get it and also many countries dont even have I.Ds and so with having to massively process all of this reliably with high security and so on and so on, so what can you think to fix this issue?",
  "author": "MarathonRabbit69",
  "comments": [
    {
      "author": "Optimum_Pro",
      "timestamp": "",
      "body": "during the meetup we all got drunk af and i can remember half of itAre you sure you are out of that state?"
    },
    {
      "author": "Super-Marx-Steel",
      "timestamp": "",
      "body": "Have you ever heard of the schrödinger's cat?"
    },
    {
      "author": "MarathonRabbit69",
      "timestamp": "",
      "body": "There is no way at all to reliably verify age if you don’t control the user terminals and require a ID to use the terminal. Period.Everything else is just performance art"
    }
  ]
}