{
  "subreddit": "delhi",
  "post_id": "1avc1x7",
  "title": "Inquiry about Carrying Liquor Bottles: Age Verification and Legal Age Confusion in Delhi Metro",
  "body": "Hey everyone,\n\nI'm planning to host a small party in delhi and I have a question regarding carrying liquor bottles. I'm wondering if the officials checking baggage would ask for the age and ID card of the person who is carrying the liquor.\n\nMoreover, there seems to be some confusion about the legal age for carrying liquor. I've come across multiple posts mentioning that the legal age was changed from 25 to 21, but there are still some sources claiming it's 25. Can anyone clarify whats the real age ?\n\nThanks in advance for your help!",
  "author": "[deleted]",
  "comments": [
    {
      "author": "chefkc",
      "timestamp": "",
      "body": "The legal age in delhi is 21 to drink state wise age differs, I think adults can carry alcohol across the border, also I think you’re allowed . AlsoAs per the Delhi Excise Act, only one litre of liquor - rum, vodka and whisky - in a sealed bottle can be carried from the neighbouring states to the national capital. Since excise is a state subject, every state government has different rules in this regard.Source"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What about age verification? should I carry aadhar and college Id with me ?"
    },
    {
      "author": "canismajoris117",
      "timestamp": "",
      "body": "The legal drinking age in Delhi is 25 years old.AAP had proposed lowering the age to 21 as part of the new excise policy, but the policy was not fully implemented and was subsequently scrapped as a whole, so the old rule still prevails.While security personnel on the metro may not bother too much regarding carrying unopened bottles, they have the authority to object and not allow it if you are not of legal drinking age."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "any source on this information? you'll help a lot and save me from trouble because I dont wanna take no risk"
    }
  ]
}