{
  "subreddit": "RobloxHelp",
  "post_id": "1f3qfjr",
  "title": "Age Verification set my age wrong",
  "body": "Anyways, I attempted to verify my age at the end of last year and the verification thingy set my age to a totally different date... I was born in 2004 and it set it to 2020... now Roblox thinks I'm a 4 year old even though my account was made back in 2014... l've contacted Roblox support numerous times last year, and I tried again yesterday but they keep saying the same thing over and over again... if someone knows a solution, please let me know... thank you :)",
  "author": "TexturalThePFNoob",
  "comments": [
    {
      "author": "DiffOnReddit",
      "timestamp": "",
      "body": "Just wait like 10 years, super easy."
    },
    {
      "author": "RustiesReddit",
      "timestamp": "",
      "body": "I’ll have my own kids by then 😂"
    },
    {
      "author": "EducationalSpirit413",
      "timestamp": "",
      "body": "The only way to change your age is by hacking the system roblox supports just saying just wait 10 more years on asset just wait it out but here's the link down I'm sure that you need an ID but I don't know maybe not but just in case have one I'm pretty sure it's only for Windowshttps://www.youtube.com/watch?v=PnNFpyfzCOE"
    },
    {
      "author": "PresentationOpen1394",
      "timestamp": "",
      "body": "Im having troubles too my friend, pls keep me updated"
    },
    {
      "author": "RustiesReddit",
      "timestamp": "",
      "body": "i hope it gets fixed lol, ill def let you know if something pops up"
    },
    {
      "author": "evm127",
      "timestamp": "",
      "body": "Contact roblox support i had a similar issue i set my location to uk im In the us. I couldnt switch it back until i contacted roblox support. Also maybe verifying your id will fix it"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Contact support and give them proof of your current age if you can (through passport or ID)"
    },
    {
      "author": "H4ckdrag0n999",
      "timestamp": "",
      "body": "Roblox support don't accept passports and IDs sent to them"
    },
    {
      "author": "omc_q",
      "timestamp": "",
      "body": "Dang my man created his account when he was 4 years old"
    },
    {
      "author": "TexturalThePFNoob",
      "timestamp": "",
      "body": "I ended up doing the same thing. Had to wait 5 years. I told them I can show them proof I was older but they said due to COPPA, they couldn't do anything even if it was true"
    }
  ]
}