{
  "subreddit": "askgaybros",
  "post_id": "1dxti1j",
  "title": "It's about time grindr implements age verification as a requirement to download",
  "body": "I always assume I’m chatting with someone 18 or older, even if it’s a blank profile.\n\nMaybe 1 hour ago.\n\nDude just left my place(gorgeous 48 yo with a thick bwc)  we were chatting for a few months and Ifinally got to play with him, so I’m like - let’s keep the train running.\n\nI get a message from this “guy”. Didn’t even look at his profile - all it said was hungforhead👀 , I’m like let’s do it.\n\nHe’s responsive and quick, I asked him “free now?”\n\nHe says “yeah, but I’m on the younger side, is that okay?”\n\nI’m thinking, “oh he probably just turned 18” and I ask, “Age?”\n\n“15”, he responds ……… like WTF, I blocked him immediately. Like seriously, WTF.\n\nI don’t want to use this app anymore.",
  "author": "Shot_Lawfulness_823",
  "comments": [
    {
      "author": "Tokidoki_Haru",
      "timestamp": "",
      "body": "Reads like a cop waiting to do some entrapment."
    },
    {
      "author": "BreadfruitNo357",
      "timestamp": "",
      "body": "yeah people are rarely so forthcoming about their actual age, OP probably dodged a major bullet"
    },
    {
      "author": "Silent-Ordinary3465",
      "timestamp": "",
      "body": "Grindr having a database of government IDs? No thanks.Parents should keep an eye on their children’s internet activity and people shouldn’t be sleeping with anyone who even looks like they could be under 18."
    },
    {
      "author": "DorjeStego",
      "timestamp": "",
      "body": "Grindr having a database of government IDs? No thanks.With how they've been known to have sold peoples' HIV statuses, yeah... no thanks."
    },
    {
      "author": "boredatclass",
      "timestamp": "",
      "body": "The app should be age-restricted by Google and Apple respectively, the stores already have age rating and they already have the user's age on file, just make it impossible to download if the user isn't at least 18"
    },
    {
      "author": "Cael_NaMaor",
      "timestamp": "",
      "body": "Agreed!Same thing but more illegal happened to me...He lied about his age, we chat, he sends a pic & his hand looks young... so I asked again & sure enough...As I was cussing him out for sending that shit to people, he blocked me. I reported it to Grindr on both the app & Twitter, got nothing. I freaked a bit (ain't getting strung up for child porn) so I called the FBI who told me I had to contact the Center for Missing & Exploited Children. So I did... brief chat, nothing.Yeah, it went a bit far for a dick pic, but I be damned if some idiot teenager is getting me jailed over their fun time..  to hell with that. Under 18, DON'T SEND PICS!!"
    },
    {
      "author": "praguer56",
      "timestamp": "",
      "body": "This happened to a friend's son. He was 19 and thought he was chatting and exchanging pics with a19 yr old girl. He got caught up in a swat action and was arrested. The girl was 16. Nothing happened to her. My friend spent close to $100 large defending his son including some 30-day mandatory program if he wanted to avoid a sex offender label. Again, nothing happened to the girl, at all. Something tells me she was part of the trap and if so, that's just shitty."
    },
    {
      "author": "blodreiina",
      "timestamp": "",
      "body": "Or just check id’s. Some of my hook ups used to check mine all the time. Didn’t bother me thought because I wasn’t hiding anything."
    },
    {
      "author": "Oop-Juice",
      "timestamp": "",
      "body": "Fucking feds on Grindr lmfao"
    },
    {
      "author": "Shot_Lawfulness_823",
      "timestamp": "",
      "body": "Always check ID!!!!!!!!!!!!!!!!!!"
    }
  ]
}