{
  "subreddit": "phishing",
  "post_id": "1jruv05",
  "title": "Are social media age restrictions actually protecting children, or just protecting platforms from legal trouble?",
  "body": "Is social media the new playground, and are kids under 13 already playing without supervision?\n\nWe always hear that social media age restrictions exist to protect children from harmful content, cyberbullying, and privacy risks. But let’s be real—kids under 13 are already on these platforms, often bypassing age verification with ease.",
  "author": "CarolinCLH",
  "comments": [
    {
      "author": "Ronin7577",
      "timestamp": "",
      "body": "It's a corporation.   They would let babies sign up if it wouldn't get them in trouble with the fed at some point.   It's the same as porn sites.   Anyone who thinks that a simple popup saying \"are you 18 or over?\" with a yes/no button actually accomplishes anything other than just giving the corp behind it another legal defense just in case is in for a rude awakening at some point in their sheltered life.   These companies do things for two reasons, to make money and to boost public image to try and make more money."
    },
    {
      "author": "EbbPsychological2796",
      "timestamp": "",
      "body": "That popup is designed to flag your content filter on restricted devices... Obviously there's ways around the filters, but that responsibility lies with whoever gives a child a device. They will always find a way around a wall given enough unsupervised time .. always."
    },
    {
      "author": "0O0O0OOO0O0O0",
      "timestamp": "",
      "body": "You’re overthinking it. They exist simply because politicians are getting votes from a certain group of people."
    },
    {
      "author": "Amazing-Wasabi4497",
      "timestamp": "",
      "body": "Correct, CIPA,COPPA don’t do much really it’s just for the government to tell themselves that there are laws in place to protect children"
    },
    {
      "author": "CarolinCLH",
      "timestamp": "",
      "body": "How would you suggest keeping children off? The companies can't see who is logging in"
    }
  ]
}