{
  "subreddit": "Twitter",
  "post_id": "1gith3c",
  "title": "Is anyone else having problems verifying their account?",
  "body": "My account got locked yesterday without any clear reason. When I try to do the captcha test to verify it, I get the following message: \"Something went wrong. Due to a technical issue, we couldn't complete this request. Please try again.\" I'm stuck in this loop until it says I've exceeded my number of allowed attempts.\n\nI've tried the test in both a web browser and the mobile app. Neither are working. I've sent a message to Twitter support, but I haven't heard anything back in over 24 hours.\n\nIs anyone else having this problem? Are there any ways around it?\n\nEdit: I was able to get the captcha to work and unlock my account by using a Chrome browser on a PC with all of the extensions disabled and popups & redirects allowed. Hopefully this post will help someone else in the future if they face the same problem.",
  "author": "SnapTwiceThanos",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »This is an automated message that is applied to every post.  Please take note of the following:Due to the influx of new users, this subreddit is currently under strict'Crowd Control'moderation.Your post may be filtered, and require manual approval.  Please be patient.Please check in with theMega Open Threadwhich is pinned to the top of the subreddit.  This thread may already be collapsed for our more frequent visitors.  TheMega Open Threadwill have a pinned comment containing a collection of the month's most common reposts. Your post may be removed and directed to continue the conversation in one of these threads.  This is to better facilitate these discussions.If at any time you're left wondering why some random change was made at Twitter, just remember:Elon is a fucking idiot and a complete fucking poserSubmissionBy:u/SnapTwiceThanosI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This happened to me several months ago, but it wasn‘t a big deal because the captcha worked, and it let me right back into my account. I’m not sure what’s changed since then.It’s times like this that Twitter really needs a support staff you can contact directly. I’ve sent a couple messages through their help center, but I haven’t received a reply.I’ll let you know if I figure out anything that works."
    },
    {
      "author": "SnapTwiceThanos",
      "timestamp": "",
      "body": "This happened to me several months ago, but it wasn‘t a big deal because the captcha worked, and it let me right back into my account. I’m not sure what’s changed since then.It’s times like this that Twitter really needs a support staff you can contact directly. I’ve sent a couple messages through their help center, but I haven’t received a reply.I’ll let you know if I figure out anything that works."
    },
    {
      "author": "fish_in_a_barrels",
      "timestamp": "",
      "body": "It just needs to die already."
    },
    {
      "author": "SnapTwiceThanos",
      "timestamp": "",
      "body": "I love using it for college football chat. I would leave it in a heartbeat if there were more fans on Bluesky."
    },
    {
      "author": "Unusual_Pie_5148",
      "timestamp": "",
      "body": "yeah same here since friday, till now can't log in. Write in but no reply from them. I didnt violate any rules, just automatic lock me out."
    },
    {
      "author": "SnapTwiceThanos",
      "timestamp": "",
      "body": "I liked several posts Saturday before my account got locked. The only thing I can figure is maybe their system thought my likes were automated.If their system can't distinguish between a bot and a human, it shouldn't be used. It's frustrating getting your account locked or suspended just for regular use of the app."
    },
    {
      "author": "PapayaCautious",
      "timestamp": "",
      "body": "The same thing happened to me. I have two accounts.  The political one will not open. Just happened today."
    },
    {
      "author": "SnapTwiceThanos",
      "timestamp": "",
      "body": "My account isn‘t political, but part of me wonders if there are hackers screwing around with the app since we‘re so close to the election. Hopefully they’ll get this issue fixed soon."
    }
  ]
}