{
  "subreddit": "teenagers",
  "post_id": "trnp6d",
  "title": "How do I get into Facebook marketplace if I’m under 18? I’ve been trying for an hour and can’t find a way",
  "body": "",
  "author": "reddit_user_46290",
  "comments": [
    {
      "author": "Glittering_Loquat779",
      "timestamp": "",
      "body": "If anyone is here in 2025, there is a way you can access it. This will only allow you to browse, and you can't message the seller. This also only works on desktops.Log out of your facebook account. This makes it so facebook thinks you're a new user.Go to the facebook marketplace. You will see a sign-up for facebook marketplace popup. Click on the next on the top right.*NOW YOU ARE IN MARKETPLACE, BUT ONCE YOU CLICK TOO MANY BUTTONS, THE SAME MENU WILL POP UP WITHOUT THE X*3. To \"bypass\" that popup, refresh the page and click X.Thank me later :)"
    },
    {
      "author": "Charming-Tourist7018",
      "timestamp": "",
      "body": "cant change location"
    },
    {
      "author": "FeatureFinal6279",
      "timestamp": "",
      "body": "Well I'm 17 i grown out my beard kinda. So hopefully it works"
    },
    {
      "author": "reddit_user_46290",
      "timestamp": "",
      "body": "Now 19 so it doesn’t matter, it goes off your Facebook age and mine is accurate to my real age so no amount of facial hair will change my birthdate. Also you should probably think about shaving, every kid I know from 15-20 who “grew out a bread kinda” looks terrible"
    },
    {
      "author": "Aggressive_Aerie_128",
      "timestamp": "",
      "body": "Facebook is some bs isn't I'm 15 and I can't do shit"
    },
    {
      "author": "reddit_user_46290",
      "timestamp": "",
      "body": "Yeah I know the struggle it’s really dumb"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "you cant. i know it stupid u either wait until youre of age or make a new account and wait till your account is old enough to use marketplace"
    },
    {
      "author": "reddit_user_46290",
      "timestamp": "",
      "body": "When I tried to make a new account I made a new username and everything and it just logs back into my old one"
    }
  ]
}