{
  "subreddit": "VRchat",
  "post_id": "1jf3h4f",
  "title": "Created a VRChat group today that is Age verification only in protest to all the instances I read in posts that complain about needing to share personal information just to hang out with other adults.",
  "body": "This is my first group that I've been considering making for a while.Here is the link, it's invite only for now, as I'll be manually checking that everyone requesting is Age Verified 18+.https://vrc.group/AOD.1951Let me know if you have any questions, concerns or suggestions. The group banner and icon are subject to be updated to something better.\n\nI do have a small optimized world , that I plan to customize for group only access since it will be an adult only world.",
  "author": "aknockingmormon",
  "comments": [
    {
      "author": "Sanquinity",
      "timestamp": "",
      "body": "Wait, people still want all kinds of personal information for their \"18+ instances\"? Fuck that...I'm age verified. If that's not good enough for you you don't actually want to check if I'm 18+, you just want power/control over me. I'm not dealing with that shit."
    },
    {
      "author": "Gallerian",
      "timestamp": "",
      "body": "Yeah. And their excuse is always the same: \"Oh kids fake it so we still need to see your ID.\"Despite the fact that faking an age verification is actually VERY hard to do. Even the most technologically inept parent would have second thoughts of having to have their ID pictures, then taking profile shots of yourself to make sure the face actually matches the ID.As you said. It's nothing more than a power trip for those guys."
    },
    {
      "author": "SadKat002",
      "timestamp": "",
      "body": "I'm gonna have to find this group so I can join, I'm so tired of little kids being in CAH 😭😭😭"
    },
    {
      "author": "allofdarknessin1",
      "timestamp": "",
      "body": "Awesome. Same tbh. When kids are in the instance it prevents me from playing the cards I'd actually want to play. If you click the link you should be able to request joining. Let me know if it doesn't work."
    },
    {
      "author": "Ryu_Saki",
      "timestamp": "",
      "body": "Considering that it heavily relies on the age verification I assume the \"age date and birth\" thing that bouncers like to do won't be a thing in this group?"
    },
    {
      "author": "allofdarknessin1",
      "timestamp": "",
      "body": "That’s correct. We will be relying solely on VRChats age verification and making age verified only instances. I want to make group public instances eventually to get the group out there but until then we won’t be using a bouncer or asking for any personal information just to get in. The goal of this group is to enjoy VRChat using the systems it has in place and create a frictionless experience as possible."
    },
    {
      "author": "Gallerian",
      "timestamp": "",
      "body": "I also want in on this group. Frankly, it's not even the young kids that piss me off anymore. It's the goddamn teenagers.I swear, I've seen more immature 16 year olds than 10 year olds.But yeah, I'd love more instances where I can actually hang out with other adults."
    },
    {
      "author": "DJR3van",
      "timestamp": "",
      "body": "Bro, I’m just frustrated that the Age Verification is not out for everyone yet. I will absolutely do it when it comes out, but I’m not paying for VRC+ just for this."
    },
    {
      "author": "allofdarknessin1",
      "timestamp": "",
      "body": "I intend to make age verified only instances that focus on Cards Against humanity and Black Cat at first and once I have some mods I can trust I want to host drinking/smoking worlds and dancing."
    },
    {
      "author": "aknockingmormon",
      "timestamp": "",
      "body": "A couple pics are posted in replies to this comment from relevant sections of the VRC FAQ. Just so everyone has the info."
    }
  ]
}