{
  "subreddit": "loopringorg",
  "post_id": "tb1q4i",
  "title": "Can't purchase LRC due to ID verification problems with Ramp? Here is a workaround!",
  "body": "I don't know if there are many others who experienced the same problem, but I wasn't able to purchase LRC via Ramp anymore. The first time purchase via Ramp was without problems, however when I wanted to buy again they asked me to verify my identity. Unfortunately the ID verification process didn't work because \"my smartphone is not compatible\". Very annoying. So, what I did was the following:\n\nGo toloopring.ioand connect mobile wallet with loopring.io\n\nStart the LRC purchase via Ramp onloopring.iodesktop.\n\nRamp will tell you that you need to verify your ID but you can only do it on mobile. They will give you a QR code, email or SMS to send you a link which you can use to continue your verification. I used the email option, so I don't know if the other 2 options work equally well.\n\nOpen the link that you get from them via email and then you can finish the ID verification easily without problems on your smartphone.\n\nIt only took a few minutes for them to verify my ID and you will get a link in that email where you can finish your LRC purchase transaction.",
  "author": "mrdrnordog",
  "comments": [
    {
      "author": "barefoot_au",
      "timestamp": "",
      "body": "Use ramp.network and bypass liquidity fee 😉Also now you verified you can use in app purchase again, just browser for verification process. If you now use ramp.network, best part it will have your most recent eth address ready to deposit."
    },
    {
      "author": "Thick-Court6621",
      "timestamp": "",
      "body": "Thanks for posting this here. It's too often that someone finds a workaround but doesn't share it. So I appreciate you taking the time to help others. I've saved this post to direct other people with the same issue to it."
    },
    {
      "author": "1tpulliam",
      "timestamp": "",
      "body": "Or use layerswap, fun and easy. Do you even bransfer bro?"
    },
    {
      "author": "Fooshi2020",
      "timestamp": "",
      "body": "Is your bootloader unlocked?  Or your phone rooted?  These can be reasons your phone is not compatible."
    },
    {
      "author": "mrdrnordog",
      "timestamp": "",
      "body": "Side note, I had issues with verification as well. I found that using chrome wouldn't work but going through mozilla fixed it. YMMV"
    }
  ]
}