{
  "subreddit": "PiNetwork",
  "post_id": "1itaur0",
  "title": "KYC Verification | Yoti Applicant",
  "body": "Hey Friends I need your help. I am stuck at this step at my verification and I don’t know what I can do or if it’s even still possible to get verified as a Yoti Applicant. I did that in 2021 and totally forgot about that and now I am stuck at this stage. I don’t wanna lose all my pi. Help would be much appreciated!",
  "author": "AutoModerator",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Joinr/pinetworknewsfor Official UpdatesCurrent Issues:Number change is only for people who typed a few digits wrong or used the wrong country codeOpen Network is 20th Feb.See this post about what Exchange you can use:https://www.reddit.com/r/PiNetwork/comments/1ions0q/here_are_the_exchanges_that_listed_pi_so_far/Please see these answers to commonly asked questions, if this doesn't answer your question, hopefully, someone else will.Q1:Can I buy/sell Pi?A: Not by the rules of closed mainnet and we don't allow it here.Q2:A KYC slot is not availableA:  You haven't completed 30 mining sessions or your account is flagged. You can appeal at minepi.com/kyc-application-access but nothing is known about slots or criteria. There's absolutely nothing you can do to get a resolution quicker.Q3:My Application has been processing/in review for weeks/months/yearsA: Your application failed or got stuck. Wait until PCT code a resolution or you get directions in the app.Q4:KYC, Wallet or other parts of Pi app stuck on \"Loading\" or \"Error\"A: Try turning off Private DNS and/or adblocker. Clear app cache, reboot device.Q5:I'm under 18 what can I do about KYCA: Put your date of birth in at the start of KYC - timer will disappear until you turn 18.Q6:Name changes required or failedA: Appeal to change your name. If appeals fail you can spend Pi to change the name.Q7:What is tentative approval?A: Tentative approval means your account needs further security checks.Q8:Why is Pi worth $50+?A: Some exchanges invented their own version of Pi whilst they can't list the real one. These are commonly known as \"Pi IOU\".Q9:I lost my passphrase or wallet compromised/pi stolen, what can I do?A: Create a new wallet and confirm it on steps 3 and 6 of the Mainnet Checklist.Q10:Will I lose all my Pi?A:  No.  Only what's attached to referrals that don't do KYC. We don't know when it will be converted to verified.Q11:When will I get paid for verifications?A: We don't know.Q12:When will my migration happen? / I have been waiting for ages.A: There are millions of people in the queue. View progress athttps://explorepi1364.pinet.com/Q13:What will be the launch price?\"A: The call auction on OKX will determine the launch price.Q14:I stopped getting validationsA: An algorithm demoted you and your account needs a new verification.Q15:blurred Camera problemsA: It's a problem caused by your device - Log on a different device.Q18:400 errorA: We don't know what causes this.Q21:I don't know anything about Cryptocurrency!A: There are free courses on this website:https://cryptosavingexpert.com/courses?show=allCan also report problems athttps://pi.app/support/- You won't get a response - helps them prioritize fixes.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    }
  ]
}