{
  "subreddit": "beatsaber",
  "post_id": "knlgeu",
  "title": "is there a ginormous skill gap between expert and expert+ or am i just bad",
  "body": "holy jesus dude. i was playing expert online today, getting 1st pretty much every round. okay, cool, good, so play expert plus. lose like 20 seconds in, only survived that long cause i was cluelessly swinging my arms around. this shit is mad hard. so am i just garbage or is the skill gap not as exaggerated as i thought it was?",
  "author": "Copoutname",
  "comments": [
    {
      "author": "RasheonFalcon",
      "timestamp": "",
      "body": "There’s definitely a big skill gap between expert and expert+"
    },
    {
      "author": "Vochtvreterr",
      "timestamp": "",
      "body": "Not all ex+ are created equal"
    },
    {
      "author": "dan26838",
      "timestamp": "",
      "body": "Yeah try playing escape exp + and then have a go at ghost exp +"
    },
    {
      "author": "STUMPYPOTATO21",
      "timestamp": "",
      "body": "There is a huge skill gap it took me a while to get it. Then there is camilla which is basically expert ++"
    },
    {
      "author": "PaoLaiZ",
      "timestamp": "",
      "body": "What is camilla? I'm kinda new here!"
    },
    {
      "author": "09eragera09",
      "timestamp": "",
      "body": "Difficulty is all over the place. Some \"expert\" maps I've played are barelyhardbut some expert+ feel like expert+++,  It's not like there's a standard to adhere to, the map creator gives them a difficulty rating based on their own personal baseline."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Copoutname",
      "timestamp": "",
      "body": "It's not so much specifically a skill gap so much as you have to change how you play. You can swing your arms wide for the most part in lower modes, but once you get to expert+ you basically have to swap to what I less-than-affectionately call \"wrist-waggle mode\". It's why I don't ever plan to go to that point. I love dancing and getting good exercise and waggling my wrists just isn't either of those things for me, or fun for that matter.Props to people who can keep up with that mess of arrows even with wrist-waggling, but you don't HAVE to go to that point. There is skill in being able to keep up, don't get me wrong, but the more dramatic difference is the waggle-play change.Also yeah as others said, the whole categorization system is pretty haphazard sometimes and something labelled expert is more like expert++ or something labelled expert is maybe hard at most. It's down the the creator to be cognizant of their own skills and general skills to appropriately label the difficulty.Give me Easy Thriller or Expert Jopping/Mayday/KDA any day."
    }
  ]
}