{
  "subreddit": "PlayDeceit",
  "post_id": "1dqg952",
  "title": "We need some form of age verification.",
  "body": "Children in the game ruin the experience. Especially when they curse and throw the N word around. With the conversations I've heard in the game, I know exactly where they are learning it from. It's not fair for the children or players who are trying to take the game seriously. Perhaps we can have a report button for underage users.",
  "author": "Forward_Rain_1210",
  "comments": [
    {
      "author": "konceptalise",
      "timestamp": "",
      "body": "Yes, please. +16 at least."
    },
    {
      "author": "ZingDev21",
      "timestamp": "",
      "body": "Any underage players you come across please report them in-game. Even better, notify us moderators in the Deceit discord server so we can take action. Is it against the TOS to play under the age of 13."
    },
    {
      "author": "Raistlin-x",
      "timestamp": "",
      "body": "As much as I agree with you, how would that work? It’s up to the parents to monitor their children and there’s nothing you or the devs can do about it, any kid can play GTA5 if their parents let them and it’s no different to playing this game"
    },
    {
      "author": "Brozo99",
      "timestamp": "",
      "body": "Technically there are legal ramifications for letting children play games that are not for there age range. But it would require someone to report parents for allowing it."
    },
    {
      "author": "DistributionIcy1208",
      "timestamp": "",
      "body": "I agree with your reason but not the solution this is a slippery slope I grew up playing any game I wanted and would be so upset if I lost all those memories I had granted I wasn't an a hole who spewed out stuff like that I've met some kids on here who are chill just depends I'd argue some adults act more immature in this game than I've seen with some kids just how it is"
    },
    {
      "author": "Forward_Rain_1210",
      "timestamp": "",
      "body": "Im"
    },
    {
      "author": "Forward_Rain_1210",
      "timestamp": "",
      "body": "Im 13 and ive been playing for 3 weeks and this is my nee faverouite game,I get voted out for being a kid 25% of games but like what can u do.I understand alot of them can be trolls but it wouldnt be fair for the ones that arent"
    }
  ]
}