{
  "subreddit": "TalesFromTheFrontDesk",
  "post_id": "1cvq56k",
  "title": "Guest refused to give me identification or physical card at check in",
  "body": "Context, i work in an inn. It’s a smaller one, about 32 rooms. Independently owned and everything. I’m the evening supervisor.\n\nSo this guest comes yesterday and he was being a complete asshole(anyone else notice an uptick in guests being very mean spirited and entitled lately?) at check in.\n\nI asked him for an id and credit card, which is standard procedure for every hotel, immediately he goes his cards already on file and asks why i need to see it. I said its to verify his payment method by seeing if the name matches the one on the card, he says that i can just verify it by id and i told him i need to see the card, he said he doesn’t feel comfortable with letting me take his card and i told him for the third time that its to verify his identity and i quite literally would just be glancing at the card.\n\nImmediately he snaps at me and says its already on file so he doesn’t see why i need to see it so i tell him that for the last time its for verification, we are not in the habit of checking guests in without verifying their identity first. This made him really mad and he proceeded to invite me to “step outside” because he didn’t feel “comfortable” with showing me the card when other people were around, my coworker was right there and there were maybe 2 guys my age being helped by her. I declined the offer which was clearly a threat (i’m a woman) and he got REALLY mad and said that i was trying to make him discuss his private information in front of everyone and he didn’t feel comfortable with that.\n\nHe becomes very verbally aggressive to the point where the guys are openly calling him an asshole and i tell him that im canceling the reservation and he needs to leave right now. He started arguing with one of the guys and it seemed like an altercation would break out so i had my coworker call the police in the back office. I guess he heard me tell her to do it because he left the lobby while hurling insults at both of us and the guy he argued with.\n\nThen this morning he emailed my manager and left a bad review grossly exaggerating the events that took place, not realizing that the entire interaction was caught on camera and showed he adamantly refused to provide id or a card to us which would’ve ended the entire situation.\n\nSo that was my Saturday evening, my manager is strongly considering hiring security simply because of people like this.",
  "author": "vape-o",
  "comments": [
    {
      "author": "MightyManorMan",
      "timestamp": "",
      "body": "When management replies to the review, go with something like.During check-in, our employee politely requested your see your ID and credit card. Instead, you refused and the employee, could not check you in. When you implied a threat by asking our (female) employee to \"step outside\" was when we called the police and you decided to leave the premises, while verbally abusing even more of the employees. Security cameras captured the entire interaction. Of course, this left us wondering why you would refuse to show ID and provide a credit card for your stay.Something like that. Leave everyone who reads it to draw the conclusion that there was something nefarious to why he refused to show his ID and credit card, like it was a stolen credit card. (It is the first thing that popped into my mind, from experience.)Basically, you are warning others that you will always require it and you won't back down. That it's all on security camera, so you have proof of what he really said and did. It's implied that management saw it and saw no reason to take action, so his story is BS. And finally that security cameras are there, so don't try anything."
    },
    {
      "author": "kagato87",
      "timestamp": "",
      "body": "Don't try to argue.  \"Them's the rules.  I don't make 'em.\"If they persist asking for you to make an exception \"it's not worth my job.\"That's it.  You've already said your hands are tied, and you've preempted the \"I'll get you fired\" angle.  You've actually put yourself on their side of the problem (which is a VERY useful technique for dealing with angry and upset people).When you argue you give the other person something they can pick at to try to unravel.If you think you're talking to a rational person you can indicate that it's for fraud prevention, \"while I don't think you're trying to scam me, we have to check every time because scammers are sneaky.\"But if they're already being an ass, stone wall that point.  That's the rule, I'm following policy.  Wish I could help but I can't."
    },
    {
      "author": "Im_done_with_sergio",
      "timestamp": "",
      "body": "You have to show ID and a credit card at every hotel you check into. What are peoples problems?  lmao what a mantrum!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Are they now on the dnr list?"
    },
    {
      "author": "East-Ad-1560",
      "timestamp": "",
      "body": "Are they now on the dnr list?"
    },
    {
      "author": "Wisdomofpearl",
      "timestamp": "",
      "body": "This type of thing seems to be happening with greater frequency all around. A few days ago I was picking up packages at my local UPS store. A woman, maybe 25-30yo was there to get a package, they always have you sign that you have received your package, she refused to sign. Would not sign on the kiosk or a printed receipt.  They refused to give her the package, she threatened to call the police and they said go ahead and call.  She left and went to her vehicle and her husband or boyfriend came in and signed for package and left. No idea why she didn't want to sign a receipt saying she received the package."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Clearly stolen card."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Thats what im thinking too"
    },
    {
      "author": "No-Falcon-4996",
      "timestamp": "",
      "body": "He clearly was not the guy on file.   You stopped him from whatever his nefarious plan was in your hotel room."
    },
    {
      "author": "vape-o",
      "timestamp": "",
      "body": "Anyone that resistant means something hinky was going on."
    }
  ]
}