{
  "subreddit": "technology",
  "post_id": "1hr4lf3",
  "title": "Pornhub Is Now Blocked In Almost All of the U.S. South. As of today, three more states join the list of 17 that can't access Pornhub because of age verification laws.",
  "body": "",
  "author": "isticist",
  "comments": [
    {
      "author": "rcmjr",
      "timestamp": "",
      "body": "A Federal judge blocked Tennessee’s age verification law for adult websites, citing free speech concerns. As of now, law will NOT go into effect until litigation is concluded.Edited on 1/13/25. Stay on preliminary injunction granted by 6th circuit. Law shall go into effect during litigation."
    },
    {
      "author": "dubt53",
      "timestamp": "",
      "body": "Just verified, still have access. I do the research so you don't have to."
    },
    {
      "author": "Capital-Giraffe-4122",
      "timestamp": "",
      "body": "Gonna start seeing ads for VPNs on all of the evangelical websites"
    },
    {
      "author": "EvoEpitaph",
      "timestamp": "",
      "body": "\"Join ChristNet, The Lord Protects *insert choir-ly jingle*\""
    },
    {
      "author": "SpacklingCumFart",
      "timestamp": "",
      "body": "That's freedom and small government right there."
    },
    {
      "author": "Vict0o0o",
      "timestamp": "",
      "body": "If wish the congressmans who passed this law would verify the age of their extramarital partners with the same caution."
    },
    {
      "author": "ClearChocobo",
      "timestamp": "",
      "body": "They do verify though. The age is the appeal to them."
    },
    {
      "author": "Lord-Nagafen",
      "timestamp": "",
      "body": "The party of small government right here. No porn, no weed, no abortions. It’s like boomer parents but for red states"
    },
    {
      "author": "Careless-Credit-1463",
      "timestamp": "",
      "body": "There is no way to technically verify that person accessing content at that specific moment is the same person that submitted their ID. It's all massive bs and just shows how fucking dilusional are people who create law."
    },
    {
      "author": "isticist",
      "timestamp": "",
      "body": "iirc one of Pornhub's arguments against laws like these is that it will drive traffic to sites that care even less about content moderation and safety... And I tend to agree with that stance."
    }
  ]
}