{
  "subreddit": "VRchat",
  "post_id": "1dp96jj",
  "title": "Age Verification: Thoughts on an optional KYC like system?",
  "body": "I saw the post today about VRChat looking to partner with groups to confirm age.\n\nIn some platforms, I've seen apps that go through a service to verify ID through drivers license or similar documents + a picture of self from camera.\n\nIf this is private, secure, and optional, would that be the best move?\n\nWondering community thoughts and alternatives if not.",
  "author": "Background_Fudge_798",
  "comments": [
    {
      "author": "BicycleClear6926",
      "timestamp": "",
      "body": "For privacy and security, it really depends on the third party they choose.  They have not released any details yet.They stated that they are \"contracting verification out to a third party\".  This is speculation on my part, but I think that what will happen is after you submit your identification to the third party service, you will get a badge or something like that on your profile showing that you are verified, and verifying that you are over 18 or not.  So, VRChat will not handle your information.  And if you don't get verified, you just don't have a badge."
    },
    {
      "author": "Ruddertail",
      "timestamp": "",
      "body": "Yeah, I just hope they're really picky about what company they partner with, and don't just do like Twitter."
    },
    {
      "author": "Bumblerlnteractive",
      "timestamp": "",
      "body": "it seems like the best approach. allow content creators to guard non verified accounts, and allow people the peace of mind knowing they're not talking to a minor especially in relational situations"
    },
    {
      "author": "QuietQTPi",
      "timestamp": "",
      "body": "This is my hope and the best way to do it. I personally value my privacy and respect the privacy of others, but I weirdly am okay with this idea. I think VRChat in particular it's gotten out of hand, but I don't think the issue is specific to VRChat either."
    },
    {
      "author": "ewrt101_nz",
      "timestamp": "",
      "body": "My problem with any verification system is trust.The system has to be proven to be 100% trust worthy or a lot of people won't bother. This is also very hard Todo.So if they can manage it sure. If not and it's forced on me I'm changing games"
    },
    {
      "author": "Cartload8912",
      "timestamp": "",
      "body": "If this is private, secure, and optional, would that be the best move?If they do remote physical ID verification to verify age, then that's one of the worst possible verification methods to date. Electronic ID verification or in-person physical ID verification are far more secure and less privacy-invasive. For the EU, they should use the eID age verification process, or fallback to the postal office age verification service. The US is SOL and must rely on less secure age verification methods, and I'm guessing most other countries don't offer a similar age verification service either, so they're SOL too."
    },
    {
      "author": "KittKattz_",
      "timestamp": "",
      "body": "US hasID.me"
    },
    {
      "author": "Bumblerlnteractive",
      "timestamp": "",
      "body": "Interesting maybe something needs looked into for the US. Never heard of these ones"
    },
    {
      "author": "AR-guyz3776",
      "timestamp": "",
      "body": "Honestly, I think VRC need’s verification if they want to keep the 18+ and under that split. However I have two concerns. One is can we trust to give our personal detail. The other is for people in different country. Many of my friend on VRC don’t even speak English and they are many many different type of documents that can be used for verification, I do wonder how that will work."
    },
    {
      "author": "Background_Fudge_798",
      "timestamp": "",
      "body": "anyone got any groups with this verification that still have slots?"
    }
  ]
}