{
  "subreddit": "OculusQuest2",
  "post_id": "1dtz52n",
  "title": "Age verification code not showing - no success with meta support",
  "body": "I got an email a few days ago saying my account hasn't completed age verification and will be disabled in a week or so.\n\nFair enough - so went through the required steps, did the cc payment age verification and moved on to the stage when it asks for the code being displayed on the device:\n\nhttps://i.imgur.com/QA430uL.png\n\nOnly trouble is, I did the verification on my PC (as that's where I saw the email) and I think at the time my occulus was turned off. When I turned it on there was no code being displayed anywhere!\n\nI've restarted the occulus a few times and poked around the settings menu in there. The only thing I've been able to find is a copy of the original notification saying the account will soon be deactivated.\n\nThe meta page asking for the code doesn't seem to have a way to resend the code - I've stepped back in the process a few times and forward to see if this will retrigger the code to show up, but no luck so far.\n\nIn shear desperation, I've even resorted to pressing the \"Need Help\" button and opened a ticket with meta directly - with some predictable (lack-of) results. Every support message/reply seems to have a 2 day turn around at best, and currently they have gone radio silent.  At this rate I'm going to run out of time before they come back with further questions.\n\nHas any one else run into this issue?\n\nAny suggestions on how I can get the code to retrigger?",
  "author": "jontomas",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hi,u/jontomas! Thank you for your submission.The following is a public announcement to everyone, and may not be in relation to what you've posted:Sales Notice:Only purchase Oculus products fromoculus.comor from one of their authorized retail sellers such as Amazon, Walmart, GameStop, etc...TheofficialOculus website isoculus.com, there are fake websites likeoculusus.com, which scammers run.If you ever encounter a fraudulent seller on Amazon, please look into Amazon'sA-to-z Guarantee Refund.Referrals:Please read ourReferrals Noticebefore posting/commenting referrals.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "VadimRus4731",
      "timestamp": "",
      "body": "I have the same problem right now, but idk the solution. I hope someone finds out how to fix this"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "nah, meta are useless. they replied to me with an update a week ago asking for a screenshot of the issue . . . which is of course a screen with no code on it.It's been a few weeks - nothing seems to have happened to my account (yet)"
    },
    {
      "author": "jontomas",
      "timestamp": "",
      "body": "nah, meta are useless. they replied to me with an update a week ago asking for a screenshot of the issue . . . which is of course a screen with no code on it.It's been a few weeks - nothing seems to have happened to my account (yet)"
    },
    {
      "author": "Muted-Candidate1573",
      "timestamp": "",
      "body": "You have to remote log out of your headset then enter the 8 digit code you normally use to log into your headset when you first got it"
    },
    {
      "author": "Own-Macaron1895",
      "timestamp": "",
      "body": "how do you do that?"
    },
    {
      "author": "Fit-Audience6206",
      "timestamp": "",
      "body": "Did you figure it out? Having the same issue."
    },
    {
      "author": "jontomas",
      "timestamp": "",
      "body": "nope, but account was never disabled.when they forced the facebook account link I had issues linking and suspect I may have created, but not used, another account - I think this was the account in question."
    }
  ]
}