{
  "subreddit": "discordapp",
  "post_id": "hxe7i6",
  "title": "Discord's Age Verification Handling is a joke",
  "body": "You are only allowed to verify your age if your account is locked. Any other time and support will just brush you off.\n\nThis is by far the worst mechanic of discord, standing in complete contrast to the many fantastic mechanics of discord that surround it. For a company that gets so many features right, it completely blows me away how they could have gotten this component so unbelievably wrong.\n\nWhen using discord I always feel supported and valued by the company, right up until they want to verify my age. All of that concern goes through the window and it feels lazy that they don't even bother to offer a system of verifying your age before any kind of termination / account lock.\n\n\n\nI made a feature request about this which also has their frustrating support ticket response, if anyone's interested. There are some comments on there of people sharing similar frustrations\n\nhttps://support.discord.com/hc/en-us/community/posts/360071868431-Allow-users-to-verify-age-with-documents-at-any-time",
  "author": "BannedByDiscord",
  "comments": [
    {
      "author": "Purpzie",
      "timestamp": "",
      "body": "All of that concern goes through the window and it feels lazy that they don't even bother to offer a system of verifying your age before any kind of termination / account lock.That's... literally what leads to account locks in the first place. You can very easily put in your birthday to verify your age. You only need your ID tochangewhat you've said on that exact screen.Also, saying that you're under 13 is indirectly verifying your age too. Discord is literally, legally required to ban you if you're under 13. It's your fault for saying that if you aren't actually that age.So congrats, this was already a thing before you even wrote this. I suggest researching before you post."
    },
    {
      "author": "ReesesBees",
      "timestamp": "",
      "body": "They ask for it to prevent underage users from joining. If you're underage and you lie about your age, then your account gets deleted; plain and simple.If you want toCHANGEyour birthday, you need to prove it with your ID to staff."
    },
    {
      "author": "BannedByDiscord",
      "timestamp": "",
      "body": "This is part of a bigger problem in the way Discord handles accounts in general. They do not care about their users. They don’t care that some people are very attached to their account, servers, and Discord friends, especially in times of COVID. They also don’t care that for some people, this is literally their support system, and yanking it away for stupid reasons can completely crash their mental health (not talking about myself, but someone I know nearly became suicidal after losing their account).Anyway, Discord has gotten so big they no longer care about individual users. Make a joke about your age? Get banned forever. Accidentally join a server where someone violated TOS? Get banned forever. Lost your codes for 2FA? Get banned forever. Don’t have a legit non-prepaid phone number that receives text messages? Get banned forever.It’s much easier to just blanket ban everyone than try to find alternate solutions to these problems, have a warning/escalation system, or a support team that consists of people and not bots."
    }
  ]
}