{
  "subreddit": "AvakinOfficial",
  "post_id": "17blmt0",
  "title": "Age Verification ✅",
  "body": "We are introducing a new feature:Age Verification coming October 23rd\n\nIn response to your many requests for heightened privacy and safety features regarding age verification, we are going to provide the option to authenticate your age for 18+ players.\n\nWhat does this mean? Avakins can validate their age and 18+ status through our partnership with Yoti, a private, secure, and independent age assurance tool. This process is quick and safe!\n\nWhat Age Verification Unlocks:\n\nPlayers who successfully verify their age will receive access to the exclusive Age Verified Apartment feature which will allow you to create Age Verified rooms!\n\nAge Verified apartments will offer a less restrictive chat filter, so verified users can chat more freely.\n\nA unique badge and profile background to better help you identify friends who share your 18+ status.\n\nAvakins who are not age verified cannot interact with Age Verified spaces. This feature ensures that you can foster community and trust with other adult players while also enhancing the safety and player experience for the younger audience.\n\nTo initiate the age verification process, head into the Avakin Life app and click on Account under the Settings menu. Avakins who have self identified as 18 or older will receive the option to verify their age.\n\nWe hope that the new age verification feature provides you with even more unlimited ways to be you. As always, we are open to your feedback!\n\nAGE VERIFICATION FAQ",
  "author": "LKWD_Maia",
  "comments": [
    {
      "author": "LKWD_Maia",
      "timestamp": "",
      "body": "📌 More information"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Will there be Age Verified Social Spots and maybe a filter in shops for age verified clothing/accessories?"
    },
    {
      "author": "FrostyVegetable7473",
      "timestamp": "",
      "body": "PLEASE give us adult clothing only available to 18+ verified accounts and only visible to people inside 18+ rooms, I would pay a fortune for this."
    },
    {
      "author": "InternationalBug8113",
      "timestamp": "",
      "body": "Makes me wonder, will 18+ animations get added to the game one day because of this, such as kissing, etc"
    },
    {
      "author": "Izzy_Moonz",
      "timestamp": "",
      "body": "What if we are 18+  but we look younger than we are?"
    },
    {
      "author": "LKWD_Maia",
      "timestamp": "",
      "body": "In the event that the age estimation process returns your age as under 18, you may use an identification document to verify your 18+ status."
    },
    {
      "author": "RedJayne",
      "timestamp": "",
      "body": "The badge and background is a great idea! Super easy to identify. This will be a massive game changer."
    },
    {
      "author": "SagHaBW",
      "timestamp": "",
      "body": "Yess!! This has been much needed for a while! 🤎🤎🤎"
    },
    {
      "author": "nfsracer08",
      "timestamp": "",
      "body": "Just found out about Yoti app. Does not look complicated and i have to do a face scan to register on the app. lol i'll wait for this feature before getting on Yoti. Thank you for this exciting news!"
    },
    {
      "author": "LKWD_Maia",
      "timestamp": "",
      "body": "Thank you for your feedback! We look forward to hearing more of your thoughts once the age verification feature is available."
    }
  ]
}