{
  "subreddit": "samsclub",
  "post_id": "1dlhern",
  "title": "Verifying Age for Customers who Purchased Alcohol",
  "body": "I started working at Sam's Club recently, and I spend a part of each shift scanning receipts before customers exit the store.  Sometimes a prompt pops up telling me to select \"Yes\" or \"No\" if a customer who purchased alcohol appears to be at least 27 years old.  Regardless of whether I select \"Yes,\" or select \"No\" and then ask for ID, the scanner screen reverts to where it was before I scanned the receipt.  The same thing happens if I select the option to bypass age verification.  I have mentioned this to several managers and asked them why this is occurring, and the only reply I have received from any of them is \"Hmmm, I've never heard of that before.\"  The only suggestion they have offered is for me to check out a different scanner.  I have done that several times, and the same thing happens regardless of the scanner. Since this interferes with my ability to complete the scanning process for some customers, and it holds up the line when I have to ask a colleague to do the scanning for those situations, I am very concerned about getting in trouble.  Has anyone else experienced this issue and, if so, what did you have to do to correct it?  I am interested in any suggestions or advice that other Sam's Club associates on this subreddit might have.  Thank you",
  "author": "Primary_Evidence447",
  "comments": [
    {
      "author": "cherrycityglass",
      "timestamp": "",
      "body": "I had this happen and it stopped happening after I completed the CBL (computer based learning) module on alcohol sales. Nobody could tell me if those two things are related, but here we are."
    },
    {
      "author": "Primary_Evidence447",
      "timestamp": "",
      "body": "As it turned out, management had not yet assigned the numerical code that I needed to be able to verify age on the hand-held scanner when scanning receipts. They finally assigned it to me about six hours into my shift on Sunday, and everything was fine after that. It kind of irks me that I was thrown up to the front without all the tools that I needed. Glad it is resolved, though."
    },
    {
      "author": "BoardImmediate4674",
      "timestamp": "",
      "body": "Yep"
    },
    {
      "author": "Primary_Evidence447",
      "timestamp": "",
      "body": "Thanks for your reply. I did the CBL module on alcohol sales during the orientation, but maybe I missed a final step to certify that I had completed the module. I will check that out before I clock in today."
    },
    {
      "author": "Primary_Evidence447",
      "timestamp": "",
      "body": "Re-did the Alcohol Sales module this morning before I clocked in, but the same issue continues to happen. Only a week and a half into this job and confused as to why this is happening."
    }
  ]
}