{
  "subreddit": "ncpolitics",
  "post_id": "18t1fjl",
  "title": "Pornhub disabled in NC due to age verification requirements (WTH NC?!?!?!? Such a prude, lol)",
  "body": "",
  "author": "OffManWall",
  "comments": [
    {
      "author": "KevinAnniPadda",
      "timestamp": "",
      "body": "People will still look at Internet porn. They will just end up on sites that are a bit sketchier, which means they may include rape porn and child porn. This will solve nothing."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "100% this. The more mainstream sites will self block and the darker shit will still be available and gain more eyes.They should have consulted with the masterbating community on this, we could have told them"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "The effects of small government republicans is to control the market with laws that are questionably constitutional."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Small government republicans my ass. They are in your house, your bedroom, your church, and now your computer."
    },
    {
      "author": "Eyruaad",
      "timestamp": "",
      "body": "You should know by now, Republicans top and only priority is what you do with your private parts."
    },
    {
      "author": "Haywoodjablowme1029",
      "timestamp": "",
      "body": "I'm so tired of these \"christian\" jackasses trying to force everyone else to follow their particular moral code. Your religion and moral code isn't better than anyone else's. You don't get to decide for everyone else. You are an asshole."
    },
    {
      "author": "Felix_Von_Doom",
      "timestamp": "",
      "body": "Their religion and moral code is worse in almost every conceivable way."
    },
    {
      "author": "jhguth",
      "timestamp": "",
      "body": "Under his Eye"
    },
    {
      "author": "Solid_Flatus",
      "timestamp": "",
      "body": "It’s the responsibility of the parents to safeguard their children online, not big daddy gubmint."
    },
    {
      "author": "OffManWall",
      "timestamp": "",
      "body": "What?!?!?!That can’t be true, I was just………uhhh, I mean, a friend of mine was just on there last night!"
    }
  ]
}