{
  "subreddit": "privacy",
  "post_id": "1g425zb",
  "title": "It's not just a 'teen social media ban', it's a national age verification scheme",
  "body": "",
  "author": "Delicious_Ease2595",
  "comments": [
    {
      "author": "nidostan",
      "timestamp": "",
      "body": "So how long before we need age verification for reddit and youtube?  Predictions?"
    },
    {
      "author": "Stefan_Estpascher",
      "timestamp": "",
      "body": "Can I see your id sir/m’am ?"
    },
    {
      "author": "Cronus6",
      "timestamp": "",
      "body": "I mean my reddit account is  almost 17 years old and I'd guess my YouTube account has to be 18 or 19 years old now. So just go by that lol."
    },
    {
      "author": "foobarhouse",
      "timestamp": "",
      "body": "Obviously."
    },
    {
      "author": "Yodl007",
      "timestamp": "",
      "body": "I read that in Snapes voice."
    },
    {
      "author": "cycling_triviality",
      "timestamp": "",
      "body": "Yeah, sure, let’s give even more personal info to companies that already mishandle our data"
    },
    {
      "author": "austriaianpanter",
      "timestamp": "",
      "body": "Facebook collected biometrics and facial recognition “to identify people” but they bent over when the chines government asked them to share such data they then removed it in 2023 out of no where watch a leak happens then they will say they have no access to that data. Dirty fucking companies"
    },
    {
      "author": "austriaianpanter",
      "timestamp": "",
      "body": "A security nightmare incoming when this whole fucking thing gets leaked online with legitimate copies of IDs and addresses gets exposed in a data base. If I have to sacrifice my fucking identity to shitpost online then fuck social media in its ass I will use fucking telegraph lines to shit post.I WANT TO KNOW IF I CAN SHIT POST IN PEACE."
    },
    {
      "author": "Flawed_L0gic",
      "timestamp": "",
      "body": "calling it now, this is how it will play out:identification to use the internet is introducedsystem is centralized because nobody thought about inherent security modelssystem is inevitably compromised because it is now one of the most valuable databases in the worldwith everyone's ID compromised, criminals now simply use legitimate citizen's informationcybercrime industry offers ID-faking services, anyone can now use a proxy to browse using a random person's IDwe are now back at the original problem, except those who use the internet legitimately are the ones who suffer, and ID theft is even more prevalent"
    },
    {
      "author": "Delicious_Ease2595",
      "timestamp": "",
      "body": "Road to Digital IDs as planned, have you noticed?"
    }
  ]
}