{
  "subreddit": "privacy",
  "post_id": "voaicx",
  "title": "“10% error rate is okay“ - Leaked EU Commission document regarding Chat Control, the law that requires the mass surveillance of messages and photos",
  "body": "TL;DR:\n\nGermany had asked the EU whether there should be a requirement for reporting hits (i.e. 99.9% hit probability). However, the commission \"did not make such a numerical determination in order to ensure openness to technology and progress.\"   Currently the software has a 90% hit probability (out of 1 million photos 100.000 are falsely reported).\n\nThe commission \"does not seek to break encryption,\" according to the report. But \"encryption is not only important to protect private communication, but would also help perpetrators/criminals\".\n\nThe GDPR remains applicable. COM emphasized that automated processes would have no direct impact on natural persons. Rather, these only led to forwarding to the EU center. In addition, the draft COM contains numerous safeguards (including orders from the competent authority or court, remedial proceedings, VHMK, involvement of the data protection authority).\n\nsearch engines, unless they are hosting service providers, are currently not covered by the draft, although they are still open to add them. Live streaming is as part of the definition of CSAM. Classified communications and corporate/government communications are not included.\n\nDo file/image-hosting provider, which do not have access to the content they store fall under the scope of the Regulation?/Should technologies used in relation to cloud services also enable access to encrypted content?Cloud services that only provide infrastructure but have no access may not be suitable addressees of identification orders. Orders could only be issued if suitable technologies were available.\n\nHow do you want to ensure that providers solely use the technology – especially the one offered by the EU Centre – for executing the detection order? How would we handle an error? How should eventual cases of misuse be detected?Misuse of technology would result in penalties. The compliance of the providers is to be ensured by national authorities. Incidentally, technologies are only suitable for identifying CSAM.\n\nDo cloud services have to block access to encrypted content if they receive a suspicious activity report about specific users?No, because blocking orders only refer to publicly accessible material.\n\n\n\n[The original article can be found onnetzpolitik.org. Feel free to correct any translation mistakes you may stumble upon in the comments]\n\n\n\nLeaked report\n\nWith the planned chat control, investigators will have to view erroneous hits, because even the EU Commission is expecting false alarms. They have responded to Member States' questions behind closed doors. We published the document in full text.\n\n\n\nCentral points of criticism of the chat control planned by the EU Commission seem to be confirmed. The EU Commission apparently expects that investigators will have to check many harmless recordings and chats of minors with their own eyes. That and more is in a Wire Report classified as Official Use Only, which we are releasing in full. It summarizes the answers of the EU Commission to the questions of the member states. 61 questions came from Germany alone.[seemy post from last week for more context]\n\n\n\nChat control is part of a law draft by the EU Commission to combat sexualized violence against children online. Among other things, it is planned that providers will also automatically search private messages for suspected criminal content if ordered to do so. IT experts and representatives of civil societycriticize this as a reason for mass surveillance.Lisa Paus (Greens)andVolker Wissing (FDP), also reject possible interference with confidential communication by Ministers of the German federal government.\n\n\n\nOne point of criticism of the planned chat control is the susceptibility of detection software to errors. No software is perfect. In the case of false-positive hits, harmless messages, chats and photos of innocent people could end up on the screens of investigators - with the suspicion of criminal offenses such as the so-calleddistribution of child pornography. The EU Commission is apparently aware of the problem and is consciously accepting it.\n\n\n\nAccording to the report, the accuracy of current grooming detection technology is around 90 percent. That means: \"9 out of 10 contents recognized by the system are grooming.\" It is called grooming when adults initiate sexualized contact with minors. That corresponds to 100,000 false alarms for one million messages recognized as supposedly suspicious.\n\n\n\nGermany had asked the EU whether there should be a requirement for reporting hits, such as a hit probability of 99.9 percent. In this way, false-positive hits can be reduced. However, the commission \"did not make such a numerical determination in order to ensure openness to technology and progress.\"\n\n\n\nAs a result, people in the planned EU center should sort out false positive hits by hand. This means that investigators may also potentially see legal footage of minors. In family chats, for example, or photos of their own children or grandchildren on the beach. It's not illegal, but the technical systems can't just contextualize something like that. Germany wanted to know from the EU Commission whether the technology would recognize such non-abusive images. In its reply, the Commission again refers to the staff at the planned EU center who would check false positives. And: “Algorithms could be trained accordingly”.\n\n\n\nBy then, the legal images would end up on the screens of EU investigators. For many teenagers, it has long been part of everyday life to mutually exchange nude pictures, so-called sexting. Such photos could also trigger an alarm during chat control. \"If such reports are received, criminal liability must be determined under national law,\" says the report.\n\n\n\nAccording to the report, the EU center should only inform the respective law enforcement authorities in the member states after sorting out false hits. The law enforcement authorities should not be able to access the unsorted hits directly. The EU center should have the EU police authority Europol as a “key partner”. A “close cooperation” is essential. \"It is also important that Europol receives all reports in order to have a better overview,\" the summary said.\n\n\n\nAt first glance, the planned chat control and end-to-end encrypted messages don’t add up. These messages can only be deciphered by the sender and recipient in their messengers. In order to control the messages anyway, this principle would have to be overturned. The commission \"does not seek to break encryption,\" according to the report. But \"encryption is not only important to protect private communication, but would also help perpetrators/criminals\".\n\n\n\nA possible solution would be for software to check photos and videos locally on your own device before they are sent in encrypted form. The use of this so-calledclient-side scanningis becoming apparent, but IT security researchers warn against it.\n\n\n\nChat control becomes mass surveillance as soon as many providers screen masses of users. The law draft stipulates that providers will only be ordered to control chats if there is a significant risk that their service will be misused for sexualized violence against children. In its answers to the member states, the EU Commission now went into more detail as to when this risk arises. Accordingly, it is not enough that a provider has \"child users\", i.e. is used by children. One measure to minimize the risk is that strangers cannot make direct contact with underage users.\n\n\n\nThe report cites the career platform LinkedIn as a concrete example of a provider without a relevant grooming risk. There, adults in particular exchange information about their professional successes. According to the report, initiations often take place on WhatsApp or Skype as well as via video games. The mention of WhatsApp and Skype does not automatically mean that these providers should expect a chat control order. But they show a trend.\n\n\n\nWhatsApp’s parent company Meta seems to be relaxed about the measures according to the report. There it says: “The 'Meta' group welcomed mandatory measures - also for industry. Self-regulation has its limits.” At the same time, Meta rejected “client-side scanning”in its own study because it violates the rights of users.\n\n\n\nAnother concern of critics is that chat control could be the cornerstone for even more information control. After all, automatic recognition systems can be trained on any type of content. Authoritarian states, for example, could ask providers to also search for politically undesirable content. According to the report, the EU Commission responded in this regard: \"Abuse of technology would result in penalties.\" National authorities would have to ensure that providers behave in accordance with the rules.\n\n\n\n\"Moreover, technologies are only suitable for identifying CSAM,\" the report goes on to say. CSAM stands for \"child sexual abuse material\", i.e. recordings of sexualized violence against minors. But image recognition can basically be trained on any content - it can search for CSAM as well as for photos of theTiananmen massacre.\n\n\n\nWe asked the \"Stop Chat Control” initiative for an initial assessment of the replies from the EU Commission. \"The Commission's answers are mostly evasive and sometimes even contradictory,\" writes a spokesman for the initiative. Many of the problematic points raised by the federal government, such as technical implementation, are not discussed in detail. “The Commission openly admits that in some cases it wants to require legislation that cannot be technically implemented. In doing so, it not only opposes fundamental rights, but reality itself.”\n\n\n\nThis reinforces the initiative's demand that the draft should be completely withdrawn. The Federal Government cannot be satisfied with these answers. Civil society organizations from all over Europe have been warning of chat controls for months. More than 160,000 people have signed a petition in Germany, and there haverecently been protests on the streets.\n\n\n\n\n\nHere is the complete document:\n\nDate: 24thJune 2022\n\nClassification: Classified - For official use only\n\nFrom: Permanent Representation EU Brussels\n\nTo: E11, Management\n\nCopy for: BKAMT, BMWK, BMDV, BMI, BMFSFJ, BMBF, BMG, BMJ\n\nSubject: RAG Law Enforcement - Police (LEWP-Police) meeting on 22 June 2022\n\n\n\nThe focus of the RAG meeting was the presentation and answering of the questions submitted on the COM draft of a proposal for a regulation to more effectively combat the sexual abuse of children by the COM.\n\nThe next meetings are scheduled for July 5th and 20th.\n\n\n\nThe agenda was adopted without changes.\n\nKOM reported on the Global Summit of the WeProtect Global Alliance (WPGA). The results of the summit included the affirmation of the joint fight against CSA, the establishment of a task force and a voluntary framework for industry transparency (cf. ppt presentation attached).\n\n\n\nPres reported on the operational CSA seminar from June 14-16 in Paris (see attached ppt presentation). The focus was on the digital dimension of CSA and the rights of those affected. In addition, there was a focus on uncovering financial flows. In addition to representatives of (operational) national authorities, the participants also included industry representatives. During the corona pandemic, there was a sharp increase in the number of spreads of CSAM. The increase in the area of ​​Live Distant Child Abuse (LDCA or \"live streaming\") was particularly strong. LDCA usually takes place against payment of money, the initiation takes place in the clearnet, often via Skype or Whatsapp, sometimes the parents of the children concerned are also involved in the actions. Criminals are increasingly using çrypt0ćûrr-3ncy to encrypt their identity. Grooming is increasingly taking place via video games. Pres presented \"undercover avatar\" for preventive contact with children in Online games (Fortnite) (project supported by Europol).\n\n\n\nPres presented a successful FRA or BRA investigation. Perpetrators could be identified with the help of suitable indicators or automated processes on Google Drive or Google Photos.\n\n\n\nThe \"Meta\" corporation[Facebook, Whatsapp, Instagram]welcomed mandatory measures - also for the industry. Self-regulation has its limits.\n\n&nbap;\n\nEuropol reported on activities in the fight against CSA (cf. ppt presentation attached). With a specialized analysis team (AP Twins), reports from NCMEC would be received, enriched and forwarded to 19 MS + Norway. NCMEC reports are currently being received via ICE HSI. With the entry into force of the new Europol mandate (Art. 26b), Europol is authorized to receive personal data directly from private individuals, to process it and to forward it to MS. The enrichment of the NCMEC reports at Europol is carried out by flagging new or known material and parallel investigative procedures and, as far as possible, by analyzing metadata. Processes are partially automated, and the GRACE project (financed under Horizon 2022), which aims to improve automated process processing, is also related to this.\n\n\n\nEuropol also transmits operational and strategic reports to MS. Cooperation with MS would take place during and after operational investigations (particularly digital forensic support and victim identification task force). Public participation through “Trace an Object” initiative, which allowed crime scenes to be identified via social media.\n\n\n\nPres then gave an overview of the questions received: 12 MS submitted a total of around 240 questions. It should be emphasized that the comments submitted to the COM proposal were mostly positive. This was followed by chapter-by-chapter verbal answers to questions by KOM.\n\n\n\nKOM has summarized questions and presented them without establishing any reference to the respective MS. Insofar as a direct reference to DEU questions could still be made in the context of the KOM presentation, this is presented below.\n\nGeneral questions:\n\nCOM first made a general statement on the interaction of the draft with DSA/TCO/GDPR. DSA is a horizontal set of regulations for creating a secure online environment, the regulatory basis for which is also Art. 114 TFEU. COM draft of a CSA-VO is based on this. Ie. unless the CSA-VO makes any more specific provisions, Art. 14 and 19 DSA, for example, continue to apply. Content flagged after this does not entail an obligation to remove it, but could serve as the basis for orders under CSA-VO-E. The GDPR remains applicable. COM draft ensures continuous and early involvement of the data protection authorities, e.g. when evaluating suitable technologies and when using them in the context of orders. Especially in the fight against grooming, the COM draft goes further than the GDPR, since the involvement of the data protection authority is absolutely necessary. KOM emphasized that automated processes would have no direct impact on natural persons. Rather, these only led to forwarding to the EU center. In addition, the draft COM contains numerous safeguards (including orders from the competent authority or court, remedial proceedings, VHMK, involvement of the data protection authority).\n\n\n\nCOM explained that the draft is in accordance with Art. 15 eCommerce Directive in conjunction with EC 47 and relevant case law. Targeted identification of clearly illegal material on the basis of national orders is not covered by the ban. The draft COM is particularly proportionate, since orders can only be issued in individual cases (where safety by design is not sufficient), orders are to be issued as specifically as possible, safeguards are in place and a strict proportionality test is required. Finally, KOM emphasized that CSAM is clearly illegal in any case - an assessment is not context-dependent.\n\n\n\nLike the COM draft, TCO-VO is a sectoral regulation. The definition of \"hosting service provider\" of the TCO-VO also applies to the COM draft. Art. 39 of the COM draft is based on Art. 14 TO VO and Art. 67 DSA.\n\n\n\nRegarding Germany’s 20th Question: On page 10 of the proposal it says „Obligations to detect online child sexual abuse are preferable to dependence on voluntary actions by providers, not only because those actions to date have proven insufficient to effectively fight against online child sexual abuse(…)“ What is COMs evidence proving that these voluntary options are insufficient?\n\n\n\nKOM referred to the Impact Assessment and highlighted four main points: first, voluntary measures are very heterogeneous (in 2020 more than 1600 companies were required to report to NCMEC, with only 10% of companies having reported at all, 95% of the reports came from \" Meta\").\n\nSecondly, voluntary measures are not continuous as they are part of company policy. Thirdly, voluntary measures also affect the fundamental rights of private individuals, decisions on which should not be left to private (market-powerful) companies. Fourth, voluntarily active companies also left data subjects alone to remove CSAM content affecting them. Those affected and hotlines lack a legal basis for searching for CSAM, and KOM wants to change this.\n\n\n\nRegarding Germany’s 10th Question: Can COM confirm that providers voluntary search for CSAM remains (legally) possible? Are there plans to extend the interim regulation, which allows providers to search for CSAM?\n\nA permanent and clear legal basis is required. Loopholes after the Interim Regulation expires should be prevented. It is still too early to determine how the transition period until a CSA-VO comes into force could look like, an extension of the InterimsVO is also possible. Hosting service providers who are not covered by the e-Privacy Regulation and are therefore not affected by the expiry of the Interim Regulation can continue to take voluntary measures.\n\n\n\nSeveral questions about encrypted content had been received. Also to GER questions 4 and 5: Does the COM share the view that recital 26 indicating that the use of end-to-end-encryption technology is an important tool to guarantee the security and confidentiality of the communications of users means that technologies used to detect child abuse shall not undermine end-to-end-encryption?\n\n\n\nCould the COM please describe in detail on technology that does not break end-to-endencryption, protect the terminal equipment and can still detect CSA-material? Are there any technical or legal boundaries (existing or future) for using technologies to detect online child sexual abuse?\n\n\n\nCOM draft is not directed against encryption. COM is not striving to break encryption, but rather has recognized the importance of encryption. Encryption is not only important to protect private communication, but would also help and cover up perpetrators, which is why KOM did not want to exclude encryption from the draft. In this context, KOM referred to Annex 8 of the Impact Assessment, which describes various technologies. KOM is also in contact with companies that are willing to use the technologies presented or are already using them. COM emphasized that the least intrusive technology should always be chosen and that where no technology is available that meets the COM draft requirement, no identification orders can be issued.\n\n\n\nSeveral questions on SMEs had also been received. Although SMEs cannot be excluded from the scope of the draft, the draft provides for a wide range of support. Among other things, by the center and national authorities by providing support in the context of risk assessment and the use of technologies. Training of employees is planned together with Europol or organizations like WPGA. In particular, the EU center takes over the control of reports.\n\n\n\nKOM explained the expected positive effects of the draft. These included: effective detection and removal of CSAM, improvement of legal certainty, liability and the protection of affected fundamental rights as well as harmonization of measures. The draft has a significant impact on the offline dimension of CSA, especially in the area of ​​prevention and support for those affected. Online and offline aspects can hardly be separated.\n\n\n\nArt. 2 f summarizes the previously presented definitions for better readability.\n\n\n\nOn the scope: search engines, unless they are hosting service providers, are currently not covered by the draft, although they play a role in the dissemination of CSAM. COM is open to a discussion about including search engines in the draft. Live streaming is as part of the definition of CSAM. Classified communications and corporate/government communications are not included in the scope.\n\n\n\nTo GER Question 34: Do provider of file/image-hosting, which do not have access to the content they store fall under the scope of the Regulation?\n\n\n\nHosting service providers are recorded, it is a question of proportionality to address the service provider who has access to the data. Ie. Cloud services that only provide infrastructure but have no access may not be suitable addressees of identification orders.\n\n\n\nWith regard to Article 2 g), COM referred to EC 11\n\n\n\nRegarding Article 2 j) \"child user\", the relevant age for \"sexual consent\" is decisive, but this varies in the MS. In principle, the draft also includes underage perpetrators. Providers are not able to determine whether there is \"consent in peers\". Upon receipt of such reports, criminal liability is to be determined under national law. If changes were made to the definitions as part of an amendment to the CSA-RL (from 2011), this would also result in changes for the COM draft of a CSA-VO.\n\n\n\nArticle 2m) “potentially” refers to leaving the final decision on what is illegal to the national authorities.\n\n\n\nArt. 2 u) is based on the regulation of the DSA.\n\n\n\nPRT requests submission of written responses. KOM replied that it could not promise this.\n\n\n\nTo GER Question 6: What kind of (technological) measures does COM consider necessary for providers of hosting services and providers of interpersonal communication in the course of risk assessment? Especially how can a provider conduct a risk assessment without applying technology referred to in Articles 7 and 10? How can these providers fulfil the obligation if their service is end-to-end encrypted?\n\n\n\nThe use of technologies depends on the respective service and the respective risks. Identification technologies are not mandatory, and encryption should not prevent providers from carrying out an analysis. However, providers usually have good knowledge of the risk of their services, e.g. through user reports. EU center will issue (non-exhaustive) guidelines.\n\n\n\nTo GER Question 9: Can COM detail on relevant „data samples” and the practical scope of risk assessing obligations? Especially differentiating between providers of hosting services and providers of interpersonal communications services.\n\nRelevant data examples depend on the respective service and the respective user behavior. For risk minimization measures, for example, it could play a role whether there is a possibility that strangers can make direct contact with underage users.\n\n\n\nTo GER Question 11: In Art. 3 par. 2 (e) ii the proposal describes features which are typical for social media plattforms. Can COM please describe scenarios in which for those plattforms a risk analysis does not come to a positive result?\n\n\n\nFor example, on professional platforms such as LinkedIn or social media without a grooming history, there should be no relevant risk.\n\n\n\nTo GER Question 2: Could the COM please give examples of possible mitigation measures regarding the dissemination of CSAM as well as grooming that are suitable for preventing a detection order?\n\n\n\nExamples for age limits or the limitation of certain functions for children's accounts are sharing pictures (pictures with a lot of bare skin) or the possibility of direct contact by external users etc.\n\n\n\nTo GER Question 3: Could the COM please explain how age verification by providers respectively App Stores shall be designed? What kind of information should be provided by a user? With regard to grooming your proposal specifically aims at communication with a child user. Shall the identification of a child user be conducted only via age verification? If a risk has been detected will providers be obliged to implanting user registration and age verification? Will there be also a verification to identify adult users misusing apps designed for children?\n\n\n\nCOM draft is open to technology, also for age control. Providers are free to choose suitable measures. The information required by users also depended on this. Measures ranging from “simple confirmation” to proof of ID are possible. KOM supports age control projects and innovations without the need to provide proof of personal data. The COM draft does not yet provide for the identification of adults who misuse children's accounts/services, such users would be recognized within the framework of identification orders.\n\n\n\nTo GER Question 14: Can COM please clarify „evidence of a significant risk“? Is it sufficient that there are more child users on the platforms and that they communicate to the extent described in Article 3?\n\nThe decision on the existence of a \"significant risk\" is made by the coordinating authority. COM will also issue guidelines in this area. The mere fact of use by \"child users\" is not sufficient to meet the requirements.\n\n\n\nTo GER Question 17: How are the reasons for issuing the identification order weighed against the rights and legitimate interests of all parties concerned under Article 7(4)(b)? Is this based on a concrete measure or abstract?\n\n\n\nA case-by-case decision is required, in which all relevant information is included and an order that is as targeted as possible should be issued. Ie. scenarios are also conceivable (comparatively low risk, very intrusive technology) in which an order – after weighing up the individual case – should not be issued.\n\n\n\nTo GER Question 13: Are the requirements set out in article 7 para 5 / para 6 / para 7 to be understood cumulatively?\n\n\n\nEach paragraph applies to different categories of CSAM, if an order applies to all categories then the requirements apply cumulatively, otherwise they apply individually.\n\n\n\nTo GER Question 16: Can COM please clarify on the requirements of para 5b, 6a, 7b – which standard of review is applied? How can the likelihood in Art. 7 par 7 (b) be measured? Does the principle in dubio pro reo apply in favor of the hosting service?\n\n\n\nDubio pro reo does not apply, since it is not a matter of criminal procedural questions, but of an assessment in the area of ​​risk minimization. The standard of review is to be determined on a case-by-case basis, and guidelines would also follow in this context.\n\n\n\nArticle 9 does not provide a fixed time frame. However, if you add up all the necessary process steps, you can count on around 12 months.\n\n\n\nTo GER Question 23: Does „all parties affected” in Art. 9 include users who have disseminated CSAM or solicited children but who were nevertheless checked?\n\n\n\nAll users who spread CSAM are recorded. It is not up to the providers to carry out legal assessments.\n\n\n\nTo GER Question 7: How mature are state-of-the-art technologies to avoid false positive hits? What proportion of false positive hits can be expected when technologies are used to detect grooming? In order to reduce false positive hits, does COM deem it necessary to stipulate that hits are only disclosed if the method meets certain parameters (e.g., a hit probability of 99.9% that the content in question is appropriate)?\n\n\n\nKOM emphasized that there are suitable technologies, some of which have been in use for years (e.g. PhotoDNA). The accuracy of grooming detection technology is around 90%. This means that 9 out of 10 contents recognized by the system are grooming. False-positive reports would then be recognized and filtered out by the EU center. KOM did not make any numerical determinations in order to ensure openness to technology and progress.\n\n\n\nTo GER Question 24: Which technologies can be used in principle? Does Microsoft Photo ID meet the requirements?\n\n\n\nThe VO-E does not specify any mandatory technologies. The EU center will provide providers with a list of suitable technologies as well as free technologies.\n\n\n\nTo GER Question 25: Should technologies used in relation to cloud services also enable access to encrypted content?\n\n\n\nKOM explained that orders could only be issued if suitable technologies were available.\n\n\n\nTo GER Question 26: How is the quality of the technologies assured or validated? How does the CSA proposal relate to the draft AI-Act?\n\n\n\nA technology committee will be set up in the EU center. Both the EU data protection officer and the Europol Innovation Hub are involved. Regarding the KI-VO: The technologies to be used under the CSA-VO are likely to represent high-risk AI in the sense of the KI-VO. Ie. they are likely to be the subject of an ex-ante conformity assessment under the KI-VO. This would then be added to the data protection control and the check by the EU center as a further safeguard.\n\n\n\nTo GER Question 27: How is the equivalence of providers‘ own technologies to be assessed under Article 10(2) and how does this relate to providers‘ ability to invoke trade secrets?\n\n\n\nCompatibility will be checked/determined by the competent authority or courts.\n\n\n\nTo GER Question 28: Can the technology be designed to differentiate between pictures of children in a normal/ not abusive setting (e.g. at the beach) and CSAM?\n\n\n\nCOM agreed that algorithms could be trained accordingly, and that any false positives were checked in the EU center (reference to Annex 8 Impact Assessment).\n\n\n\nBetween GER Questions 30 and 31: How do you want to ensure that providers solely use the technology – especially the one offered by the EU Centre – for executing the detection order? How would we handle an error? How should eventual cases of misuse be detected?\n\n\n\nMisuse of technology would result in penalties. The compliance of the providers is to be ensured by national authorities. Incidentally, technologies are only suitable for identifying CSAM.\n\n\n\nTo GER Question 32: Could you please elaborate on the human oversight and how it can prevent errors by the technologies used?\n\n\n\nProviders are not obligated to humanely review every report. However, the EU center guarantees human oversight of reports from known CSAM. The center is committed to human oversight for new CSAM and grooming. The center thus acts as a filter between LEAs and providers.\n\n\n\nTo GER Question 33: How do you expect providers to inform users on „the impact on the confidentiality of users’ communication”? Is it a duty due to the issuance of a detection order? Or may it be a part of the terms and conditions?\n\n\n\nThe obligations in Art. 10 are linked to any identification orders.\n\n\n\nTo GER Question 15 / 19: How detailed does the detection order specify the technical measure required of the provider?\n\n\n\nHow concretely does the identification order specify the measure required of the provider? What follows in this respect from Article 7(8) („shall target and specify [the detection order]“), what from Article 10(2) („The provider shall not be required to use any specific technology“)?\n\n\n\nA detection order does not specify the technology to be used; but specify the extent of the obligation. COM referred to Article 7(8).\n\n\n\nKOM stated that providers would have to draw up an implementation plan as part of issuing an identification order. The GDPR would be ensured by national authorities (not providers). In the case of grooming, providers are obliged to involve data protection authorities.\n\n\n\nOn the distinction between coordinating authorities and courts: the coordinating authorities usually have special (professional) expertise, especially in the area of ​​risk minimization, which courts usually do not have. In view of the affected fundamental rights, courts (or competent national authorities) should be included as a further level of protection within the framework of proportionality.\n\n\n\nTo GER Question 18: Has COM yet received feedback by the providers, especially regarding article 7? If so, can you please elaborate the general feedback?\n\n\n\nCOM had involved providers from the beginning (e.g., via EU IF, direct talks, COM Johansson's trip to Silicon Valley) and had received positive feedback. Company welcomed provider obligations as well as legal certainty and clarity.\n\n\n\nTo prevent duplication of reports and possibilities of deconflicting: A distinction should be made between reports from providers and from users/hotlines. Providers are obliged to report to the EU center. If there are additional national reporting obligations, this should be indicated, for example, in reports to the EU center. Reports from users/hotlines, on the other hand, could continue to be sent to the providers. If users/hotlines also notify national authorities in parallel, this requires suitable deconflicting processes.\n\n\n\nTo GER Question 36: Which role should the Coordinating Authority play regarding reporting obligation?\n\n\n\nCoordinating agency would monitor provider compliance, but it would not be given an equally active role as in the context of the injunction.\n\n\n\nTo GER Question 38: What number of cases does COM expect for the reports to EU CSA? How many cases will be forwarded to the competent national law enforcement authorities and/or Europol?\n\n\n\nKOM cannot provide the exact number. If the current reports to NCMEC are used as a basis for an estimate, it should be borne in mind that US law is not specific. Currently, many reports are not actionable because they are not CSAM according to EU law or information is missing. There is also a lack of filters to prevent false positives. Overall, not only an increase in the number of reports but also an improvement in the quality of reports to LEAs is to be expected.\n\n\n\nTo GER Question 40: At what point can knowledge of the content be assumed to have been obtained by the provider, is human knowledge required?\n\n\n\nCOM Draft does not specify that human knowledge is required. It may be necessary to specify this further.\n\n\n\nRegarding the differences in removal orders between TCO and CSAM, COM stated: In contrast to the TCO Regulation, CSAM is illegal material regardless of the context; TCO is aimed at as many users as possible and is usually distributed publicly via hosting services. In contrast, CSAM is aimed at targeted dissemination, often via interpersonal communication services (2/3 of today's reports originate from interpersonal communication services). Since other types of services would usually be abused, other safeguards would also be required. COM draft does not provide for crossboarder removal orders (unlike TCO), as COM draft is nationally oriented overall.\n\n\n\nOne MS had requested alignment of the deadline with the TCO Regulation to 1 hour (COM draft: 24 hours). COM explained that it was open for a discussion on this. In view of the obligations of the providers, 24 hours would be appropriate in their view.\n\n\n\nTo GER Question 39: Will the right to an effective redress be affected by the obligation under art. 14 to execute a removal order within 24 hours?\n\n\n\nComplaints by providers against removal orders have no suspensive effect. Appeal procedures do not exempt from removal obligation.\n\n\n\nTo Art. 15 para. 4: KOM referred to Art. 12 para. 2, if 6 weeks were not sufficient, an extension of another 6 weeks was possible.\n\n\n\nTo GER Question 43: How can blocking orders be limited in practice to specific content or areas of a service, or can only access to the service as a whole be blocked?\n\n\n\n“URLs pointing to a specific image/video\" are affected in order to issue orders that are as targeted as possible.\n\n\n\nTo GER Question 44: Do cloud services have to block access to encrypted content if they receive a suspicious activity report about specific users?\n\n\n\nNo, because blocking orders only refer to publicly accessible material.\n\n\n\nCOM stated that the liability regime of the draft is coherent with liability regime of the DSA.\n\n[Chapter 3 & 4 can be found on the website for anyone who didn’t immediately skip to the comments. I exceeded the character limit :L]",
  "author": "AprilDoll",
  "comments": [
    {
      "author": "noellarkin",
      "timestamp": "",
      "body": "Holy crap this is so, so dystopian."
    },
    {
      "author": "unsignedmark",
      "timestamp": "",
      "body": "We are moving at full steam towards a perfectly implemented control society, and this is a key foothold for them to gain, towards the goal of ending encryption all together. If that comes to pass it is game over for freedom and democracy, for a very, very long time.People need to realise the scale of the horror that this is, and in a real hurry."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What the actual fuck..."
    },
    {
      "author": "unsignedmark",
      "timestamp": "",
      "body": "\"Encryption also helps criminals\" is the most senile argument against encryption, and it is repeated ad nauseum, probably because is so utterly invalid.So does cars, bike lanes, woolen sweaters, access to drinking water, and you know what else? Laws and governments. Lets make sure to dismantle those things as well, we wouldn't want ANYTHING in society that could help a CRIMINAL!"
    },
    {
      "author": "Slapbox",
      "timestamp": "",
      "body": "The Patriot Act normalized this for the entire west. We're just fucked."
    },
    {
      "author": "onan",
      "timestamp": "",
      "body": "Classified communications and corporate/government communications are not included.Changing this would go a long way toward fixing measures like this.If powerful institutions were subject to the same compromises of their privacy and security, I bet that they would suddenly see amuchhigher bar as necessary to prevent abuse."
    },
    {
      "author": "whitepepper",
      "timestamp": "",
      "body": "Not to mention it keeps seeming like the higher up and more in control you get, the more likely you are to be an actual predator."
    },
    {
      "author": "lunar2solar",
      "timestamp": "",
      "body": "Seems like in the dystopian near future, only the rich and powerful will have privacy."
    },
    {
      "author": "ModPiracy_Fantoski",
      "timestamp": "",
      "body": "Old messages wiped after API change.  -- mass edited with redact.dev"
    },
    {
      "author": "AprilDoll",
      "timestamp": "",
      "body": "Since the available evidence suggests that these people do not care about children whatsoever, the system being put into place is likely to be used for entirely different purposes."
    }
  ]
}