{
  "subreddit": "ukpolitics",
  "post_id": "1h1jmz5",
  "title": "Do 'much, much more' on age verification, social media firms told",
  "body": "",
  "author": "vriska1",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Snapshot ofDo 'much, much more' on age verification, social media firms told:An archived version can be foundhereorhere.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "What I want to know is how does Ofcom realistically expect social media to verify age online.What are social media platforms supposed to do? Ask for a passport? Ain’t no way I’m supplying my passport info to Twitter or Facebook.Not to mention they make a lot of money on young people, because young people disproportionately spend more time online. They have no actual business incentive to implement rigorous age verification."
    },
    {
      "author": "AI_Hijacked",
      "timestamp": "",
      "body": "Ain’t no way I’m supplying my passport info to Twitter or Facebook.And Reddit since it's a social media site."
    },
    {
      "author": "m1ndwipe",
      "timestamp": "",
      "body": "Yes, passport, driving license, or credit card verification yes. There is literally a consultation paper about it on their website."
    },
    {
      "author": "OneTrueScot",
      "timestamp": "",
      "body": "What I want to know is how does Ofcom realistically expect social media to verify age online.The same as your bank? Or any other KYC required business?The problem is that children are allowed on social media, and they don't have ID. I'm not sure they should be - it seems like every single piece of scientific evidence says it's almost entirely negative for them."
    },
    {
      "author": "AcademicIncrease8080",
      "timestamp": "",
      "body": "The idea that civil servants will be able to come up with sensible and effective regulations to stop young people interacting with each other online is just absolutely ludicrous. These are the most technological adept generation - they will definitely find workarounds lolWhat will end up happening is children and teenagers will end up on unregulated platforms and websites which are even worse."
    },
    {
      "author": "Telkochn",
      "timestamp": "",
      "body": "Shielding kids from everything until they turn 18 is how you end up with adults who can't cope with anything."
    },
    {
      "author": "thehibachi",
      "timestamp": "",
      "body": "I don’t know that those of us that grew up largely without social media in this current form are in a position to confidently say that.The reason social media doesn’t dominate my life is almost certainly more to do with my age, and the fact that I witnessed the rise (and fall?) of it, than it is to do with my superhuman ability to deal with things I’m exposed to."
    },
    {
      "author": "MrSoapbox",
      "timestamp": "",
      "body": "This again?I have a solution.Parents, do much, much more on parenting your kids."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "This is still likely to fail hard like with what happen with the BBFC, it will likely be delayed. OSA Age verification parts are unworkable and likely to fail."
    }
  ]
}