{
  "subreddit": "discordapp",
  "post_id": "1ecc003",
  "title": "Discord age verification",
  "body": "Okay discord how do I hold my ID, piece of paper and take selfie at once, I don't even have enough hands to do that, anyway I sent them this 3 weeks ago without a respond, will my account be bring to life ever?",
  "author": "Ill_Ad8322",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »If this is a bug report or technical issue, please also post aproperly formatted commentin the Monthly Megathread pinned at the top of the subreddit. It is closely monitored and prioritized by Discord. Thank you.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Woofer210",
      "timestamp": "",
      "body": "Paper and ID in one hand, phone in the other, take the picture with your volume button assuming you have that enabled."
    },
    {
      "author": "scoobs9696",
      "timestamp": "",
      "body": "Interesting, they ask for the last four digits or your account. Isn’t that the discriminator they removed 🤔"
    },
    {
      "author": "Pixel131211",
      "timestamp": "",
      "body": "this may sound crazy, but our hands have the ability to hold multiple items at once.joking aside, I had to do this for an alt account of mine and they unbanned it after a week. Discord can take up to 2 months to reply to these things though I've heard. so I'd give it a while before they respond."
    },
    {
      "author": "MotherDema",
      "timestamp": "",
      "body": "Holy hell, two months? Mine got banned 2 days ago for the same issue, despite the fact this same thing happened way back in 2021 and I verified my age. They responded in a day that time it happened."
    },
    {
      "author": "TheReelEpicKiller",
      "timestamp": "",
      "body": "Tape your id to the paper"
    },
    {
      "author": "luciferDemonOfTheSky",
      "timestamp": "",
      "body": "Never heard of a timed photo?"
    },
    {
      "author": "ADHDinmymind",
      "timestamp": "",
      "body": "Get unbanned in the end?"
    },
    {
      "author": "Ill_Ad8322",
      "timestamp": "",
      "body": "yes my account got unbanned after 46 days"
    }
  ]
}