{
  "subreddit": "paypigsupportgroup",
  "post_id": "1cldt6c",
  "title": "Is loyalfans reliable age verification?",
  "body": "I see a lot of dommes on reddit and twitter link to it.  I’m not really interested in domme that aren’t at least 21+ (or really closer to mid 20s-30s tbh) I just want to put my mind at ease for interacting with dommes.  Just wanted to know if this a reliable age verification and/or what other forms of age verification you consider to be valid to make sure you aren’t interacting with a minor?",
  "author": "alleriamystic",
  "comments": [
    {
      "author": "girl4awkes",
      "timestamp": "",
      "body": "Yes, it is reliable as you must verify with legal identification. It is basically a competitor site to onlyfans"
    },
    {
      "author": "tiles78",
      "timestamp": "",
      "body": "Awesome, thanks for answering"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Make sure whatever site they link is a CREATOR account and not a FAN account. You don’t need to do age verification with an ID to make a fan account on either site.on OF you can tell because next to the name is a black check mark. on LF there is an option to tip/subscribe or send money in some way."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I thought that fans on LF also had to provide ID on signup making it a valid form of AV for subs as well?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "You have to show your government ID (license or passport) so I would say it's pretty reliable. They also have us send a picture of us holding it up next to our faces so that they can decide if we look like the photo on the ID"
    },
    {
      "author": "Successful_War5900",
      "timestamp": "",
      "body": "yes! :)"
    },
    {
      "author": "QueenFeetJo",
      "timestamp": "",
      "body": "Yes, OF, LF and Fansly can be considered good for age verification, there is a strict process before receiving the approval"
    },
    {
      "author": "Big_Natural_5550",
      "timestamp": "",
      "body": "It’s reliable but Yoti app is my go to. It’s so easy there’s no real excuse for Dom/es or subs to use it"
    },
    {
      "author": "alleriamystic",
      "timestamp": "",
      "body": "Loyalfans is 18+ so it's not going to tell you if someone is over 21.Their only flaw is that anyone can sign up with 18+ ID and pretend to be a woman. Don’t trust pages with no visible photo content, or they could be a catfish."
    }
  ]
}