{
  "subreddit": "technology",
  "post_id": "1ddju7x",
  "title": "Age Verification Systems Will Be a Personal Identifiable Information Nightmare",
  "body": "",
  "author": "anonymousjeeper",
  "comments": [
    {
      "author": "PCP_Panda",
      "timestamp": "",
      "body": "Great way for the state to blackmail anyone"
    },
    {
      "author": "wwwhistler",
      "timestamp": "",
      "body": "this has nothing to do with protecting children.it is all about control. and that those in charge ( and those who plan on TACKING charge) want to squash all alternative versions of their lies. they are afraid of what YOU say and think unless the thoughts are those given to you. to that end they want all communication Identified so as to ensure  a proper response from the authorities to curtail such incorrect thoughts."
    },
    {
      "author": "SUP3RGR33N",
      "timestamp": "",
      "body": "It's absolutely this. There's no way there's such cross-party support for this in both Canada and America for just forcing porn behind an age gate. ESPECIALLY with how these bills are being written, so that any social media site will technically fall under the same requirements. They're not even trying to make the motions make sense, or be descriptiveat all.They're clearly trying to tie real identities to the internet in an effort to remove internet anonymity altogether. There's basically zero protections, and they're forcing each corporation to handle the PII themselves --- that's INSANE!We can't even keep our governmental systems from being hacked, why should we be providing PII that can fully be used for identity theft to every single internet-based shared-media service? The same corporations that are getting hacked and leaking massive amounts of dataconstantly."
    },
    {
      "author": "BlindWillieJohnson",
      "timestamp": "",
      "body": "I generally hate conspiratorial thinking, but you’re absolutely right. This really is about tying us to our real lives to our online ones. You expect that kind of thing from red states, where elected leaders care more about what powerless people do in their bedrooms than what powerful people are doing to their wallets. But blue states getting in on it baffles me. Where is the support for sexual freedom?"
    },
    {
      "author": "EmbarrassedHelp",
      "timestamp": "",
      "body": "The public doesn't care if it gets leaked that someone uses financial services, buys alcohol, or goes to a club. Such information is useless for blackmail, and anyone using that argument for being in favor of age verification is being dumb. The same cannot be said for NSFW content, for which there exist strong stigmas and biases that can harm you.Most of the groups advocating for age verification are industry lobbyist groups and their proxies, and the sooner people realize that the better. These companies want to get rich off of their services being mandated for everything imaginable."
    },
    {
      "author": "Froyo-fo-sho",
      "timestamp": "",
      "body": "The public doesn't care if it gets leaked that someone uses financial services, buys alcohol, or goes to a club.I care if they leak the data on my drivers license. Photo, address, birthday, DL#."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "They are also trying to pass a bill called KOSA that could bring in AV.If you want to help stop this bill contact your lawmakers here.https://www.stopkosa.com/"
    },
    {
      "author": "WhiteF1re",
      "timestamp": "",
      "body": "I did this and my state reps emailed me back saying they're supporting it anyway."
    },
    {
      "author": "anonymousjeeper",
      "timestamp": "",
      "body": "Ashley Madison. Cough, cough."
    }
  ]
}