{
  "subreddit": "PonyTown",
  "post_id": "1k7bbay",
  "title": "minors in 18+ server??",
  "body": "i just want to be in a safe space for adults. i'm 21 and i don't want to have to worry that whoever i'm talking to is lying about their age. just to clarify, this refers to talking about mature topics like mental health, politics and real world issues. if it happens to come up in conversation, i don't want some immature, underage troll to make a joke out of things that cause me genuine anxiety/panic.\n\ni guess what i'm meaning to ask is, is anyone else really paranoid that literally anyone you interact with in the 18+ server could be a minor?",
  "author": "Ok_Storage6398",
  "comments": [
    {
      "author": "OliverOrchard",
      "timestamp": "",
      "body": "I don’t know if this is a popular opinion but that’s going to be the same for any 18+ space online. Kids will lie about their age, there’s no real avoiding it, people before us lied about their ages, we lied about our ages as kids, and the kids after us will do it too. If you are paranoid about it, you could always stick with interacting with people who have other socials linked! Thats usually a safe betI have found that it’s fairly obvious who is and isn’t underage just on how they act, the best thing to do in that situation is whisper to them to ask their age (kids are more likely to tell the truth if it’s not in the public chat) then screenshot the chat and report to the PT email, as well as hide/block them. Yea it’s a little bit sneaky but it’s for their safety as well as your own.I’m 21 as well and the best advice I could give is just hide people who make you uncomfortable or you’re unsure about. Because hey, even if you’re wrong and they’re an adult, it’s a random pony game on the internet and blocks aren’t like a personal insult"
    },
    {
      "author": "BrainDamagedVort",
      "timestamp": "",
      "body": "solid advice, will do!"
    },
    {
      "author": "CrazyCatGirl92",
      "timestamp": "",
      "body": "I haven't been to the 18+ server yet (I'm a minor and I don't have access to 18+ serv, dw) but it does creep me out that anyone in the 18+ server could be a minor. It's a place for adults to loosen up and be able to talk about serious things without minors making it a joke, and the minors are taking away that freedom by not being in the safe server."
    },
    {
      "author": "SymbioteSpider84",
      "timestamp": "",
      "body": "At least your mature enough to understand the concept and respect it."
    },
    {
      "author": "BrainDamagedVort",
      "timestamp": "",
      "body": "EXACTLY"
    },
    {
      "author": "Beaumont420",
      "timestamp": "",
      "body": "I totally get this. I'm 25 and I run into people saying they're under 18 way more often than I'd like. Make sure you report people who do admit to being underage; they won't get banned, but they'll be locked off of the 18+ server."
    },
    {
      "author": "eliatshaha",
      "timestamp": "",
      "body": "I'm 25 too, and they even laugh/complain abt our age, lmao."
    },
    {
      "author": "chrisredfieldsnuts",
      "timestamp": "",
      "body": "there are minors in the server. it is unavoidable unfortunately as anyone can lie about their age.my best advice to give you is to ask beforehand. i know it might feel odd, but just adding “MDNI” in your name can also go a long way. minors will not interact with me since i added it, but beforehand people would be whispering me and then just “btw im 16.” and after adding that, they all stopped contacting me. they do usually respect boundaries."
    },
    {
      "author": "megdiamonsta",
      "timestamp": "",
      "body": "my friend once met a 11 y.o in 18+ server, like safe server is literally there for you. why are you here? most of the time minors are in here just to swear freely, but with this yall getting both sidesn trouble"
    },
    {
      "author": "Ok_Storage6398",
      "timestamp": "",
      "body": "I'm going to be the oddball under this post, but I feel like it's worth saying. I've been playing PT for over 5 years, watched hundreds of people (supporters included) plead with the devs to add a middle ground: a 13+ server.They promised to add it, yet delayed it for YEARS, saying that the \"censorship system is too hard to navigate.\"I'm an adult now, but I wasn't for at least half of my time on PT. I played on both 18+ and the safe server freely. They are both public servers, there is no proper age verification, and if they really cared about minor safety, they would implement it.I find myself playing on safe nowadays; more people, bigger fandom spaces, etc. and constantly find other adults (18-21) there too.The solution? Don't talk about weird shit in public. PT does nothing to contribute to this problem, and simply uses 18+ and safe as a flimsy partition between two age groups. If you insist on saying nsfw jokes, or talking about politics, you should understand who you're speaking to first, like others have suggested; look at their socials, gauge their behavior; immaturity is not age exclusive. Hell, ask them.PT won't do half the work, so you have to. And despite what most people think, minors and adults can co-exist in spaces without it being creepy or weird. Everyone should vet who they're speaking to, regardless of age."
    }
  ]
}