{
  "subreddit": "SnarkAntiSexWork",
  "post_id": "1humcz4",
  "title": "Ex “OF Agency Recruiter” claims there’s is no age verification when uploading content to OF etc",
  "body": "Watch the full video here (fast forward to 1:12)https://youtu.be/UjCEvGlxEZk?si=IHUxoNM9QlEMLxjv\n\nFor creators, OnlyFans requires you to upload a government-issued ID to prove you’re 18+ and match it with a selfie holding that ID. They also check everything through a third-party system before approving your account. Creators also need to set up a payout method, which includes extra verification for banking.\n\nFor customers, there’s no need to upload an ID, but you have to link a valid credit or debit card to subscribe. That card acts as proof you’re over 18 since financial institutions already verify that info. You also have to confirm your email during sign-up.\n\nWhile these steps are in place to meet legal requirements, some argue they’re not foolproof, especially when it comes to customers who might use someone else’s card or ID to get around the system.\n\nAdditionally, OnlyFans uses AI technology to monitor content uploaded to the platform. When creators upload videos or photos, the AI scans them to check for any violations of the platform’s rules. One of its key functions is to detect if there are people in the video who shouldn’t be, like minors or individuals who are not authorized. The AI compares faces or other identifying features to the platform’s database, ensuring that content complies with legal and ethical guidelines. If the AI flags something, it goes under review by the moderation team for further confirmation. This system is part of the platform’s effort to protect both creators and customers while adhering to age-verification laws.",
  "author": "XGrayson_DrakeX",
  "comments": [
    {
      "author": "ichunddergeist",
      "timestamp": "",
      "body": "That’s absolutely ridiculous. I don’t work on OF because the amount of data they take from you to verify your age is more than I’m comfortable sharing. Any online SW (unless you build your own brand entirely using a bank account, which again, banks don’t just give out to minors who walk in on their own) has to go through multiple loops to verify their identity. They’re so confident lying because the anti-porn crowd will buy anything"
    },
    {
      "author": "DebunkJunkiee",
      "timestamp": "",
      "body": "This woman claims to be an ex-OnlyFans agency manager, but anyone familiar with the OnlyFans advice subreddits knows that these agencies are widely regarded as scams that exploit vulnerable people. In her own videos, she even admits to cold messaging creators to recruit them— a common tactic of these predatory agencies. Now, she speaks out against the industry on podcasts and other platforms, framing herself as someone who experienced its supposed “dangers.” But let’s be clear: she wasn’t working as a creator or genuinely part of the industry—she was allegedly part of a scam that failed. Now she’s capitalizing on this false narrative to discredit the industry. ✨Allegedly✨"
    },
    {
      "author": "Chainmale001",
      "timestamp": "",
      "body": "I AM on OnlyFan. I'll tell you now, their vetting process is intense. They require everything from State ID to verified email. They also require verification of every person associated with the account. I mentioned I'm married, even thought she has nothing to do with my account, and they wanted to verify HER. I do solo work. So saying OF doesn't vet is an outright lie."
    },
    {
      "author": "XGrayson_DrakeX",
      "timestamp": "",
      "body": "I cannot believe someone would just straight up lie like that. (I mean I can but wow)People have gotten AI flags and weren't even breaking TOS. like a dildo or their own reflection was getting flagged as other people. They also heavily censor kink content and routinely take down couples content even if both people are tagged. I've had random shit taken down that had been up for YEARS without warning. Didn't even get an email about it. I got fed up and just abandoned mine.OF is a terrible platform but it's not for any of the reasons antis keep claiming."
    }
  ]
}