{
  "subreddit": "TikTok",
  "post_id": "191n1p2",
  "title": "I got this notification today about how I’m not 16 and my account will get deleted. What does this mean?",
  "body": "",
  "author": "Zekiahsdad87",
  "comments": [
    {
      "author": "TheLegendaryHaggis",
      "timestamp": "",
      "body": "As it says - If you are underage then you cannot have a tik tok account and they will delete it as per the terms and conditions which you agreed to when joining."
    },
    {
      "author": "TheDarkWeb697",
      "timestamp": "",
      "body": "Originally the number was 13 they must have realized that that was stupid making it so low, so it's increasing to 16, it means that your account will be deleted no matter what unless you somehow age in a couple weeks, you should still be able to view videos though"
    },
    {
      "author": "melomakaronaX",
      "timestamp": "",
      "body": "Wait, age limit is 16? Im not on tiktok but a lot of people I know (under 16) are. Uh oh........."
    },
    {
      "author": "mecrurydreams",
      "timestamp": "",
      "body": "Hey that same thing happened to me not too long ago, on that day you’re gonna realize you’re gonna be logged out so you’re gonna wanna try to log in and appeal it. You’re gonna have to provide a form of identification that shows you’re 16+ and you’re gonna have to take a picture with it with your face while holding it and also you’re gonna have to write a code on a paper big and hold it showing your face after that you should gain your account right away (idk if it takes a while but for me I got it back once I submitted those 2)"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Do you lack the ability to read?"
    },
    {
      "author": "-_Koga_-",
      "timestamp": "",
      "body": "That you’re younger than 16 and your account may be deleted…"
    },
    {
      "author": "unmatchedfailure",
      "timestamp": "",
      "body": "I wish other platforms allow reports for under age users"
    },
    {
      "author": "BearJustBarely",
      "timestamp": "",
      "body": "For those wondering, there's a massive personal injury lawsuit in progress regarding safeguards and child safety among other things and it's coming after tiktok, Facebook, instagram, etc. Pretty big settlement expected from it as well as harsher restrictions for age and social media.[Ironically]tiktok video from a creator discussing the lawsuit"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "it means that you're under the age of 16 and they're deleting your account.r/kidsarefuckingstupid"
    },
    {
      "author": "Zekiahsdad87",
      "timestamp": "",
      "body": "It means exactly what it says."
    }
  ]
}