{
  "subreddit": "patreon",
  "post_id": "16hfade",
  "title": "Adult Patreon age verification",
  "body": "Has anyone else had this problem? Patreon is all of a sudden demanding I verify my age. This must be the second email I've gotten about it this month. But the only form of certification they've offered is state ID, real personal stuff. They've said they're going to create alternatives, but at the same time, they're all but demanding I verify my age right now or they're going to start delaying payouts. All the while they haven't actually put forth any alternate forms of verification yet.\n\nIs anyone else having this problem, or do they know of an alternate form of ID that Patreon has introduced but aren't being one hundred percent transparent about for whatever reason?",
  "author": "TimoTheoDoro",
  "comments": [
    {
      "author": "jroberts67",
      "timestamp": "",
      "body": "Actually Patreon gave the head's up last year that they would be requiring ID verification and as of now I'm not aware of any other method of verification except government ID."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I know that, but in every email and notification they've given, they've said they'll be rolling out alternate forms of ID if I'm not comfortable with using my state ID and not to worry about anything. But for whatever reason they'rereallydriving down that I have to verify NOW NOW NOW and the alternate method hasn't been introduced yet."
    },
    {
      "author": "ispinox",
      "timestamp": "",
      "body": "It’s standard procedure if you’re creating adult content. We all have gone through that. If you’re uploading stuff on xhamster or Pornhub you need to do the same, although they have other options like driving license.In the end they all require “real personal stuff”Patreon announced that last year, so it’s actually nothing new"
    },
    {
      "author": "newbNox",
      "timestamp": "",
      "body": "It’s quite the same as if you go buy alcohol, smokes anything from store, the cashier needs a way to see your old enough. So does Patreon, so they can be asured that the content posted by you is from actual adult~"
    },
    {
      "author": "TimoTheoDoro",
      "timestamp": "",
      "body": "Is this ID requirement just for creators are also for normal Patriot users? I'm being hit with this rule as well even though I have never created anything using the platform and I barely ever comment on posts. I'm in an infuriating email chain with someone from their customer support and the best they have to say is \"This process is only meant for creators but I triggered it for your account - this way you know this is a legitimate request from Patreon.\" 🤨🤨🤨"
    }
  ]
}