{
  "subreddit": "Utah",
  "post_id": "10awkqr",
  "title": "Should porn websites require age verification to view adult content? The new bill proposal by Utah state Sen. Todd Weiler aims to prevent minors from accessing pornographic websites.",
  "body": "",
  "author": "yourinnervagabond",
  "comments": [
    {
      "author": "FLTDI",
      "timestamp": "",
      "body": "\"are you over 18? Click here to confirm\"that'll stop em!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "They want you to put in your ID which is Bs"
    },
    {
      "author": "everydave42",
      "timestamp": "",
      "body": "Performative legislation. Anyone with common sense knows that there are so many sources of porn that fall outside the purview of a state law that this is ultimately meaningless.Besides, since declaring porn a public health crisis, I've seen exactly zero real legislation or action to combat the actual problems that porn present. Maybe if we start with education around sex, relationships, body image, gender issues, etc so we can have open discussions about the place of porn in society...a place that has existed for effectively forever...then maybe we can get to a point of *healthy* expressions of sexuality. Just banning something never works."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Bruh, please….. it’s like age verification for games.. put in a random number… pass go"
    },
    {
      "author": "GeneralTomatoeKiller",
      "timestamp": "",
      "body": "They want to require ID verification, so it'll be more likely that they just use a VPN or some type location blocker."
    },
    {
      "author": "GItPirate",
      "timestamp": "",
      "body": "So you're saying you weren't born January 1st 1900? Gasp!"
    },
    {
      "author": "ericwiththeredbeard",
      "timestamp": "",
      "body": "Ah yes the war on porn while the unsheltered starve and freeze."
    },
    {
      "author": "Jaxsdooropener",
      "timestamp": "",
      "body": "As usual, Republicans are focusing on stupid shit that isn't important and avoid doing anything harder that might actually help people."
    },
    {
      "author": "WayneKrane",
      "timestamp": "",
      "body": "Salt lake drying up? Who cares! Housing is unaffordable? Meh! Can’t find enough teachers? Kids will be fine! Porn though, that’s my priority!!!-Mr. Weiler"
    },
    {
      "author": "yourinnervagabond",
      "timestamp": "",
      "body": "So much porn on Reddit... we'll have to age verify to get on this site, right?"
    }
  ]
}