{
  "subreddit": "unitedkingdom",
  "post_id": "1gombh8",
  "title": "Children should be forced to PROVE their age with documentation before they access social media, EE boss urges",
  "body": "",
  "author": "RedRocketStream",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »This article may be paywalled. If you encounter difficulties reading the article, trythis linkfor an archived version.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "If you been keeping up with australia plan for this so far its been a huge messhttps://www.pushsquare.com/news/2024/11/australias-planned-social-media-ban-to-include-psn"
    },
    {
      "author": "limeflavoured",
      "timestamp": "",
      "body": "the government won't or can't specify the technical method it will use to verify age.Funny that. Exactly the same issue the UK government had with their porn restrictions."
    },
    {
      "author": "BeardedBaldMan",
      "timestamp": "",
      "body": "Australia is a great example of what happens when you combine the inability to think things through with the technical awareness of a koala.You know that everyone involved in the legislation makes dognapping posts"
    },
    {
      "author": "Ill_Mistake5925",
      "timestamp": "",
      "body": "And yes, and to do that this would mean adults would also have to prove their age. And then suddenly all these companies have a copy of your ID/birth certificate/bank card etc to prove your identity.Call me cynical but say every porn site required identifying information to access, a hacker with half a brain would realise that’s a golden ticket to make money off of blackmailing porn users for cash.That aside the responsibility of policing your children’s access to online media lies with the parents, not individual websites or apps. Parenting apps are wildly available and easy to use even for those not particularly tech literate-and in this day and ageplentyof parents and would be parents are tech literate by virtue of their age and growing up with tech."
    },
    {
      "author": "Dude4001",
      "timestamp": "",
      "body": "That’s not how it works. Sites that already verify your ID securely pass you off to dedicated service like Onfido, then you return to the site you’re signing up for with a yay or nay. Nothing is kept on file."
    },
    {
      "author": "FilthyRilthy",
      "timestamp": "",
      "body": "It's all too late for this kind of talk. 10 years ago they should have implemented this. Why are they only now realizing how damaging social media is?"
    },
    {
      "author": "piyopiyopi",
      "timestamp": "",
      "body": "It’s not too late at all. It should have been sooner, granted, but it should still be done"
    },
    {
      "author": "hallmark1984",
      "timestamp": "",
      "body": "\"The best time to plant a tree is 20 years ago.\n\nThe second best time is today\"\n      Gemma Collins 2023"
    },
    {
      "author": "RedRocketStream",
      "timestamp": "",
      "body": "Won't somebody think of the children! An absolutely unmanageable proposition and I would question the complete lack of technical knowledge required to make such a suggestion. Either ban it altogether (heavily in favour as it's imo a net negative to society) or revert from engagement farming algorithms to personally curated timelines (I.e., a basic feed or content you have actually chosen to follow). Neither of these things will happen though as there's both too much money in the system and it's too useful a tool for psyops."
    }
  ]
}