{
  "subreddit": "datingoverforty",
  "post_id": "1d79b5n",
  "title": "How do you verify identity of someone from OLD?",
  "body": "40f. How do you get comfort that the person you are talking to is who they say they are? I must say as a woman, many guys have been quite forthcoming and showed me their drivers license or shared their social media accounts early without my even asking. I am talking to someone (no red flags really) who doesn't have a lot of presence on social media and would like some kind of comfort that he is the person he says he is.\n\nEdit 1 - thanks so much everyone! Your responses have been very helpful and actually helped me revisit my approach to this.",
  "author": "thaway071743",
  "comments": [
    {
      "author": "BurnTheOrange",
      "timestamp": "",
      "body": "I don't have social media. I don't mind if someone wants to video chat or meet first in a public place or group activity. No way in hell am I sending pictures of my ID to someone I don't know. That would feel like the start of a scam to me if someone asked me for a picture of my ID online."
    },
    {
      "author": "Vegetable_Bet_9218",
      "timestamp": "",
      "body": "Thanks, I never ask."
    },
    {
      "author": "explorer1960",
      "timestamp": "",
      "body": "I don't generally share of any of that in messaging.I prefer to meet in person in a public place, and then share.So far no one has asked to video chat."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I ask for a video chat and then if that goes fine I meet them in a public place.If they've shared their driver's license (I would NEVER do that!) what more can they give you."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "If your instincts are telling you something is amiss, I'd just take it as a sign that you're not compatible. You can't reasonably investigate them and turn over every detail of their life before meeting for your own comfort. If things escalate to a phone call and/or video call and it still seems like something's missing, I'd just decline to meet them and end the connection.I'm someone with very little presence online, and I'm sure it makes some people uneasy. They're completely welcome not want to get to know me further because of it. My feelings aren't hurt over this.Also, I once dated someone who was very forthcoming about who he is (met his friends, got involved in his hobby, compared notes in our careers, showed me his drivers license, gave me his social media handles, always responsive on texts and phonecalls), and while I had no doubt about his identity, nefarious things about his character later surfaced that he couldn't hide. I just mention this as a warning that you can get all the details upfront, and they can still be hiding some pretty major dealbreakers. There is no 100% guarantee about someone.I'd just start with a phone call and see how you feel from there. I know sometimes people ask for a full name so they can do a background check, but I'd never consent to that myself and don't expect other people to hand me that information at the start either."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "By meeting them somewhere safe. Even then it doesn't mean you ever really know someone. People can be effectively deceptive for years. Once you are actually in a relationship it is just a leap of faith."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Video calls and in person meets. I'm assuming by verification of identity, you mean they're not a catfish or scammer."
    },
    {
      "author": "Standard-Wonder-523",
      "timestamp": "",
      "body": "I've never asked to supply my driver's license.  I have however given my full name to any match that we've scheduled a date for.  From this, one can search me, and find stuff with my pictures, which easily look like the guy in my profile photos.  But they also weren't the same photos, so it's pretty easy to imagine I'm a real person.Consider that your \"comfort\" that someone is who they say that they are might be just that; comfort.Someone choosing to impersonate me has a number of public photos that they could choose.  Moreover, what one could publicly learn of me would give some incorrect conclusions; many of my photos/presence online had my wedding ring.  To help combat that, I did make my relationship status public on FB.  But beyond that, my account is pretty well locked down.There will always be an element of risk in trying to get to know someone.  Consider instead of trying to wrap yourself in comfort, you instead look to set down boundaries and standards that will make you bolt.  I.e. you show up somewhere and the person is not at all as pictured.  Immediately seek assistance from the employees of making a quick and private escape.  If you start hearing inconsistent stories*, just leave and block; don't ask for a ridiculous story/excuse.*Someone says that they've never been married, and later a marriage does pop up; but it's OK, she's in the past.  Wink wink.  Wink."
    },
    {
      "author": "thaway071743",
      "timestamp": "",
      "body": "I don’t? Sometimes we will talk about where they work and I might Google a little. But I don’t expect even a last name before meeting them. I don’t usually give mine."
    }
  ]
}