{
  "subreddit": "IRS",
  "post_id": "1ivbr7u",
  "title": "Problems Verifying Identity for ID.me",
  "body": "First year filing taxes, and I tried to make an account for IRS. They use ID.me, and a few weeks ago, I tried and they couldn't verify my identity despite me having a valid drivers license and SS card. Tried again today and they still couldn't verify it, so they made me send pics of proof of identity and said they'll send an email in 2-3 days for a video call. I really need to make an account cause I need a form to send to my university, and the sooner I send it, the sooner they can process my FAFSA. Have y'all had issues verifying with ID.me, and if so, how did y'all fix it?",
  "author": "AutoModerator",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "i got verified today in last than 30 mins video call just had too show ID they sent email in 10 mins idk why they told you 2-3 days ??"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I don’t know, but now I’m even more stressed out 😭😭  The only thing I see being a possible issue is that none of my IDs have my middle name and I put that in the registration thing. Could that be a problem?"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Welcome tor/IRS, the subreddit for taxpayers and tax professionals to discuss everything related to the Internal Revenue Service. We are glad you are here!Here are a few reminders before you get started:Please be respectful of others in the community. We do not tolerate personal attacks or harassment.Be wary of scammers and spammers. The IRS will never contact you via direct message or email. If you receive a message from someone claiming to be from the IRS, do not respond and report it to the IRS immediately. The same rules apply tor/IRSDirect messaging is forbidden and can lead to a ban onr/IRS. If you have a question or need assistance, please post it in the subreddit so that everyone can benefit from the discussion.For more information aboutr/IRSrules, please visit our subreddit wiki:https://www.reddit.com/r/IRS/wiki/index/Link to finding local tax advocate:https://www.irs.gov/taxpayer-advocateWe welcome international users tor/IRS. Please feel free to participate in our discussions, even if you are not a US taxpayer.The moderator team is committed to keepingr/IRSa safe and welcoming community for everyone. We will not tolerate hate speech or discrimination of any kind.If you see something that you think violates our rules, please report it to the moderators. We appreciate your help in keepingr/IRSa positive and productive space.Thank you for being so cooperative! We hope you enjoy your time onr/IRS.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    }
  ]
}