{
  "subreddit": "pettyrevenge",
  "post_id": "v0qeg3",
  "title": "You're still handing out your old number after 5 years? Enjoy your appointments canceled.",
  "body": "So, I've had my number for 5 years, maybe 6, I don't remember exactly. When I got this number, the previous owner still got regular messages and phone calls, which is completely understandable that she didn't have everyone up to date on her newest number or lack of number.\n\nThe first 3 months it was nothing to me, I'd answer the calls, send them on their way. Well, that was until I got a phone call from an elementary school looking for, let's call her Sarah. Sarah's daughter was throwing up and running a high fever and needed to go home. I told the school that this was a new number for me and there was no Sarah around. I thought certainly this issue would make her come to the realization that she needed to update her number. But no.\n\nI had to block the schools number because I continued to get calls and texts that had way too much information about Sarah's daughter. Including her name, age, and school events with times and changes in school schedules. I wasn't comfortable receiving that info, so I blocked it.\n\nMaybe 2 or 3 weeks after i blocked the school, Sarah's grandmother calls me because I assume the school couldn't get ahold of Sarah. But I have to tell grandma that I'm not Sarah & to please ask her granddaughter to update her information. Sarah still did not.\n\nWith all of the information that I unwillingly had on Sarah (full name, age, where she attends college, her home address, and where she works), I found her on Facebook and kindly asked her to not use her old number anymore. I'm not sure if she saw the message or not, but it didn't help my problem.\n\nThis has been ongoing for years and it's not just spam, it's people she knows, co-workers, family, doctors, her real estate agent even.... So, before, if she had appointments that were asking to be verified via text to my phone, I would just ignore them. But she had an appointment this time and I am just so fed up of Sarah STILL giving out this number after 5 years of this nonsense that I canceled her appointment for her. A few days later, a new appointment to the same place needed verification & I canceled it again. And the next one I get will be cancelled also. Get your shit together Sarah!!\n\ntldr: person keeps using my number as their current contact info for 5 years, so I cancel all of her appointments that send text messages for a verification.",
  "author": "SharpCheddarBS",
  "comments": [
    {
      "author": "lelawes",
      "timestamp": "",
      "body": "How in the world does this woman function? You reached out to her, you’ve been kind and respectful to everyone who has called until now. I think you’re perfectly justified in cancelling anything that comes through your number from now on. “Oh sorry, Sarah wanted me to let you know she can’t make it.”"
    },
    {
      "author": "Barflyerdammit",
      "timestamp": "",
      "body": "I opened this up expecting to see a nuanced situation where Sarah may have been unaware, old or incapable, etcI now think Sarah is a fucking idiot."
    },
    {
      "author": "DlVlDED_BY_ZERO",
      "timestamp": "",
      "body": "I worry too often that her kid can't get ahold of her. I forgot to add that I spammed her fb messages that day to let her know what was going on. She never replied. I just think if I changed my number, my kid's school or day care would be the first to know! But I think I'm more responsible than Sarah in this manner."
    },
    {
      "author": "NanMcD",
      "timestamp": "",
      "body": "I don’t know how many of y’all will remember when gmail was by invite only, but that’s how long i’ve has my email address. About 5 years ago some woman named Nancy started randomly using my email. I’ve received bank statements, credit card statements, x-rays, etc. I have tried everything to find this woman, no luck. People are careless sometimes."
    },
    {
      "author": "Business-Raise2683",
      "timestamp": "",
      "body": "I had the same situation. My very old invite only era gmail address with first name.last name was used by someone else. I think I even know somewhat who she is, she really has the exact same name as me and I met her mother and she told me some info. But this pre-dates even the email... I cannot reach them anymore, I never knew her real email or phone number.I got a lot of fitness appointments, some work related things (she wrote to some news papers) and some contracts. If it sounded important and I was in a good mode I wrote back to the sender. The fittness thing was very annoying because there the reaction of the IT guy was that I should put up a filter because they couldn't reach the woman (who goes there in person). So after a while I started deleting the appointments.But the last one was a new job contract. Full information including pay sent to the wrong email. I wrote a long letter about it being not the correct one and asked them to tell her to please not to use my email and how much other things got sent to me. The job (HR) people were very kind and this was the last wrong email I got. I hope she got the job, but it would be her mistake if not..."
    },
    {
      "author": "dchac002",
      "timestamp": "",
      "body": "Fuck Sarah"
    },
    {
      "author": "PdSales",
      "timestamp": "",
      "body": "I was going to, but she texted me to cancel."
    },
    {
      "author": "wattlewedo",
      "timestamp": "",
      "body": "When I bought my house 27 years ago, it took three years before the after-midnight automatic faxes stopped."
    },
    {
      "author": "Thewolf1970",
      "timestamp": "",
      "body": "I'm going on 12 years with some lady that forgets her new number. Early on it was an oncologist office. I told them to delete the number but they went to an automated system.Two weeks ago I got a call from some store telling me her special order came in. I told them to send it back. They told me it had a 20% restocking fee. I said no problem."
    },
    {
      "author": "SharpCheddarBS",
      "timestamp": "",
      "body": "\"You keep my number on the wrong files? I send it back\""
    }
  ]
}