{
  "subreddit": "CryptoCurrency",
  "post_id": "1io7dt6",
  "title": "Worldcoin (PoH) on Pornhub for age verification",
  "body": "I genuinely believe Proof of Humanity (PoH) is one of the most promising applications of blockchain technology we have right now. It just makes so much sense, especially when you consider the mess that is online age verification.\n\nThink about it: sites like Pornhub struggle to balance access with protecting minors, especially with these new laws in some US states. Traditional methods are either privacy nightmares or easily bypassed. But PoH, with its ability to verify humanness without revealing personal details, seems like a perfect fit. Pornhub only needs to know if you’re 18+.\n\nI'm actually surprised I haven't seen more discussion about this. Has anyone come across proposals or articles exploring the use of PoH, maybe even Worldcoin specifically, for age verification on Pornhub? It feels like the timelines of these two developments are almost perfectly aligned. I wouldn't be surprised if we see a future where you can verify yourself on Pornhub, Coinbase, banks, liquor stores using World (WLD) or another PoH solution soon.\n\nIn general there is a lot of hate on Worldcoin, but I don’t see why. I get that the eye scanning orb thing is creepy, but there aren’t many other options to actually proof that you are an unique human. Just curious about what people think about it.",
  "author": "kirtash93",
  "comments": [
    {
      "author": "rifts",
      "timestamp": "",
      "body": "I don’t understand how that would work?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Sell your bags and find something that isn’t literally 1984"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yes, there are many people trying to implement zero knowledge proofs. Proof of Humanity is just a buzz word the scammers at World Coin use. Let that thing die Sam."
    },
    {
      "author": "CryptOrBust",
      "timestamp": "",
      "body": "Am I the only one seeing mark of the beast stuff emerging from all this?"
    },
    {
      "author": "dan345dmg",
      "timestamp": "",
      "body": "Not just you"
    },
    {
      "author": "GreedVault",
      "timestamp": "",
      "body": "But can I not let Worldcoin know that I am watching PH?"
    },
    {
      "author": "DrSpeckles",
      "timestamp": "",
      "body": "It would be a record of something, not the thing itself. There are so many potential breaks in the evidence chain getting that info into, out of, and usage of that information that it’s of no use."
    },
    {
      "author": "AggCracker",
      "timestamp": "",
      "body": "I've had thoughts about Blockchain as a way to encrypt and verify personal data and history.I have no idea how it would work logistically, but i could imagine it being useful to link medical history, legal status, etc etc.You could use your \"crypto self\" as a universal sign on to anything online social media, work, etc etc.Of course 3rd party buy in would be a huge hurtle.. and of course the actual security of it all.Blockchain is probably not actually the technology for this.. but still"
    },
    {
      "author": "kirtash93",
      "timestamp": "",
      "body": "*unzips*Oh wait, wrong sub."
    }
  ]
}