{
  "subreddit": "Ring",
  "post_id": "1d00ebu",
  "title": "Ring Verification is Obnoxious",
  "body": "The process for verification is one of the worst experiences I've ever had with a product.\n\nI got a new phone ages ago and never signed back into Ring.  Decided to do so tonight and need to verify, cool understand that for security, but you can't because you need your old device!\n\nOk well that sucks but there is the ID verification so no problem!  Well it timed out and said it couldn't be done and to use the chat to resolve the issue, links to the chat.  Getting more annoying at every step.\n\nTalk to chat person up until they need to verify my account on a new device and WELL THEY CAN'T!  That can only be done over the phone!  Ugh, you pointed me here Ring!  Fine, I'll go through yet another step to sign into my account.\n\nCall support, ask some ID verification questions and send me an email with a code to get into my account.  \"Ok sir we are now in your account and verified it is your account that is greatly appreciated, one last step we need the serial number of your device.\"\n\nAnd now I'm fuming, you're in my account, you literally just verified it and said so.  Now getting the serial number isn't a major issue right?  Wrong, because I was super fancy 6 years ago when I bought it for this house and built it flush into the molding around the door.  Hey customer service do I really need to go get a crow bar and destroy the front of my house to verify my account on a new device?  The answer is yes, they cannot verify the account, the account they the rep is quite literally currently signed into on the phone via verifying my identity over the phone, can't do it, must have serial number for security purposes.\n\nHow can a company have such frustrating methods of getting into an app?  Why must my solution be to end up hanging up knowing my choices suck so bad because I decided to make the doorbell look nice on my house?\n\nI think I might be done with Ring and order an Ecobee or other tonight.\n\nEnd rant.",
  "author": "FewRelation4342",
  "comments": [
    {
      "author": "PMM62",
      "timestamp": "",
      "body": "Your complaint about the route to getting support is valid.Your complaint about the verification method isn’t - it isn’t the most outrageous request to provide the serial number of a device you say you own, and frankly I am pleased that Ring asks for such details before providing access to an account."
    },
    {
      "author": "minos157",
      "timestamp": "",
      "body": "Why?  I also have a simplisafe security system and they verify your account by asking for normal levels of information and nothing about devices.Take my situation out, what if you were deployed somewhere for an extended period of months or even years through work and your phone bricks and you have to get a new one.  You now can't access your ring devices until you get home.  It's an absolutely outrageous request because it effectively locks you out of your device security monitoring until you can physically be near your device."
    },
    {
      "author": "magnus319",
      "timestamp": "",
      "body": "use an authenticator app it’s more secure than a text and can be backed up and restored from one phone to another. this is not just advice for Ring either it’s for anything that uses multifactor authentication and you don’t have to worry about it when switching phone numbers."
    },
    {
      "author": "PMM62",
      "timestamp": "",
      "body": "use an authenticator appOr if you use Apple devices, just use the one built into the password app and backed up in iCloud."
    },
    {
      "author": "minos157",
      "timestamp": "",
      "body": "I have an authenticator app but unfortunately I can't setup Ring in it until I can get into the app.  I didn't set it up previously because it wasn't an option when I first got the doorbell."
    },
    {
      "author": "PanHalen37",
      "timestamp": "",
      "body": "Absolute shite. Been trying to create an account for about an hour and giving up now. What trash"
    },
    {
      "author": "OutCaste1981",
      "timestamp": "",
      "body": "Sorry to revitalize this 8 month old thread but your experience and anger have given me solidarity since I am currently living it. I love technology but hate how they regulate it for consumption. Things that sound good at first, get over-regulated when they feel comfortable with a following and people being dependent on them."
    },
    {
      "author": "FewRelation4342",
      "timestamp": "",
      "body": "This app is a$$. They want me to send them a pic of driver's lic? Eff that. What other app asks for that kind of verification--not even my banks ask for that. This company is garbage."
    }
  ]
}