{
  "subreddit": "worldnews",
  "post_id": "6nsx3l",
  "title": "As of April 2018 the UK will require all pornographic websites to have some form of age verification",
  "body": "",
  "author": "autotldr",
  "comments": [
    {
      "author": "kingoflint282",
      "timestamp": "",
      "body": "So they don't think kids are resourceful enough to grab their parents' credit card or memorize the details? Also, I'd fucking hate giving porn sites my credit card info, that just sounds like a bad idea."
    },
    {
      "author": "PbThunder",
      "timestamp": "",
      "body": "My thoughts exactly, VPN or deepweb would be one solution.Also what about reddit, that has porn on it?!"
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "This wont work and everyone knows it, bet it wont even begin around April 2018 after they find out how impossible this is."
    },
    {
      "author": "PbThunder",
      "timestamp": "",
      "body": "Well blocking Pirate Bay was effective"
    },
    {
      "author": "SlyPhi",
      "timestamp": "",
      "body": "Something has gone seriously wrong in the UK."
    },
    {
      "author": "blackburn009",
      "timestamp": "",
      "body": "Are you saying that underage people have worked out how to get through the \"I am 18\" checkbox?"
    },
    {
      "author": "ul2006kevinb",
      "timestamp": "",
      "body": "I mean, for most things the checkbox should be ok, but I've definitely seen things on this site that would seriously scar young people.Maybe have \"porn\" and \"ultra porn\" avg the latter requires verification"
    },
    {
      "author": "PbThunder",
      "timestamp": "",
      "body": "It has been suggested stricter control such as requiring credit card information, the details are not yet confirmed."
    },
    {
      "author": "autotldr",
      "timestamp": "",
      "body": "This is the best tl;dr I could make,originalreduced by 89%. (I'm a bot)The April 2018 goal to protect under-18s was revealed as digital minister Matt Hancock signed the commencement order for the Digital Economy Act, which introduces the requirement.Some provisions set out by the Act have already come into force, including the introduction of a \"Broadband universal service obligation\" to give households the right to request download speeds of at least 10 megabits per second, and increased fines for firms behind nuisance calls.\"The Digital Economy Act is about building a strong, safe and connected economy,\" said Mr Hancock.Extended Summary|FAQ|Feedback|Topkeywords:Act#1including#2digital#3service#4pornography#5"
    }
  ]
}