{
  "subreddit": "nashville",
  "post_id": "1i19bj7",
  "title": "Age-verification law for pornographic websites allowed to go into effect",
  "body": "",
  "author": "mis_no_mer",
  "comments": [
    {
      "author": "themastermatt",
      "timestamp": "",
      "body": "Wish i could waste this much time at my job."
    },
    {
      "author": "blurry850",
      "timestamp": "",
      "body": "Make Tennesseans use VPNs law"
    },
    {
      "author": "Unleashed-9160",
      "timestamp": "",
      "body": "Bought 2 year subscription yesterday lol I don't even watch porn"
    },
    {
      "author": "revrenlove",
      "timestamp": "",
      "body": "I'm a software developer. I have worked for 2 different healthcare companies (an industry that is HIGHLY regulated) that allowed for SQL injection on the publicly facing login page.There is a 100% chance a data breach will occur at some point and all records related to any person's identification and browsing history on said sites will be leaked.Any one who supports this blindly supports not having any privacy for anyone for any reason. It's a blatant overstep by government and the exact opposite of patriotic.Shame."
    },
    {
      "author": "jgrowl0",
      "timestamp": "",
      "body": "*waits for the inevitable leak of conservatives' porn habits and fetishes in a couple of years 🍿"
    },
    {
      "author": "timbo1615",
      "timestamp": "",
      "body": "Get ready for age verification for reddit"
    },
    {
      "author": "turribledood",
      "timestamp": "",
      "body": "So much freedom"
    },
    {
      "author": "the-real-slim-katy",
      "timestamp": "",
      "body": "Multiple things can be true:It’s damaging to young children to view adult content. Do whatever you want as an adult but this is bad for kids.This is a really stupid and bad law."
    },
    {
      "author": "mooslan",
      "timestamp": "",
      "body": "Great job everyone, making Tennesseans more likely to have their identity stolen."
    },
    {
      "author": "mis_no_mer",
      "timestamp": "",
      "body": "In other news, VPN usage in Tennessee skyrockets"
    }
  ]
}