{
  "subreddit": "anime_titties",
  "post_id": "1k39i0e",
  "title": "Discord Begins Testing Facial Scans for Age Verification",
  "body": "",
  "author": "NewManufacturer4252",
  "comments": [
    {
      "author": "empleadoEstatalBot",
      "timestamp": "",
      "body": "Discord Begins Testing Facial Scans for Age VerificationDiscord has begun requiring some users in the United Kingdom and Australia to verify their agethrough a facial scanbefore being permitted to access sensitive content. The chat app’s new process has been described as an “experiment,” and comes in response to laws passed in those countries that place guardrails on youth access to online platforms. Discord has also been the target of concerns that it does not sufficiently protect minors from sexual content.Users may be asked to verify their age when encountering content that has been flagged by Discord’s systems as being sensitive in nature, or when they change their settings to enable access to sensitive content. The app will ask users to scan their face through a computer or smartphone webcam; alternatively, they can scan a driver’s license or other form of ID.Discord is reportedly preparing to go public on the stock market, though those plans may change as the stock market continues to experience tumult amid President Trump’s global trade war. The company brought in more than $600 million in revenue in 2024, according toBloomberg, primarily by upselling users on its Nitro premium service that includes features like custom emoji and larger file upload sizes. The app is popular with gamers but has been criticized as being abrasive and hard to navigate.Both the UK and Australia have moved to impose new restrictions on youth access to online platforms out of fear that they may be harmful to brain development. While many do believe social media, in particular, can have adverse effects on adolescents who are still developing their emotional learning and behavior, teens themselves have reported benefits of social media use, and much research regarding adverse effects remains observational. Schools across the United States have been imposing daylong bans on access to phones, but those moves are also intended to curb distraction.Australia’s outright ban on teenagers under 16 from using social media, set to go into effect by the end of the year, has been criticized over its enforcement mechanism, which requires platforms take “reasonable steps” to prevent underage users from accessing their services. That could come in the form of ID verification, which critics argue is a violation of privacy as it would potentially require all users to hand over sensitive information.Australia’s legislature has some flexibility to choose which platforms are affected, which has caused friction as YouTube isreportedly being exemptfrom the law, even though it is the most popular platform among adolescents there. The government is particularly focused on exempting platforms it deems to have an educational purpose, but TikTok and others have criticized the exemption of YouTube for being an arbitrary sweetheart deal.In the United States, some states have passed laws requiring platforms verify the ages of their users and limit access to certain websites—in Florida, PornHub took its website offline after the state legislature put in place a law forcing it to verify identities. Nobody wants to submit their drivers license to access a porn website.“We’re currently running tests in select regions to age-gate access to certain spaces or user settings,” a spokesperson for Discord said in a statement. “The information shared to power the age verification method is only used for the one-time age verification process and is not stored by Discord or our vendor. For Face Scan, the solution our vendor uses operates on-device, which means there is no collection of any biometric information when you scan your face. For ID verification, the scan of your ID is deleted upon verification.”A judge in Arkansas recentlyinvalidated a lawpassed there that would have required all users of social media to verify their age, saying the law was a violation of First Amendment protections as it placed broad content-based restrictions on access to speech, violating the rights of everyone, not just minors. In March, Utah Governor Spencer Coxsigned into lawa bill that requires Apple and Google to check the ages of users and limit minors’ ability to download apps without parental permission. That law similarly wasstruck downon Wednesday.These laws will likely continue to be challenged in the courts as the First Amendment generally applies to minors.Maintainer|Creator|Source CodeSummoningu/CoverageAnalysisBot"
    },
    {
      "author": "NewManufacturer4252",
      "timestamp": "",
      "body": "Byte by byte, little by little, I've watched since the 90s when Bill gates said everyone should have their ID online, the walled garden getting planted and now it is thriving. The gate is slowly closing by a bunch of lawmakers with no clue, except the size of checks they get for relection. Nice dinners and vacations.Digital IDs are an effective tool against povertyhttps://www.gatesfoundation.org/ideas/articles/mosip-digital-id-systems"
    }
  ]
}