{
  "subreddit": "discordapp",
  "post_id": "1c5gttc",
  "title": "Is the discord face and id verification safe?",
  "body": "I’ve been asked to send my id to verify my age. I’m a little reluctant to do that because I’ve heard of many companies misusing these information. Is it safe and should I do it?",
  "author": "Samtino00",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »If this is a bug report or technical issue, please also post aproperly formatted commentin the Monthly Megathread pinned at the top of the subreddit. It is closely monitored and prioritized by Discord. Thank you.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Demonic-Angel13",
      "timestamp": "",
      "body": "Why have you been requested to verify with your id?Did you get in trouble due to age? Is it to be able to view nsfw? Other than these reasons I don't think there would be a reason to verify age or for it to be requested.Also be highly aware of who requested it and that it's actually legit. And you need to make sure you know why.Always ask yourself who and why and what channel. If you can't verify it's legit or has any purpose then it may not be worth the risk"
    },
    {
      "author": "Icy_Government_3278",
      "timestamp": "",
      "body": "I'm sorry, I know you commented 4 months ago but I really need for you to have an opinion on my post. To sum it up, I am 110, without the 0, and I only use discord to talk to my in real life friends. But I had added one of my friends from roblox whom I don't know in real life. Long story short, there discord account had apparently gotten hacked and they had reported me accidentally or something. They told me the only way to remove my report is by talking to a discord admin. So I added this person on discord who was apparently a verified discord admin and hired by discord. I just explained the situation and he said I had been accused of many crimes like money fraud and stuff. I'm not really sure what that is but I'm concerned...I had to send some information about myself which I have said on my post but he asked me if I called him all the reports would go. And if I didn't the local authorities would get involved.  I only summed this up but for extra information, please dedicate some time reading my post."
    },
    {
      "author": "thebebee",
      "timestamp": "",
      "body": "is this requested from discord themselves in a support ticket? otherwise this is some random person and don’t do that. if you are verifying your age in a ticket yes it is safe."
    },
    {
      "author": "Icy_Government_3278",
      "timestamp": "",
      "body": "I'm sorry, I know you commented 4 months ago but I really need for you to have an opinion on my post. To sum it up, I am 110, without the 0, and I only use discord to talk to my in real life friends. But I had added one of my friends from roblox whom I don't know in real life. Long story short, there discord account had apparently gotten hacked and they had reported me accidentally or something. They told me the only way to remove my report is by talking to a discord admin. So I added this person on discord who was apparently a verified discord admin and hired by discord. I just explained the situation and he said I had been accused of many crimes like money fraud and stuff. I'm not really sure what that is but I'm concerned...I had to send some information about myself which I have said on my post but he asked me if I called him all the reports would go. And if I didn't the local authorities would get involved.I only summed this up but for extra information, please dedicate some time reading my post."
    },
    {
      "author": "antboiy",
      "timestamp": "",
      "body": "where are you asked? thats important, if its someone in a server then dont, if it is in a discord ui then i dont know.server id verification is alway a scam. for offical discord i dont know"
    },
    {
      "author": "KalHasWaffles",
      "timestamp": "",
      "body": "you are being scammed"
    },
    {
      "author": "The_Bisexuwhale",
      "timestamp": "",
      "body": "If you do verify your ID with a server always make sure to block out (not blur, use a method with 0% transparency) all information besides your picture/birthdate (depending on what the require). It cannot be guaranteed to be safe because you are basically giving your information to a random person. But, that makes it harder for anything to go wrong."
    },
    {
      "author": "Samtino00",
      "timestamp": "",
      "body": "I'd still say, don't give out personal identifying information to anyone other than a trusted company. The companies have legal obligations to handle that information a specific way. They aren't allowed to store it (unless they tell you) and they definitely can't manipulate or share it.Server moderators are not held to a standard like that, even if they're employees of some company. You volunteered private information in a public method (yes I believe DMs are still considered public as in no expectation of privacy)"
    }
  ]
}