{
  "subreddit": "DataAnnotationTech",
  "post_id": "1jeaymy",
  "title": "UK ID Verification",
  "body": "Hey, so I just got the ID Verification on my dashboard. I work in the UK and I do not have a passport/ driving licence as I'm not a British national. I do have a residence permit but since 1st Jan 2025, UK has moved to e-documents. So the physical residence permit is expired and I'm not sure how to use the e-document for ID verification.\n\nHas anyone faced the same issue and was able to complete the verification?",
  "author": "Impressive_Radio1682",
  "comments": [
    {
      "author": "Wairua1983",
      "timestamp": "",
      "body": "So you don't have any ID at all? What about from your original country?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yes, but getting a licence can take about 2 months and I can't work until then. But looks like that's the only option right now"
    },
    {
      "author": "maelstromm7",
      "timestamp": "",
      "body": "Yes, but getting a licence can take about 2 months and I can't work until then. But looks like that's the only option right now"
    },
    {
      "author": "Independent_Bid_2521",
      "timestamp": "",
      "body": "You can use your id from your originial country. I did id verification last year it's similar to my case. I got dash of doom the very next day after verifying but got the dash back after 2-3 weeks. Was really scary ngl. If you don't wanna take a chance, get some physical id first and then verify it lol."
    },
    {
      "author": "VanessaSeaWitch",
      "timestamp": "",
      "body": "Do you have any official ID with a photo on it? I think they just want to make sure your picture matches your face to verify you are who you say you are. I used a driver's license from a state I no longer live in and it went through for me. I don't know if that helps."
    },
    {
      "author": "maelstromm7",
      "timestamp": "",
      "body": "Did you use a license from a different country or just a different state in the US?"
    },
    {
      "author": "Fun_Understanding180",
      "timestamp": "",
      "body": "Which subject You give exam ?"
    },
    {
      "author": "Impressive_Radio1682",
      "timestamp": "",
      "body": "Inbox"
    }
  ]
}