{
  "subreddit": "VRchat",
  "post_id": "1j03tol",
  "title": "Is Age Verification still reliable in VRChat?",
  "body": "I was goofing off and went to Audience Anarchy and when I got there, three users asked me my age to make sure I was 18 and older. I verified my age and was allowed to stay, but when I asked if he could see my Age Verification badge he told me that he that said system had been compromised and little kids had found a way to cheat the system (which sounds genuinely nuts considering you need a pic of your drivers license along with an ai scan of your face)\n\nI decided to make this post to find out if The Age Verification process is still soundproof or if squeakers have found a way to cheat their way in.",
  "author": "drksolrsing",
  "comments": [
    {
      "author": "zig131",
      "timestamp": "",
      "body": "A really nonchalant/oblivious/shitty parent could let a child scan thier ID and face 🤷 . Or I guess they could pay another adult, but each ID is one time use.No system is 100% foolproof.However if the child was exposed to anything, that would be 100% on the parent and VRC would not be liable as they have done due diligance.But generally these people still asking for age without checking for the badge first are on an ego trip, and think they have some kind of super voice age detection powers."
    },
    {
      "author": "Boney_McBonerton_YT",
      "timestamp": "",
      "body": "Honestly I was heavily picking up an power trip vibe from the guy checking users, I just didn't bring it up in case someone got their undies in a twist."
    },
    {
      "author": "turtledude01",
      "timestamp": "",
      "body": "This right here.  Any group or club in vrchat declining to accept the vrchat proven age verification is actually putting the liability of allowing an underage person on themselves.  If a user is verified illegitimately they can also be banned and the ID will never be usable again (might be wrong on this but it's highly likely to be true).  Anyone either asking for age and DOB or asking you to join a discord and ID/ FACE verify instead of trusting the vrchat system (trust but verify, I've still ask just age) is simply believing they are a better judge of real/ fake IDs than any legitimate iD system."
    },
    {
      "author": "TheShortViking",
      "timestamp": "",
      "body": "How the fuck do they think asking people their age is better? If someone gets past the verification then of course they are going to lie about their age. How dense are these bouncers?Like is this how they think its going to go?\"Hey how old are you?\"\"I'm verified\"\"I don't trust the shitty verification, answer the question!\"\"Ohh, yea I'm 15\""
    },
    {
      "author": "Skylar_Drasil",
      "timestamp": "",
      "body": "They are extremely dense, I legit used the VRC chatbox to say “I already verified” once, they said they didnt trust it, so I told them what they wanted (also through the chatbox) and they let me through. Legit double standard there"
    },
    {
      "author": "pinkiceygirl",
      "timestamp": "",
      "body": "Truly there is no winning with these people and I largely suspect a lot of them just wish to power trip. I’d rather believe an ID system over someone just blurting an age they memorized to get in. (basically the equivalent of clicking “yes I’m 18” on adult sites) are these systems fool-proof? No but it is so much better than what we had considering people begged for this to be in place."
    },
    {
      "author": "Embarrassed-Touch-62",
      "timestamp": "",
      "body": "Oh yes, but asking the age is 100% safe. Like we live in a world where lying will kill you right? Nobody lies about it for sure..."
    },
    {
      "author": "cgsimo",
      "timestamp": "",
      "body": "Its just dumb bouncers thinking they are special. Even if age verification was not fool proof, which it probably isn't 100%, its still a lot more reliable than just asking. Like anyone can just lie. If someone doesn't recognize my age verification and insist on me giving my DOB I just leave the instance."
    },
    {
      "author": "Korteck",
      "timestamp": "",
      "body": "Anyone who thinks asking someone their age is somehow more secure than someone submitting government ID and a facial scan is a moron and probably just wants to power trip. I've told my actual birthrate to these bouncers maybe twice ever. I've told them I was born in 1955, and no one bat an eye.Could some kid trick their parents to get verified? Yeah probably. Are the VAST majority of verified people actually 18 or over? Yes.Verification is 100% more reliable than just asking someone their age and hoping they're telling the truth."
    },
    {
      "author": "drksolrsing",
      "timestamp": "",
      "body": "If you find people that are saying this, screen record them saying it, and send it to VRC.The only way to fully battle kids skirting the system is to blow their legs out from under them. The account will be banned and the ID will not be able to be used in VRC anymore.It's very easy.For the large number of people who have absolutely seen kids circumvent it, not a person has actual proof of this."
    }
  ]
}