{
  "subreddit": "RobloxHelp",
  "post_id": "1fbhbbo",
  "title": "I need help with changing the age on my account",
  "body": "Okay, so today I was playing a Roblox game and this guy asked me if I had VC, and I told him no, since I didn’t bother with trying to enable it due to the fact I don’t like using my voice to talk. Later on I was a little curious to see how to enable it (I wasn’t going to anyway) and I just realized I had my account set to the wrong age (8 years old) despite me making my account when I was actually 8. I’m 18 now, almost about to be 19 in a few more weeks and I genuinely want to change the age on my account so it’s more accurate. Any help on how to reach out for support and what to say in order for them to have my age changed?",
  "author": "Prestigious_Bad_5476",
  "comments": [
    {
      "author": "Usesed",
      "timestamp": "",
      "body": "This happened to my friend, he was messing around and set his age back 8 years. Roblox refused to do anything. If you really want to try to fix it, and i’d see why, they might have a support line, i’d recommend calling them rather than email, as the emails are most of the time automated, even when they say it was a human response.Edit: Just remembered that when your account turn 13, you can change the age to whatever, but that’s still in 5 years for your account so RIP"
    },
    {
      "author": "OwnRecognition4047",
      "timestamp": "",
      "body": "Do you know a phone number I can reach out to in order to contact them?"
    },
    {
      "author": "Vinyl-Scratched",
      "timestamp": "",
      "body": "Is there seriously no way to verify with an ID if your account is under 13???? That’s messed up."
    },
    {
      "author": "OwnRecognition4047",
      "timestamp": "",
      "body": "I’m not even sure, I recently just got my ID so I’m not positive if I can use it to identify myself"
    },
    {
      "author": "Disastrous_Binkus",
      "timestamp": "",
      "body": "You have to wait until October 31st of 2029 I believe unfortunately"
    },
    {
      "author": "OwnRecognition4047",
      "timestamp": "",
      "body": "And I wasn’t even born on Halloween, I was born on the 3rd… I don’t know why it was even set to that 🥲"
    },
    {
      "author": "BeeswarmAdamboi",
      "timestamp": "",
      "body": "this is the same thing that happened to me, it was 2020 when i made my acc and set the birthdate to 2020 december 1st. yea, i was born on 23. 4. not even december, plus that meant i was about 20 days old when i masde it but roblox is a bunch of bots."
    },
    {
      "author": "brehkid2",
      "timestamp": "",
      "body": "Had the same issue, just make some good story in your email and they should change it, for me I just said I can supply photo I’d or anything and they eventually just reset my age and I could make it my correct age, but they definitely can do something about it, any support person saying otherwise is lying, just gotta try until you get someone nice"
    },
    {
      "author": "BigBIGBIGGPP",
      "timestamp": "",
      "body": "No way to change it. I had the same issue, my brother made my account and set my birthday to 2011, finally got my voice chat this year. You can change it after it turns 13."
    },
    {
      "author": "Prestigious_Bad_5476",
      "timestamp": "",
      "body": "roblox support sucks. however, i heard roblox is trying to make a way to fix this in the future so you could just wait for that update ig. (RTC on X: \"Roblox will soon allow users to correct their birthdate if they’ve entered an incorrect age at signup. https://t.co/uOhaWiqrHO\" / X)there is a pc exploit that can be used to fix this issue however people are mostly just suspicious of me when I try to explain it and it also looks like you're on mobile so I'll just not elaborate further. :Psadge"
    }
  ]
}