{
  "subreddit": "sugarlifestyleforum",
  "post_id": "1hpuxce",
  "title": "Seeking is now requiring ID verification upon sign up.",
  "body": "SD here. I’m restarting a new account and it’s asking for a selfie to continue. Is this new?\n\nUpdate: This message as a PM from Seeking (and in case you were wondering if Seeking reps were lurking in this sub):\n\nHi, Yes, that’s correct! Seeking has recently implemented a new process that requires ID verification during sign-up. This is part of our ongoing efforts to enhance security and ensure a safe environment for all users. If you need further details, please reach out tosupport@seeking.com. Thank you.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Taser_Special_1410",
      "timestamp": "",
      "body": "Yes, it's true.  That way when their database gets hacked the perpetrators will have every user's id and photo plus all their profile and message content.  I know Seeking says it's handled by a 3rd party, but everything you put out on the Internet is subject to being hacked.  This verification system is why I'll never have a Seeking account again."
    },
    {
      "author": "isaidbiotch",
      "timestamp": "",
      "body": "This all started when I tried to renew my membership using a prepaid Visa card. I tried it with two different cards, and it didn’t let me renew. When I tried to create a new account, it asked me for a live selfie ID verification. Even though I’ve never been into anything nefarious, or scammed anyone, I’ve always liked my anonymity on these sites. (I still remember well the Ashley Madison leak from 2015.) Looks like one more reason to bail on Seeking."
    },
    {
      "author": "Cultural_Primary3807",
      "timestamp": "",
      "body": "Or it makes it more profitable to sell our information to \"hackers\""
    },
    {
      "author": "EmpressofPFChangs",
      "timestamp": "",
      "body": "And this is why I freestyle now. I have no problem doing face verification but have serious reservations about giving a dating website my government ID. They are 💯gonna store that somewhere and there’s no need for them to have it. When they inevitably get leaked, I don’t want whoever having my info."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I think I read about it being new in their recent forums on the site 😊"
    },
    {
      "author": "Junior_Trash_1393",
      "timestamp": "",
      "body": "Just as the sun rises in the East I’m certain that info will be hacked"
    },
    {
      "author": "anomdom4u",
      "timestamp": "",
      "body": "Yes this is part of their new scammer prevention initiative."
    },
    {
      "author": "Itchy-Throat-4779",
      "timestamp": "",
      "body": "Yep to combat catfishers, scammers."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I welcome this! there are thousands of low effort accounts on seeking that I have to wade through to find verified ones. If you are already ID verified, there's no need to do anything."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I get their reason, but as an aspiring SB who was JUST getting comfy with the idea of my face being on there, this has solidified that I will NOT be joining the bowl. Sad face."
    }
  ]
}