{
  "subreddit": "facebook",
  "post_id": "1hdqucr",
  "title": "Won't let me upload ID to verify my age and it's starting to make me mad",
  "body": "I recently turned 18 and want to use marketplace and went to verify my identity. It made me upload a picture of myself to estimate my age using AI and it said I was under 18 and now it won't even let me upload an ID to rebuttle it and it's starting to tick me off. I just want to use marketplace, any advice??",
  "author": "UnitedAndIgnited",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Thank you for posting tor/facebook. Please read the following (this does not mean your post has been removed):SCAM WARNING: If you are having a problem with your account, beware of scammers who may comment or DM you claiming they know someone who can fix your account, or asking you for money or your login information. If you receive a message like this, block and report them.Here is an example of me making a fake hack post and all the scammers who flocked it it, lol.  THERE IS NO REASON FOR SOMEONE TO HAVE TO TELL YOU IN PRIVATE HOW TO GET YOUR ACCOUNT BACK.  If you check the sub there are PLENTY of high karma posts that gives some tips should your account be hacked/locked.r/facebookis an unofficial community and the moderators are not associated with Facebook or Meta.  DO NOT MESSAGE THE MODS ASKING FOR HELP WITH FACEBOOK.Please read the rules in the sidebar (or the 'about' tab if you're on mobile). If your post violates any of them, delete it.If you notice your post has multiple replies but you only see this post, the reason is due tobots and scammers already being removed trying to steal your info/moneyI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "ParkingOutside6500",
      "timestamp": "",
      "body": "They go by how old you LOOK?  That's insane.  I looked twelve until I was 30."
    },
    {
      "author": "theranimakerjr",
      "timestamp": "",
      "body": "It's the bane of my existence, full goatee and it said I was underage"
    },
    {
      "author": "inventedmedia",
      "timestamp": "",
      "body": "dude i just turned 18 today and am having the exact same issue. it tells me to use the link but the link leads nowhere but to the base facebook home page"
    },
    {
      "author": "theranimakerjr",
      "timestamp": "",
      "body": "Same, they need to fix their shit bruh"
    },
    {
      "author": "Dismal_Expression_34",
      "timestamp": "",
      "body": "Same issue for me. Think I found where to upload it (search up identity confirmation in the settings) but it tells me that this isn’t the device I mainly use for Facebook, even though this is literally the only device I own. So I don’t know if that settings works or not."
    },
    {
      "author": "samhrx",
      "timestamp": "",
      "body": "God the same thing happened to me. Did it ever register you as using the device enough?"
    },
    {
      "author": "Own_Sun_7292",
      "timestamp": "",
      "body": "this is exactly what happened to me did it ever work for you?"
    },
    {
      "author": "Masaters",
      "timestamp": "",
      "body": "As I became an adult I had access to marketplace and posted an ad (I did not violate any community policies or something of the like, no reason that I could've been reported), however, I checked a few hours later and my access was gone. So I did the video selfie to no avail, then I submitted two pieces of ID through the id confirmation area you mentioned; and finally got my id confirmed. HOWEVER, this still doesn't allow me to access marketplace.On a computer browser when trying to access facebook marketplace it reads:Marketplace isn't available to youThis might be because Marketplace isn't available in your country, you've just joined Facebook or your account doesn't meet our age and eligibility criteria.(button saying Learn more)On my phone when trying to acccess facebook marketplace, it shows a glimpse of the marketplace home page and then gets overlayed with a:Unable to confirm your ageIf you fail a video selfie verification, you'll be asked to try a new verificiation method. Verification methods vary by location and may not be available in your area.(button saying Learn more)I can almost navigate facebook marketplace on my phone, such as viewing saved items, if you press fast enough, but thats useless cos the overlay with the same message keeps popping up.When you try and go to their help guides and whatnot, their chatbot thingy asks do you want to upload Id? and you go yes. blah blah blah, then it tells you to log into facebook and follow the steps however upon clicking the link its just the facebook home page. Others have faced similar issues.PLUSthere is no where to upload ID specifically for marketplace, only for running ads about social issues, politics, economics. I knew this before submitting photo ID, but I was optimistic it would translate to marketplace after confirming that I am indeed an adult.I still don't have access to marketplace... I don't care if its \"processing\" somehow in the backend, it shows that my ID is confirmed, at least it should say \"waiting for human approval\" if that were the case.This is an absolutely dismal platform, especially since I need access to marketplace urgenlty to purchase stuff that I need soon; on top of that this is a company which is not small by any means whatsoever. If it helps I'm based in Aus"
    },
    {
      "author": "UnitedAndIgnited",
      "timestamp": "",
      "body": "Any luck? I’m 19 and can’t go through, despite uploading my face."
    }
  ]
}