{
  "subreddit": "shopify",
  "post_id": "1cwk7ve",
  "title": "Easy Age Verification app not working",
  "body": "On Shopify starter so this is the only age verify app deemed “compatible” with my store. Installed and set up, yet nothing appearing on my site. Anybody else have this issue?\n\nhttps://apps.shopify.com/age-verification-8#:",
  "author": "IllProfessor302",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »To keep this community relevant to the Shopify community, store reviews and external blog links will be removed. Users soliciting sales or services in any form will result in a permanent ban.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yourcommentinr/shopifywas automatically removed as your comment karma is below 10. You can increase your comment karma by posting in other areas of Reddit to earn upvotes. The higher quality the content, the higher your karma will become.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Yourcommentinr/shopifywas automatically removed as your comment karma is below 10. You can increase your comment karma by posting in other areas of Reddit to earn upvotes. The higher quality the content, the higher your karma will become.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Apprehensive-Sea-876",
      "timestamp": "",
      "body": "Maybe try other app. Not sure how there is compatible issue when all the app did was create a popup.https://apps.shopify.com/search?q=Age%20Verification"
    },
    {
      "author": "Ok-Ideal-5865",
      "timestamp": "",
      "body": "This one is free and I’ve not had any issues, you can see an example I have added to a client’s website.ExampleAge Gate"
    },
    {
      "author": "IllProfessor302",
      "timestamp": "",
      "body": "This is what I’m using on my Wordpress site. I’ve been getting increasingly frustrated with woocommerce so was angling to make the switch to Shopify but if I can’t get something as simple as this to work or get any support in a reasonable timeframe I’ll have to just stick with my current setup"
    }
  ]
}