{
  "subreddit": "Ohio",
  "post_id": "1bznhr3",
  "title": "Ohio attempting to join other states in requiring ID to view explicit material on the web",
  "body": "House Bill 295, known as the ‘Innocence Act,’ received its first hearing at 11:00a.m. on Wednesday.\n\nCo-sponsored by Rep. Powell, and sponsored by Representative Steve Demetriou, the Innocence Act would require a more rigorous age verification process to prevent minors from viewing sexually explicit material on the internet in Ohio. It would require any person in the state to verify their age prior to accessing pornographic websites and would make it illegal for anyone under the age of 18 to view sexually explicit content.\n\n“In Ohio, any business whose primary purpose is to sell or rent adult content must verify the age of those entering their establishment as required in Ohio Revised Code Section 2907.39,” said Demetriou. “The Innocence Act will take concepts from this common sense law in the ORC into the 21st Century. We need to pass the Innocence Act because we know that video rental stores are largely part of a bygone era as smartphones and the internet are the platforms through which our children are exposed to obscene and harmful content.”\n\nThis version of the Innocence Act was created after receiving input from the Ohio Casino Control Commission, the Ohio Department of Public Safety, the Ohio Prosecuting Attorney’s Association, the Ohio Judicial Conference, the Ohio Attorney General’s Office, and the Age Verification Providers Association.\n\n“The porn industry has used technological advances to put harmful content at our children’s fingertips,” said Powell. “Ohioans know that porn can change consumers’ brains, be habit-forming, normalize abuse, perpetuate racism and toxic stereotypes, and harm sexual development and intimacy. We cannot let the porn industry addict our children to material that can harm them for decades to come.”\n\nSimilar legislation has been passed with wide bipartisan support in other states such as Texas, Louisiana, Virginia, California, and Utah to name a few, that require commonsense age verification measures to protect kids from dangerous and explicit material online.\n\nOther states such as Texas, Louisiana, Virginia, California, and Utah to name a few, have passed similar legislation with wide bipartisan support. Ohio hopes to be the next state to protect kids from dangerous and explicit material online by passing this commonsense age verification measure.\n\nWednesday’s committee hearing can be viewed at the below link:https://ohiochannel.org/video/ohio-house-criminal-justice-committee-4-3-2024\n\nhttps://www.billtrack50.com/billdetail/1644442\n\nEdit: This was a legislative email update sent to constituents from one of the sponsors of the bill. I thought it needed to be shared. I do not agree with this bill and am firmly against it, for any number of reasons.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "re-goddamn-loading",
      "timestamp": "",
      "body": "Before the state starts demanding our IDs to view porn, the full web history of each of the lawmakers responsible for this bill needs to be released to the public."
    },
    {
      "author": "DioxazineDream",
      "timestamp": "",
      "body": "Reminds me of the TikTok hearings …. “When I get on TikTok, it’s nothing but a bunch of teenagers dancing provocatively in tiny clothes.”Well, Sir, allow me to explain algorithms…"
    },
    {
      "author": "Playful-Tumbleweed10",
      "timestamp": "",
      "body": "VPN companies must be ecstatic."
    },
    {
      "author": "Onlyroad4adrifter",
      "timestamp": "",
      "body": "They are probably lobbying for this"
    },
    {
      "author": "BoodaSRK",
      "timestamp": "",
      "body": "Meanwhile, massive political and business corruption. By men who probably way sleazier than the average Ohioan."
    },
    {
      "author": "Karmaqqt",
      "timestamp": "",
      "body": "You know it’s old people thinking this is a good idea. And they think it works too, that’s the best part."
    },
    {
      "author": "AerialDarkguy",
      "timestamp": "",
      "body": "404Mediaandtechdirtwrote a good article on the harms of these age verification bills. I get for many, it seems as intuitive as id for beer, but these bills are dangerous and dont understand the harms of id over the internet. Numerous studies have shown that no id scheme over the internet issecure, reliable, and accessible. They will increase our risk for data breach that make us vulnerable to blackmail similar to the Ashley Madison leak, risk outing the LGBTQ community, and push users to porn sites abroad with less protection for the actors.  This will also prevent adults who do not possess ID from viewing content. Unfortunately, it's not just a republican problem. Representative Demora is a Democrat and pushed a similar bill withSenate Bill 212and democrat lead house in Virginia passed with Democrat support. If you oppose this bill, I would write to your representative regardless of their political affiliation.And for folks who are sure VPNs will survive this, the anti porn movement is pushing this across the country to make the strategy of pulling out unviable and liable enough to comply. The anti porn movement knows Netflix blocks VPN traffic due to liability from copyright, they want the same liability to influence porn companies to do the same thing."
    },
    {
      "author": "Suspicious_Victory_1",
      "timestamp": "",
      "body": "How’s this supposed to work? Each website is going to require a drivers license number to access or something? Is there a centra database of everyone’s age?Are websites going to host and manage PII? Or will the state do it and assign a personal identification number or something?Who determines which content is too adult to allow children to see? Is there an elected panel? Appointed? Just state lawmakers visiting random websites all day looking for porn?Is the language in this bill strong enough it wouldn’t be abused to suppress non pornagraphic content as well? Seems like we’ve learned time again our state lawmakers are willing to abuse the system to push their agenda. How do we make sure that doesn’t also happen here in the name of innocence’?"
    },
    {
      "author": "OhioMegi",
      "timestamp": "",
      "body": "Let parents be responsible for this shit.  If parents are crap, oh well.  The GOP want small government, but  want to control everything.  Such hypocrites, vote the fuckers out."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Just want to point out that this law fits into Project 2025's plan to declare any expression of queerness, transness, or gender noncomformity as \"pornographic\" in order to erase LGBTQ+ people from publuc life. They dont care about porn, they want to block any and all LGBT+ content from the internet.https://www.documentcloud.org/documents/24088042-project-2025s-mandate-for-leadership-the-conservative-promiseRegardless of how you feel about queer people, you should give that document a read and see what you think about the rest of it."
    }
  ]
}