{
  "subreddit": "ChumbaCasino",
  "post_id": "1fqdom4",
  "title": "For those of you seeking to be informed about these class actions that are happening... and no this isn't just people who have lost who are upset and angry. This is far bigger than that. Money laundering. Racketeering. Massive payouts are on the way for those who have signed up. Shutdowns to follow.",
  "body": "BEFORE YOU READ THIS (YES IT IS LONG BUT IT'S INFORMATIVE) PLEASE RECOGNIZE THIS FOR WHAT IT IS AND STOP ATTACKING FELLOW PLAYERS SOCIAL SWEEPSTAKES CASINOS ARE ABOUT TO GO THE WAY OF THE TRANSVAGINAL MESH AND ROUNDUP WEED KILLER\n\nBreaking Down the Latest Sweepstake and Social Casino Lawsuits and Enforcement in the United States and Australia\n\nAugust 26 2024\n\nWe previously reported on a growing litigation trend in the United States, as social gaming casinos and sweepstakes operators have been facing increasing legal scrutiny in the United States. In this update, we further outline the recent key developments in the field.\n\nThe claims against operators stem from the offering either social casino operations, or simulated casino games together with a “dual-currency model”. Whereas social casino models include casual games (which may resemble gambling by style) in a closed-loop economy, and rewards cannot be redeemed for real-world currency or prizes, dual-currency models operate differently.\n\nTypically, a dual-currency model provides one virtual coin that is either distributed to players for free in a periodic increments, or is purchasable via an online store, and is solely used to play casino-like games. In addition to these virtual coins, operators allow players to obtain an additional virtual item, a “sweep-coin”, which can be obtained by daily log-ins, promotions or as bonus for purchasing virtual coins. Such sweep-coins have a single purpose of being exchanged for cash or prizes.\n\nThe AGA Calls for Enforcement Against Sweepstakes Operators\n\nOn 19 August 2024 the American Gaming Association (the “AGA“), which is a national trade group representing the US casino industry, has called out gaming regulators and state attorneys to investigate operators of “sweepstake casino” models with a dual-currency system, to determine whether these companies are in compliance with their respective laws, as well as to consider enacting legislation to prevent “exploiting loopholes in sweepstake regulations to offer online real money gambling”.\n\nAccording to the AGA, these sweepstake models undermine gaming regulation and is designed to circumvent or exploit ambiguity in state gambling laws and the regulatory frameworks within which the legal gaming industry operates.\n\nThe AGA further emphasized that the lack of regulatory oversight presents many risks for consumers as well as the integrity of the gaming market, including weak (if any) responsible gaming protocols, lack of age verification processes, few (if any) self-exclusions processes and lack of independent product testing to ensure basic fairness to players.\n\nAML Enforcement Against Sweepstakes Operators in Missouri\n\nIn July 2024, following an investigation by the Department of Justice (“DOJ”), two men that operated sweepstakes in Missouri plead guilty for failing to implement appropriate anti-money laundering (“AML”) controls mandated by a Missouri bank, as required under the Bank Secrecy Act.\n\nThe DOJ investigation found the men deliberately provided false information to their bank, by way of misclassification of their companies as “direct mail advertising” companies (as opposed to sweepstake operators), and by omission of previous legal actions taken against the companies.\n\nAccording to the DOJ, these attempts were made in order to escape heightened monitoring under the bank’s policies and procedures – including the implementation and maintenance of AML controls – as required by the bank for high-risk business such as sweepstakes.\n\nVGW and Others Face Litigations and Enforcement in Multiple States\n\nVGW Holdings, an Australian-based gaming company operating popular online social casinos and sweepstake platforms (such as Chumba Casino, Global Poker or LuckyLand Slots) based on the dual-currency model, has faced additional litigation and enforcement in the following states (in addition to the previously reported class-action settlement in Kentucky):\n\nGeorgia: In May 2024, a class action was filed against VGW Holdings Limited and its subsidiaries, Malta Limited, Luckyland Inc., and GP Limited for operating and marketing their games as “just for fun” while facilitating real-money gambling using a dual-currency system. The class actions represent a class of Georgia gamblers who played VGW’s games Chumba Casino, Global Poker or LuckyLand Slots. Michigan: the Michigan Gaming Control Board had issued cease-and-desist letters to three online gaming companies – VGQ LuckyLand Inc. (VGW), as well as PredictionStrike Inc and Sweepstakes Limited (Stake.us) – claiming that these companies had offered and promoted internet gambling in Michigan without being licensed to do so in Michigan.\n\nDelaware: Earlier, in 2023, the Delaware Sports Betting Regulator also sent a cease-and-desist order against VGW and its subsidiaries, demanding residents of Delaware will not be able to play online casino sweepstakes products. Social Casino Litigation – US and Australia\n\nIn parallel to the sweepstakes related litigation cases, several litigation cases against social casino operators have been filed in the US and Australia:\n\nWashington: In June 2024, High 5 Games, which operates social casino games, was found to be offering illegal gambling under the Recovery of Money Lost at Gambling Act and Washington Consumer Protection Act, following a class action by consumers. Specifically, the court ruled that virtual coins in the apps should be interpreted as “things of value,” irrespective of any periodic giveaways to players via various methods. The court further stated that the value of the coins stems from their ability to allow extended gameplay.\n\nKentucky: In April 2024, Yellow Social Interactive, which operates the social casino platform Pulsz, had agreed to a $3.6 million settlement in a class action filed against the operator. This is an additional settlement agreed upon by Pulsz, following a former $1.32 million settlement agreed upon in November 2023. The class action claimed Pulsz was an illegal online casino site, violating Kentucky laws by selling in-game currency that allows players to gamble.\n\nAustralia: In July 2024, Aristocrat Leisure, an Australian-based company offering, inter alia, social casino apps through its arm Pixel United, was alleged to have violated local gambling rules according to a class action lawsuit brought against the company in the Federal Court of Australia. Claims against the company include the harm caused to players by the lack of financial or time limits in the games. As we have indicating before, the litigation and enforcement trend in the US is expanding throughout the Unites States, and recently to additional states around the world.\n\nOperators of social casino games, and in particular, operators of sweepstakes casinos, should carefully review and monitor these developments, assess their potential exposure, ensure clear and transparent disclosure regarding the nature of the games – particularly the availability of virtual chips for purchase and the possibility of real money prizes – and explore mitigation strategies to address any risks.",
  "author": "MarkAggressive1038",
  "comments": [
    {
      "author": "No_Willingness8651",
      "timestamp": "",
      "body": "Just out of curiosity, where did you find this information?  I'm not disputing what you've posted, just genuinely interested."
    },
    {
      "author": "vaginalvitiligo",
      "timestamp": "",
      "body": "I literally just copied and pasted it from this article. Reason being is I had been working on putting something together myself because I hadn't seen it all in one place. But this is the closest that it can go as of right now cuz there are still other filings that still haven't completed. This is what I've seen to be the most comprehensive coverage of all publicly available information.https://www.lexology.com/library/detail.aspx?g=49c941ea-6e07-44a7-ba2a-91f699d5b938"
    },
    {
      "author": "Electrical_Skin_4857",
      "timestamp": "",
      "body": "Following"
    },
    {
      "author": "Final-Asparagus8805",
      "timestamp": "",
      "body": "So what your saying is that I can sue all of the social casinos and win as long as I have an account with them."
    },
    {
      "author": "vaginalvitiligo",
      "timestamp": "",
      "body": "You would need to apply through an attorney and meet eligibility requirements. I can't determine if you're eligible. But realistically, yes if you have an account you most likely You would have a case. It all depends on what state you live in and what your situation is.I'm not an attorney so I'm not telling you anything definitively that you can or cannot do nor am I giving legal advice."
    },
    {
      "author": "WonderfulTennis3476",
      "timestamp": "",
      "body": "Pretty sure it depends on the operator. Things chumba has and continues to do are the reason they are getting sued and will most likely lose. For example, frivolously denying mail in entry forms, lying and manipulating gameplay etc.Not to mention the woman that initially filed the claim SMARTLY excluded herself from their arbitration clause which is really going to help this case big time."
    },
    {
      "author": "PotentialGenius99",
      "timestamp": "",
      "body": "I just won over $200,000 on PulszBingo and during my redemption they locked me out of my account and sent me an email saying they will not be fulfilling my redemption because I am in violation of their Terms of Service.  Which, I am NOT... I've read through it front and back and sideways and I am not in violation of anything.  My account was already verified, I've been playing for months and months with absolutely no issue, so now that I had a big win I'm all of a sudden in violation.  What do I need to do? I'm sick, literally sick!! My father is an attorney... so cost isn't an issue... please tell me what to do..  This is so wrong and so unfair."
    },
    {
      "author": "vaginalvitiligo",
      "timestamp": "",
      "body": "Maybe reach out to the kind law firm as they're handling a few cases there or really any consumer protection attorney might be able to help."
    },
    {
      "author": "MarkAggressive1038",
      "timestamp": "",
      "body": "How do you join the lawsuit"
    },
    {
      "author": "MarkAggressive1038",
      "timestamp": "",
      "body": "Is there a way for individuals to join that don’t reside in those specific states?"
    }
  ]
}