{
  "subreddit": "Tiktokhelp",
  "post_id": "1hud679",
  "title": "Tiktok age verification is taking a LOT of time",
  "body": "I've had a request for age verification in progress for 5 days (I'm over 18) and I've had no news despite numerous reminders from myself. I've just passed the 10,000 subscriber mark and therefore can't activate monetization, do you know if there's a way to speed things up?",
  "author": "Yomu95",
  "comments": [
    {
      "author": "Time_Prior_",
      "timestamp": "",
      "body": "They do these manually. It was new years, and then a weekend, so less people probably working"
    },
    {
      "author": "Yomu95",
      "timestamp": "",
      "body": "Thanks for your answer ! That's what i was thinking but It's just frustrating not having any news but I just had bad timing i guess"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "If this post is CLICK FOR CLICK related, please delete and repost onr/c4ctiktokReferral links are no longer supported on this sub but they are welcome on c4ctiktok :) Thank you for posting, please be sure to checkFaQPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "TypicalLook",
      "timestamp": "",
      "body": "Any update? My account just got age restricted and all my tts and purple ticket money is gone"
    },
    {
      "author": "Yomu95",
      "timestamp": "",
      "body": "Nope xD, still no update and it's been a week :DDDDDD It's frustrating, I get no response from them and it's impossible to get in direct contact with support. All we can do is wait."
    },
    {
      "author": "userbellz",
      "timestamp": "",
      "body": "On the same boat but it’s been 8 days for me"
    },
    {
      "author": "Yomu95",
      "timestamp": "",
      "body": "They finally answered me today and everything is now done, hope it won't take too long for you"
    }
  ]
}