{
  "subreddit": "SocialSecurity",
  "post_id": "1jtrm96",
  "title": "Identity verification online is impossible",
  "body": "I can build a computer. I can write code. I've been doing these things since the early 90s.\n\nfor the past several years, I have been  verified forlogin.govthru the Veterans Administration\n\nSocial Security website is mandating that I verify my identity.  I have tried repeatedly over the course of a week.  I gave up. So now I will go to the post office in person to verify my identity.\n\nAt first I was okay with this new policy. I believed it is a quick and easy way for them to stop or prevent fraud.  Folks complained about the folks who were ill and homebound, I figured they could just do it online, maybe with some help from a care giver.\n\nI'm still okay with everyone having to verify but this online verifcation is impossible and frustrating and it may cause issues for folks who can not travel.\n\nFix this bullshit please my incompetent friends at SS andlogin.gov\n\nEDIT Thank you,  ID me was quite easy.  So it seems like the issue is with thelogin.govfolks",
  "author": "FunCommunity4816",
  "comments": [
    {
      "author": "KWAYkai",
      "timestamp": "",
      "body": "Interesting how you, at first, were okay with the new policy. But now that it’s impacting your life it’s a bad policy."
    },
    {
      "author": "Difficult-Low5891",
      "timestamp": "",
      "body": "Thought that was funny, too. Typical."
    },
    {
      "author": "sundancer2788",
      "timestamp": "",
      "body": "I think you need to do ID me. I did mine months ago, hubby did his just two weeks ago. Make sure the picture of your license is straight on and clear. Don't look down when doing the selfie video."
    },
    {
      "author": "Particular_Map9772",
      "timestamp": "",
      "body": "This is what works. I would add back up a little from the camera which worked for me"
    },
    {
      "author": "bonfuto",
      "timestamp": "",
      "body": "When I verified recently forlogin.govI had to put my license on a well-lit windowsill to get it the system to recognize it.  I probably could have set up lighting, but it was sunny that day.  I tried it with room lighting and it didn't work."
    },
    {
      "author": "greensinwa",
      "timestamp": "",
      "body": "My 79 yo mother hates computers and can’t work the camera on her phone. She’s lucky, she has help. How many seniors are in the same boat.Fuck this regime."
    },
    {
      "author": "bonfuto",
      "timestamp": "",
      "body": "There was a post in this sub recently that saidlogin.govwasn't working and you should useID.meinstead.  I was tempted to follow that advice, but I'm not sure I need to at this point"
    },
    {
      "author": "Sknowles12",
      "timestamp": "",
      "body": "I tried for weeks to get ID.ME verified. Yes, impossible. The biggest holdup is just trying to upload pics of current ID. My hubs (veteran) is very ill, making it difficult to leave the house. The local (very rural) post office doesn’t do ID, so more travel we cannot do. We are apparently screwed. I have no idea how our homeless and housebound can do this."
    },
    {
      "author": "AssociateBest6744",
      "timestamp": "",
      "body": "I did the ID me thing last Thursday, no issues at all."
    },
    {
      "author": "FunCommunity4816",
      "timestamp": "",
      "body": "ID.MEis very straightforward"
    }
  ]
}