{
  "subreddit": "delta",
  "post_id": "1htyesa",
  "title": "Identity verification?",
  "body": "I have a flight tomorrow, got the check-in notification on my email, went to the app to check-in.\n\nTried to login and got this message. I have flied hundreds of thousands of miles with them and have sent them my passport in the past, so it’s not like they don’t know who I am… has anyone seen this before?",
  "author": "Coffeekittenshorses",
  "comments": [
    {
      "author": "Miserable_Tourist_24",
      "timestamp": "",
      "body": "Yes, I’ve seen it and done it and still end up with the dreaded SSSSS boarding pass. Just fill it out. It’s likely a random pull. This is for an international flight, right? Is it by chance a code share with Virgin?"
    },
    {
      "author": "Formal-Row2081",
      "timestamp": "",
      "body": "My flight tomorrow is domestic with Delta, I have a flight to London in a month but I don’t think it’s a code share"
    },
    {
      "author": "Sea-Dingo4135",
      "timestamp": "",
      "body": "I’ve had similar, even after verification it wouldn’t clear. Problem with the app."
    },
    {
      "author": "sdkfhjs",
      "timestamp": "",
      "body": "I am in the same boat, I filled out the form and haven't heard back. I was able to check in with my confirmation code as a guest though and get a mobile boarding pass, however"
    },
    {
      "author": "HarvyHusky",
      "timestamp": "",
      "body": "Just navigated to the form and it looks like a pretty simple form with what it asks for (name, address, email, SkyMiles number, etc). I would complete the form now, and then just plan on arriving at the airport earlier than expected to check in at the agent assist line at the ticket counter. There is likely something flagged on your SkyMiles account, and they need you to complete the form ondelta.comand upload a picture of your government issued photo ID before they'll let you regain access to your account."
    },
    {
      "author": "Formal-Row2081",
      "timestamp": "",
      "body": "Thanks - let me do that"
    },
    {
      "author": "nulluniversal",
      "timestamp": "",
      "body": "I'm currently having the same issue. Frequent flyer and never have had any problems signing in. I filled out the form so hopefully this issue can be resolved fast, I have a domestic flight soon I'll have to check-in for."
    },
    {
      "author": "Fondtravels_",
      "timestamp": "",
      "body": "That’s frustrating, especially with a flight tomorrow. This can happen if Delta flags your account for security—like logging in from a new device or a random audit.Here’s what to do:Complete the Identity Verification Form: Follow the app's prompt under \"SkyMiles Help.\" Have your ID and SkyMiles number ready.Contact Delta Support: Call their SkyMiles team if you're short on time. They can verify your account manually.Check-in Alternatives: You can check in at the airport kiosk or use Delta’s website as a guest (with your confirmation number).Hopefully, this gets sorted quickly, and you can focus on your trip.Safe Travels!!"
    },
    {
      "author": "saltyschweddyballz",
      "timestamp": "",
      "body": "I have the same issue, wonder if they're having system issues."
    },
    {
      "author": "Coffeekittenshorses",
      "timestamp": "",
      "body": "I'm also having this problem--it started probably about a month and a half ago.  I've filled out the identity verification form twice.  I was not able to use the wifi on my most recent flight because I couldn't log in.  I am unbelievably annoyed."
    }
  ]
}