{
  "subreddit": "NewToReddit",
  "post_id": "1j8r6pu",
  "title": "How to do Age verification",
  "body": "I'm in Indiana, so I need age verification to see NSFW video's.  So How do we do this here on Reddit?\n\nThanks",
  "author": "PitchReasonable28",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome tor/NewToReddit,u/Lonelysenior60! Thanks for posting.Your post has been flaired 'Needs attention' so we can easily identify which posts require answers.Someone will be along to help you shortly.If you're new, check out our \"General Guide to Reddit and Karma\"Wiki page versionorMobile friendly post version, it explains how to get started on Reddit; including information on karma, navigation, and more. You might also like to check out ourwiki indexandFAQ.Please let us know how you found us! - Click here to fill out our one question surveyOnce you get some answers, don’t forget to engage and ask any additional questions you have!Once you have a good answer you can mark your post as answered by commenting with the exact phrase!answered. Otherwise, a mod will do so as time allows, once an accurate answer has been provided. This makes unanswered posts easier to find.Thank you! :)I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "MadDocOttoCtrl",
      "timestamp": "",
      "body": "Reddit does not allow NSFWimages orvideo to be directly hosted on Reddit. These link to other web sites.Different states have their own laws and methods for verifying your age to access these web sites.CORRECTION: Reddit now hosts NSFW photos, but not video."
    },
    {
      "author": "Lonelysenior60",
      "timestamp": "",
      "body": "So do you have to guess which website and verify with each website or What.  It seems like it just happened.  Wow very confusing.Thxs for your input"
    },
    {
      "author": "PitchReasonable28",
      "timestamp": "",
      "body": "thnxs bro"
    }
  ]
}