{
  "subreddit": "Ruleshorror",
  "post_id": "rijpzv",
  "title": "thispersondoesnotexist.com",
  "body": "Welcome to thispersondoesnotexist.com, the world’s best and largest database of AI generated faces! Now, I’m sure you know of this website’s, ahem, reputation, but we assure you as long as you follow our basic guidelines, you’ll be fine!\n\nAlways try to keep your internet connection at its peak. It’s not technically required, but a solid connection keeps the anomalies at a minimum.\n\nIf a pop up shows up asking for facial ID verification, decline it. You’ll still be able to browse the site, and you don’t want your data falling into the wrong hands, do you?\n\nIf one of the faces you scroll to looks like someone you know, reload quickly. It’s only a little unsettling if you reload quickly but if you let it stay on screen it won’t stay that way.\n\n3a. If the face looks familiar but you don’t know from where, reload as normally. They’re no threat to you now, but if you see them IRL any time in the next few days, avoid being alone for too long.\n\n4. If the face is broken in a way that doesn’t look like an issue with the AI (extra mouth or eye, etc) avoid eye contact and report the issue.\n\n4a. If you know the face despite being unrecognizable, right click to save the image and delete it. You’ll feel incredibly guilty, but it was them or you.\n\n5. If every time you reload the faces’ eyes are tracking your location, shut your eyes and pray to any god you may believe in. They won’t listen but it’ll scare the faces. Reload the site three times, inspecting the eyes each time. If everything went well, on the third time the face will be looking away from you.\n\n4a. If faces are looking on the second reload either they don’t get the memo or they’re attempting to deceive you. Close the tab and reopen it. The same face will be showing up, this time looking away.\n\n5. If a distorted face is behind any face you see, use a MIRROR to check behind you for any undesirables that may have escaped the computer. If anything is there, don’t turn your body around to get a better look. It’ll always be stuck behind you, and forcing it closer to the computer isn’t in either of your best interests.\n\n5a. If anything is there, right click to save the image and delete it from your computer. Trust us, you’re doing it a favor.\n\n6. If your Internet isn’t at full connection, the AI may screw up and show you the face you shouldn’t see. If you see Him, and we cannot stress this enough, IMMEDIATELY close the tab and don’t open it again for at least a day, and only if your connection is at full.\n\n6a. This face in particular can take on many forms. He ordinarily looks like the base of a middle aged Asian man with horrifically distorted features, but He can alter its appearance to attempt to fool the viewer.\n\n6b. Under no circumstances are you to download the image, letting Him. into your computer cannot be undone, even by factory resetting it, and attempting to delete the image will only anger Him.\n\n7. If you see your own face showing up, it’s either a coincidence or you failed one of these steps. Just to be safe, download the image and delete it. It’ll be quicker that way.\n\nAnd that’s it! If you make sure to follow these guidelines to the letter, we’re sure you’ll still exist by the end of your experience! If you have any questions about how our AI works, don’t hesitate to throw an email our way. Have fun!",
  "author": "CharacterMood4",
  "comments": [
    {
      "author": "psycopath3551",
      "timestamp": "",
      "body": "This is creeping me out, especially rule 5. Good job, OP!"
    },
    {
      "author": "Papi_legba",
      "timestamp": "",
      "body": "I think because I have always found AI generated faces to be sinister (like computers shouldn’t be this good at making faces..) this creeped me out ALOT. Love it, great post!"
    },
    {
      "author": "crystallized_doggo7",
      "timestamp": "",
      "body": "I visited the actual website before reading this and broke like 5 of the rules, should I start writing my will?"
    },
    {
      "author": "4tomguy",
      "timestamp": "",
      "body": "All I’ll say is there’s very good reason those faces wanted out"
    },
    {
      "author": "ayeshuckmytoes",
      "timestamp": "",
      "body": "r u alive, i am scared 😅"
    },
    {
      "author": "Aidenator98",
      "timestamp": "",
      "body": "That’s 2 times this Website appeared on a rule list."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "its a creepy site though, and ripe for these kinds of stories."
    },
    {
      "author": "netmyth",
      "timestamp": "",
      "body": "Great read, well done!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "the numbering got a bit funky, but interesting idea"
    },
    {
      "author": "CharacterMood4",
      "timestamp": "",
      "body": "I love this! I remember using this site in one of my stories a while back, it is the perfect site for horror"
    }
  ]
}