{
  "subreddit": "australia",
  "post_id": "1cv59q3",
  "title": "How age verification rules for porn and social media could impact millions of Australian adults",
  "body": "",
  "author": "Uniquorn2077",
  "comments": [
    {
      "author": "CrazyFellaFromPhilly",
      "timestamp": "",
      "body": "Can see this going wrong on so many levels due to the government’s incompetence with modern day tech lol"
    },
    {
      "author": "Kytro",
      "timestamp": "",
      "body": "If even if it's competent and well executed, it's practically impossible to achieve. Many of these companies don't even operate in Australia, or have an Australian presence."
    },
    {
      "author": "Chosen_Chaos",
      "timestamp": "",
      "body": "It would be nice if for once -just once- people with actual technical knowledge were consulted before stupid ideas like this were floated publicly..."
    },
    {
      "author": "NeonsTheory",
      "timestamp": "",
      "body": "Considering the data breaches in recent history, be ready for your boss to know your porn habits"
    },
    {
      "author": "Agent_Jay_42",
      "timestamp": "",
      "body": "Lol... This bit cracked me up.Outlines why it won't work, but hell, let's do it anyway.In Texas, porn use appeared to decline by roughly 80 per cent after a scheme was introduced, suggesting that in reality, Texans were dodging the scheme using VPNs.The industry acknowledges it's a challenge, but argues it would be a mistake to let perfect get in the way of good."
    },
    {
      "author": "philly4yaa",
      "timestamp": "",
      "body": "The Australian government has always made the dumbest of decisions when it comes to anything internet related. Incompetent old cunts"
    },
    {
      "author": "Pipehead_420",
      "timestamp": "",
      "body": "Except when labor’s nbn plan was to go full fibre like 15 years ago. That was a good decision. But the liberals destroyed it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Anyone with some basic to intermediate IT knowledge is not going to be effected. Just more bumbling idiot making stupid decisions that cost this country millions."
    },
    {
      "author": "Bees1889",
      "timestamp": "",
      "body": "They're intertwined anyway, for example Twitter has some seriously extreme content on it, is available on all app stores and most parents are probably oblivious and isn't generally blocked or filtered as a \"porn site\"..It sounds completely unworkable and if anything does happen it might have unintended consequences eg, instead of being on mainstream platforms that have to at least appear or try to have content moderation in order to be acceptable to payment providers etc. they'll be on the rest of the completely unregulated internet which won't have any sort of checks or content moderation at all."
    },
    {
      "author": "Uniquorn2077",
      "timestamp": "",
      "body": "Fuck our governments waste money on some absurd shit in this country."
    }
  ]
}