{
  "subreddit": "PornhubComments",
  "post_id": "1hrelun",
  "title": "That 14 day warning I got actually wasn't lying 🤦",
  "body": "",
  "author": "axron12",
  "comments": [
    {
      "author": "ChefArtorias",
      "timestamp": "",
      "body": "They did it in VA like a year ago. Seems to be here to stay."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Florida requires serious age verification to access pornography. Age verification is expensive and runs the risk of privacy concerns. Pornhub blocked access to their services In Florida"
    },
    {
      "author": "Ricer_16",
      "timestamp": "",
      "body": "Florida requires serious age verification to access pornography. Age verification is expensive and runs the risk of privacy concerns. Pornhub blocked access to their services In Florida"
    },
    {
      "author": "DecoherentDoc",
      "timestamp": "",
      "body": "So, laws like the one that just went into effect in Florida have been passed in several states here in the US. The laws require age verification via official government IDs (driver's license, passport, etc). Pornhub thinks that's a huge breech of privacy and a gateway tofurther breeches of personal privacy, so they're simply cutting access to their site in states that pass these laws.Which is probably just fine to the lawmakers, because the laws are simply a result of American mainstream culture being extremely prudish."
    },
    {
      "author": "MrsAnnaClark",
      "timestamp": "",
      "body": "In Montana if you turn off your WiFi and just use phone data, it will work anyway."
    },
    {
      "author": "ManyThing2187",
      "timestamp": "",
      "body": "IN here, I used to use data but even that started to get blocked so I broke and got a VPN."
    },
    {
      "author": "dylanlovespies",
      "timestamp": "",
      "body": "This is why we use a VPN for certain states that allows porn 🙏"
    },
    {
      "author": "Optimus_Pitts",
      "timestamp": "",
      "body": "Proton VPN had to have gotten thousands of downloads in Arkansas alone when pornhub became inaccessible.Totally not speaking from experience or anything."
    },
    {
      "author": "Yeetblast",
      "timestamp": "",
      "body": "Bro in texas i can't register an account to verify my age with. The ONLY option seems to be a vpn."
    },
    {
      "author": "axron12",
      "timestamp": "",
      "body": "Just use a vpn, I think there are free options that will work even."
    }
  ]
}