{
  "subreddit": "offmychest",
  "post_id": "1j3hkeo",
  "title": "I was on adult web cam site, and I am still concerned I did something wrong.",
  "body": "Sorry for the vague language, but I had to comply with the rules.\n\nI started going on webcam site (similar to Omegle) to help with my social anxiety and practice interacting with people. I hoped this would help me become more comfortable in social situations. Over time, I began to encounter people who were engaging in intimate or suggestive content. This caught me off guard, and I wasn’t sure how to react. I became curious about the behavior and started interacting with others who seemed to be open to these types of discussions.\n\nOne day, I was matched with a person who mentioned that they were looking for an intimate conversation. I felt curious. Later, I was matched with someone who was revealing more of their body on camera. I asked, \"Is this real?\" and she replied, \"Yes, this is real.\" I asked, \"Can you show me more?\" She said, \"No, what the heck. I'm not going to do that!\" and skipped.\n\nSoon after, I discovered an adult website with private one-on-one chats and began talking to women with intimate intent. I started asking them to reveal more, and some did without hesitation. Afterward, I went and did the deed to the imagination of what I saw.Shortly after, I suddenly worried:What if they were underage?I got extremely concerned and wanted to find them again, but I had no way of doing so. I initially thought that if people were engaging in these kinds of interactions, they must be adults.\n\nI investigated the website and found out that they verify users’ ages with ID. I returned to the platform and began asking women how old they were. They all told me they were over 18. I reported the site to local authorities, expressing concerns about potential illegal activity, although I didn’t have solid proof. The authorities investigated the site and found no evidence of any wrongdoing. Interpol did an investigation on the site, and found no evidence of wrongdoing either.\n\nThe anxiety grew worse, and I seriously considered reporting myself to the police in hopes that they could investigate and determine whether I had interacted with anyone underage. I also began questioning whether I had at any point unknowingly gotten exposed to minors in that way. I began taking SSRI’s and anti anxiety meds to manage my anxiety and started therapy.\n\nWhen I felt better, I returned to the site (the one that is similar to Omegle) again to engage with people. Shorty after I was again matched with people who were wanting to have suggestive conversation and revealing more of their body (both men and women). I initially skipped, but got curious and felt excited again.I promised myself that I would never ask anyone to do anything, and if I had any suspicion that someone might be lying about their age, I would immediately skip them.\n\nEventually, I was matched with someone whose video was black, but they seemed to be suggesting that kind of behavior with emojis. I asked them how old they were, and they responded, “15.” I immediately skipped. I got matched with someone after. She had her torso visible, and then she lifted her shirt, exposing part of her body. I asked, “How old are you?” but she skipped me immediately.\n\nI was left feeling distressed - I was using the site without clear age verification, hoping to meet people who were showing intimate content, while also being aware of the risk that there could be someone underage experimenting.\n\nThe next day, I reached out to a  sex counselor and confided in her about my concerns. I started crying on the phone, realizing that I had crossed personal boundaries in my behavior, just because I was curious.\n\nDespite this, I still find myself wondering whether any of the women I interacted with on the webcam site were underage. My anxiety continues to distort my memory, and I wonder:What if they were 17? Or 16? Or even younger?Sometimes, these thoughts become overwhelming, and I question whether I might have missed signs that would have indicated their true age. Someone might say, “You would have noticed if they were much younger,” but what if I didn’t??",
  "author": "Fit-Discussion3536",
  "comments": [
    {
      "author": "Ath-e-ist",
      "timestamp": "",
      "body": "Chances are, yes probably.Teens are teens, curious, risky andquitestupid.If you weren't actively seeking out kids, you're fine."
    },
    {
      "author": "Fit-Discussion3536",
      "timestamp": "",
      "body": "Two things.Firstly, even though I was not seeking out minors, I was still present on the platform, hoping to get matched with someone naked (my age). In other words, I was aware of the risk, but still on the platform.Yes, I told myself I would ask how old they are, and would not ask anything of them. But, what happened before, I don't know how that makes me look.Secondly, I asked women to show some body parts (on the adult web cam with verification), which they did. I still can't stop thinking whether they were underage or not."
    }
  ]
}