{
  "subreddit": "MawInstallation",
  "post_id": "oysben",
  "title": "Does P == NP? A contemplation of electronic security and automation in Star Wars.",
  "body": "It is frequently observed that automation in Star Wars is far less widespread than might be expected, particularly given what their technology seemingly could be capable of.\n\nIn this essay, I will be making the case that the low level of automation is, in fact, entirely logical, given the nature of computer science in that setting. Spoilers for various properties will ensue, up to and including recent (from the perspective of 08/07/2021) episodes of The Bad Batch.\n\nBroadly speaking, I will be attempting to demonstrate the following conjecture, using sources from the Lore:\n\nAutomation in the GFFA is inherently unwise, becauseit is substantially easier to subvert digital networks than it is to construct them.\n\nI'll start by addressing possible alternative explanations, then I'll get into why I think mine is the most likely, with a specific focus on mathematical relationships, slicers, and risk-vs-reward. Finally, I'll cover the implications of this, and wrap it up with a conclusion.\n\nOf course, the conjecture I offer here won't be the only proffered explanation. Here are some others:\n\nLuminous Beings Are We\n\nStar Wars is not only a tale of armies and machines, it is also a story of spirituality, mysticism, philosophy, and the paranormal. The Sith and the Jedi may disagree on many fundamental tenets of faith, but on one aspect they are unanimous: the Force is more powerful than any tool made from \"crude matter\". Darth Vader isopenly dismissiveof the Death Star, warning those who praise it that no piece of apparatus can rival the Cosmic Energy Field which Binds All Things.\n\nThis belief is not without a solid basis! By trusting in the Force, Luke Skywalker wasable to destroy the very superweapon his father had previously discussed, and then many years later hestood alone against an army, allowing the Resistance to escape.\n\nHowever, I don't think the Force can be the explanation, for the simple reason that so many of the people designing the technology of the various militaries place little stock in the Force.Orson Krennicwas not an especially religious man, nor wasSabine Wren, norArmitage Hux. The people actually designing the sophisticated technology of the setting are typically apathetic or outright disdainful towards the more transcendent aspects of the setting. It is unlikely then, that they shied away from automation of critical systems, particularly military systems, out of reverence for the Force.\n\nNo Money, No Parts, No Deal\n\nIn a galaxy with trillions of living beings, it may simply be cheaper to have an organic do something than an automated system. Frugality is, after all, a powerful motivator.\n\nIf that were the case, however, I think we'd see a very different Galaxy. Look at the Death Star, for instance. Thetrash compactor is automated, but thepoint-defence guns are manually operated. On the Supremacy, the laundry is done by an automatic ironing machine, but anything even remotely security-critical has a human to do it.\n\nThe general rule is that if something could go wrong without killing anyone important, let an automated system do it.\n\nThe greatest degree of automation and systems integration is used by the Trade Federation in Episode 1, a group which (unlike the Separatist Alliance they would eventually join) holds profit and frugality as its highest values, with little to no broader ideological motivation. They had all of their droids slaved to a single digital network. They had a massive ship with almost no organic crew. They cut corners wherever possible and automated everything. And they lostbadly.\n\nAutomation isn't expensive, but it is unreliable.\n\nImmensely Superior To Droids\n\nAside from a connection to the cosmic energy field that all living things create and commune with, living beings may simply have basic advantages to droids that renders overreliance on automation unwise. To at least some extent, this is true. Most droids have extremely limited problem-solving abilities, with even the majority oftactical droidsfailing to adapt when faced with complex enemy tactics. Perhaps, then, mechanised systems are simply so inferior that nobody wants to use them?\n\nThis -to me- seems close to the truth, but incomplete. Some factions are willing to accept the limitations of a machine army in exchange for their cheapness. What they will not do, however, is fully network them. Consider thebroadsides exchangebetween two capital ships in the Battle of Coruscant.\n\nThe ship crewed by organics loads and operates its heavy guns as we might expect, manually. But what about the droid-ship? It essentially does the same thing, simply replacing human gunners and loading crews with independent robots! No automated mechanical loading belt. No triggers linked into the bridge controls. The way they fire is for someone on the command deck to give an order, the order to be relayed over tannoy, and the droids to then run and push buttons or move ordinance like humans would!\n\nI think this illustrates the crux of the issue. Machines are vulnerable. So even if it would be more efficient to link them all together (making, in effect, one big machine) most people won't do that because that gives your entire system a single point of failure.\n\nStar Wars technology operates on rules that real-world technology does not, either because the laws of physics are different there, or because their science is so advanced that it can overcome the limitations our technology has.\n\nOne example of this is lightspeed.\n\nAnother, I believe, is the Polynomial-time question.\n\nWhat is Polynomial Time?\n\nIn computer science, it is extremely important to measure the relationship between the input size of an algorithm and the time (which, in reality, means the number of individual mathematical operations) needed to complete the algorithm. The input is often denoted as \"n\" and the time taken to solve it is usually denoted as \"O\".\n\nFor example, if I say an algorithm hasO(n^2)complexity, that means doubling the size of the input will quadruple the time it takes for the algorithm to complete.\n\nBecause computers are very fast, some complexities are considered acceptable. Generally speaking, anything with polynomial complexity is treated as acceptable for most operations. Polynomial functions are those which depend on different powers of the input. SoO(n^2),O(n^5), andO(n^9)are all polynomial. Some algorithms, however, are so inefficient that even with powerful computers, they take too long to complete for them to be useful. These typically have exponential complexity, or worse. For instance,O(n^n).\n\nThis is particularly relevant in cryptography. For any digital cypher, there are essentially two important algorithms,verificationandsolution. Verification is the process of checking whether any given input is correct. For example, if you gave me an encrypted file, and I rented what I thought was the password/key, the time it took the computer to tell me if the key was right would be the verification time. Solution, by contrast is the process of working out ALL valid keys and ALL nonvalid keys.\n\nPractically speaking, most encryptions have only one valid key, only one way to decode the information. So, anyone who runs the \"solution\" can work out all the invalid keys (that is to say, every possible password except the right one) and the one [password that will decode the information.\n\nAs a result, most encryptions are supposed to have very low verification complexity (polynomial) and very high solution complexity (exponential or worse). In this case, \"n\" is the length of the key, usually the maximum number of characters in the password. If the password can be up to 100 characters long, then we have an \"n\" of 100. So, if the complexity of validation is polynomial, you can double the length of the password, and still have an algorithm that allows the right people (I.E, the ones with the password) to access the information quite quickly. Someone who doesn't have the password, however, should have to wait for ages before they find it out.\n\nIt is estimated that modern encryption methods would take millions of years to solve, by which time the information will likely be useless to whoever is trying to steal it.\n\nThis assumes, however, that the set of all cyphers with polynomial verification algorithms (P) isn't a subset of the set of all cyphers with polynomial solution algorithms (NP). If, as some mathematicians fear, P == NP, then a sufficiently clever codebreaker could theoretically break any cypher which is actually practical to use.\n\nMost computer scientists believe that either P is not NP, or that it is, but the process of actually making those fast (polynomial) solution algorithms is too hard for anyone to ever achieve.\n\nIn Star Wars, I think this isn't the case. In the Galaxy Far Far Away, if an encrypted file or a secure network can be used quickly, it can also be broken quickly.\n\nEvidence Of This\n\nThere are a few sources which support my claim, but I'd say the strongest ones are A New Hope and The Last Jedi.\n\nFirst Order coding is stated to be immensely secure.Bio-Hexacrypt, cycled hourly. This means that anyone who wants to overcome their digital security has, at most, 59 minutes and 59 seconds to break the most secure encryption software available.\n\nWe know of at least three people who are claimed to have the ability to overcome such encryption. Maz Kanata, The Master Codebreaker, and DJ. Of these, the latter's skills are confirmed to be effective. He almost effortlessly bypasses the digital security on the First Order's Flagship/Capital.\n\nWhat eventually stops the resistance incursion is not some sophisticated network of sensors, but an independent droid and a platoon of stormtroopers. The more networked, the more vulnerable.\n\nAs for A New Hope, consider the events of Princess Leia's rescue. The moment he connects to the Death Star computer with his Scomp Link, R2-D2 (who is not an imperial droid, and presumably has no access privileges) he immediately knows its layout. He has control over non-critical functions of the space station, such as the trash compactor.\n\nTo further support my claim, let's consider Jedi: Fallen Order. Specifically, the fact that a simple software patch installed by a scavenger can allow aBD-Unit(essentially a droid intended to facilitate exploration) to completely override the intentions of Imperial security and probe droids.\n\nConsider the implications of this. It's a world where any digital system, any computer, anything with a Turing-complete machine (this simply means a machine which can take in any computable algorithm, not a machine that passes the Turing Test), can be commandeered the moment someone interfaces with it.\n\nASCOMPport is a vulnerability. Any machine which has to have one must be physically protected in order to prevent subversion. And this vulnerability extends to wireless systems too.\n\nIt's worth noting the fact that in modern-day earth combat, fighter planes rarely engage one another at visual ranges, preferring instead to send guided missiles with onboard computers over long distances. In star wars, however, this is less common, with direct-fire weapons being preferred. The likely reason for this is that missiles can betrivially sliced. Logically, they must have some form of IFF system, and therefore they must allow incoming signals to be interpreted by the droid-brain.\n\nGetting back to the Death Star infiltration, remember howdifficult it was for Obi-Wan to disable the tractor beam? He had to reach an almost inaccessible place to shut it down. This makes total sense if we assume that physical security is the only means of protection!\n\nWe see the same thing in Rebels. Important files aren't on the same network as most terminals, being accessibleonly through a terminal in the officeof the ship's commanding officer. Once the droids get to this place, however, accessing the data is trivial!\n\nAll security design in Star Wars must take the following axiom into account:\n\nAny and all digital systems which are accessible to the people they are supposed to be accessible to are also vulnerable to people who are not supposed to access them.\n\nIf a person can physically reach the access point to a digital system, it must be assumed that they can gain as much control over it as the system would allow legitimate users. Depending on the skill of the slicer, it might take minutes or hours, but they'll get in.\n\nA lot of the questionable design choices in the GFFA suddenly becomes utterly reasonable. Theridiculous paddle systemfrom Rogue One's data vault? Perfectly sensible, it's designed to slow down infiltrators in the citadel tower. It's legitimately faster than having a firewall!\n\nDroids are memory wiped frequently because they WILL divulge all of their secrets if captured. They can't help it, though an Organic might resist torture, but a Droid can simply be sliced.\n\nLiving beings do almost every job, because a network is vulnerable. In the Bad Batch, we see that a Venator's guns can be accessed via scomp link if one is at the gun itself, but not from the bridge. Why? Presumably so that if the bridge is breached, the enemy will not be able to control the guns. Every section of the ship must be taken before it can be controlled.\n\nOnce you realise this, almost all of Star Wars military architecture begins to make sense.\n\nThe way data is shared is also far more sensible! People ask why Leia didn't just broadcast her message to Yavin in ANH, but in a world without reliable encryption, broadcasting sensitive data would be incredibly stupid!\n\nNo wonder Imperials and FO officers carry around so many Code Cylinders! Those things are essentially multiple-terabyte-long passwords, the \"n\" of imperial encryption. And it still isn't enough.\n\nWe really shouldn't be surprised that automation in Star Wars is so crude. It would make little sense for it NOT to be!\n\nGiven how easily even the highest levels of digital security can be sliced, and the effective impossibility of reliably encrypting vital data, most security in Star Wars is physical. Electronic Warfare became so sophisticated that people simply avoided it.\n\nIt's not altogether dissimilar to the way artillery changed warfare here on earth, putting an end to conventional fortifications. There is no way to build a wall thick enough that an ICBM won't destroy it, so great stone keeps don't get built anymore. The only defence is not to be there when the rocket explodes.\n\nHighly mobile assets were the answer to artillery, and centuries of architectural innovation were abandoned.\n\nSimilarly, the answer to Electronic Warfare was not to have anything that could be hacked. Star Wars systems look primitive to us the same way a modern military base looks primitive next to aGothic Castle.",
  "author": "Ricky_Boby",
  "comments": [
    {
      "author": "The-Last-Despot",
      "timestamp": "",
      "body": "Amazing read. It makes so much sense and kind of shows why r2 was always instantly able to break into enemy networks. Also makes sense as to why assets were put in physically defensible locations. It definitely makes for more interesting warfare in my opinion! The only thing we are missing is an example of guided ordinance being hacked."
    },
    {
      "author": "TheCybersmith",
      "timestamp": "",
      "body": "The hunted short shows this."
    },
    {
      "author": "ScoutTheTrooper",
      "timestamp": "",
      "body": "This might be my favorite post on the sub yet, fantastic write-up."
    },
    {
      "author": "TheCybersmith",
      "timestamp": "",
      "body": "Thanks! Please unblock me on twitter."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Great way to explain the weird computer disconnect with our world."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "iirc Chopper from Rebels got hacked in the matter of seconds after connecting to a Scomplink being watched by a slicing operator."
    },
    {
      "author": "gyurka66",
      "timestamp": "",
      "body": "iirc Chopper from Rebels got hacked in the matter of seconds after connecting to a Scomplink being watched by a slicing operator."
    },
    {
      "author": "spineflu",
      "timestamp": "",
      "body": "Droids are memory wiped frequently because they WILL divulge all of their secrets if captured. They can't help it, though an Organic might resist torture, but a Droid can simply be sliced.depending on their models of cognition and assuming a sophisticated enough micro-robotics interface, the organic beings could also be hacked to divulge their secrets without torture, should this be trueIt's unclear whether Star Wars doesn't have appropriate micro-robotic circuitry to make the brain interface, or whether the research required to map the physiology of all sentient species is untenable, but assuming one could solve the chemical computer of the brain, organic beings brains would be just as hackable, with a much more annoying physical interface.(also you've got your P and NP mixed up about midway through - NP has the verification algos, P has the solution algos.)"
    },
    {
      "author": "sroomek",
      "timestamp": "",
      "body": "The Techno Union did this to Echo. They were able to pull the Republic battle strategy data directly out of his mind via the cybernetics they installed in his head."
    },
    {
      "author": "Ricky_Boby",
      "timestamp": "",
      "body": "To add to your theory it's probable that the Star Wars universe has Quantum Computers, which aretheorized to be able to break our current encryption methods with ease. Here MIT thinks it would only take 8 hours to break a 2048 bit RSA key in the next 25 years. To compare that key would take up to300 trillion years to brute force with a traditional computer.Moreover, encryption algorithms in general and asymmetric encryption in particular are hard to find and do right. Currently we only know of RSA (which dates to 1978) and ECC (which dates to 1985) as provably secure asymmetric encryption algorithms. If advancements are not made in Quantum Encryption we may be in the same boat as your theory, where airgaps (not connecting your device/local network to the internet) are the only solution, and honestly I work in Industrial Controls and most factories and critical machines are already airgaped as it is since that is the only 100% security available."
    }
  ]
}