{
  "subreddit": "Indiana",
  "post_id": "1gw6s9j",
  "title": "Major Adult Sites Blocked in Indiana",
  "body": "If ethically sourced and used responsibly by adults I’m in support of freedom to publish erotic imagery on the web.\n\nAnyway, I noticed recently that at least two of the very biggest and most well known sites now direct you to an explanation that because Indiana requires age verification before you access their site, the complexities involved have pushed them to decide to simply be unavailable in Indiana. That’s it.\n\nI support making it difficult for underage web users to consume pornography when they are far too young and impressionable to do so. But this feels weird - like responsible adults’ internet usage is essentially being censored by the state. Anyone else notice this? Thoughts or opinions?",
  "author": "Few_Lion_6035",
  "comments": [
    {
      "author": "Dry-Amphibian1",
      "timestamp": "",
      "body": "This is what people voted for.  This is the kind of freedom and small government they prefer."
    },
    {
      "author": "jheins3",
      "timestamp": "",
      "body": "Republicans are for deregulation I thought? Oh wait, not if it's sex, contraceptive, or access to women's health."
    },
    {
      "author": "Sunnyjim333",
      "timestamp": "",
      "body": "\"This is the kind of freedom and small government they prefer.\"Rather, \"These are the kind of restrictions and repression they prefer.\""
    },
    {
      "author": "j-shoe",
      "timestamp": "",
      "body": "I would guess the kids found many loop holes around this block and in turn find darker and possibly dangerous results by pushing this in less respectable mediums.For example, you will get age verification by pornhub.com but xnxx.com is allowed. The tech is flawed and just more gaslighting by a majority of the Indiana representative"
    },
    {
      "author": "motherjuno",
      "timestamp": "",
      "body": "yep, pornhub is gone but a lot of unverified sites with way more intense and unvetted material is available because the sites aren’t as reputable."
    },
    {
      "author": "naptown-hooly",
      "timestamp": "",
      "body": "Yeah. We’re governed by religious nut jobs."
    },
    {
      "author": "Learn_Every_Day",
      "timestamp": "",
      "body": "Remember smaller government somehow equals less rights for YOU and me. 🏛"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Gotta beat it to thoughts and prayers now, like the amish."
    },
    {
      "author": "omgsohc",
      "timestamp": "",
      "body": "You know what's so stupid about it? It only blocks a few sites. Reddit? Full of porn, no ban. I searched Google for a specific video, the first link worked, it was a popular porn site. So they \"banned\" porn but they did it so badly that it just forces users to visit their unbanned competition and also use less reputable sites. And all of this can be circumvented with a VPN or a  dozen other simple tricks. Our lawmakers spent our money on this dumb shit!"
    },
    {
      "author": "Few_Lion_6035",
      "timestamp": "",
      "body": "And kids all know to use a proxy unlike our ignorant politicians. All Indiana did was add an additional step to rubbing one out!"
    }
  ]
}