{
  "subreddit": "australian",
  "post_id": "1equh1o",
  "title": "Major ID change for every single Australian to be introduced with new verification system",
  "body": "",
  "author": "Venotron",
  "comments": [
    {
      "author": "Jackson2615",
      "timestamp": "",
      "body": "The more you  concentrate  personal information  the bigger the honey pot for hacking.  I dont trust governments to use our information  JUST  as intended, look at the COVID check in  data  that we were told was ONLY to be used for contact tracing by  health departments.  Then we find out it was  being shared with  police and other government entities  for a range of non health   purposes."
    },
    {
      "author": "el_diego",
      "timestamp": "",
      "body": "That's fair, but I also don't trust companies with it as we've all seen with the multiple massive security breaches."
    },
    {
      "author": "PhoenixGayming",
      "timestamp": "",
      "body": "There was an article today about MyGov being compromised as hackers were able to associate a dummy MyGov account to a victims and then gain access that way... they will never be able to secure it properly."
    },
    {
      "author": "AncientExplanation67",
      "timestamp": "",
      "body": "The governments E-Health system  which has the private health details of 24 million Australians was hacked over 300 times in its first 3 years. Not sure why anyone would trust or help any Australian givernment with digital id."
    },
    {
      "author": "vacri",
      "timestamp": "",
      "body": "I wonder what this is really for, because \"18 year olds drinking at RSLs\" seems to be a bit too much of an edge case to be the primarily marketed function in the article."
    },
    {
      "author": "snappydamper",
      "timestamp": "",
      "body": "It's to combat the wave of data breaches we've had where, to pick a totally hypothetical random example, a phone company unnecessarily stores your identifying information, gets hacked and now you're in a position to have your identity stolen."
    },
    {
      "author": "NeonsTheory",
      "timestamp": "",
      "body": "Considering our country didn't care about user data being leaked by Optus, Medibank, and countless other instances, this is an extremely concerning choice for Australia"
    },
    {
      "author": "WhatAmIATailor",
      "timestamp": "",
      "body": "I’m a big fan of giving less personal data to private businesses but I don’t know how much I trust a government designed app. Seems like this will have all the cookers outraged about a national ID again as well."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Lol: Remember this?https://www.health.gov.au/ministers/the-hon-mark-butler-mp/media/failed-covidsafe-app-deleted"
    },
    {
      "author": "Venotron",
      "timestamp": "",
      "body": "FWIW, the government offers IT professionals and developers about 35% less than the private sector.The people implementing and maintaining these systems for the public sector aren't exactly the best and brightest."
    }
  ]
}