{
  "subreddit": "Scams",
  "post_id": "n00o17",
  "title": "/r/Scams Common Scam Master Post",
  "body": "Hello visitors and subscribers ofr/scams! Here you will find a master list of common (and uncommon) scams that you may encounter online or in real life. Thank you to the many contributors who helped create this thread!\n\nPrevious threads:https://reddit.com/r/Scams/search?q=common+scams+master+post&restrict_sr=on\n\nBlackmail email scam thread:https://www.reddit.com/r/Scams/comments/n00kg3/the_blackmail_email_scam_part_7/\n\nSome of these articles are from small, local publications and refer to the scam happening in a specific area.Do notthink that this means that the scam won't happen in your area.\n\nCaller ID spoofing\n\nIt is very easy for anyone to make a phone call while having any number show up on the caller ID of the person receiving the phone call. Receiving a phone call from a certain number does not mean that the person/company who owns that number has actually called you.\n\nEmail spoofing\n\nThe \"from\" field of an email can be set by the sender, meaning that you can receive scam emails that look like they are from legitimate addresses. It's important to never click links in emails unless absolutely necessary, for example a password reset link you requested or an account activation link for an account you created.\n\nSMS spoofing\n\nSMS messages can be spoofed, so be wary of messages that seem to be from your friends or other trusted people.\n\nThe fake check scam(Credit tou/nimble2for this part)\n\nThe fake check scam arises from many different situations (for instance, you applied for a job, or you are selling something on a place like Craigslist, or someone wants to purchase goods or services from your business, or you were offered a job as a mystery shopper, you were asked to wrap your car with an advertisement, or you received a check in the mail for no reason), but the bottom line is always something like this:\n\nThe scammer sends you a very real looking, but fake, check. Sometimes they'll call it a \"cashier's check\", a \"certified check\", or a \"verified check\".\n\nYou deposit the check into your bank account, and within a couple of days your bank makes some or all of the funds available to you. This makes you think that the check is real and the funds have cleared. However, the money appearing in your accountis notthe same as the check actually clearing. The bank must make the funds available to you before they have cleared the check because that is the law.\n\nFor various and often complicated reasons, depending on the specific story line of the scam, the scammer will ask you to send someone some of the money, using services like MoneyGram, Western Union, and Walmart-2-Walmart. Sometimes the scammer will ask for you to purchase gift cards (iTunes, Amazon, Steam, etc) and give them the codes to redeem the gift cards. Some scammers may also give you instructions on how to buy and send them bitcoins.\n\nWithin a couple of weeks, though it can take as long as a month, your bank will realize that the check you deposited was fake, and your bank will remove the funds that you deposited into your account and charge you a bounced check fee. If you withdrew any of the money from the fake check, that money will be gone and you will owe that money to the bank. Some posters have even had their bank accounts closed and have been blocked from having another account for 5 years using ChexSystems.\n\nGeneral fraudulent funds scamsIf somebody is asking you to accept and send out money as a favour or as part of a job, it is a fraudulent funds scam. It does not matter how they pay you, any payment on any service can be fraudulent and will be reversed when it is discovered to be fraudulent.\n\nPhone verification code scamsSomeone will ask you to receive a verification text and then tell you to give them the code. Usually the code will come from Google Voice, or from Craigslist. In the Google version of the scam, your phone number will be used to verify a Google Voice account that the scammer will use to scam people with. In the Craigslist version of the scam, your phone number will be used to verify a Craigslist posting that the scammer will use to scam people.  There is also an account takeover version of this scam that will involve the scammer sending a password reset token to your phone number and asking you for it.\n\nBitcoin job scams\n\nBitcoin job scams involve some sort of fraudulent funds transfer, usually a fake check although a fraudulent bank transfer can be used as well. The scammer will send you the fraudulent money and ask you to purchase bitcoins. This is a scam, and you will have zero recourse after you send the scammer bitcoins.\n\nEmail flooding\n\nIf you suddenly receive hundreds or thousands of spam emails, usually subscription confirmations, it's very likely that one of your online accounts has been taken over and is being used fraudulently. You should check any of your accounts that has a credit card linked to it, preferably from a computer other than the one you normally use. You should change all of your passwords to unique passwords and you should start using two factor authentication everywhere.\n\nCartel scam\n\nYou will be threatened by scammers who claim to be affiliated with a cartel. They may send you gory pictures and threaten your life and the lives of your family. Usually the victim will have attempted to contact an escort prior to the scam, but sometimes the scammers target people randomly. If you are targeted by a cartel scam all you need to do is ignore the scammers as their threats are clearly empty.\n\nBoss/CEO scamA scammer will impersonate your boss or someone who works at your company and will ask you to run an errand for them, which will usually be purchasing gift cards and sending them the code. Once the scammer has the code, you have no recourse.\n\nEmployment certification scams\n\nYou will receive a job offer that is dependent on you completing a course or receiving a certification from a company the scammer tells you about. The scammer operates both websites and the job does not exist.\n\nCraigslist fake payment scams\n\nScammers will ask you about your item that you have listed for sale on a site like Craigslist, and will ask to pay you via Paypal. They are scamming you, and the payment in most cases does not actually exist, the email you received was sent by the scammers. In cases where you have received a payment, the scammer can dispute the payment or the payment may be entirely fraudulent. The scammer will then either try to get you to send money to them using the fake funds that they did not send to you, or will ask you to ship the item, usually to a re-shipping facility or a parcel mule.\n\nCraigslist Carfax/vehicle history scam\n\nYou'll encounter a scammer on Craigslist who wants to buy the vehicle you have listed, but they will ask for a VIN report from a random site that they have created and they will expect you to pay for it.\n\nDouble dip/recovery scammers\n\nThis is a scam aimed at people who have already fallen for a scam previously. Scammers will reach out to the victim and claim to be able to help the victim recover funds they lost in the scam.\n\nGeneral fraudulent funds scamsThe fake check scam is not the only scam that involves accepting fraudulent/fake funds and purchasing items for scammers. If your job or opportunity involves accepting money and then using that money, it is almost certainly a frauduent funds scam. Even if the payment is through a bank transfer, Paypal, Venmo, Zelle, Interac e-Transfer, etc, it does not matter.\n\nCredit card debt scam\n\nFraudsters will offer to pay off your bills, and will do so with fraudulent funds. Sometimes it will be your credit card bill, but it can be any bill that can be paid online. Once they pay it off, they will ask you to send them money or purchase items for them. The fraudulent transaction will be reversed in the future and you will never be able to keep the money. This scam happens on sites like Craigslist, Twitter, Instagram, and also some dating sites, including SeekingArrangement.\n\nThe parcel mule scam\n\nA scammer will contact you with a job opportunity that involves accepting and reshipping packages. The packages are either stolen or fraudulently obtained items, and you will not be paid by the scammer.Hereis a news article about a scam victim who fell for this scam and reshipped over 20 packages containing fraudulently acquired goods.\n\nThe Skype sex scam\n\nYou're on Facebook and you get a friend request from a cute girl you've never met. She wants to start sexting and trading nudes. She'll ask you to send pictures or videos or get on webcam where she can see you naked with your face in the picture.The scam: There's no girl. You've sent nudes to a guy pretending to be a girl. As soon as he has the pictures he'll demand money and threaten to send the pictures to your friends and family. Sometimes the scammer will upload the video to a porn site or Youtube to show that they are serious.\n\nWhat to do if you are a victim of this scam: You cannot buy silence, you can only rent it. Paying the blackmailer will show them that the information they have is valuable and they will come after you for more money. Let your friends and family know that you were scammed and tell them to ignore friend requests or messages from people they don't know. Also, make sure your privacy settings are locked down and consider deactivating your account.\n\nThe underage girl scam\n\nYou're on a dating site or app and you get contacted by a cute girl. She wants to start sexting and trading nudes. Eventually she stops communicating and you get a call from a pissed off guy claiming to be the girl's father, or a police officer, or a private investigator, or something else along those lines. Turns out the girl you were sexting is underage, and her parents want some money for various reasons, such as to pay for a new phone, to pay for therapy, etc. There is, of course, no girl. You were communicating with a scammer.\n\nWhat to do if you are a victim of this scam: Stop picking up the phone when the scammers call. Do not pay them, or they will be after you for more money.\n\nPhishing\n\nPhishing is when a scammer tries to trick you into giving information to them, such as your password or private financial information. Phishing messages will usually look very similar to official messages, and sometimes they are identical. If you are ever required to login to a different account in order to use a service, you should be incredibly cautious.\n\nThe blackmail email scam part 5:https://old.reddit.com/r/Scams/comments/g8jqnr/the_blackmail_email_scam_part_5/\n\nPSA: you did not win a giftcard:https://old.reddit.com/r/Scams/comments/fffmle/psa_you_did_not_win_a_gift_card/\n\nSugar scams\n\nSugar scammers operate all over the internet and usually come in two varieties: advance-fee scams where the scammer will ask for a payment from you before sending you lots of money, and fake check style scams where the scammer will either pull a classic fake check scam, or will do a \"bill pay\" style scam that involves them paying your bills, or them giving you banking information to pay your bills. If you encounter these scammers, report their accounts and move on.\n\nGoogle Hangouts\n\nGoogle Hangouts is a messaging platform used extensively by all kinds of scammers. If you are talking with someone online and they want you to switch to Hangouts, they are likely a scammer and you should proceed with caution.\n\nPublishers Clearing House scams\n\nPCH scams are often advance-fee scams, where you will be promised lots of money after you make an initial payment.You will never need to pay if you win money from the real PCH.\n\nPet scams\n\nYou are looking for a specific breed of puppy, bird, or other pet. You come across a nice-looking website that claims to be breeding them and has some available right now - they may even be on sale! The breeders are not local to your area (and may not even list a physical location) but they assure you they can safely ship the pet to you after a deposit or full payment. If you go through with the payment, you will likely be contacted by the \"shipper\" who will inform you about an unexpected shipping/customs/processing fee required to deliver your new pet. But there was never any pet, both the \"breeder\" and the \"shipper\" are scammers, typically operating out of Africa. These sites are rampant and account for a large percentage of online pet seller websites - they typically have a similar layout/template (screenshot - example)\n\nIf you are considering buying a pet online, some easy things to check are: (1) The registration date of the domain (if it was created recently it is likely a scam website) (2) Reverse image search the pictures of available pets - you will usually find other scam websites using the same photos. (3) Copy a sentence/section of the text from the \"about us\" page and put it into google (in quotes) - these scammers often copy large parts of their website's text from other places. (4) Search for the domain name and look for entries on petscams.com or other scam-tracking sites. (5) Strongly consider buying/adopting your pet from a local shelter or breeder where you can see the animal in person before putting any money down.\n\nThanks tou/djscsifor this entry.\n\nFake shipping company scams\n\nThese scams usually start when you try to buy something illegal online, though not always. You will be scammed for the initial payment, and then you will receive an email from the fake shipping company telling you that you need to pay them some sort of fee or bribe. If you pay this, they will keep trying to scam you with increasingly absurd stories until you stop paying, at which point they will blackmail you. If you are involved in this scam, all you can do is ignore the scammers and move on, and try to dispute your payments if possible.\n\nChinese Upwork scam\n\nSomeone will ask you to create an Upwork or other freelancer site account for them and will offer money in return. You will not be paid, and they want to use the accounts to scam people.\n\nQuickbooks invoice scam\n\nThis is a fake check style scam that takes advantage of Quickbooks.\n\nThe blackmail email scamThe exact wording of the emails varies, but there are generally four main parts. They claim to have placed software/malware on a porn/adult video site, they claim to have a video of you masturbating or watching porn, they threaten to release the video to your friends/family/loved ones/boss/dog, and they demand that you pay them in order for them to delete the video. Rest assured that this is a very common spam campaign and there is no truth behind the email or the threats.Herearesomenewsarticlesaboutthisscam.\n\nThe blackmail mail scam\n\nThis is very similar to the blackmail email scam, but you will receive a letter in the mail.\n\nRental scamsUsually on local sites like Craigslist, scammers will steal photos from legitimate real estate listings and will list them for rent at or below market rate. They will generally be hesitant to tell you the address of the property for \"safety reasons\" and you will not be able to see the unit. They will then ask you to pay them a deposit and they claim they will ship you the keys. In reality, your money is gone and you will have no recourse.\n\nCraigslist vehicle scamsA scammer will list a vehicle on Craigslist and will offer to ship you the car. In many cases they will also falsely claim to sell you the car through eBay or Amazon. If you are looking for a car on Craigslist and the seller says anything about shipping the car, having an agent, gives you a long story about why they are selling the car, or the listing price is far too low, you are talking to a scammer and you should ignore and move on.\n\nAdvance-fee scam, also known as the 419 scam, or the Nigerian prince scam. You will receive a communication from someone who claims that you are entitled to a large sum of money, or you can help them obtain a large sum of money. However, they will need money from you before you receive the large sum.\n\nMan in the middle scams\n\nMan in the middle scams are very common and very hard to detect. The scammer will impersonate a company or person you are legitimately doing business with, and they will ask you to send the money to one of their own bank accounts or one controlled by a money mule. They have gained access to the legitimate persons email address, so there will be nothing suspicious about the email. To prevent this, make contact in a different way that lets you verify that the person you are talking to is the person you think you are talking to.\n\nDigit wallet scam\n\nA variation of the fake check scam, the scammer sends you money through a digital wallet (i.e. Venmo, Apple Pay, Zelle, Cash App) along with a message claiming they've sent the money to the wrong person and a request to send the money back. Customer service for these digital wallets may even suggest that you send the money back. However, the money sent is from a stolen credit card and will be removed from your account after a few days. Your transfer is not reversed since it came from your own funds.\n\nCam girl voting/viewer scam\n\nYou will encounter a \"cam girl\" on a dating/messaging/social media/whatever site/app, and the scammer will ask you to go to their site and sign up with your credit card. They may offer a free show, or ask you to vote for them, or any number of other fake stories.\n\nAmateur porn recruitment scam\n\nYou will encounter a \"pornstar\" on a dating/messaging/social media/whatever site/app, and the scammer will ask you to create an adult film with her/him, but first you need to do something. The story here is usually something to do with verifying your age, or you needing to take an STD test that involves sending money to a site operated by the scammer.\n\nHot girl SMS spam\n\nYou receive a text from a random number with a message along the lines of \"Hey babe I'm here in town again if you wanted to meet up this time, are you around?\" accompanied by a NSFW picture of a hot girl. It's spam, and they'll direct you to their scam website that requires a credit card.\n\nIdentity verification scam\n\nYou will encounter someone on a dating/messaging/social media/whatever site/app, and the scammer will ask that you verify your identity as they are worried about catfishing. The scammer operates the site, and you are not talking to whoever you think you are talking to.\n\nThis type of scam teases you with something, then tries to make you sign up for something else that costs money. The company involved is often innocent, but they turn a blind eye to the practice as it helps their bottom line, even if they have to occasionally issue refunds. A common variation takes place on dating sites/dating apps, where you will match with someone who claims to be a camgirl who wants you to sign up for a site and vote for her. Another variation takes place on local sites like Craigslist, where the scammers setup fake rental scams and demand that you go through a specific service for a credit check. Once you go through with it, the scammer will stop talking to you. Another variation also takes place on local sites like Craigslist, where scammers will contact you while you are selling a car and will ask you to purchase a Carfax-like report from a specific website.\n\nMulti Level Marketing or Affiliate Marketing\n\nYou apply for a vague job listing for 'sales' on craigslist. Or maybe an old friend from high school adds you on Facebook and says they have an amazing business opportunity for you. Or maybe the well dressed guy who's always interviewing people in the Starbucks that you work at asks if you really want to be slinging coffee the rest of your life.The scam: MLMs are little more than pyramid schemes. They involve buying some sort of product (usually snake oil health products like body wraps or supplements) and shilling them to your friends and family. They claim that the really money is recruiting people underneath you who give you a slice of whatever they sell. And if those people underneath you recruit more people, you get a piece of their sales. Ideally if you big enough pyramid underneath you the money will roll in without any work on your part. Failure to see any profit will be your fault for not \"wanting it enough.\" The companies will claim that you need to buy their extra training modules or webinars to really start selling. But in reality, the vast majority of people who buy into a MLM won't see a cent. At the end of the day all you'll be doing is annoying your friends and family with your constant recruitment efforts. What to look out for: Recruiters love to be vague. They won't tell you the name of the company or what exactly the job will entail. They'll pump you up with promises of \"self-generating income\", \"being your own boss\", and \"owning your own company.\" They might ask you to read books about success and entrepreneurs. They're hoping you buy into the dream first.If you get approached via social media, check their timelines. MLMs will often instruct their victims to pretend that they've already made it. They'll constantly post about how they're hustling and making the big bucks and linking to youtube videos about success. Again, all very vague about what their job actually entails. If you think you're being recruited: Ask them what exactly the job is. If they can't answer its probably a MLM. Just walk away.\n\nYou should generally avoid answering or engaging with random phone calls. Picking up and engaging with a scam call tells the scammers that your phone number is active, and will usually lead to more calls.\n\nTax Call\n\nYou get a call from somebody claiming to be from your countries tax agency. They say you have unpaid taxes that need to be paid immediately, and you may be arrested or have other legal action taken against you if it is not paid. This scam has caused theAmerican IRS,Canadian CRA,British HMRC, andAustralian Tax Officeto issue warnings. This scam happens in a wide variety of countries all over the world.\n\nWarrant Call\n\nVery similar to the tax call. You'll get a phone call from an \"agent\", \"officer\", \"sheriff\", or other law enforcement officer claiming that there is a warrant out for your arrest and you will be arrested very soon. They will then offer to settle everything for a fee, usually paid in giftcards.\n\n[Legal Documents/Process Server Calls]\n\nVery similar to the warrant call. You'll get a phone call from a scammer claiming that they are going to serve you legal documents, and they will threaten you with legal consequences if you refuse to comply. They may call themselves \"investigators\", and will sometimes give you a fake case number.\n\nStudent Loan Forgiveness Scam\n\nScammers will call you and tell you about a student loan forgiveness program, but they are interested in obtaining private information about you or demanding money in order to join the fake program.\n\nTech Support CallYou receive a call from someone with a heavy accent claiming to be a technician Microsoft or your ISP. They inform you that your PC has a virus and your online banking and other accounts may be compromised if the virus is not removed. They'll have you type in commands and view diagnostics on your PC which shows proof of the virus. Then they'll have you install remote support software so the technician can work on your PC, remove the virus, and install security software. The cost of the labor and software can be hundreds of dollars.The scam: There's no virus. The technician isn't a technician and does not work for Microsoft or your ISP. Scammers (primarily out of India) use autodialers to cold-call everyone in the US. Any file they point out to you or command they have you run is completely benign. The software they sell you is either freeware or ineffective.What to do you if you're involved with this scam: If the scammers are remotely on your computer as you read this, turn off your PC or laptop via the power button immediately, and then if possible unplug your internet connection. Some of the more vindictive tech scammers have been known to create boot passwords on your computer if they think you've become wise to them and aren't going to pay up. Hang up on the scammers, block the number, and ignore any threats about payment. Performing a system restore on your PC is usually all that is required to remove the scammer's common remote access software. Reports of identity theft from fake tech calls are uncommon, but it would still be a good idea to change your passwords for online banking and monitor your accounts for any possible fraud.How to avoid: Ignore any calls claiming that your PC has a virus. Microsoft will never contact you. If you're unsure if a call claiming to be from your ISP is legit, hang up, and then dial the customer support number listed on a recent bill. If you have elderly relatives or family that isn't tech savvy, take the time to fill them in on this scam.\n\nChinese government scam\n\nThis scam is aimed at Chinese people living in Europe and North America, and involves a voicemail from someone claiming to be associated with the Chinese government, usually through the Chinese consulate/embassy, who is threatening legal action or making general threats.\n\nChinese shipping scam\n\nThis scam is similar to the Chinese government scam, but involves a seized/suspicious package, and the scammers will connect the victim to other scammers posing as Chinese government investigators.\n\nSocial security suspension scam\n\nYou will receive a call from someone claiming to work for the government regarding suspicious activity, fraud, or serious crimes connected to your social security number. You'll be asked to speak to an operator and the operator will explain the steps you need to follow in order to fix the problems. It's all a scam, and will lead to you losing money and could lead to identity theft if you give them private financial information.\n\nUtilities cutoff\n\nYou get a call from someone who claims that they are from your utility company, and they claim that your utilities will be shut off unless you immediately pay. The scammer will usually ask for payment via gift cards, although they may ask for payment in other ways, such as Western Union or bitcoin.\n\nRelative in custodyScammer claims to be the police, and they have your son/daughter/nephew/estranged twin in custody. You need to post bail (for some reason in iTunes gift cards or MoneyGram) immediately or theconsequences will never be the same.\n\nMexican family scam\n\nThis scam comes in many different flavours, but always involves someone in your family and Mexico. Sometimes the scammer will claim that your family member has been detained, sometimes the scammer will claim that your family member has been kidnapped, and sometimes the scammer will claim that your family member is injured and needs help.\n\nGeneral family scams\n\nScammers will gather a large amount of information about you and target your family members using different stories with the goal of gettimg them to send money.\n\nOne ring scam\n\nScammers will call you from an international number with the goal of getting you to return their call, causing you to incur expensive calling fees.\n\nTHE GOLDEN RULE OF ONLINE SHOPPING: If it sounds too good to be true, it probably is.\n\nDropshipping\n\nAn ad on reddit or social media sites like Facebook and Instagram offers items at huge discounts or even free (sometimes requiring you to reblog or like their page). They just ask you to pay shipping.The scam: The item will turn out to be very low quality and will take weeks or even months to arrive. Sometimes the item never arrives, and the store disappears or stops responding. The seller drop-ships the item from China. The item may only cost a few dollars, and the Chinese government actually pays for the shipping. You end up paying $10-$15 dollars for a $4 item, with the scammer keeping the profit. If you find one of these scams but really have your heart set on the item, you can find it on AliExpress or another Chinese retailer.\n\nInfluencer scams\n\nA user will reach out to you on a social media platform, usually Instagram, and offer you the chance to partner with them and receive a free/discounted product, as long as you pay shipping. This is a different version of the dropshipping scam, and is just a marketing technique to get you to buy their products.\n\nTriangulation fraud\n\nTriangulation fraud occurs when you make a purchase on a site like Amazon or eBay for an item at a lower than market price, and receive an item that was clearly purchased new at full price. The scammer uses a stolen credit card to order your item, while the money from the listing is almost all profit for the scammer.\n\nInstagram influencer scams\n\nSomeone will message you on Instagram asking you to promote their products, and offering you a discount code. The items are Chinese junk, and the offer is made to many people at a time.\n\nCheap Items\n\nMany websites pop up and offer expensive products, including electronics, clothes, watches, sunglasses, and shoes at very low prices.The scam: Some sites are selling cheap knock-offs. Some will just take your money and run.What to do if you think you're involved with this scam: Contact your bank or credit card and dispute the charge.How to avoid: The sites often have every brand-name shoe or fashion item (Air Jordan, Yeezy, Gucci, etc) in stock and often at a discounted price. The site will claim to be an outlet for a major brand or even a specific line or item. The site will have images at the bottom claiming to be Secured by Norton or various official payment processors but not actual links. The site will have poor grammar and a mish-mash of categories. Recently, established websites will get hacked or their domain name jacked and turned into scam stores, meaning the domain name of the store will be completely unrelated to the items they're selling. If the deal sounds too good to be true it probably is. Nobody is offering brand new iPhones or Beats or Nintendo Switches for 75% off.\n\nCheap Amazon 3rd Party Items\n\nYou're on Amazon or maybe just Googling for an item and you see it for an unbelievable price from a third-party seller. You know Amazon has your back so you order it. The scam: One of three things usually happen:\n\nThe seller marks the items as shipped and sends a fake tracking number. Amazon releases the funds to the seller, and the seller disappears. Amazon ultimately refunds your money.\n\nThe seller immediately cancels the order and instructs you to re-order the item directly from their website, usually with the guarantee that the order is still protected by Amazon. The seller takes your money and runs. Amazon informs you that they do not offer protection on items sold outside of Amazon and cannot help you.\n\nThe seller immediately cancels the order and instructs you to instead send payment via an unused Amazon gift card by sending the code on the back via email. Once the seller uses the code, the money on the card is gone and cannot be refunded.How to avoid: These scammers can be identified by looking at their Amazon storefronts. They'll be brand new sellers offering a wide range of items at unbelievable prices. Usually their Amazon names will be gibberish, or a variation on FIRSTNAME.LASTNAME. Occasionally however, established storefronts will be hacked. If the deal is too good to be true its most likely a scam.\n\nScams on eBay\n\nThere are scams on eBay targeting both buyers and sellers. As a seller, you should look out for people who privately message you regarding the order, especially if they ask you to ship to a different address or ask to negotiate via text/email/a messaging service. As a buyer you should look out for new accounts selling in-demand items, established accounts selling in-demand items that they have no previous connection to (you can check their feedback history for a general idea of what they bought/sold in the past), and lookout for people who ask you to go off eBay and use another service to complete the transaction. In many cases you will receive a fake tracking number and your money will be help up for up to a month.\n\nScams on Amazon\n\nThere are scams on Amazon targeting both buyers and sellers. As a seller, you should look out for people who message you about a listing. As a buyer you should look out for listings that have an email address for you to contact the person to complete the transaction, and you should look out for cheap listings of in-demand items.\n\nScams on Reddit\n\nReddit accounts are frequently purchased and sold by fraudsters who wish to use the high karma count + the age of the account to scam people on buy/sell subreddits. You need to take precautions and be safe whenever you are making a transaction online.\n\nComputer scams\n\nVirus scam\n\nA popup or other ad will say that you have a virus and you need to follow their advice in order to remove it. They are lying, and either want you to install malware or pay for their software.\n\nChinese Brushing / direct shipping\n\nIf you have ever received an unsolicited small package from China, your address was used tobrush. Vendors place fake orders for their own products and send out the orders so that they can increase their ratings.\n\nMoney flipping\n\nScammer claims to be a banking insider who can double/triple/bazoople any amount of money you send them, with no consequences of any kind. Obviously, the money disappears into their wallet the moment you send it.\n\nSite to report scams in the United Kingdom:http://www.actionfraud.police.uk/\n\nSite to report scams in the United States:https://www.ic3.gov/default.aspx\n\nSite to report scams in Canada:www.antifraudcentre-centreantifraude.ca/reportincident-signalerincident/index-eng.htm\n\nSite to report scams in Europe:https://www.europol.europa.eu/report-a-crime/report-cybercrime-online\n\nFTC scam alerts:https://www.consumer.ftc.gov/scam-alerts\n\nMicrosoft's anti-scam guide:https://www.microsoft.com/en-us/safety/online-privacy/avoid-phone-scams.aspx\n\nhttps://www.usa.gov/common-scams-frauds\n\nhttps://www.usa.gov/scams-and-frauds\n\nhttps://www.consumer.ftc.gov/features/scam-alerts\n\nhttps://www.fbi.gov/scams-and-safety/common-fraud-schemes",
  "author": "Dylansawers",
  "comments": [
    {
      "author": "EugeneBYMCMB",
      "timestamp": "",
      "body": "Door to door scamsAs a general rule, you should not engage with door to door salesmen. If you are interested in the product they are selling, check online first.Selling MagazinesSomeone or a group will come to your door and offer to sell a magazine subscription. Often the subscriptions are not for the duration or price you were told, and the magazines will often have tough or impossible cancellation policies.Energy salesSomebody will come to your door claiming to be from an energy company. They will ask to see your current energy bill so that they can see how much you pay. They will then offer you a discount if you sign up with them, and promise to handle everything with your old provider. Some of these scammers will \"slam\" you, by using your account number that they saw on your bill to switch you to their service without authorization, and some will scam you by charging higher prices than the ones you agreed on.Security system scamsScammers will come to your door and ask about your security system, and offer to sell you a new one. These scammers are either selling you overpriced low quality products, or are casing your home for a future burglary.They ask to enter your homeWhile trying to sell you whatever, they suddenly need to use your bathroom, or they've been writing against the wall and ask to use your table instead. Or maybe they just moved into the neighborhood and want to see how you decorate for ideas.They're scoping out you and your place. They want to see what valuables you have, how gullible you are, if you have a security system or dogs, etc.Street scamsBegging With a Purpose\"I just need a few more dollars for the bus,\" at the bus station, or \"I just need $5 to get some gas,\" at a gas station. There's also a variation where you will be presented with a reward: \"I just need money for a cab to get uptown, but I'll give you sports tickets/money/a date/a priceless vase.\"Three Card Monte, Also Known As The Shell GameUnbeatable. The people you see winning are in on the scam.Drop and BreakYou bump into someone and they drop their phone/glasses/fancy bottle of wine/priceless vase and demand you pay them back. In reality, it's a $2 pair of reading glasses/bottle of three-buck-chuck/tasteful but affordable vase.CD SalesYou're handed a free CD so you can check out the artist's music. They then ask for your name and immediately write it on the CD. Once they've signed your name, they ask you for money, saying they can't give it to someone else now. Often they use dry erase markers, or cheap CD sleeves. Never use any type of storage device given to you by a random person, as the device can contain malware.White Van Speaker ScamYou're approached and offered speakers/leather jackets/other luxury goods at a discount. The scammer will have an excuse as to why the price is so low. After you buy them, you'll discover that they are worthless.iPhone Street SaleYou're approached and shown an iPhone for sale, coming in the box, but it's open and you can see the phone. If you buy the phone, you'll get an iPhone box with no iPhone, just some stones or cheap metal in it to weigh it down.Buddhist Monk PendantA monk in traditional garb approaches you, hands you a gold trinket, and asks for a donation. He holds either a notebook with names and amounts of donation (usually everyone else has donated $5+), or a leaflet with generic info. This is fairly common in NYC, and these guys get aggressive quickly.Friendship Bracelet ScamMore common in western Europe, you're approached by someone selling bracelets. They quickly wrap a loop of fabric around your finger and pull it tight, starting to quickly weave a bracelet. The only way to (easily) get it off your hand is to pay.Leftover salesThis scam involves many different items, but the idea is usually the same: you are approached by someone who claims to have a large amount of excess inventory and offers to sell it to you at a great price. The scammer actually has low quality items and will lie to you about the price/origin of the items.Dent repair scamsScammers will approach you in public about a dent in your car and offer to fix it for a low price. Often they will claim that they are mechanics. They will not fix the dent in your car, but they will apply large amounts of wax or other substances to hide the dent while they claim that the substance requires time to harden.Gold ring/jewelry/valuable item scamA scammer will \"find\" a gold ring or other valuable item and offers to sell it to you. The item is fake and you will never see the scammer again.Distraction theftOne person will approach you and distract you, while their accomplice picks your pockets. The distraction can take many forms, but if you are a tourist and are approached in public, watch closely for people getting close to you."
    },
    {
      "author": "CakeDayOrDeath",
      "timestamp": "",
      "body": "Another one that would be good to add if the mods feel comfortable doing so: crisis pregnancy centers, which scam people seeking abortions. They essentially pretend to be abortion clinics, and will often give themselves names with things like \"women's center\" and \"choice\" in the title. The staff in there set up medical equipment and wear lab coats to further the impression that they are a medical clinic. They may even set up shop next to an actual abortion clinic.If someone goes into a CPC, the staff may:Try to talk the person out of an abortion.Do an ultrasound and tell the person that the pregnancy is farther along than it actually is.Give false information about abortion (e.g. that it causes breast cancer) or exaggerate the risks of an abortion.Give people food, which means that if they had booked an abortion procedure that requires them to fast (and mistaken the CPC for the abortion clinic next door), they wouldn't be able to do the procedure that day.-Encourage the person to keep putting off getting the abortion until they pass the cutoff point for a first trimester abortion.When asked how much they charge for an abortion during a phone call, evade the question by saying that they don't discuss prices over the phone and encourage the caller to come in person and discuss pricing. Obviously, there is no pricing because they don't do abortions, but it's easier to intimidate people out of an abortion in person."
    },
    {
      "author": "ThoughtCenter87",
      "timestamp": "",
      "body": "This is probably about to be far more pertinent now than ever, unfortunately. I will not be surprised if this scam evolves in some manner."
    },
    {
      "author": "chikin_dinner",
      "timestamp": "",
      "body": "For people in the USA. If you get a call from an unknown number and it has the same first six digits (eg: your number is 123-456-7890 and you get a call from 123-456-4321) it’s likely a scam of some sort."
    },
    {
      "author": "ArionnaKajira",
      "timestamp": "",
      "body": "I wrote this piece that was mainly about sugar scams, but I think it has useful bullet points about a lot of popular scams at present :)I don’t know who needs to hear this, but beware of ‘sugar scam’ no real sugar daddy will ask you to send money to receive moneyThings to watch out for1: Is your supposed sugar daddy far to eager to have you as his sugar baby without really getting to know you?2: Do they need you to send them cash first before they will spoil you?3: after they have transferred you money do they then need you to transfer some elsewhere (beware of this as their original payment to you WILL bounce)4: does their name and location seem to not match what they are telling you?5: check their other pictures if on social media6: google their name and any info they give you8: do not give them personal info about yourself9: do not give out bank details or copies of your ID10: use tineye or reverse google images to check their photos11: If something feels too good to be true it often is12: If you have been caught up in one of these scams do not feel silly, as many have just be aware of what to look out for and trust your own inner judgement13: these sort of scams seem to be the new Nigerian Prince scams, or the scam that you have coming into a fortune, but in both case a small fee needs to be paid first"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I was just involved in the underage scam from a dating site.  Should’ve researched before I picked up the phone.  Thankfully I got mad and told them I had bills to pay when he asked for $$ to end the phone agreement and hung up. But still anxious as shit"
    },
    {
      "author": "TrumpCardStrategy",
      "timestamp": "",
      "body": "Rental apartment/house scam - a usually too good to be true apartment or house appears for rent on craigslist or other rental site using photos stolen from real listing. the owner or agent will have some story about why they cant show you the property (missionary, traveling, tenants still living there etc.) but will say you can drive by and check it out. Will send legitimate lease and require down payment. Will dissappear with your money, you’ll find only find out on move in day"
    },
    {
      "author": "InfernalCape",
      "timestamp": "",
      "body": "A tip to receive fewer unwanted spam phone calls:Many people think that telling scammers to put you on the do not call list will be effective in stopping the calls, but it won’t. Scammers often collect data in order to scam more effectively. So by interacting with them, you’re really just giving them a heads up that you’re keen to their game. They don’t care though. They’ll just try more advanced techniques on you in the future.Tell them instead that you have no computer and your phone is an iPhone. Doing so will get you on manyscammers’do not call lists. Since many cold-call scams are tech scams that involve remote access, letting them know they’re truly wasting their own time by calling you (because you don’t even own a device they can scam you with) is the most effective way of keeping your number out of their leads.That and not answering the calls to begin with, of course."
    },
    {
      "author": "Emotional-Mammoth251",
      "timestamp": "",
      "body": "I work at a prominent coffee chain. We’ve had people (or maybe one guy I’m not sure - it’s never me in the window), pay for orders they didn’t pay for the day before. Sometimes they use cash, sometimes a card. I’ve worked here for three years and I’ve NEVER experienced so many kind-hearted folks, and now this is happening constantly. It sounds VERY scammy to me. I could be wrong, but ya know, I might not be. Has anyone hear of this?"
    },
    {
      "author": "Dylansawers",
      "timestamp": "",
      "body": "Dont talk about it with your boss if you want to keep your job. the company you work for is laundering money, (turning dirty illegal money into clean money through the « legit » coffee business)"
    }
  ]
}