{
  "subreddit": "Tiktokhelp",
  "post_id": "1hx9itu",
  "title": "random age restrictions",
  "body": "sooo I have had musical.ly/tiktok on my phone since 2016 and I first downloaded it when I was below the age of 13, but I have had it ever since and I never had any issues with age restrictions. I am now above the age of 18 so my days of changing my birth year to sign up for websites are behind me, but I went to send a message to my friend on TikTok and was told “Due to multiple community guidelines violations, you’re temporarily prevented from sending and receiving messages.” I was SUPER confused by this because I have never violated any community guidelines on this app and this came out of absolutely nowhere. I clicked on the thing that said learn more and it told me that I was blocked from messaging because I was below the age of 16. I clicked the appeal button and it gives you the option to either take a selfie of yourself holding your ID up, or give them your credit card information so they can take out a small charge then refund it. I personally haven’t ever seen a social media platform or any other website ask for someone to send a picture of themselves holding up their ID, and I wasn’t comfortable with it. I just put an empty visa gift card into the credit card thing and it worked perfectly fine. It wasn’t that big of an issue to resolve, but I’m just annoyed that it happened in the first place + if I really was under the proper age needed to be able to send messages or whatever it is,  it’s super easy to bypass. I’d also prefer if it didn’t tell me that I had violated community guidelines when I hadn’t. Just a big mess and super annoying and disrespectful in a way Lol. Hopefully this post can help some random person out if this happens to them.",
  "author": "Infinite_Monitor345",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "This is a community ran subreddit - We are not affiliated with TikTok. If this is a question about the algorithm or why you're getting a certain amount of views, please attach screenshots of both your engagement metrics, and the retentiongraph. Attaching a link to your account will also make it easier for people to help you  Thank you for posting, please be sure to checkFaQPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Ok-Breadfruit-8013",
      "timestamp": "",
      "body": "This just happened to me today. Will try the empty visa giftcard"
    },
    {
      "author": "catipod",
      "timestamp": "",
      "body": "this happened to both me and my brother yesterday… first i got banned from messaging and then they banned my account completely. (he only got banned from messages)."
    },
    {
      "author": "kgalvan",
      "timestamp": "",
      "body": "Dude i just got this today, like id rather not upload my ID or CC to it?? Wtf so weird."
    },
    {
      "author": "domiii010",
      "timestamp": "",
      "body": "BRO THEY DIDNT ACCEPT MY APPEAL BOTH ID AND CREDIT CARD IDK WHAT TO DO"
    },
    {
      "author": "flower_girl05",
      "timestamp": "",
      "body": "i got the exact same thing just 2 days ago. i did end up doing the ID option which idk how i feel about that now considering it’s been almost 24 hours and my account has yet to change. i’ll update if anything but this has been super annoying considering the ban soon 🥲"
    },
    {
      "author": "AdEquivalent8173",
      "timestamp": "",
      "body": "they did this to me yesterday and did not approve the credit card and im still waiting for the id appeal results. I have had the app since 2019 and i am in my early 20s so i have no idea why they sent me this now"
    },
    {
      "author": "Kaleidoscopic_ness",
      "timestamp": "",
      "body": "i’ve tried signing up to tiktok for the first time and am of age but it just says i’m not eligible and i even tried saying i was born in 2000 and it just denies me"
    },
    {
      "author": "Infinite_Monitor345",
      "timestamp": "",
      "body": "I just had this happen to me. I am actually so confused. Did it make you put in a cardholder name when you put in your appeal with giftcard?"
    }
  ]
}