{
  "subreddit": "SubredditDrama",
  "post_id": "1bezjtg",
  "title": "In lieu of a new Texas law forcing age-verification on adult websites, PornHub closes its doors to Texans. r/Texas reacts.",
  "body": "A new bill was recently passed in the US state of Texas (and then upheld in federal appeals court) that forces adult websites to age-verify users via photo ID. Just to be clear, this is not a porn ban, however PornHub has decided to stop offering its service to users in Texas in protest of this. This has previously happened for the states of Utah, Arkansas, Virginia, Montana, and North Carolina.\n\nLink to post\n\nDrama:\n\n\"I predict instances of rape will skyrocket.\"\n\n\"Age verification required before you drink alcohol, smoke cigarettes, or go into a strip club. None of y'all talk about that, why?\"\n\nUser writes a screed about erectile dysfunction and divorce, as well as porn addiction. I ain't copying it down it's too much.\n\n\"Why would our Lawmakers reverse course real quick? You think they gonna kowtow to smut peddlers?\"\n\n\"It’s not “prude” to try to restrict pornography\"\n\n\"Keeping minors away from porn is somehow a bad thing apparently\"\n\n\"Oh, no, you have to ensure that the people watching your porn are of age. Must be rough. What's next? Preventing kids from going into sex shops?\"\n\n\"Stay away from porn it ruins your brain. Keep your eyes and mind clean. Jesus loves you all\"\n\nFlairs:\n\n\"I'm like a porn prepper\"\n\n\"Has someone alerted Ted Cruz?\"\n\n\"Can’t even watch a proper cream pie video on Pi day\"\n\n\"I wish Jesus would use those moist holes in his hands to help love me harder\"",
  "author": "OddSeraph",
  "comments": [
    {
      "author": "SomeFreeTime",
      "timestamp": "",
      "body": "How is Ted Cruz going to find new pornstars to like now?"
    },
    {
      "author": "drama_hound",
      "timestamp": "",
      "body": "Well it isn't blocked in Cancun."
    },
    {
      "author": "Evinceo",
      "timestamp": "",
      "body": "I copied it for you OP:First off F them all. We have a generation of 25 yr old men with ED and skyrocketing divorces due to this filth. Their adds are always about cheating on your spouse and getting them as young as the law allows while pretending they’re younger. It’s all trash. Second off though, they openly admit here at their attempt to monopolize a market. “This law forces people to not click “yes” cause it’s such an exhaustive effort and instead go to third party websites that are smaller and not able to afford the expensive compliance measures that pornhub the conglomerate can”.They could care less about minor allegations and they have the money to cover anything they need up. They could care less that a user has to click one more time to see tits. No what they’re worried about is the general image and vibe that a user will receive. They will be reminded of the explicit nature, the underlying issue that’s lead to allegations, they’re afraid that the government and its governed will see the true evil of the industry and the related crimes that come from sex addiction which stems from regular pornography consumption. They’re afraid that this will snowball into a movement of accountability and actually wanting better for ourselves.Understand, it might require govt intervention to slow the damage of the porn industry and its ties with minor trafficking but this is not as simple as deterring from the use of a website. Men all across America suffer from the addiction and wish they weren’t as reliant as they are. Those same men are rejoicing at these restrictions and have some more hope. Porn addictions seriously addictive and carries with it a massive list of side effects both short and long term"
    },
    {
      "author": "Front-Pomelo-4367",
      "timestamp": "",
      "body": "Fun fact that it's also illegal to sell sex toys in Texas, and also to own six or more sex toys (because it's presumed that the only reason you own six sex toys is because you're planning to sell them)(It's still on the books, but was ruled unenforceable and unconstitutional in 2008)"
    },
    {
      "author": "grissy",
      "timestamp": "",
      "body": "In alabama it’s illegal to sell sex toys unless they’re for educational purposes, because having fun with them is sinful. Consequently every adult store is required to have “for educational purposes only” all over their windows and shelves, and they also have to tell you when you come in that you are only allowed to buy anything if it’s to educate yourself (presumably about how sinful it is) and you have to say “yes, that’s what I’m going to do.”Small government!"
    },
    {
      "author": "otokoyaku",
      "timestamp": "",
      "body": "God, that reminds me of the whole \"carrying more than one condom at a time means you're definitely a sex worker\""
    },
    {
      "author": "Buttersaucewac",
      "timestamp": "",
      "body": "And it’s not one of those wacky laws left over from an 1820 penal code no one took seriously anymore. Texas police were conducting raids and sting operations over dildo and lingerie ownership as recently as 2007. Women were being handcuffed and taken to the station with their charges public and in the newspaper after admitting to ordering Hitachis and clone-your-partner’s-penis dildo mold kits. They sent officers undercover to bachelorette parties to sell honeymoon sex toy kits and arrest the buyers. The Texas government was controlling your masturbation and sex habits at gunpoint while calling itself the land of the free, within most of our lifetimes."
    },
    {
      "author": "drama_hound",
      "timestamp": "",
      "body": "5 is fine though. One for each workday with a rest period on the weekends."
    },
    {
      "author": "Kineth",
      "timestamp": "",
      "body": "\"Can’t even watch a proper cream pie video on Pi day\"lmao"
    },
    {
      "author": "OddSeraph",
      "timestamp": "",
      "body": "Texans about to go back to using sears catalogs.Idk but there's something hilarious about a state that constantly boasts about how free and independent they are and how people are just flocking there, consistently have things happen to it that makes you question them."
    }
  ]
}