{
  "subreddit": "undertheoaktreebook",
  "post_id": "1cvrsjj",
  "title": "How long does it take to get age verified in Ridibooks if you are a foreigner?",
  "body": "I wanted to read the novel in ridibooks, but I needed to get verified as an adult. Of course I am an adult so I went through all the procedure that a foreigner has to go through to get age verified. But 1 day has already passed and I didn't hear anything from them. I'm afraid that something went wrong so I'm thinking of sending the request again. Did anyone went though a similar situation? (And sorry about my bad english, im not native)\n\nEdit: Thank you everyone for all your answers! You guys are really kind, helped me a lot :)) I have logged in this morning to see if I was verified and I was! I think the problem was because I sent the request during the weekend, and I saw in the website that the working hours are only during the weekdays. So thank you guys!! <3",
  "author": "elmariiee",
  "comments": [
    {
      "author": "QuinnsWife",
      "timestamp": "",
      "body": "It took less then 24 hours for me (US)"
    },
    {
      "author": "nadiason",
      "timestamp": "",
      "body": "Few hours to a day on a working day according to koreas time"
    },
    {
      "author": "Chemical-Secret8241",
      "timestamp": "",
      "body": "Less than half a day for Canada"
    },
    {
      "author": "Glittering-Cream-488",
      "timestamp": "",
      "body": "When doing this do we need to translate our info to korean? I saw a post giving those instructions but I didn't do that."
    },
    {
      "author": "Rumaan_14",
      "timestamp": "",
      "body": "They probably won't notify you. Log out of Ridi and log back in to see if you can access the adult session. I've heard some people getting approved in less than a day and some taking up to 4 days."
    },
    {
      "author": "elmariiee",
      "timestamp": "",
      "body": "I never got a notification I just logged in the next day and was verified"
    }
  ]
}