{
  "subreddit": "VRchat",
  "post_id": "1jn475f",
  "title": "Is age verification not enough?",
  "body": "Hello! I’m new to the game as I recently got a headset and have been having a lot of trouble. I try to join 18+ servers because I don’t want to be around children tbh, but I keep getting kicked because the people who let you in think I sound like a child. I bought the age verification and I wear the badge, I have my age in my bio and a picture of myself but I’m still getting kicked from places before I even have the chance to give them my age and dob. It’s really frustrating and it’s honestly made me quite insecure about my voice lol. People have been really mean and aggressive about my voice and as glad as I am that theres people out here really trying to protect children I’m not sure what more I can do to verify my age, does anyone have any advice?",
  "author": "CeriPie",
  "comments": [
    {
      "author": "plantgirl7",
      "timestamp": "",
      "body": "If anyone is asking for your date of birth beyond the verification and commenting on your voice at all they’re on a power trip and you probably don’t even want to participate in that instance"
    },
    {
      "author": "weewoo0333",
      "timestamp": "",
      "body": "That makes sense as a lot of them would sit and argue with me which didn’t make sense cause if you really think I’m a child why would you argue?"
    },
    {
      "author": "Just-Brush399",
      "timestamp": "",
      "body": "If they think voice verification is more secure than id verification then those groups probably aren’t worth your time. There’s plenty of groups out there specifically for age verified users. Try looking for the groups called “age gated” and “age verified”"
    },
    {
      "author": "weewoo0333",
      "timestamp": "",
      "body": "Thank you! I had no idea about these groups and defo will check them out :)"
    },
    {
      "author": "No-Reality-2744",
      "timestamp": "",
      "body": "I don't trust the groups pretending a voiced DOB is more valid than ID verified as it means they will just trust anyone that claims to be an adult anyway. It doesn't help that I have found out that some groups do indeed ignore the ID verifying so they can let teens pretend to be adults in there. If they ask me for a DOB, it's an instant leave, and with the amount of other people doing the same they will just have to deal with the walkaways. Most nights I can find at least one place that takes my profile as a responsible claim of my age and knows that is already as safe as they are gonna get it, in-game at least."
    },
    {
      "author": "Kymerah_",
      "timestamp": "",
      "body": "It’s enough to be age verified for normal people, don’t worry.You don’t want to be around people who still ask for your DOB, they’re doing you a favour."
    },
    {
      "author": "Aduritor",
      "timestamp": "",
      "body": "It is enough. The only problem is that the powertripping group moderators had their precious \"age and date of birth\" taken from them, and now are spreading the lie that the age verification is easily bypassed (it is not) to keep feeling in power."
    },
    {
      "author": "Emotional_Fold_2527",
      "timestamp": "",
      "body": "call them creepy and find another world tbh"
    },
    {
      "author": "zakku_88",
      "timestamp": "",
      "body": "VRC player base: Implement some sort of age verification!VRC: *implements age verification* Alright, here you goVRC player base: No! Not like that!I swear, a lot of these people (bar group owners/staff in particular) don't want actual solutions, but just more of the illusion of having some sort of \"power\" over others smh..."
    },
    {
      "author": "CeriPie",
      "timestamp": "",
      "body": "Report them for attempting to solicit personal information. Asking for DoB to participate in an instance when you are age verified is a violation of the privacy section of VRChat's ToS. There should be absolutely no reason anyone should be trying to pry your DoB out of you if you are age verified through VRChat's official system."
    }
  ]
}