{
  "subreddit": "discordapp",
  "post_id": "183u9pu",
  "title": "Ways to verify someone age on a public discord server",
  "body": "So I wanted to know if there's any other way that I could accurately verify people to assure that they are of age without ID verifications. I have a 21+ only server and it's fairly new, and I want to know are their any bots or any other methods to know for it.",
  "author": "alexytomi",
  "comments": [
    {
      "author": "piano1029",
      "timestamp": "",
      "body": "No, there is nothing someone has that officially confirms their age except a form of ID or their birth certificate."
    },
    {
      "author": "RadiantLimes",
      "timestamp": "",
      "body": "There are websites/companies which will verify someones age for you using their identity , so people would have to be willing to upload their government proof of age. which can be linked back to a bot which tells the mods so they can make the person with a role. Most channels in the server are locked behind this role. Though this is not a free service as you would need to pay a monthly fee or per person fee."
    },
    {
      "author": "Virtual-Possession83",
      "timestamp": "",
      "body": "Have any idea on what those websites are?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "You can ask for an image of them holding a legal ID with the DoB visible. If its just to verify age then just about everything else can blurred aside from the DoB without any issues.If you need to verify who theyclaimthey are (probably more than the case of NSFW servers or such, where people try to take their identity), then having their face visible is probably okay but you need to have a trustworthy staff team for that. But if it's just a gaming/community server then it doesn't need to be that in depthThere isn't a way to do it without ID unfortunately, but the top option is probably the safest/least intruding one as all that's revealed is their DoB"
    },
    {
      "author": "Virtual-Possession83",
      "timestamp": "",
      "body": "Thank you, Auto! It would also be more sufficient if we had then write and lift up their server username also just in case also for the first option. Once again, thanks!"
    },
    {
      "author": "alexytomi",
      "timestamp": "",
      "body": "you could politely ask for their birth certificateit has to be a request rather than a demand or it's illegal i think"
    }
  ]
}