{
  "subreddit": "CloudResearchConnect",
  "post_id": "1egr4m4",
  "title": "ID Verify?",
  "body": "Been on the site for years since Beta with no issues so far. Just got an email that I have 7 days to verify my identity. Anyone else get this?\n\nNormally, I'd be cool with it, but with how sketchy CRC is getting, I think I may just let it lapse.\n\nEDIT: Yes, I know this used to be optional, but CRC is now demanding it within a week to \"maintain my access to the site\". It's not a scam email either, this shows up in my CRC account itself.",
  "author": "oceanmoney",
  "comments": [
    {
      "author": "spiffyshxt",
      "timestamp": "",
      "body": "Search the sub to see other instances of this, but there have been a few people who came in here to post with screenshots included due to receiving the same notification on their dashboards.Just for context, it's not the same optional ID verification that they claim allows more prioritization for projects (a lie), it's something that you must do within a certain window of time or your account is put on hold or waitlisted. Previously, it was mentioned in the sub so infrequently that it seemed to be something they did on a case by case basis, but due to all the waitlisting/banning for alleged TOS violations, I wouldn't be surprised if required ID verification in order to participate became mandatory."
    },
    {
      "author": "KiznaTowryk",
      "timestamp": "",
      "body": "I received it as well, logged in to check and it's right there on my dashboard. It's genuinely frustrating having to be forced to do so. I have a 850 score, I've been approved for well over 1k surveys and I've been using connect since 2022. Why now all of a sudden?"
    },
    {
      "author": "curbstxmped",
      "timestamp": "",
      "body": "Yeah, I got it today as well. It's a legit communication from Connect. You can also go to your dashboard and see where they mention the deadline there as well.I won't be responding to it since I don't use Connect much anymore and it makes up such a tiny portion of my overall income. In terms of my performance, I have a perfect score and have never received a rejection. I'm inclined to believe they are just rolling this new requirement out in waves, and they'll likely force everyone to verify eventually. It just kind of comes with the territory, though. Integrity has to be protected with online research and all. I'll come back and update with what happens when you don't respond to the request after my deadline is up.edit: Waitlisted as of 8/7, which was my ID verification deadline. Hope this helps someone."
    },
    {
      "author": "SnooSquirrels798",
      "timestamp": "",
      "body": "what do you use instead of connect? prolific?"
    },
    {
      "author": "jherara",
      "timestamp": "",
      "body": "I don't usually respond on this sub, but I noticed a few people automatically linking refusal with fraud. It's important to keep in mind that many companies are now using driver's licenses and other photo IDs to train AI systems to create avatars without paying the people in their systems a single cent for the use of their faces. They're also using those IDs, with a person's photo and home details, to sell their products and services, which means more chances of hacking. Lastly, some people were vetted through MTurk, thoroughly, and then invited to come to CR based on years of previous work. So, I imagine it would then irritate or worry them to have to prove who they are when their identity was already proven several times and the identification service could put them at greater risk of identity theft. It's for these reasons that some government agencies and nonprofits are now accepting mail with letterhead or a postal mail address card as proof of address so that people aren't put at greater risk.Note: I'm speaking in generalities based solely on the OP's statements and personal experience with and statements read online about MTurk and not on anything I've seen on the CR site, since I don't share publicly or privately anything I've seen or experienced on the platform."
    },
    {
      "author": "literallydondraper",
      "timestamp": "",
      "body": "I’m pretty sure it’s done through a third party if I’m not mistaken? Not to say that couldn’t have issues, but Cloud doesn’t perform the check directly. I did it as soon as I signed up, have had no problems. I remember it being somewhat optional but encouraged to get more studies. Not sure if researchers can filter participants that way or they just say that as an incentive. It raises your score which is probably irrelevant to you at this point"
    },
    {
      "author": "Ok_Lifeguard_5373",
      "timestamp": "",
      "body": "I got it too, I've been on there for years and never had an issue. I went to check out exactly what they're asking for and when I click to verify my identity it doesn't open and it freezes the entire page, on Chrome and Firefox. My ID is expired and it would take a couple of weeks to get a new one, so unless they let you update it later, I guess I'm finished. I don't do too many on there anyway, but it's a little frustrating, I have zero rejections and now I'll lose the account because my id is expired."
    },
    {
      "author": "literallydondraper",
      "timestamp": "",
      "body": "The safest would probably be to not take studies until your ID comes in. That being said, I’ve seen other people on this sub who’ve said they’ve been fine without it, but that might have been before the great purge. I’m not sure lol"
    },
    {
      "author": "oceanmoney",
      "timestamp": "",
      "body": "I have not received any messages in my CRC inbox or emails about this kind of thing whatsoever. I mean, time will tell, but AFAIK, nothing about this so far.EDIT: There is also not a single announcement on my dashboard, it just looks default. I believe if they're going to start forcing verification for each participant, then that's how it is going to be. Prolific has already ruled this method as a hard requirement. So I guess if you're uncomfortable the whole concept, then that's going to be a huge roadblock."
    }
  ]
}