{
  "subreddit": "VRchat",
  "post_id": "1hzkhvd",
  "title": "Even with the verification system people ask for date of birth",
  "body": "So what was the point of adding a verification system? I think the 18+ badge should be shown next to your status",
  "author": "Barasu1",
  "comments": [
    {
      "author": "MuuToo",
      "timestamp": "",
      "body": "I've seen some people tryna argue it's easy for a kid to fake an ID or use their parent's, but then in the next breath say they'll ask people for ages, as if it's totally secure and people can't just verbally lie."
    },
    {
      "author": "Pokabrows",
      "timestamp": "",
      "body": "Exactly! I feel like ID verification is at least harder to fake than saying a birthday.If I had realized the ID thing was gonna be completely ignored I wouldn't have bothered to get ID verified..."
    },
    {
      "author": "Evaunit01berser",
      "timestamp": "",
      "body": "That's when you know people have no idea how the system works.The kids are not faking a face scan"
    },
    {
      "author": "nekogarrett",
      "timestamp": "",
      "body": "It's their only sauce of power. They sit in front of a wall and it's their only ability of interactions."
    },
    {
      "author": "SpectorEscape",
      "timestamp": "",
      "body": "Don't you know! The random dude taking his bouncer roleplay too seriously is more trustworthy then a system that requires actual ID!"
    },
    {
      "author": "Chambers1041",
      "timestamp": "",
      "body": "Yeah I got asked for DOB the other day, told him \"click my profile I have the 18+ badge\" \"DOB please\".Clownery."
    },
    {
      "author": "Pokidoki123",
      "timestamp": "",
      "body": "I went to JustB club host by Heavenly Paradise last week and got ask for DOB eventho I tell them to please check my profile. He told me that he still ask anyway because his boss tell him to do so and say that \"kids manage to get verified\" and \"Don't trust the system\".I want Age Verify system to act like how you take off your hat to show your bald spot when ask for ID to enter the bar."
    },
    {
      "author": "RedTaxx",
      "timestamp": "",
      "body": "As if people can’t lie about that smh"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Eventually the system will go public, and the better groups will make their public instances age gated.It's in beta with barely any access. Most people don't know how it works nor is it possible to make gated instances without excluding most adults in the game.Give it time. Eventually instances that aren't gated simply won't be visited by adults for specific worlds and events. When that happens, stragglers will adapt or fall into obscurity."
    },
    {
      "author": "Barasu1",
      "timestamp": "",
      "body": "If they won't use my vrchat verification, I just leave."
    }
  ]
}