{
  "subreddit": "AmazonFlexDrivers",
  "post_id": "8u1bas",
  "title": "How do they know if you fail to verify age on an alcohol order?",
  "body": "I received an email from Amazon support saying that during the past week I failed to verify age on one or more orders. I don't understand how they can know if the app doesn't even let you continue unless you enter the name and age of the person. (even if it's bogus information)",
  "author": "dr00sk",
  "comments": [
    {
      "author": "deserttrends",
      "timestamp": "",
      "body": "Probably undercover buyers. In the restaurant industry, there are undercover agents from the state that will bust servers. Some restaurants hire secret shoppers to do the same thing and will fire the servers on the spot."
    },
    {
      "author": "Lukkypuppy",
      "timestamp": "",
      "body": "You do realize YOU can be fined like $5k or more for not verifying age or seeing ID?? I know you have to scan or input the data from the ID into the app (so you have to see it either way to be allowed to accept the drop off). I’m not sure why this is even a question?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "SPD5101",
      "timestamp": "",
      "body": "You delivered an order that included an alcohol and you didn’t either request an ID, didn’t scan it, and/or didn’t enter manually."
    },
    {
      "author": "JustMyOpinion78",
      "timestamp": "",
      "body": "You have to scan or manually enter to complete the delivery. I would send an email back asking what order as you are unable to deliver without the verification. As for proof that you didn’t and push the topic, given you did request when ever it asks for ID."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Redshirtfailure",
      "timestamp": "",
      "body": "Did you have support mark a bunch of verify orders as delivered?"
    },
    {
      "author": "CapnShinerAZ",
      "timestamp": "",
      "body": "They know you failed to verify age because of the bogus information you entered. Honestly, you're lucky they didn't just deactivate you. They probably should, because you are going to get the liquor license revoked if you keep that up."
    },
    {
      "author": "jellybelly62",
      "timestamp": "",
      "body": "You should absolutely be deactivated!"
    },
    {
      "author": "dr00sk",
      "timestamp": "",
      "body": "Most likely the address has repeat deliveries, and your bogus info did not match the normal info. This isn't just to cover Amazon, its to cover YOU. Do it wrong, and you CAN end up in jail."
    }
  ]
}