{
  "subreddit": "discordapp",
  "post_id": "17yzduf",
  "title": "Is this normal to get this kind of request?",
  "body": "",
  "author": "mx20100",
  "comments": [
    {
      "author": "Markiemoomoo",
      "timestamp": "",
      "body": "If Discord thinks that you're underaged, yes."
    },
    {
      "author": "Optimistic-Dreamer",
      "timestamp": "",
      "body": "I’ve had to do this to join nsfw servers to prove I’m over 18. This is normal. Most I’ve seen ask you to write your discord tag and the name of the server on a sheet of paper and place a redacted pic of your license on that sheet."
    },
    {
      "author": "Hype365",
      "timestamp": "",
      "body": "Based on this comment here on another post 20 days ago, either you got your account back once and then got it disabled again for an age report again, or you still haven't done as they stated EXACTLY. If you don't do EXACTLY as stated (including the selfie) then your account will simply be deleted for being underage age as they are legally required to comply with child online protection laws which prevent them from storing information about underage users."
    },
    {
      "author": "gergobergo69",
      "timestamp": "",
      "body": "The birthday numbers on my ID was blurry, so they asked me to send again after a few daysafter I sent another one they instantly let me through 👍"
    },
    {
      "author": "ChiisanaSoraNi",
      "timestamp": "",
      "body": "If you're appealing an underage ban - yes."
    },
    {
      "author": "I_AM_DA_BOSS",
      "timestamp": "",
      "body": "Only if it’s an underage ban appeal"
    },
    {
      "author": "Agreeable_You_8841",
      "timestamp": "",
      "body": "They want your blood type too"
    },
    {
      "author": "raz0r_ttv",
      "timestamp": "",
      "body": "DNA code while you are at it"
    },
    {
      "author": "TropicaL_Lizard3",
      "timestamp": "",
      "body": "Yes, if you got banned for being underage. I doubt you are one, but at a very high likelihood someone reported you making a joke about your age. It happened to some of my friends under a false reporting campaignP.S. Out of most rules, Discord takes their age policy very seriously and will respond swiftly to such reports. It's part of the law. Just a heads up."
    },
    {
      "author": "mx20100",
      "timestamp": "",
      "body": "If you’ve been reported for being underage, how else would they confirm it?"
    }
  ]
}