{
  "subreddit": "aves",
  "post_id": "57c3nb",
  "title": "Escape ID problems",
  "body": "How strict are securities with ID's? My friend recently lost his work permit ID and wont be receiving the new one until mid november. He does not have a drivers license since he hasn't done the driving part yet. Would they let him go in with the expired work permit ID he has?",
  "author": "Snakersolid",
  "comments": [
    {
      "author": "ricky_tan",
      "timestamp": "",
      "body": "I don't think they'll let him in with that because it is expired. I suggest your friend go to the DMV tomorrow and apply for a California ID (or w/e state you're in) and pray he receives before Escape. It usually takes 1.5 to 2.5 weeks.Edit: Formatting"
    },
    {
      "author": "Saltymochi",
      "timestamp": "",
      "body": "He can get in if he brings his passport! If he doesn't have a passport either then the best bet is to go to the DMV and get an ID, they'll provide him with a temporary ID that must be accompanied with another form of ID though (WORKS WITH EXPIRED IDs). So he should be fine with using the temp ID the DMV gives you along with his expired worker's permit ID."
    },
    {
      "author": "JenDrk",
      "timestamp": "",
      "body": "I would just go for an ID if he can't get his drivers license. It happened to my friend for EDC he went early in the morning to the DMV and got a regular ID and luckily got it within a week. If you went now You should be able to get it in time. I think you can use an old drivers permit also not entirely sure though. Best bet is to email insomniac, they replied pretty quick and were very helpful."
    },
    {
      "author": "Figueroa54",
      "timestamp": "",
      "body": "Happened to me last year was able to get in with a expired Id and DMV document. I emailed them as soon as I  lost it this was there response \"DMV documents proving the renewal of your lost ID card will only be accepted with a hardcopy of an expired ID/passport.If you do not have an expired ID; please bring the DMV paperwork, a school/work ID with your photo, a credit/debit card with your name on it, and any other documentation proving your age/identity. Although it is not guaranteed, these documents should increase your probability of gaining entry.\" Hope it helps"
    },
    {
      "author": "Time314159",
      "timestamp": "",
      "body": "In my opinion there's 0% chance they'll let him in. Insomniac is pretty strict with IDs and with the SBPD being as strict as they are now (see Nocturnal) I'd say his best bet is to go to the DMV."
    },
    {
      "author": "Snakersolid",
      "timestamp": "",
      "body": "Can he apply for a passport on the consulate it does not take long to get one better safe than sorry..."
    }
  ]
}