{
  "subreddit": "SkincareAddiction",
  "post_id": "14ubqqt",
  "title": "[Anti-Aging] Is the way the TikTok “aged” filter ages accurate?",
  "body": "In the last few days, the filter has blown up. I have seen people who look incredible and barely changes but I look like a 90-year-old women who sunbathed and smoked. I’m 17, have worn sunscreen everyday since I was 13, and recently started retinol. I have also avoided making exaggerated facial expressions (like raising my eyebrows). Now I’m scared I’ll end up looking like the filter no matter what. So tell me, is it accurate?",
  "author": "Deannamspar1234",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Hi everyone and welcome to SkincareAddiction!Need skincare guides?Check out our wiki!Everyone is welcome inthis community; remember to be kind and assume good faith :)I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "ReaLitTea",
      "timestamp": "",
      "body": "No… how you age is determined by genetics and lifestyle, not everyone is going to age the same as portrayed by a filterAlso even if people do age like that, it is what it is. There’s nothing to be scared of, you’ve likely lived long enough to realize life is not all about looks"
    },
    {
      "author": "Difficult_Brief647",
      "timestamp": "",
      "body": "Come on, how could a filter possibly predict how much sun exposure you will get in your life?"
    },
    {
      "author": "silvermanedwino",
      "timestamp": "",
      "body": "This. It’s a gimmick.  Nonsense…And please- don’t control your facial expressions to reduce the normal/natural signs of “aging”. Be yourself.  Be happy/sad/worried, etc.  These comments from young people make me sad.  I’m not judging, please know… but it’s sad to hear individuals change facial expressions, how they sleep, etc to avoid a natural process. Of course, eat decently, don’t smoke, avoid sun bathing…. Moderate alcohol.  Take decent care of your skin….It’s just…. A bit disheartening at times.  Especially in the very young…… you’re all beautiful and have lovely, elastic skin!  Enjoy it.Worry about the rest when you’re older and truly seeing changes."
    },
    {
      "author": "lustforyou",
      "timestamp": "",
      "body": "I hope not. Im early 20s and have done it with my friends, and they look 40ish, while I literally look 90I’m not putting too much stock into it. It’s just a random filter, and I have pronounced cheekbones that I think it really picks up to give me a gaunt look. Regardless, don’t stress over it. I quit using the filter so as not to trigger me lol, as I get bad anxiety over aging.If it helps in general, I read a quote recently that said something alone the lines of “there’s nothing sadder than wasting youth by trying to run away from aging”We’re young now (especially you, 17 is so much younger than you even realize) so just enjoy being young and take the regular precautions. If we’re fortunate, we’re gonna age regardless, might as well savor our youth for now and live in the moment"
    },
    {
      "author": "shitpresidente2",
      "timestamp": "",
      "body": "funny thing is I have very pronounced cheekbones but it makes my face sag so much and look fat. It's so bizarre. It really picks up on some of the lines you have on your face. Some lines I've had since I was young and has been the same for a long time - filter just uses that and exaggerates it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "The fact that this is even being asked blows my mind. Leave it to social media to warp everyone’s sense of reality. 😤"
    },
    {
      "author": "PurpleSkies21",
      "timestamp": "",
      "body": "I have yet to find someone who looks as bad i do with this filter, everyone looks 40-60, while i look 116 i really dont understand😅"
    },
    {
      "author": "Carolina_Blues",
      "timestamp": "",
      "body": "replying to this a few months late but I am also convinced that all the dermatologists and plastic surgeons saying its accurate are because they make money off of our fear of aging whether its procedures or surgery so of course they going to say its real"
    },
    {
      "author": "Deannamspar1234",
      "timestamp": "",
      "body": "this filter has really triggered me because i suffer with pcos and i literally look like my dad and other tiktok filters also register my face in a similar manner, i identify as non-binary but that doesn't mean i wanna look like my dad in 50 years or whatever. it makes my skin look so fucking bad and i know that i did a lot of skin pickin in my youth and didn't start taking care of my skin until i was 19 ish. I just feel like shit about it and honestly not sure how to cope without feeling like i'm lying to myself"
    }
  ]
}