{
  "subreddit": "onlyfansadvice",
  "post_id": "1k5hbra",
  "title": "What am I doing wrong?",
  "body": "My husband and I are getting started. I’ve been absorbing every bit of advice on this page for weeks and got made two accounts under my name. One for a free account and one for a paid account. They both got verified & release forms were submitted for my husband on each.\n\nA few days later I got the posted email saying my release form link has expired and needs to be resubmitted. The next email said the account was deactivated:\n\n“Following a manual review, your account has been deactivated because it violated our Terms of Service or Community Guidelines for the reason(s) below:\n\nfeaturing, tagging, or referencing someone whose age, identity or consent is not verified”\n\nI hadn’t posted even posted anything yet - had just put a solo picture up & written out bios. And the release form was submitted days prior with the verification.\n\nFrom what I understand he doesn’t HAVE to have his own account. And the only reason I was trying to avoid that was because I had to enter my social media info despite it saying “optional”.\n\nDid I miss a step? Is this because I put fake names in our bio? Is that allowed? Does he have to have an account? Is there some way to bypass the social media step during verification?\n\nI have no intention of quitting no matter how frustrating this is so any help is greatly appreciated.",
  "author": "FrostingSmart4189",
  "comments": [
    {
      "author": "petsydaisy",
      "timestamp": "",
      "body": "Don't put real info anywhere client facingAppeal. Onlyfans automates a lot if its \"support\".Probably it will go smoother if he has an account."
    },
    {
      "author": "SavannahBendz",
      "timestamp": "",
      "body": "You don't have to have social media connected BUT you do need to connect social media for verification then you can delete right after."
    },
    {
      "author": "timetoplay101010",
      "timestamp": "",
      "body": "Sounds like you created a couples account? Seems easier of you both just create your own account and get verified, then you can tag his profile when y'all make content together"
    },
    {
      "author": "CocoNoirr",
      "timestamp": "",
      "body": "Honestly get him to make a verified account ! I had the same issue with release forms, I kept having to redo it over and over again for the same thing i posted/ sent weeks ago. As soon as he made an account and I could just tag him, never had the issue again!! It was very frustrating x"
    },
    {
      "author": "stacys-the-mom-now",
      "timestamp": "",
      "body": "Dealing with authorizations is super annoying, the creator account is so much easier. he never has to post anything, they won’t link to socials, they just use them to verify that he’s a real person. If he’s worried about people finding his page, just make his account faceless, a picture of his chest or something"
    },
    {
      "author": "Love_Ranch",
      "timestamp": "",
      "body": "It was super frustrating getting started. We do couple content and my gf didn't have any social media. We had to set up a separate account for her and she had to set up an IG and post a few pictures for verification. Every time we post I tag another creator. Every picture, every message, everything. It does get easier."
    },
    {
      "author": "alix_cross",
      "timestamp": "",
      "body": "Did you use a fake name on the application/release form vs what’s on your social media?"
    },
    {
      "author": "FrostingSmart4189",
      "timestamp": "",
      "body": "Nope - it was my regular personal IG page and all my info was real. I wrote fake names in the bio though - I wondered if that could cause anything. We didn’t want to use our actual names"
    },
    {
      "author": "timeforscorpio",
      "timestamp": "",
      "body": "I just created my OF and EVERY time I log in it tells me to “ complete my required Face ID” and I’ve done it 5 times now.  I have no idea what’s going on"
    },
    {
      "author": "FrostingSmart4189",
      "timestamp": "",
      "body": "for such a popular site there are so many issues like that 😕"
    }
  ]
}