{
  "subreddit": "Tiktokhelp",
  "post_id": "1ff7514",
  "title": "tiktok support age verification not working",
  "body": "Hi so basically i've recently tried to get my age verified on tiktok so I can go live or just do whatever honestly, and I keep on getting the message \"Unable to verify age\" and it telling me i'm not over 18, well fortunately enough for the both of us im literally 21 years old. I tried appealing it probably over 10 times and it gives me the same results everytime saying my \"documentation doesn't meet the requirements\" i've sent in my ID probably 10 times and even did the bank account charge and still nothing. I tried reaching out to tiktok support and got little to no information regarding what I can do about this. I tried reaching out to the support team and i'm now getting the notification \"Plat docking not enabled\" when i try to submit my report to them regarding this and now idk how Im supposed to even contact them when I cant submit a request about this because IDK WHAT PLAT DOCKING IS. someone help me i'm not great with technology and my computer bf is at work. i'm on my Iphone so idk how to fix this dumb plat docking issue someone pls tell me something idk what im doing. I'm literallt now getting restrictions on my entire tiktok account because they think im a minor, i can only be on tiktok for 1 hour out of the day before I get a notification to put in a password to keep staying on the app. IM 21 TIKTOK I PAY MY OWN PHONE BILL HOW R U GONNA RESTRICT ME ON MY OWN PHONE.",
  "author": "Jayden-2511",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Thank you for posting, please be sure to checkFaQPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Doce_potato",
      "timestamp": "",
      "body": "Essa bosta nn funciona tentei varias vezes não passei na fase de tirar foto, sempre trava e volta pro início"
    },
    {
      "author": "Jayden-2511",
      "timestamp": "",
      "body": "have you solved it? i have the same issue"
    }
  ]
}