{
  "subreddit": "travel",
  "post_id": "1i4qi7g",
  "title": "Other age verification methods beside passport in USA?",
  "body": "I'm from Sweden, visiting USA for vacation, and I actually lost my passport here in America because I had to use my passport for age verification to get alcohol, and somehow I lost that passport. Huge headache to have my passport lost because of such a stupid reason, just to get alcohol. I had to get a temporary passport now so I can get back to Sweden, it's a piece of paper that can be used at the airport. But I assume it will only work for airport, I have no way of verifying my age anymore in America as I'm here.\n\nI wish there was another easier way for me to verify my age. I don't really want to be carrying around my passport whenever I'm out and about in America. I bought a passport holder with an AirTag tracker after the lost passport incident so that I wouldn't have to experience losing the passport ever again in the future, but that also means that carrying my passport with me is going to be even more bulky if it's going to be in a passport holder.\n\nIn Sweden, I can just use my driver license to verify my age, but because it's a Swedish driver license, most places in America don't accept that as age verification, it's just been passport that works for age verification.\n\nI've looked around online, and it really does seem that a passport is the only viable way for me to verify my age when I'm in USA, which sucks if I've already lost it now, and I'm staying in America still. I was thinking that there would be some way to get some identification card that tells you my age, and would be able to be verified in America, without me having to being my passport everywhere. You can get identification cards, but only if you're a US citizen it seems. What about me who's only visiting the US as a tourist?\n\nI just wanted to ask here anyway as a last resort, just to confirm, is there really no other way to verify my age when I'm in USA other than a passport? It would really suck if this is truly the case as I lost my passport here because of a stupid mistake.",
  "author": "Responsible-Seaweed-",
  "comments": [
    {
      "author": "SplitOpenAndMelt420",
      "timestamp": "",
      "body": "Nope. Passport it is"
    },
    {
      "author": "No-Ad8919",
      "timestamp": "",
      "body": "I guess it really is like that, damn. I bought a passport holder with AirTag tracker now, so I guess next time I visit USA I will have to carry that with me whenever I'm going out from now on. Thank you"
    },
    {
      "author": "traumalt",
      "timestamp": "",
      "body": "I’ve showed them My South African drivers licence before and it worked, why is the Swedish one a problem now?And did you try one of those national ID cards that every European has?"
    },
    {
      "author": "No-Ad8919",
      "timestamp": "",
      "body": "Apparently, it was just that some venues have never seen a Swedish drivers license, so they didn't know what to do with it to verify my age and didn't feel comfortable with giving me alcohol because of that, I think.And I don't actually have a Swedish national ID card, but it's definitely something I should look into getting, just for safety sake at this point. You never know when it could be useful to have.It seems that a physical passport is the only 100% guarantee to work everywhere, but you're saying that showing my Swedish driver license should work too in USA? Is it like a 50% chance they would accept it att different venues or what is it like? I'm just curious at this point, probably just have to suck it up for now and just wait until I get back to Sweden and get a new passport, and next time I come to USA I will have that passport in my new passport holder with AirTag tracker so I don't lose it accidentally"
    },
    {
      "author": "lirarebelle",
      "timestamp": "",
      "body": "Is a regular ID not mandatory in Sweden? What do Swedes who don't have a license do? Do they carry their passport all the time? Just curious.I had no problems with my German ID card in NYC last year. Our passports always stayed in the safe. Definitely get an ID for the next time."
    },
    {
      "author": "Responsible-Seaweed-",
      "timestamp": "",
      "body": "My friend from Denmark uses her driver's license for age verification for drinking, etc out here. They are always baffled, but we don't look like we are at a questionable age for alcohol purchase any more so that may help them to shrug off their confusion with her Danish ID."
    }
  ]
}