{
  "subreddit": "technology",
  "post_id": "1ia3lva",
  "title": "The Online Porn Free-for-All Is Coming to an End | Three decades into the internet era, the Supreme Court finally appears ready to uphold age-verification laws.",
  "body": "",
  "author": "digitaljestin",
  "comments": [
    {
      "author": "Hexxxer",
      "timestamp": "",
      "body": "...in the United States"
    },
    {
      "author": "Recent_mastadon",
      "timestamp": "",
      "body": "Feel that FREEDOM!?!?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It would be so funny if a national porn ban is finally what wakes this country up"
    },
    {
      "author": "Reactance15",
      "timestamp": "",
      "body": "Alcohol ban did that a hundred years ago in the US. Those people that learned died off."
    },
    {
      "author": "beanpoppa",
      "timestamp": "",
      "body": "It's not about banning porn. They want everyone on the Internet to provide ID. Porn sites are just the start."
    },
    {
      "author": "nutmac",
      "timestamp": "",
      "body": "Oh boy!I can't wait for browsers to require a login and they transmit my info to every websites I visit. Zero privacy in exchange for not having to login to websites."
    },
    {
      "author": "Independent-End-2443",
      "timestamp": "",
      "body": "Technology has come a long way since the Court first struck down age-verification requirements. Age verification services are now effective, easily used, and secure enough to be widely deployed.This is not true. Age verification is fundamentally privacy-invading. I would be skeptical of anything this author writes."
    },
    {
      "author": "soonerstu",
      "timestamp": "",
      "body": "I love how much Marc Novicoff just hand waves that entire argument. I mean obviously this vague private entity called Yoti is definitely going to delete your data and never be compromised, it’s not like Lastpass’ entire corporate purpose was security and they still got breached! Uploading your drivers license image online is no different than flashing it to a cashier! It’s impressive how much commentary from The Atlantic has fallen off."
    },
    {
      "author": "Bedbathnyourmom",
      "timestamp": "",
      "body": "Age-verification AKA Anti-privacy"
    },
    {
      "author": "digitaljestin",
      "timestamp": "",
      "body": "I can't wait for a disgruntled PornHub employee to leak every Republican congressman's porn viewing habits, which is exactly what they could do as soon as they are required to collect everyone's IDs.Also...I should apply for a job at PornHub."
    }
  ]
}