{
  "subreddit": "MarkMyWords",
  "post_id": "18ra1ur",
  "title": "MMW: The age verification laws that several red states passed is just so they can have a database for easy pickings if/when they make Pr0n illegal.",
  "body": "The red states that passed age verification laws requiring adult sites to ask for a driver's license # say they did it to \"protect minors\" but IMO that part is just theater.  Any minor can just take his or her dad's driver's license and use it to get past the verification.\n\nThat's not why they did it.  Once you enter your driver's license #, it gets stored in a database.  Databases are required to turn over their data to law enforcement if requested.  If one of those states decide to full on dictatorship and ban Pr0n, they will have a database full of people that they will most certainly go after.  That's why they are doing this.  They don't care about kids.  They care about having easy pickings to arrest people once they succeed in banning adult content.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "Pretend_City458",
      "timestamp": "",
      "body": "It's going to be used to comb through for political enemies"
    },
    {
      "author": "FrankRizzo319",
      "timestamp": "",
      "body": "This is correct."
    },
    {
      "author": "robotwizard_9009",
      "timestamp": "",
      "body": "This. A blatent invasion of privacy.. \"small gov\" my ass. The christo fascists are showing their colors."
    },
    {
      "author": "jungle-fever-retard",
      "timestamp": "",
      "body": "A portion of conservatives aren’t even hiding it any more. It was always “We’re the party of small government” but now they’re coming with “Well I’m not advocating for big government, I just believe in government intervention when necessary” type arguments lol"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "More likely is that we're about to learn how many Republicans have a thing for tranny porn."
    },
    {
      "author": "Dr-Satan-PhD",
      "timestamp": "",
      "body": "Ex post facto,per the US Constitution (Article I, Section 9, Clause 3). You cannot be prosecuted for something that was legal at the time you did it. They would have to amend or get rid of the Constitution in order to do so.Now, if you want to get into that conversation,Trump has explicitly saidhe would be willing to terminate \"all rules, regulations, and articles, even those found in the Constitution\", over his claims of election fraud. So it wouldn't be a stretch for him (or some other autocratic fuckhead) to attempt to terminate the Constitution over porn. Speaker Mike Johnson would be the one to look out for on this topic.In order to amend the Constitution, you need to either a) have two thirds of both the House and Senate vote for the proposal, or b) you need two thirds of the state legislatures to call a Constitutional convention, something that has happened exactly one time in US history, where the Constitution itself was drafted. All other amendments have been passed via option a. To completely abandon the Constitution, we would need to already be an all-out fascist dictatorship, and at that point, accessing porn is going to be the least of your worries."
    },
    {
      "author": "ConflagWex",
      "timestamp": "",
      "body": "They don't have to prosecute people for viewing pr0n when it was still legal.  They'd have a list of people they know are into that and try to catch them with contraband materials after they make it illegal.  Or at the very least harass the hell out of people on the list to discourage it."
    },
    {
      "author": "Aesirtrade",
      "timestamp": "",
      "body": "Good news is data shows such content is  iewed more often by Republicans than Democrats. So when they start hitting people with felonies, for the actual purpose of eliminating voters, they'll hurt themselves more than others.They know they watch porn all the time, and they are not capable of imagining people are different or better than them, so Dems must be worse. They figure they'll knock out a 2-1 ratio of dems to reps. It'll likely be the reverse."
    },
    {
      "author": "mm202088",
      "timestamp": "",
      "body": "Republicans- obsessed with what you do with your genitals"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Holy slippery slope Batman.Ain’t gonna happen. Live your life but also consider that porn is fundamentally bad for you."
    }
  ]
}