{
  "subreddit": "Scams",
  "post_id": "ye4fko",
  "title": "My experience identifying various scams as a teller",
  "body": "I've been the equivalent of a universal banker at credit unions for a few years, and I thought I'd share some of the scams I've encountered, how I spotted them, how they work, and at least with the last story, have a bit of a laugh.\n\nOverpayment Scam\n\nMember comes to the drive-thru when we're pretty busy. She wants to deposit a check for between $3-4k. Her balance is roughly $200 or so, and I checked her recent transactions to see if a deposit like this was usual for her. It wasn't, as she hadn't had a deposit of more than $500 in the last 3 months. I look at the check and I don't recognize the bank its supposedly drawn from, nor do I recognize the maker. Its some generic \"advertising company.\"\n\nAt this point I'm following usual risk-mitigation procedure in depositing the check with an extended hold on it, but I didn't immediately think it was a scam. I return to the drive-thru and tell her \"Alright, I made the deposit for you, but its on an extended hold because of the amount. The funds should be available within 5 business days.\"\n\n\"Oh no, that's payroll, they told me to tell you its payroll.\" Alright, red flag #1. Payroll checks have different regulations, and unless your real-life employer has bounced your checks in the past, we can't place holds on them. But of course what is 'payroll' is subject to verification. Usually its enough to see that they've deposited checks in similar-amounts from the same maker on a regular basis, which can be verified by their account history. If we're really cautious, especially if they just opened their account, we may even go so far to call that employer to verify.\n\n\"Is this your employer?\"\n\n\"Yes\"\n\n\"It doesn't look like you've received a check from them before, is this a new employer?\"\n\n\"Well they're going to wrap my car for advertising and I need to wire $1500 of it by tomorrow so they can do the wrap. So there can't be a hold on the check or I'll lose the gig!\" And there it is, red flag #2 and confirmation. I explained the scam to the member and after a bit of conversation she was appreciative and asked us to reverse the deposit and shred the check.\n\nMore info on car-wrap scams.Same goes for any type of \"Here's more than we agreed, you need to pay a portion of it back for whatever reason.\"\n\nGrandson Needs Bail\n\nAnother time I had an older member come to the teller line very frazzled. \"I, um, I need to do a wire, can I do a wire? How do I do that, I've never done that before?\" She had real fear in her voice.\n\nI pulled a wire request form for her, but before I handed it to her I asked what the purpose of the wire would be.\n\n\"What does it matter? I just need to send the money as soon as possible. How soon will it get there?\"\n\n\"I understand, but its important for us to gather a bit more information for all wires we do. Would you mind telling me a bit more about the purpose?\"\n\nWhile still sounding scared and frazzled, she also became embarrassed and told meher grandson called and needed money for bail. She told me how good of a kid he was, and how he made it clear that he needed the money immediately. She showed me a note that she hastily-wrote with the wire instructions her 'grandson' gave her over the phone.\n\nI asked if she was sure this was her grandson, and she became very offended (learned to use more tact after this one). I tried sympathizing with her, and the (theoretical) urgency of the situation, but I asked her to take a moment to think. Did he call from his usual number? No, he was at the police station. Did he say what police station? Yes, several states over. Did it show up on the caller-ID? She doesn't remember. I asked when was the last time she spoke to her grandson or his parents, and she said its been about a week or two. She hadn't tried contacting any of them since the call.\n\nI told her I had some concerns that is a scam, and told her that its very common for scammers to call older people pretending to be grand-children needing money urgently. She assured me she knew her grandson's voice when she heard it, but I could tell she started to question the situation.\n\nShe went back and forth trying to rush me to complete the paperwork, and asking me questions, clearly doubting the situation.\n\nI suggested she call the police department directly to ask about her grandson. I even wrote down their number I got from Google. I told her to try calling her grandson directly at his cell-number she has, or to call his other family. I assured her that wires wouldn't go out for another 2 hours anyway, so she had plenty of time to research this further.\n\nShe still seemed frazzled and not totally convinced this was a scam, but she said she would go do those things and come back later. I didn't see her again, so I hope she realized it was a scam.\n\nNew Account Deposit\n\nThis one's different because the victim would be the credit union. Woman came in to open a new account and presented a business check for close to $3k for deposit. As a safeguard we place all (non-payroll) checks deposited into a new account on an automatic 14-day hold. I didn't explain that until her account had been opened and she became very flustered. She told me that she needed to get the money now, something about her sister having a medical emergency, but the story changed a few times. I told her she could deposit the check at a financial-institution she already has a relationship with, or she may go to the issuing bank to cash the check, but that our policy was to place it on an extended hold.\n\nShe argued, so I offered to attempt to verify the funds with the issuing bank and ask my manager for an exception (only remotely possible if I could verify the funds.)\n\nOf course the (supposed) issuing bank is small with only 2 branches, roughly 3-hours away. I call their customer service and they don't verify funds. Most places don't because its a security risk. If someone has an account number they could just pretend to have a check in hand, ask \"is the account good for it?\" and subsequently get information about the balance on an account they're not on.\n\nSheveryreluctantly let me deposit the check with the hold, then came back an hour later asking to reverse the transaction. Said she found a branch of the issuing-bank 30-minutes away (no she didn't) and would go there. I learned why we had that extended-hold policy, and I expect her account sat unused at the $5 minimum forever. But at least she didn't get $3k from us using a fake check and let the account default.\n\nSocial Security Number Has Been Compromised\n\nA middle-aged man came up to my teller window and handed me a large taped-up Fed-Ex box and said \"I need to deposit this.\"\n\nThat's weird af, and also potentially dangerous, so I immediately asked him why, what it was, and told him to open it himself. He refused and just said \"It's $40k, I just need to deposit it.\"\n\nI called my manager over to supervise and he agreed to open the box together. Inside were 4 bricks of aluminum foil, which of course is even weirder. I asked the member what was up with that, and he said \"Yeah they told me I had to do that to ship it.\"\n\nIn each brick was indeed $10k of strapped 100's. While my manager and I dual-controlled the count (the member was adamant that there has to be $40k exactly, and I kept telling him we can only deposit what's physically here) I asked him what the story was.\n\nHe got a call from 'the IRS' saying his social security number has been compromised, and that he needed to move all of his money into a 'secure wallet'. The callers told him that his account at the credit union wasn't safe, and asked him how much he had. $70k, he told them. They said he needed to ship the money to a PO box in Ohio so the 'FBI' could ensure its safety. They told him this needed to be done in cash, and he needed to wrap each bundle of bills in aluminum foil per 'IRS' policy.\n\nThat's in fact done to attempt to by-pass shipping carrier scanners which try to find these types of things and reject the packages. You're not allowed to ship cash for a reason, after all.\n\nFed-Ex was able to catch this box of $40k and give it back to our member, but they did not catch the other box which has $30k. He lost that money.\n\nWe had a lengthy conversation about the scam, how it worked, and what to look out for in the future. I told him he can always call the credit union at any time if he's unsure about something, as we're trained to spot these things.\n\nI also had a lengthy conversation with the manager of one of our other branches who allowed him to withdraw the money the previous week in the first place, despite knowing it was a scam. He said he tried to convince the member, but clearly he didn't try hard enough.\n\nMillion-Dollar Bill\n\nI have a lot of sympathy for folks who get scammed, as a lot of these ruses are really sophisticated or otherwise obfuscated, leading to confusion. This one though, I just have to laugh.\n\nMember walked right up to my teller window and shoved her phone in my face with a picturelike this, except the bill was in someone's hands.\n\n\"Is this real?\" she asked me. I really tried hard not to laugh.\n\n\"No, that's not real. There's so such thing as million-dollar bill.\"\n\nShe just kinda went \"Hrmph.\" I asked why she was asking, and she told me someone in Africa needed to get rid of it and was only asking for $2500.\n\nI said, yeah, no, that's a scam. Do not buy that. There's no such thing. She asked if I was sure, and I said yes.\n\nThen she called someone on facetime or whatever andheld the phone up to me.\"Can you just tell him that? What you told me.\"\n\nI swear to god I thought this woman was putting me on the phone with some Nigerian scammer. He even looked like he was in a bunker or something. Very flustered, I tried to tell her not to engage with it, its a scam, don't bother. She insisted, \"No, just tell him what you told me.\"\n\n\"Uhhhm. Sir. Yeah, um. I was just telling our member here that there's no such thing as a million-dollar bill.\"\n\nHe immediately grumbles and is agitated, asking how I know. Good lord. I plead with the woman to hang up, not to engage with the scammer, and to please not put me on video with some criminal. She said \"What? No that's my husband.\" and told him \"See, I fucking told you it wasn't real,\" hung up on him and left.",
  "author": "stealth_bohemian",
  "comments": [
    {
      "author": "filthyheartbadger",
      "timestamp": "",
      "body": "Very enjoyable read! And also sad. I hope the next generation of elderly are sophisticated enough to realize taking all the cash you have in the world and wrapping it up in aluminum foil and…..and….etc isn’t a normal way to go about things, but-        dunno"
    },
    {
      "author": "MartinSilvestri",
      "timestamp": "",
      "body": "there will be different scams by then and they will get a bunch of us yea"
    },
    {
      "author": "97Edgewood",
      "timestamp": "",
      "body": "Great read, thanks.See, I fucking told you it wasn't real,\" hung up on him and left.And that cracked me up."
    },
    {
      "author": "songn01",
      "timestamp": "",
      "body": "Probably the longest post I've ever read here, but it was so good it read so fast."
    },
    {
      "author": "mdavis2204",
      "timestamp": "",
      "body": "My favorite quote from the FTC has to be:“If you get a message urging you to deposit a check and wire money back, it’s a scam. Every time. No matter the story.”"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I was a teller and personal banker for eight years and recently transferred to the Fraud department of my bank and I've seen several of these, as well. Jeez Louise we see so much fraud on an unfortunately regular basis. We had a client ship cash recently because we refused to do the wire transfer she wanted once we realized she was being scammed. We will tell people over and over that they are being scammed and do everything we can to stop it, but we can only do so much when they refuse to listen.I've talked to multiple people recently who have told me they just spent two hours or the whole day on the phone with the fraud department and as soon as I tell them no, I'm the fraud department, the light bulb turns on. I can almost hear the moment their gears start turning and they realize they've been scammed. It's heart breaking, frustrating, infuriating all at the same time."
    },
    {
      "author": "stealth_bohemian",
      "timestamp": "",
      "body": "Worked in a similar role, and I will never forget the frustration of trying to convince people they're being scammed."
    },
    {
      "author": "Ok-Cap-204",
      "timestamp": "",
      "body": "I remember reading where a lady came into Walmart with that million dollar bill, bought a bunch of stuff and tried to use it to pay. She was expecting the cashier to give her several hundred thousand dollars in change!  She did not believe it wasn’t real. I think she also had to pay a fee for it to be released to her “custody”."
    },
    {
      "author": "kitaknows",
      "timestamp": "",
      "body": "I'm glad we ended on a funny one to cheer me up after some of the sad ones. Great stories."
    },
    {
      "author": "stealth_bohemian",
      "timestamp": "",
      "body": "Brings back memories of stuff we dealt with in the almost 20 years I worked at a bank. Altered checks and gift card scams were the two I saw most often. Sigh."
    }
  ]
}