{
  "subreddit": "Conservative",
  "post_id": "1i240yd",
  "title": "Pornography age-verification laws get warm reception at Supreme Court",
  "body": "",
  "author": "v7z7v7",
  "comments": [
    {
      "author": "Fit-Judge7447",
      "timestamp": "",
      "body": "Please stop linking pay to read sites"
    },
    {
      "author": "kereso83",
      "timestamp": "",
      "body": "You can read the whole thing here:https://archive.vn/ZyKmpOn 90% of pay-to-read articles, you can just go toarchive.vn, put the article URL into the text field and save and you will get the whole article. If the morbid curiosity to read the New York Times or Washington Post ever strikes you, this site will help if it's behind a paywall.I also use it sometimes on any site that I just don't want getting traffic whether there's a paywall or not. More people should do this."
    },
    {
      "author": "Westwood_1",
      "timestamp": "",
      "body": "The only silver lining is that they should also be warm to voter ID..."
    },
    {
      "author": "TheGame81677",
      "timestamp": "",
      "body": "I live in Tennessee and they just implemented this. I’m against it for a few reasons. Mainly because it’s an overreach of Government. We need less government, not more. Secondly, it doesn’t really stop anything. Pornhub is blocked, but most of the big porn sites are accessible. Plus, you can easily look on X and Reddit and find plenty of porn. It just seems like a big show and a pat on the back by rich hypocrites."
    },
    {
      "author": "General-Gold-28",
      "timestamp": "",
      "body": "Even on the conservative subreddit it’s still Reddit. And Redditors are first and foremost coomers."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Smoll-viking",
      "timestamp": "",
      "body": "I’m against the id to access porn because of the potential power grab that a government can turn it into."
    },
    {
      "author": "Yoinkitron5000",
      "timestamp": "",
      "body": "Please stop handing the deep state easy wins for surveillance. The next obvious step is to go after VPNs."
    },
    {
      "author": "nybadfish",
      "timestamp": "",
      "body": "Also, since when is living in a nanny state a conservative view??"
    },
    {
      "author": "v7z7v7",
      "timestamp": "",
      "body": "The problem that I have with this is where does it stop? What’s stopping a state from requiring an ID to look at a gun website, social media, etc.? There are plenty of things that require a physical age verification, but that information isn’t stored anywhere. This information would need to be stored or require verification every time you go online. I could easily see something like a state saying you can’t access a political campaign website without age verification because you need to be 18 to vote, so access to the website should be restricted to adults.Also, I definitely don’t want to hear anyone supporting this, but opting out of the facial recognition scans at the airport or freaking out over having an Alexa or Rumba in the house."
    }
  ]
}