{
  "subreddit": "VRchat",
  "post_id": "1igy0ul",
  "title": "Thoughts on 18+ Verified",
  "body": "While I absolutely LOVE the fact that accounts can now be 18+ verified. Which allows for 18+ instances and \"should\" put a stop to being asked my age constantly in lobbies. I feel like a ton of people don't realize it's a thing or are too lazy to check your profile.\n\nAlso last night I went to an instance ones by a group named \"Adult Den\". Only thing was everyone there was kids. Maybe 2 other adults were there. Hell the instance (and group owner) wasn't even a verified 18 account.\n\nThey also had no idea it was a thing. I know you need to verify on a PC (I think mobile is an option idk) but it seems Quest users are the ones not that familiar with it",
  "author": "Sanquinity",
  "comments": [
    {
      "author": "bunnythistle",
      "timestamp": "",
      "body": "Currently age verification is only available to VRChat+ users, and since it costs VRChat money per each verification it's unclear if that's going to change in the near future or not. This means that anyone without VRChat+ obviously won't be able to verify without subscribing or getting a gift subscription.Of course, with that feature not being available to everyone, that does limit its usefulness too."
    },
    {
      "author": "Helgafjell4Me",
      "timestamp": "",
      "body": "Pretty sure the plan is to open it to everyone. VRC+ just gets early access."
    },
    {
      "author": "SupOrSalad",
      "timestamp": "",
      "body": "The last few nights I’ve been hanging out in verified only 18+ lobbies, and it’s been a breath of fresh air. Just a bunch of people hanging out like old vrchat. Almost nobody at the mirrors, no kids running around trying to troll. It felt like old vrchat again"
    },
    {
      "author": "zakku_88",
      "timestamp": "",
      "body": "It's technically still in testing phase/slow rollout. I don't think anyone can say for certain how well it works (or doesn't) until it becomes more widely available.My hope is that (when released fully) it not only provides better public spaces for adults, but also helps make it easier to spot predators somehow"
    },
    {
      "author": "abluecolor",
      "timestamp": "",
      "body": "How would it possibly make it more easy to spot predators? Seems like a side effect of this will be making it easier to find spaces with tons of kids. Predators won't be verifying their accounts."
    },
    {
      "author": "Femboy_Go_Beep_Beep",
      "timestamp": "",
      "body": "I think the verification system is going to be a massive improvement to this game with 18+ instances. The best part is that the verification is actually more secure then marketed, you can verify without sending a full id photo. I covered all information on mine except for the photo and date of birth in masking tape and it still  accepted the id. I wish they would market that as a feature so more people could worry less over security, hopefully they will at some point."
    },
    {
      "author": "TunaDawson110",
      "timestamp": "",
      "body": "I was age checked today. Im 18+ verified. Dude told me he doesn't trust 18+ verification because \"there was this kid\" then he got cut off"
    },
    {
      "author": "chyadosensei",
      "timestamp": "",
      "body": "Had the same situation. Maybe same person? They're just are so heart broken with the idea that bouncers will be obsolete with this new feature."
    },
    {
      "author": "smalldroplet",
      "timestamp": "",
      "body": "I was one of the first to get it in the beta and people still harass me about my age verbally at instances when I ask them kindly to look at my profile."
    },
    {
      "author": "Sanquinity",
      "timestamp": "",
      "body": "Honestly at this point if \"bouncers\" don't accept the age verification I simply don't want to be in their instance. Because 1: That means their own \"age verification\" (asking for age) is flawed and the instance will likely have minors in it anyway, and 2: They're likely on a power trip, wanting to be the one to decide to gets to enter. But can't think of other reasons to do so than age.Like, they added age verification specifically to provide a secure way to determine if someone is 18+. If a group doesn't want to make use of it I don't trust that group."
    }
  ]
}