{
  "subreddit": "AusMemes",
  "post_id": "1h1wme5",
  "title": "Now the social media age verification bill has passed...",
  "body": "",
  "author": "[deleted]",
  "comments": [
    {
      "author": "peniscoladasong",
      "timestamp": "",
      "body": "I think VPN exit of Nee Zealand is your best bet. Same pant and relatively same time zone."
    },
    {
      "author": "evilspyboy",
      "timestamp": "",
      "body": "Just for those looking for help, a VPN doesn't mask when you label your posts as in Australia, set your location to Australia and have your age set to under 16. But you can change those now and set your location to Antarctica for example. You can be 99 years old and a penguin.I'm sure everyone knows this but I posted inr/Australiaand I MASSIVELY underestimated how many people knew what a VPN does.Anyway, we now return you to memes to escape the disappointing present reality *sigh*"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Silver_Exam4489",
      "timestamp": "",
      "body": "Joke's on you, this is what swiss readers thought after they read the news from down under:Poll in swiss news app SRFThe majority voted somethig like: \"Yes, Switzerland should follow the Australian example.\""
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "All 1665 of them!"
    },
    {
      "author": "LeWidget",
      "timestamp": "",
      "body": "Dutton wants the use of facial recognition :/. Wonder how that will go down if it gets challenged in court. Surely biometrics comes under privacy laws. Pretty sure I read somewhere a few years back that an employer installed a new finger-print scanner to login/off. It got challenged in a smaller court & found in breach of privacy."
    },
    {
      "author": "zelmazam1",
      "timestamp": "",
      "body": "Just say you are over the age of 16 when making the account like we all use to do when going onto redtube or PH"
    },
    {
      "author": "Donglemaetsro",
      "timestamp": "",
      "body": "You think someone can do that? Just go on the internet and tell lies?"
    },
    {
      "author": "casbott_",
      "timestamp": "",
      "body": "The worst internet in the developed world - if it was installed AFTER Abbott won power. The original NBN was brilliant as it was simply \"Install completely new stuff, and dont use any legacy infrastructure beyond the pathways to lay it in.\" And those that had it installed before Labour lost got a much better service. To the point that a street where the houses on one side of the road were done under the original NBN have a significantly higher value than the equivalent houses directly opposite, that have the Libs Byzantine mess of upgraded old phone line systems with each one having to be a BESPOKE installation... which drives the installers mad.And that's why new connections can temporarily wipe out the NBN on the same line. The original system was plug and play, with a lot of future proofing. But it couldn't be allowed to continue as that would give Labour a win. So Murdoch ran his usual disinformation campaign, and enough suckers fell for it. And the cheaper NBN ended up costing massively more, of course, while delivering much less.That Labour never campaigned on \"They screwed up the NBN ... and killed the car industry\" is a failure on their part however. But then later on, after 2019, \"They ignored the bushfire warnings because the reports mentioned climate change... and then tried to blame greenies, claiming they lit the fires.\"The Australian Labour Party and the American Democrat Party must have a bilateral agreement to advise each other on the worse ways to hit back against Murdoch's propaganda. \"If we're nice to him, maybe he won't be that mean to us again and tell everyone so many lies about us..\""
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "So what are you guys going to do? When you have to give Reddit Some kind of photo ID"
    }
  ]
}