{
  "subreddit": "VRchat",
  "post_id": "1hog6cl",
  "title": "Those who are age verified, what’s it like?",
  "body": "Just curious",
  "author": "RamJamR",
  "comments": [
    {
      "author": "SeraXI",
      "timestamp": "",
      "body": "You click the link, it sends you an e-mail with another link.  You click that link from your phone, take a picture of your ID, then it will ask you to hold the camera in front of your face and rotate it around your head left to right to make sure you are alive.Then it's done.  Badge option becomes available."
    },
    {
      "author": "--an",
      "timestamp": "",
      "body": "The initial roll-out was pretty small with haphazardly chosen groups and I have seen only a few 18+ instances. It will take some time and a proper release for verification to mean anything."
    },
    {
      "author": "ncamp84",
      "timestamp": "",
      "body": "Don’t have to give an age and birthday at the bar worlds now. I just say I’m verified and they look at my profile and let me in. I didn’t go to those kind of worlds before because I don’t like giving that information out to random people on the internet. Plus I’m older and I don’t have to hear all the BS that comes with that when I did say it."
    },
    {
      "author": "nesnalica",
      "timestamp": "",
      "body": "the verification or having the badge on ur profile"
    },
    {
      "author": "Idontmatter69420",
      "timestamp": "",
      "body": "i havent \"used\" it yet bc i dont really visit many instances like that, im usually only with a friend and then with their friends who i dont know personally but we see each other a fair bit and get along pretty well"
    },
    {
      "author": "Pokabrows",
      "timestamp": "",
      "body": "I haven't actually seen a verified instance yet so mostly just a cool little profile badge.The actual verification process with an ID card and your face was really quick and went smoothly. Which I mean is probably a big part of why they went with persona."
    },
    {
      "author": "Uhohspagetti0sss",
      "timestamp": "",
      "body": "I was roleplaying as a barista in a world when it first rolled out and some dude sat down and bragged about his badge and then asked for \"the special\" I then proceeded to give him a cup of iced milk."
    },
    {
      "author": "lilfox3372",
      "timestamp": "",
      "body": "I didn't get checked for age at an event (cool). I got approached and flirted with because I was verified and it's 'okay' (uncool)"
    },
    {
      "author": "Mysterious_Edge3877",
      "timestamp": "",
      "body": "Shiny new tag, other then that go to Age verified instances where you dont have to worry about people below 18."
    },
    {
      "author": "RamJamR",
      "timestamp": "",
      "body": "Which I think helps people below 18 as well.  We have our space, they have theirs."
    }
  ]
}