{
  "subreddit": "MaliciousCompliance",
  "post_id": "bif90k",
  "title": "Don’t have your credit card? No food for you.",
  "body": "This story actually happened on New Years Eve in 2017 so it’s still somewhat fresh on my mind. I used to work for a Dominos in New York. We had to work on New Years Eve and honestly I would have much rather have been home ordering pizza instead of delivering them. Send lots of love to food workers on holidays and maybe give them a little extra tip, it’ll help make their night worth it. Also I’ve omitted the curse words used in this story and changed them to more family friendly words. The night was relatively slow compared to normal, at least until around 10-11pm. I was what you’d call a third shift driver as we typically closed 2-3am in the morning. The only people that ordered this late were either college students, people who are drunk, people who are high, and sometimes all 3 of them at once. At around 9pm I received an order to go to a ladies house that had a dual payment. Most of it was on a card and about $0.10 was in cash. When people were short on cash I would typically forward them the money if it wasn’t too much. It would come out of my tip money but I didn’t mind as I didn’t have major bills at the time. We never got many tips either as at the end of a typical 10 hour shift I’d come out with $15 in tips. For someone to leave $0.10 in cash on a dual payment I had a suspicious feeling they’d become a problem but was hopeful that they simply didn’t have $0.10 in their bank. I’ve been there, I get that. On my way to leaving the restaurant I asked my boss if I really had to collect the $0.10 from the customer, more or less in a joking manner. With a serious tone he said that I would have to have the $0.10 or I’d have to pay for it. As long as the person was kind and didn’t give me much of a problem, I wouldn’t mind forwarding that to them, so I left the store towards their house. I did not expect what was going to happen next. I arrive at the customers house to be greeted by an absolutely adorable kid. He had to be no older than 5 or 6 years old. I told him I’d need to talk to his parents and asked him to tell them to bring their credit card. We had to check the last 4 numbers of the credit cards against the receipt and imprint them onto it as some people tried charging our store back with the bank and having that imprint on the receipt proved we delivered the pizza. Not getting the imprint can lead to termination if there were enough offenses so I really don’t typically like risking that. The kid said okay and ran upstairs. A minute later this rather large lady starts making her way down the stairs and stops half way down. She is followed by at least 8 kids of varying ages. To say the stairs were packed would be an understatement.\n\nFor the purposes of the story CL: Crazy Lady Me: Obviously me DG: Drunk guy\n\nCL takes a stance on the stairs and glares into my eyes menacingly.\n\nCL: What do you want. I don’t a credit card my brother ordered it from one town away. It’s already paid for so give it to me what more do you want?\n\nMe: I’m so sorry ma’am however we require that we verify the credit card and imprint it on to the receipt as it is our stores policy. Do you know how far your brother is from here? I have one more delivery and I might be able to get my managers permission to come back after that delivery to verify the card.\n\nWe don’t get paid extra for gas if we mess up or have to make extra trips for a customer, regardless of the reason. It’s $1 a trip and this customer was not close to the store so this alone was a rather generous gesture.\n\nCL: No he’s too far away. Listen i already gave you my money give me the pizza now! You already took way too long to get here as it is.\n\nMe: As I said prior ma’am I am unable to do that. It is our companies policy to verify cards and I could get in serious trouble if I do not follow this policy.\n\nAt this point she starts getting rather irate. If the card verification ever became an issue, if the customer was nice to me, I would write FLAT on the receipt, indicating the numbers on the card were flat and could not be imprinted. This of course, was against policy, however I’m a nice gal so I would do this from time to time. My boss also never checked to verify if a card was a flat card or not. He only checked to make sure an imprint or the word FLAT was on the receipts when we banked out at the end of the night so I never got in trouble for doing this. There was also not typically an issue as almost all of our customers knew our policy and were readily presenting their cards at the door so I didn’t have to do this too often. So in a way I guess you could call this a malicious compliance. I was not ready to risk anything for some entitled lady.\n\nCL: Give me my flipping pizza how hard is this for you?\n\nMe: I’d be happy to call my manager to see if he’d be willing to make an exception for you if that would be acceptable.\n\nCL: FINE call your fipping manager.\n\nIf a customer had more than 5 orders in our system occasionally we’d grant an exception as long as they never gave us a problem in the past. This wasn’t a written rule but we tried to appease. Also as long as a manager approved, I wouldn’t get in trouble. I take out my phone and call the store. We didn’t have a direct line to our managers we just called the main line like everyone else. My coworker answered the phone. I asked for him to get my manager.\n\nMe: Hey boss I’m at the x street address on my runs and she doesn’t have the credit card used on the order. Can we make an exception?\n\nMy boss checks through her previous orders and she only has a couple on file.\n\nBoss: No make sure to get the imprint. If you can’t get the imprint take the order back to the store. Let me know what happens.\n\nI hang up the phone.\n\nMe: Sorry, but my manager can not make an exception. If you have a different card you can put the bill on or have the remainder in cash I’ll happy finish the delivery.\n\nCL: Are you flipping stupid I don’t have another card to put it on. Call your manager again. Do it now!\n\nMe: I have another delivery to go on now. If you’d like to speak to my boss please call the stores number. I’d be happy to give it to you.\n\nCL: NO I want YOU to call him again.\n\nMe: I just talked to him and his answer won’t change. Do you want the number or not?\n\nCL: fine give me the number\n\nI gave CL the number and waited for my boss to tell her the same thing I did. She absolutely looses it on my boss. She hangs up.\n\nCL: Are you gonna refund my money?\n\nMe: Absolutely ma’am we will refund it tonight. You should see it reflect in your account in 2-3 business days.\n\nCL: I don’t want my money in 2-3 business days I WANT MY MONEY NOW.\n\nShe then proceeds to jump up and down on the stairs like a child throwing a fit. The kids run back up the stairs watching from the doorway.\n\nCL: I want my money NOW. I want my money NOW. Give me my flipping money NOW.\n\nMe: Ma’am please calm down. I can not do that as the 2-3 business days is for bank processing time. We have no control over that timeframe.\n\nCL: I want my money NOWWWW.\n\nAt this point CL starts running down the stairs charging at me. I promptly get off her deck as she slams the door behind me. I’m a bit shaken up as I thought she was going to flat out attack me but I try to brush it off. I start walking towards my car when a guy exits the bar across the street. Remember DG from above? This is where he makes his debut.\n\nDG: Hey why are you taking all that food back to your car? She not want it?\n\nMe: No she definitely wanted it. She didn’t have the credit card used to pay for the order so per company policy I have to take it back.\n\nDG: Say I’m mighty hungry and I got a couple kids upstairs that would probably appreciate some food right now. How much for the food?\n\nI look at the tag we were given containing the price and look back at DG.\n\nMe: It would be $26 and change.\n\nDG: I’ll take it. I have the cash for you right here.\n\nMe: Mind if I check with my boss to verify this okay?\n\nDG: I don’t mind.\n\nI call my boss and he says more or less as long as I get the money for the food he doesn’t mind me giving it to him. DG gives me the money for the food and I unpack it for him on a bench outside.\n\nMe: You don’t even know what this lady ordered and you want to just give me $26 for it right now?\n\nDG: I like surprises I’m sure it’s good.\n\nI give him the food and I return to finish my last delivery. I get back to the store about 30 minutes later. Little did I know, CL saw me give her food to DG and has been calling our store the ENTIRE TIME since I left her house. Me and my coworkers were in tears with laughter as she kept changing her phone number probably using an app and calling to complain. At one point she tried ordering food AGAIN using a different number to the same address. She wasn’t very bright. Moral of the story. Don’t be a jerk to your delivery drivers and use common sense. JG Wentsworth may have done her a blessing.\n\nEdit: I didn’t know the post was going to get so big. Love you guys. I was inspired to start posting some of my crazy stories by a couple YouTubers. Shoutout to Fresh rSlash and Storytime. If you guys read this y’all are awesome. I’ll be posting more to come in the future. I have plenty of stories to share.",
  "author": "[deleted]",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Drunk guy is a bro"
    },
    {
      "author": "TheOneWhoKnocks2016",
      "timestamp": "",
      "body": "bruh moment"
    },
    {
      "author": "RexMcRider",
      "timestamp": "",
      "body": "\"Not getting the imprint can lead to termination if there were enough offenses so I really don’t typically like risking that.\"DEFINETLY.  I spent about 10 years working in Merchant Services on the Merchant side.  The amount of charge backs that can get an account closed only has to reach 1% or 2 %.  And the worst part:  Once that happens, the business, AND the \"business principals\" that signed the application, all get put on the Terminated Merchants File (we used to call it \"Getting TMFd\").  Once a business &/or person has been TMFd, they can't get another merchant account in the US.  Period, end of subject.  You can get taken off of it, but it's a bitch.  That said, pretty much everyone I ever heard about getting TMFd was a crook (and usually not to bright either).So, if you have a business that has goofed but you're on good terms, try and make it right with them another way.If they're hosing you, then charge that sucker back!"
    },
    {
      "author": "monkeyboi08",
      "timestamp": "",
      "body": "It’s good to know charge backs are so effective. I’ve never made one, but I like knowing that I can."
    },
    {
      "author": "everlyafterhappy",
      "timestamp": "",
      "body": "I don't know if this exactly fits here but I liked it enough to give it my approval by clicking on an arrow pointing up."
    },
    {
      "author": "AnDwHaT5",
      "timestamp": "",
      "body": "I figured it was pretty close to fitting and pretty close to not fitting so I figured I’d just post it and if I was asked to move it I would."
    },
    {
      "author": "smokeNgrace",
      "timestamp": "",
      "body": "Is getting an imprint still a common thing? I don’t think I’ve ever had anyone ask for my card to check against the order. It makes sense, just haven’t experienced it..."
    },
    {
      "author": "capgunbean",
      "timestamp": "",
      "body": "\"What do you want?\" \"It's paid for.\" \"Give it to me!\"I'm surprised you didn't ask for the $0.10 when she started that whole stink fit"
    },
    {
      "author": "RexMcRider",
      "timestamp": "",
      "body": "I think that, at that point, the $0.10 took a far back seat to getting out of there alive, and hopefully not being consumed by the Entitled Beast herself."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}