{
  "subreddit": "Dungeonborne",
  "post_id": "1eatm24",
  "title": "Credit Card Age Verification",
  "body": "So I essentially wasn't paying attention to the account creation process and put in my age as a minor. Now the game wants me to verify my age through credit card verification. A bit sketchy, but even once I've done that the game needs additional verification to invite my friends into my game/ use VOIP. Not the best practice in my opinion, and the email verification has still yet to be received 2 hours later.",
  "author": "Ball_Full",
  "comments": [
    {
      "author": "Extra_Compote_7513",
      "timestamp": "",
      "body": "Huh? Where do you live? None of us had to do that from what I know of. Never heard of it at all."
    },
    {
      "author": "Ball_Full",
      "timestamp": "",
      "body": "I live in the states.  The age verification through credit card only happened after I accidentally put in the wrong age. I've only been able to confirm one other instance of this happening whilst doing research trying find a solution for this issue. I tried uninstalling/reinstalling/removing from account nothing has worked so far.  In fact, as of writing this I still haven't received an email verification. Only other means for a solution I guess is going through the support that states having a 72 hour window for response times."
    },
    {
      "author": "Scourge_Azotar",
      "timestamp": "",
      "body": "Isnt the account your steam account?"
    },
    {
      "author": "Ball_Full",
      "timestamp": "",
      "body": "Yeah, it’s through steam. As far as i know it’s because I entered the wrong age so the game flagged my account as a minor, and because it was flagged as a minor it wanted verification through credit card from a “parent or guardian” (their words) giving permission to play the game(which I did with a visa gift card to be safe). It’s a weird way of verifying age/ consent from a legal guardian in my opinion, but that’s their process. There’s additional verification needed even after doing this in order to use voip/ add or invite friends which I’m still unable to do. I’m even unable to see steam friends through the game until this additional verification is done. (They email a code which I still haven’t received)."
    },
    {
      "author": "Hawkryl",
      "timestamp": "",
      "body": "Did you find a solution to resetting this? I was just clicking through and didn't notice until it asked for a credit card."
    },
    {
      "author": "Ball_Full",
      "timestamp": "",
      "body": "nah still no solution other than entering cc info otherwise I suppose you can make a new steam account which I don’t plan on doing. I’ll continue playing dndr instead"
    }
  ]
}