{
  "subreddit": "IRS",
  "post_id": "1jdzuiv",
  "title": "Let Talk about Verification",
  "body": "So essentially the IRS developed this system of needing to verify one’s identity, which would help prevent fraud. On the Surface sounds great, but like almost anything else created by the IRS, it has turned out to be disastrous. But Why ?\n\nFirst, the concept is this, the IRS flags your tax return for whatever reason and places an I.D. hold for verification. The system completely stops processing your return until the taxpayer has successfully Verified themselves.\n\nThe Verification process itself is the problem. They send you a piece of paper through the United States Postal Service (also known as snail mail 🐌) with a 14 digit control number written on it.\n\nWhen you receive the letter, you are to then go online to ID.Me. Where ID.Me requires you to enter your full name, date of birth, full social security number, upload a drivers license, and sometimes a social security card, plus take a selfie to confirm the face matches the verified state issued Identification card you presented.\n\nThen once you have successfully verified your identity, you can now use the ID.Me service with the username and password you created, and enter the 14 digit control number, answer a few basic questions about your tax return, the amount expected, AGI, last 4 digits of the bank account your refund is going to and your done.\n\nHere is the problem. Most people have no clue their return is on an I.D Hold, they receive no notifications, no updates, and nothing even appears on the WMR portal to let them know that. So they are waiting for almost a month and some change. Just to find out, oh they have to verify.\n\nThe letter itself takes weeks sometimes even a month to arrive, and that’s if it even arrives at all. Leaving the taxpayer having to call the ever so busy IRS, and that’s if they can get through. Taxpayers are working a 9 to 5 job, therefore they don’t have all the time in the world to sit and wait extended holds times for the IRS agents to pick up the phone.\n\nAnd the fact we live in the 21st century doesn’t seem to register to the IRS. Keep in mind, you can literally video chat with a person in Hong Kong within seconds, send money to a person in Australia within the blink of an eye, pay for groceries, gas, and bills by just a tap of your phone.\n\nAnd you mean to tell me, this is the best solution the IRS could come up with to verify your identity, in 2025 ?\n\nThe IRS agents say, “well by sending mail to a persons home, that prevents people who have fraudulently used someone else’s information to file for taxes to receive the refund”. Wrong.\n\nThe IRS could simply have people create an ID.Me account, have them verify themselves through that service, and once successfully verified, answer the questions about their tax return and boom 🤯, their done ✅. If they can’t verify their identity, no problem set them up with an appointment to their local IRS office. It is that simple.\n\nBecause here is the reality, in the effort to combat fraudulent tax returns from scammers, majority of all taxpayers are going through extended hold periods for their tax refunds.\n\nIn case you forgot, your tax return was completely paused , meaning the system stopped processing it the moment it put the ID Verification hold on it. So now that’s an additional 2 to 3 weeks bare minimum to complete the verification, and most of that is just waiting around for the letter with the 14 digit control number on it. Now that your verified, the system picks back up where it left off, and now the system has identified a problem. A problem that could have been resolved in the 2 to 3 weeks you were waiting for that verification letter to arrive. But nope 👎🏾, now you have to wait an additional 2 to 3 weeks for that problem to now be resolved.\n\nThe problem is not that taxpayers have an issue with identity checks, and combating fraud. The issue taxpayers have an issue with, is the fact that the system put in place does not reflect that we live in an age of technology.\n\nIt is not ok for single mothers and fathers, taxpayers who paid into the system regularly, and all those taxpayers who look forward to having their refund to pay for much needed services, medical bills, past due rent, or just looking to finally get their heads above water from the sharks🦈 also known as everyday bills. And have them wait an extended period of time, just for an ID Verification, which should only take an hour at best to complete not weeks to a month !!!!!!\n\nYou cannot start a job in this country without the government automatically asking for their share. So just like the government wants their money in a timely manner, with no B.S on the side, the same grace should be given to taxpayers in receiving their refunds and coming up with systems that don’t extend their wait time to receive those refunds, just because you want to combat fraud !\n\nIM DONE ✅",
  "author": "Unlucky-Ad6799",
  "comments": [
    {
      "author": "Neither_Desk_2091",
      "timestamp": "",
      "body": "Everyone who hasn’t received your refunds yet and had to verify online, be sure to call and verify as well because sometimes your online verification will not go through and will hold up processing."
    },
    {
      "author": "Mermaid_Juice92",
      "timestamp": "",
      "body": "Problem is they tell me not to call until AFTER the nine weeks is up. They refused to tell me anything before the 21 days too so I requested letter before 21 days was up and it’s been two weeks on Thursday with no update. They yell at me and tell me I’m in the wrong for even calling because it clearly says to give them 9 weeks and they can’t do anything or tell me anything until then (IDK WHY SOMEONE DOWNVOTE ME BUT MY COMMENT WASNT RUDE NOR WAS I PUTTING ANYONE DOWN THIS IS JUST WHAT IM BEING TOLD!!!)"
    },
    {
      "author": "Unlucky-Ad6799",
      "timestamp": "",
      "body": "So Fun Fact: There is a person or people, who literally came on this post to downvote all of the comments left under it, and also the post itself. The weird part, I’m advocating for you to get your refund in a timely manner.The person is either a person who stalks the IRS subreddit page (waiting for their refund) but has their nose 👃🏽 in the sky like they are so much better than the rest of you.Or an IRS employee, that feels like going hard for the IRS ( which is the same IRS currently firing them by the boat loads) will somehow prove their loyalty to a company that has absolutely no loyalty to them."
    },
    {
      "author": "Cool-College-7095",
      "timestamp": "",
      "body": "Great post. I filed 1/31 accepted 2/1 my transcript was blank so 2/23 I called they told me a letter was sent out 2/20… received letter 3/6 verified identity same day online. Then called 3/12 and verified over the phone bc my transcript was still blank. They asked me a few questions and let me know everything went through. Well my transcript is still blank as of 3/18… I have no code or anything this never happened to me before."
    },
    {
      "author": "Morbid_Joke710",
      "timestamp": "",
      "body": "I filed 1/27/25, verified 2/18/25 nothing updated until last week and I now have a 570 code on my transcript so I called the IRS and they are soooo difficult to get a hold of a human but the lady I spoke with was very nice and as helpful as the stupid IRS system would let her be and she told me that everything looks good on her end - the hold came off my account on 2/21/25 but that is why there is a 570 code on my transcript - because of the ID verification hold which is so stupid - i am praying so very hard I get 846 DDD this week but all she could tell me was it could take the whole 9 weeks  - she said if I do not receive my refund by 4/25/25 then give them a call back theni want to pull my hair out lol. To anyone that hasn't received their refund yet, I will add you to my prayers and begging of the universe that we receive good news this week lol!"
    },
    {
      "author": "Medical-Date2141",
      "timestamp": "",
      "body": "I agree.... last year I had my refund by 2-21..... I just got the verification letter Saturday and did it..... now waiting.... again.... utter bs"
    },
    {
      "author": "Unlucky-Ad6799",
      "timestamp": "",
      "body": "Sorry about the extended wait time, but at least you got the verification out the way"
    },
    {
      "author": "BigTyme420",
      "timestamp": "",
      "body": "I filed 1-18,  processed 2-24 and marked 570/971 3-3,  verified 3-7,  and still no update.  Fingers crossed"
    },
    {
      "author": "SloWi-Fi",
      "timestamp": "",
      "body": "Funding to starve the IRS is a thing.I guess you'd rather have identity thieves running rampant, refunds being paid to BS accounts, and no protection?Better idea is to not rely on a huge refund."
    },
    {
      "author": "Unlucky-Ad6799",
      "timestamp": "",
      "body": "Hey thanks for stopping by, and to answer your question, no not at all. However, I remain solid and firmly on my perspective, the verification process could be way less complicated. The Verification process sounds like we live in the 1990’s opposed to the age of technology in which we do.Fraud has been happening since the hands of time, and fraud will continue to happen until time and the earth itself, stops existing.We are all for helping to combat fraud, but in an effort to combat fraud, it shouldn’t extend wait times beyond normal processing.Every system that is made by the government, is not the best system for protecting people. Sometimes they do get it wrong, people are flawed, correct ? And the same people making these systems are jus regular people.I do not see the problem with questioning the system. In order to improve any process or system put in place by any authority, people must voice their concerns and problems.Because the system of verification was put in place to protect those very individuals against fraud, but it is also causing a significant delay and can be improved. Any system or procedures can always be improved, correct ?But everyone is entitled to their own opinions, and I also respect your position as well."
    }
  ]
}