{
  "subreddit": "amazonprime",
  "post_id": "15x3smc",
  "title": "ID verification needed for refund??",
  "body": "So I have been waiting on a refund for a few weeks now. The item cost me $428. I got the run around from three different chat associates, and in the final message, they said “Because we noticed abnormal activity on your account, we need to verify your identity before we can consider your request for a refund or replacement”. I don’t understand what the abnormal activity is, or are they just trying to not refund me for my item? I’m also not keen on providing Amazon a copy of my license. This was a rifle scope, so I’m concerned Amazon has some kind of a list that I have now made. Only thing I could think of. Any idea what is happening?",
  "author": "opun",
  "comments": [
    {
      "author": "LiLiPootHERE",
      "timestamp": "",
      "body": "Is this me or anyone else has noticed that Amazon prime customer service has become so poor in responding to questions and resolving simple issues that they must not happen in the first place."
    },
    {
      "author": "AbcdefG77703",
      "timestamp": "",
      "body": "Amazon is going downhill fast.  They are outsourcing to other countries more now and the other countries aren't aware of the laws and legalities of other countries they deal with.  They seem to have automated responses they are to copy and paste to the chat if you use the chat.  I dont know if you get better luck calling but they always suggest calling or waiting for a call for 24 hours, its like you took my money fast enough now give it back.  They are experiencing a lot of loss with people cancelling Prime becuase Prime is not even honored in shipping anymore.  And with the holiday season and a lot of returns, they are gearing up to fight everyone so they don't have net loss by all the returns that will end up coming after holidays.  Being a Priome member and paying a monthly fee really doesn't have anything to do with helping anyone anymore."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "AbcdefG77703",
      "timestamp": "",
      "body": "I can tell you what to do that WILL get you results, NO ID needed, NO arguing with Amazon Associates who are rude most of the time:  Report that you sent a return to the BBB on their websitehttps://www.bbb.org/file-a-complaintand tell them Amazon is not refunding you and that they are requesting outrageous private information from you just to get your refund.  Within a day or 2, the BBB will handle it and you WILL get a response and you WILL get your refund that is due you without having to jump hoops with the Amazon Associates.  I have recently had to do this for an item that was first of all shipped LATE.. 5 days LATE to be exact after I pay for Prime to get it within 2 and the date it said it would be delivered was 2 days not 5 days and then after it was shipped it said delivered but it was not delivered, I did not receive it and they were giving me the runaround another 3 days.  So I went to the BBB website and reported them.  Within 24 hours the BBB got back to me SO DID AMAZON and THEY REFUNDED ME within minutes.  So start reporting them to the BBB, do NOT send your ID to them, they do not need this information to do returns and refunds... They refund back to the source that paid them so there is no reason they need an ID or other information to do a refund, thats ridiculous.  Amazon used to be easy to deal with and a great company but lately it is going down hill.  I'll shop other places instead, I am just trying to use up a gift card so I can get off there agian..."
    },
    {
      "author": "pornonporno",
      "timestamp": "",
      "body": "BBB didn't work for me."
    },
    {
      "author": "Ok-Vermicelli1655",
      "timestamp": "",
      "body": "Hey so I made a complaint through the BBB and got this response back from Amazon: I am Vishal from Amazon.com. I am writing in response to a complaint filed on your behalf by the Better Business Bureau BBB - I have provided the BBB with a copy of this message.I've reviewed your email regarding an order placed on our website.Upon reviewing I can see that our specialist team needs to verify your identity before we can consider your request for a refund or replacement. We may also request additional information before granting your request.Amazon takes all security-related matters very seriously and your account security is our top priority. We have policies and security measures in place to ensure that your personal information remains secure.Once submitted, our team will review and get back to you with an update on refund for the mentioned order.I have also forwarded a relative feedback to our business team regarding your experience and they will be reviewing this further.However, we won't be able to provide any further information apart from this.I hope this helps! Have a great week ahead!I have never returned anything to Amazon apart from this so I don’t understand what security they’re talking about. I also don’t feel comfortable providing my ID to them. Any ideas of what I should do?"
    },
    {
      "author": "Flat-Ad-8254",
      "timestamp": "",
      "body": "This “new” policy is exploiting Amazon customers. #1 they don’t send out an email to inform you they need additional documentation because they are hoping you don’t bug them about it and they keep the item and your money. #2 Even if you already sent the item (mine was an $1100 item) back to them, they indicated in the email they do send upon calling, that if you don’t send an ID you forfeit your right to be eligible for a refund (and the item you already return I presume) but that you are able to continue using your account. So, if this were truly about potential fraud, why would they allow you to continue using your account as normal? It seems to me that the only fraud happening here is that Amazon is getting greedy, keeping the return item and money of many unsuspecting customers who don’t know to call and hassle them. I say this is a class action law suit. If anyone is interested in starting that up you have my time energy and effort to help it come to fruition."
    },
    {
      "author": "ExistingAsparagus180",
      "timestamp": "",
      "body": "I was waiting for someone to jump start a lawsuit! I had ordered an item and it came used. I requested a replacement and it was delivered. I took the item to UPS and got a receipt. The receipt doesn’t show a tracking number. Instead, it says “contact Amazon.” I had returned two other replacements because they were either used or broken and had received an email stating that my return was complete. However, on the other items, it’s still showing as “replacement ordered” so I decided to chat with a rep. The first one couldn’t help me for whatever reason so I was transferred. I told the person who I was transferred to my reason for the chat and this person went on to ask which item because there are many.. umm… first of all, I shop on Amazon a lot purely for its comvience and second, it’s not my fault they send out used and broken items. Anyway… The person I was transferred to kept insisting that I would get a refund when my item is received. I kept telling this rep that I wasn’t asking for a refund. I was asking if the item was received by Amazon because I have no way of tracking it (no tracking number is provided). Rep then checked and said there’s a carrier delay. I said ok thanks. - that’s all I wanted to know. Then this pos proceeds to tell me that they aren’t a carrier and that I need to contact UPS. I then asked how is UPS going to help if no tracking number is listed? Crickets! I exited the chat and then I see the email that everyone else is getting. I’m down to sue Amazon. Not only does asking for personal information sound shady, I can almost guarantee that their drivers are stealing packages from one particular warehouse. I had ordered the same item twice because the first one was considered “lost/stolen” as it had been delayed in transit for over a week and the second time I ordered the same item (left the same warehouse as the previous one) was delayed in transit again. It took me 5 tries with 5 different reps to get my refund for it. Mind you, I live in a state where it doesn’t rain nor snow so weather isn’t to blame. Amazon has gotten lazy, greedy and shady with their business practices and I’m getting sick and tired of it. This email was the last straw."
    },
    {
      "author": "Several-Wishbone5330",
      "timestamp": "",
      "body": "Hello All,Amazons behavior is BIZARRE! Perhaps they too many customers.Here's a message from Amazon Customer Service on 11/12/2023 in my Amazon Message Center of the Amazon Customer Dashboard -- See: (1)My reply will follow with this provided their comment field allows enough characters  -- See: (2)============================== (1) ===========================Title: A Message from Amazon Customer ServiceHello,Thank you for contacting Amazon.com Customer service for Order \"X0X0X0X0X0\".Because we noticed abnormal activity on your account, we need to verify your identity before considering your request for a refund or replacement. We may also request additional information before granting your request.You will receive second email with instructions on how to share this information with Amazon. Once you submit your information, it can take up to 3 business days for us to finish our investigation. After this time, you can contact back and we will share the status of the investigation with you and any next steps that we might need to take.Thanks for your understanding.We'd appreciate your feedback. Please use the buttons below to vote about your experience today.Best regards,Amazon.com============================== (2) ===========================Hello Amazon Customer Service,Please forward to: Amazon Director of Customer Service.Please explain why I am not being refunded for the return of a \"TIUIHU Portable Silicone Case for Ricoh Theta Z1 360 Degree Camera\". It was purchased from Amazon on Oct 11, 2023.I returned this product with another product in the same box with the same shipping label as per Amazon shipping instructions.While I opened the Amazon shipping boxes to confirm their contents when I received them, none of the product packages were ever opened by me.The other product in the box (RICOH Remote Control TR-1 for Theta Camera) was successfully returned to Amazon and refunded to my credit card account.These products for return were shipped  to Amazon via UPS on Oct 23, 2023 and were delivered to an Amazon facility dock in LAS VEGAS, NV, US on Oct 30, 2023.There is a UPS \"Proof of Delivery\" document available from UPS.I have a photo of both products in the box just before I sealed it and attached an Amazon generated UPS shipping label. I personally delivered this box to my local UPS store and received a receipt from them.On Nov 12, 2023, I called Amazon Customer Support when I discovered that the returned \"TIUIHU Portable Silicone Case for Ricoh Theta Z1 360 Degree Camera\" was still listed as un-returned in my Amazon customer dashboard.While discussing this matter with an Amazon Support person on Nov 12, 2023, I began to suspect that I might be being scammed for personal information.I believe that the Amazon Support person told me that a government issued ID would be required to prove my identity before a return would be initiated.I will not be sending Amazon.com, Inc. proof of my identity in order to obtain my refund.Amazon is engaging in coercive and privacy invasive tactics.If you choose to refuse my request, I will be filing  complaints with the Oregon Department of Justice Consumer Protection department and the US Attorney General.Please initiate my refund immediately.Thank you.My NameMy Amazon Login Name"
    },
    {
      "author": "opun",
      "timestamp": "",
      "body": "This is complete bs for Amazon to accuse customers of fraud and then demand an ID based off those false accusations. They should be either sued for this or boycotted, maybe both."
    }
  ]
}