{
  "subreddit": "VRchat",
  "post_id": "1h8p7s5",
  "title": "Age verification rumors",
  "body": "Is anyone in a group that is testing the age verification? I know it’s being slowly rolled out to certain groups.\n\nWhat is it like? Is the process easy? Is it accomplishable straight from vrchat? What do you like about it? What do you not like about it?\n\nThere are some nasty rumors going around about the process such as users having to pay for the verification. I’m just wanting some clarity.",
  "author": "SeasaltApple382",
  "comments": [
    {
      "author": "Silvercat18",
      "timestamp": "",
      "body": "It's basically using a phone to send a pic of photo ID and possibly a pic of you for liveliness. Built into vrc, at no extra cost."
    },
    {
      "author": "BigAssDragoness",
      "timestamp": "",
      "body": "Step 1: Stop listening to rumors and reading unverified sources.Step 2: There is no step 2.VRChat themselvesare going to be your best source of information on the process and its implementation. Everything else is hearsay and should be ignored unless provided with a trustworthy, vetted, and verified source."
    },
    {
      "author": "ethiopian1987",
      "timestamp": "",
      "body": "Pirate Software says the exact same thing about people not reading it for themselves, and believing unverified things.From my understanding after watching both videos about it, and reading the FAQs, a third party company who specialise in ID verification will verify the ID and send only your date of birth to VRChat.The service is free and requires an unedited ID card. That is my understanding of it, though VRChat is the utmost source of information on how this works."
    },
    {
      "author": "XxXlolgamerXxX",
      "timestamp": "",
      "body": "You can check a lot of FAQ here:https://ask.vrchat.com/t/age-verification-faq/28458"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "It's verification through Persona. Persona works with multiple companies to verify identification and one of those companies being Square.Persona has never had a major breach and they do not \"get hacked all the time\" as you will try to see people tell you without any proof or links.It costs no money for the end user to verify with Persona.You take a selfie, then take a picture of you'd ID. It's pretty simple."
    },
    {
      "author": "MrDrRandy",
      "timestamp": "",
      "body": "Vrchat released a video talking about this and what it entails"
    },
    {
      "author": "ancoigreach",
      "timestamp": "",
      "body": "If you want to know what is going on with VRChat, you should be in the official Discord, reading the pings, and reading/watching the Developer Updates, and reading the FAQs. Not listening to \"nasty rumours\".Here's a link to the official VRChat Discord:https://discord.com/invite/vrchatDeveloper Update on Age Verification, and the follow-up FAQ:https://www.youtube.com/watch?v=odiNjIFUNvwhttps://ask.vrchat.com/t/age-verification-faq/28458"
    },
    {
      "author": "Demuunii",
      "timestamp": "",
      "body": "Go into a public group black cat on a Friday/saturday night without a kid running up to you demanding your age or you’ll be kicked from the world - mission impossible"
    },
    {
      "author": "Serious_Lifeguard_90",
      "timestamp": "",
      "body": "Finally! Time to kick out kids"
    },
    {
      "author": "SeasaltApple382",
      "timestamp": "",
      "body": "I'm glad this is happening. What a welcome change."
    }
  ]
}