{
  "subreddit": "Indiana",
  "post_id": "1bfdta8",
  "title": "Indiana to require age verification to access porn online",
  "body": "Indiana governor signs into law age verification to access porn online. Law goes into effect July 1st. Gonna be a lot of Hoosiers pissed off at republicans!! But hey, you get to carry around your guns, so there’s that.",
  "author": "_Dyson_Sphere_",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "First they made me drive to Illinois to get my weed, and I said nothing, because I didn't smoke.Then they made me drive to Illinois to get an abortion, and I said nothing, because I was not a woman.Then they made me drive to Illinois for my wank, and there was no one left to speak for me."
    },
    {
      "author": "mjk25741",
      "timestamp": "",
      "body": "Republicans are top tier when it comes to contradicting themselves."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "All those other places have markers on their media that marks them as 18+ where appropriate. Just check the visitors geo location and don't let them access it. I'd be curious if sites don't just block Indiana altogether to avoid getting sued Rockita or some similar nonsense."
    },
    {
      "author": "dpjorgen",
      "timestamp": "",
      "body": "All those other places have markers on their media that marks them as 18+ where appropriate. Just check the visitors geo location and don't let them access it. I'd be curious if sites don't just block Indiana altogether to avoid getting sued Rockita or some similar nonsense."
    },
    {
      "author": "choate51",
      "timestamp": "",
      "body": "Is this freedom?"
    },
    {
      "author": "theferriswheel",
      "timestamp": "",
      "body": ""
    },
    {
      "author": "lai4basis",
      "timestamp": "",
      "body": "I think people who don't understand the Internet should stop legislating it. If you are over the age of 65 you have no business creating tech legislation."
    },
    {
      "author": "Agile-Knowledge7947",
      "timestamp": "",
      "body": "The party of “small government” strikes again and chips away even more at personal freedoms"
    },
    {
      "author": "PrincessImpeachment",
      "timestamp": "",
      "body": "I don't really care much about porn, but it's not the point. It's the principle of it all. Republicans strip away the rights of others whenever they feel it's necessary. If it goes againsttheirvalues, it's BAD and it needs to be banished. They don't care about how anybody else feels on the matter. They're straight up assholes and how they keep getting elected into office just boggles my mind. Conservatives and Republicans are NOT out for your best interests, people. When will this state, hell... when will half of the country get it through their thick skulls?"
    },
    {
      "author": "_Dyson_Sphere_",
      "timestamp": "",
      "body": "For those that may have missed it. Pornhub and Redtube blocked all of Texas due to a similar law. Rather than deal with the bullshit of trying to verify people by their IDs they just said no."
    }
  ]
}