{
  "subreddit": "GameStop",
  "post_id": "16h8bs5",
  "title": "We have to check ID regardless if you look old or not. Do not get mad please…",
  "body": "Long explanation but the summary of it is that at our location we are required to always check ID even if they are of age because of two main reason. Our location; being in a busy shopping center and past issues we have had; specifically children not telling their parents what the game is. Now idk if it’s the same for every district or every store (probably not) but that is what we we are told to do.\n\nNow I myself always found this “new change” odd and a bit exaggerating to say the least but after my manager and my DM spoken to us the team about it and why we push for this policy from here on out I guess in the end it all make sense. Tbh I don’t mind it and don’t care much about it, as long as we make the sale it’s all good. Now we been doing this ever since the year before Covid, since holiday season I will say and I guess I was dumb enough to hope that people will understand. But nope 9/10 times I been yelled at by guests as to why I need to check ID.\n\nI would calmly explain to them why and what the rating system is but they would say along the lines of “but I played ___” or “is just blood and gore” or “don’t I look old enough? im literally ___ years old” Sorry but I am told to check id regardless.\n\nReason why I share this is because a guy came in looking for black ops 3 looked about 30 ish or so years, asked for his ID and he lost it when I said I can’t ring him up for it unfortunately. He almost was about to yell at me until I told him “im really sorry but I’m following procedures that my DM is telling me…“ he ofc calmed down but still called me a b*tch and walked off. Which I have already gone use to myself and I don’t mind if I am thrown insults at once and while. But I ask that guests don’t do it to none of my other coworkers, they are all doing the same procedures I am doing.",
  "author": "devil1fish",
  "comments": [
    {
      "author": "VeryTiredDeer",
      "timestamp": "",
      "body": "When I was still a holiday hire, my store manager was very strict about ID’ing for M rated games. I was working with him and my assistant manager this shift.A woman, clearly in her 80’s, was buying World at War for her grandson for Christmas. I went through the “blood, violence, gore, etc” disclaimer and skipped the pos prompt for ID. My manager steps over and whispers “ID” to me, so I ask for her ID, and she bursted out laughing, causing me and the assistant manager to burst out laughing. In his embarrassment, the SM retired to his desk in the back with a “very well hidden” flask of whiskey he emptied into his coffee.After SM went to the back the woman said something to the effect of “does your manager know that the next time I’ll get id’d is when my family visits me in the morgue.” She, her daughter, and her grandson were regulars, I later found out.I guess the situation made such an impression on her that she’s hand over her license even when buying E rated titles just to fuck with me.This was 2008-2009 so I have my doubts she’s still alive, but I’ll never forget her, even as a complete stranger"
    },
    {
      "author": "GrimmTrixX",
      "timestamp": "",
      "body": "I dealt with this at GS and when I worked at a bank. You'd be surprised how many people don't give a shit if I just gave all of their money to someone claiming to be them without visual proof. Lol"
    },
    {
      "author": "Accomplished_View533",
      "timestamp": "",
      "body": "All I can say is this… bruh 😭😂"
    },
    {
      "author": "DuckSwimmer",
      "timestamp": "",
      "body": "I literally intervened during a confrontation at a bank cause the guy was popping off at the teller because they refused to do anything with his account without his ID. Not one of my most smartest moments cause it was a heated situation at a fucking bank, but I wasn’t going to have a teller, who was being nice as hell, just get fucking dragged because this old ass man didn’t take his license with him despite him fucking driving there. We joked about it after the fact."
    },
    {
      "author": "Due_Raspberry_8521",
      "timestamp": "",
      "body": "One way I used to go about it is that I would apologize and point to the camera and just say I have to check ID since I have it watching me and I luckily never had anyone complain about me checking for their ID."
    },
    {
      "author": "ProfessionRich7883",
      "timestamp": "",
      "body": "Had someone ask me if they could use their friend’s expired id (the friend was not in the store with him) after I told him I needed a physical id to do a trade I told him absolutely not it has to be you and has to be current."
    },
    {
      "author": "09dollface",
      "timestamp": "",
      "body": "Do you guys ID for using points as well? The last time I was in I only bought a plushie (went for something else but wasn't able to get it) but used a ton of points and got asked to show it. I've never had to show it or saw my parents when I would go with them until that point and found it a bit odd"
    },
    {
      "author": "Accomplished_View533",
      "timestamp": "",
      "body": "Technically we are supposed to yes. It’s so that way we prevent any form of theft or fraud. And it sucks to say because I know family shares their account with each-other but unfortunately we have to. Idk how it is for other locations but I know for us, yes."
    },
    {
      "author": "watcherx18",
      "timestamp": "",
      "body": "And this is why I will never again work anywhere that sells age-restricted products. Done enough of that crap in a convenience store. People think showing their ID is inconvenient, but it is just to follow, in your case, the rules. Or in my past case, the LAW."
    },
    {
      "author": "devil1fish",
      "timestamp": "",
      "body": "I have no idea why anyone ever has issues about being asked to show ID. It's an inconvenience, maybe, but one that takes like, 10 seconds to deal with. Just don't be that person"
    }
  ]
}