{
  "subreddit": "Pinterest",
  "post_id": "1309d7h",
  "title": "New teen safety updates (+response from Pinterest team about changing age)",
  "body": "Recently I decided to look through this subreddit as I have been having trouble with the new teen safety update and it appears this is wayy bigger of a problem than I had perceived . Hopefully this could be helpful for anyone with a similar problem!\n\n\n\nContext:\n\nAfter discovering that Pinterest had recently added restrictions on accounts under 16 and 18, I panicked to check my birthday set on my account (as I incorrectly set it back a long time ago while creating the account and never bothered to fix it) only to find that I couldn't change it. I also had problems with being kicked off of group boards and messaging which, yes, is a part of the teen restrictions apparently. This was really frustrating to me as I use Pinterest on the daily and some fun features were just taken away. Since this was happening I contacted them asking about not being able to change my birthday (due to the new update, supposably) and today I have finally gotten a response.\n\n\n\n(response copy and pasted):\n\nHi there,\n\nMy name is Joe and I am here to help you with your request.\n\nWe recently made changes to the features available for teen accounts to make sure we’re helping everyone, especially teens, create a safe, personal space on Pinterest. Even if you’re not a teen, you may see some of the recent changes.\n\nFor now, there’s not a way to change the age on your account. I know this isn’t ideal, and we're working on a solution.\n\nTo learn more about what’s happening, read our approach to teen safety on Pinterest and the settings that are available for teen personal and business accounts.\n\nI realize some of these changes were unexpected and want to thank you for your patience while our team works to improve the experience.\n\nThanks,\n\nJoe\n\n\n\n\n\nPrior to this instance of reaching out to them, I had messaged them one other time relating to a similar issue and I got a very similar response (seems almost copy and pasted.) This probably means that many people are messaging them about it, which is great since it may push them more to fix it. However, both times they have said that they are working on features to fix this issue already so I guess all we have to do is wait it out unfortunately :(\n\nI just wish they released this update better!\n\n\n\n\n\nHere is the first response I got from messaging them btw:\n\n\n\nHi there,\n\nThank you for contacting Pinterest. My name is Carine and I am here to help you with your request.\n\nWe recently made changes to the features available for teen accounts to make sure we’re helping everyone, especially teens, create a safe, personal space on Pinterest. Even if you’re not a teen, you may see some of the recent changes.\n\nFor now, messaging features are only available for people 18 and over. While I can’t turn this feature back on for you, our team is working on updates to make sure you can safely connect with people you know.\n\nTo learn more about what’s happening, readour approach to teen safetyon Pinterest and the settings that are available for teen personal and business accounts.\n\nI realize some of these changes were unexpected and want to thank you for your patience while our team works to improve the experience.\n\nAlso, we're aware that some people are having trouble seeing their followers.(**note, I was having trouble with seeing my followers so that is the main reason I messaged the first time**)\n\nWe're working on making updates.\n\nThank you for your patience while we work on this.\n\n( I will edit this post as needed with any updates <3)",
  "author": "AutoModerator",
  "comments": [
    {
      "author": "Gamerboy_4132",
      "timestamp": "",
      "body": "Honestly getting fed up with them"
    },
    {
      "author": "bunnygirl103",
      "timestamp": "",
      "body": "Have emailed them 4 times within the last month, and have gotten the same response each time. Pinterest used to be my favorite social media platform, but I'm getting pretty dam fed up with it. Absolutely hate it, and hope they'll go back to the way it was"
    },
    {
      "author": "Mako_akuma",
      "timestamp": "",
      "body": "Yup, im starting to get pretty pissed off too now lol 😭"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "We honestly need a new pinterest at this point they pretty much self destructed with this one"
    },
    {
      "author": "ellalol",
      "timestamp": "",
      "body": "We honestly need a new pinterest at this point they pretty much self destructed with this one"
    },
    {
      "author": "toxinemia",
      "timestamp": "",
      "body": "i’m so irritated by this. my 18th passed in april and i just went to update my age, and it simply wouldn’t let me. i’m technically supposed to have all the features right now but because they only had my age and not my birthday when they made this update, my account is limited."
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Get ahead with free online courses.Pinterest Academycovers topics like creative strategy, campaign optimization and more. You’ll get pro tips and hands-on examples to help grow your business on Pinterest.Once you sign up, you’ll be able to access courses from any device. You can start, stop or pause your classes at any time. Each class takes 2-5 minutes. The entire curriculum can be finished in under an hour.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    }
  ]
}