{
  "subreddit": "AvakinOfficial",
  "post_id": "17c18t6",
  "title": "Have to pay for age verification?",
  "body": ".",
  "author": "EducationalRaccoon31",
  "comments": [
    {
      "author": "life_zero",
      "timestamp": "",
      "body": "Dayum wait a minute I missed the part where they said they charged for verification 😭 now idc if I am  age verified or not and if I end up talking with just kids I am quitting but I am NOT paying for this, its a good run for years now finally got the last hint to quit avakin fr 🫡Hard monetising currency for the whole store was something but now you literally gotta pay to play? Plus it's a very good update for creeps who are already sus around kids to identify who's a minor (if you think what I said is vulgar then I know your game better than you) I have seen this app become discord over the years for exact reason you are thinking.I am telling this for like the thousandth time just make it a PAID app LKWD or whoever is incharge yall are not slick with free app with in-app purchases thing 😂 well idc now. I am out."
    },
    {
      "author": "Magicquest213",
      "timestamp": "",
      "body": "Yes, it’s 5.49 for each account."
    },
    {
      "author": "Mean-Information-584",
      "timestamp": "",
      "body": "Why tho? Don't we pay enough already with in game purchases? We haven't even had an adequate halloween update for goodness sake!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Why do we have to pay for this? Don't we pay enough with how expensive the game is sheesh"
    },
    {
      "author": "avakinveteran",
      "timestamp": "",
      "body": "😐"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "5.49 usd per account you'd like to verify though the exchange rate might differ depending on your country"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "to be clear, you can use the ONE-TIME FEE for more than ONE AVAKIN Account you own and control.I.e. avakin players with more than one account can use this one time fee ONCE, to confirm all their accounts"
    },
    {
      "author": "diamondz_ava",
      "timestamp": "",
      "body": "Yes"
    },
    {
      "author": "TheNoOneIsMe",
      "timestamp": "",
      "body": "To add on to what Magic answered here is theFAQ about Age Verification on Avakin"
    },
    {
      "author": "EducationalRaccoon31",
      "timestamp": "",
      "body": "Will this restore my 18+ items they have taken from my account while I took a break for the last few months? I’m missing so many things"
    }
  ]
}