{
  "subreddit": "VRchat",
  "post_id": "1j9dt4z",
  "title": "Age Gating instances (Verified)",
  "body": "Can someone fill me in on the thought process behind these squishy brained people.\n\nAge verification has rolled out for VRC+ peeps like myself. We have 18+ instances.\n\nWhy are PUBLIC instance owners not accepting that the Age Verified 18+ badge is enough. Six different worlds tonight and I’m met with “AgE n DaTe Of BiRtHsnort”\n\nThere’s a whole process, is it just some smooth brained thing I can’t understand? Someone explain it to me please.",
  "author": "yandeere-love",
  "comments": [
    {
      "author": "VenomousKitty96",
      "timestamp": "",
      "body": "Because people really think some kids gonna have their parent age verify for them and lie.But if a kid is going to go through that much effort to get verified whats gonna stop them from lieing about their age in the lobby too when asked.Mostly seems like an excuse to power trip."
    },
    {
      "author": "ScienceAndLogic-",
      "timestamp": "",
      "body": "FR every time i join a lobby that asks i say “I’m age verified look on my profile” they either get snarky or let me in"
    },
    {
      "author": "AryaDRed",
      "timestamp": "",
      "body": "People power triping and them not looking into the profile first, its not visible without.If some one asks i say im verrified and if they insist and power trip i leave, that conversation is not worth my oxigen"
    },
    {
      "author": "LigerXT5",
      "timestamp": "",
      "body": "Same here. Wife (VRChat Mute and Desktop) and I visit a number of bar worlds, and we're asked and we state we're 18+ Verified, welcome to check our profile. Half the time, they don't and repeat the question. We shrug and leave.She's even gone as far as having her age and birth date in her Bio.What really annoys them, Sunset Bar, you can verify on their site, and just walk through the gates."
    },
    {
      "author": "allofdarknessin1",
      "timestamp": "",
      "body": "So I went to an event tonight. Kind of newer player joined while I was waiting in security. They tell him he’s not verified in the server and even joined it. He said he’s age verified. They explain some kids got access to their parents id card and verified, so because of that they the guy has to join the server and verify with his id. He says he’s been buying beer for over a decade and tells them he’s not doing all of that now but will do it for next time. And left. I had to fight the urge to tell them a few kids getting verified isn’t enough and probably never happened and that this is all bullshit"
    },
    {
      "author": "Midnight_Myth",
      "timestamp": "",
      "body": "\"They explain some kids got access to their parents id card and verified\"\"the guy has to join the server and verify with his id\"Always find that logic of those people funny. Some kid was able to get the id card and circumvent the system, where you have to make a biometric scan. This same person definitely won't be able to just bypass the \"check\" on the server the same way."
    },
    {
      "author": "TotallyUnInvisable",
      "timestamp": "",
      "body": "it's because people think you can circumvent the verification so they do it just to be \"sure\"or at least it's what I hear most of the times.sure it might be possible to circumvent the verification process or by using a parents account.but also in my eyes it's just stupid to ask when someone enters a 18+ instance where you need to be verified to begin with.to moderators of such 18+ verified instances in my opinion put in the rules of the group that if it's been detected you lied about your age or circumvented the verification process you will get banned from entering the group and instances associated with it,then you don't have to constantly ask it and it probably makes the time of the moderators also a more fun and easier time by hanging around the other people instead of constantly asking for age and dat of birth."
    },
    {
      "author": "smalldroplet",
      "timestamp": "",
      "body": "Nah, they just power tripping. Move along."
    },
    {
      "author": "According-Stage-8665",
      "timestamp": "",
      "body": "I've stopped going to bar worlds and other ones cause of it. Some of them are so fucking cocky when they tell you they don't accept it to. Me being age verified is essentially the same thing but better cause at least you can trust it more. It's all dumb."
    },
    {
      "author": "yandeere-love",
      "timestamp": "",
      "body": "That's strange and frustrating. Possible theories come to mind:They've been bitten by mishandling minors and now they're paranoid (unlikely, asking someone's DOB is weaker verification than VRC's new age verification processPotential grooming? Do you have a voice that sounds young-ish perchance?Power trip, some moderators let a tiny amount of power allow them to ffeel like gods"
    }
  ]
}