{
  "subreddit": "technology",
  "post_id": "1gtefsb",
  "title": "No-one's really sure how age verification will work on under 16s social media ban",
  "body": "",
  "author": "UnacceptableUse",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "a lot of money will be spent on researching it, and they will find its not practicalthen it will lead to digital ID's for everything., then no more anonymity."
    },
    {
      "author": "GeneralZaroff1",
      "timestamp": "",
      "body": "This is the real reason. Digital IDs for everything, similar to China."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "vriska1",
      "timestamp": "",
      "body": "More likely they drop the whole thing."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "One thing I’ve learned from my teenagers is that they figure out how to circumvent any technology fairly quickly. Hacking is a life skill is this age."
    },
    {
      "author": "DiscardedMush",
      "timestamp": "",
      "body": "Boobs are great motivation!"
    },
    {
      "author": "ValveinPistonCat",
      "timestamp": "",
      "body": "It's a Trojan horse to push for digital ID so they can control what we're allowed to see and punish critics.The internet is no longer the wild west it's been taken over by tech and media oligarchs, and governments have always hated people having a platform where they can freely criticize their leaders the only difference between authoritarian and liberal countries is whether or not they can say the quiet part out loud.Any time a politician screams \"THINK OF THE CHILDREN!!!\" it's never actually about the children."
    },
    {
      "author": "djdeforte",
      "timestamp": "",
      "body": "Probably as good as it did when I was 12 looking at porn in late 90’s on the internet."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "UnacceptableUse",
      "timestamp": "",
      "body": "I don't understand why they can't just do what they do with under 13s who are already banned from social media?"
    }
  ]
}