{
  "subreddit": "onguardforthee",
  "post_id": "1fix18g",
  "title": "Age-verification laws won’t protect kids from porn – and they could even make things worse",
  "body": "",
  "author": "GenericFatGuy",
  "comments": [
    {
      "author": "woodst0ck15",
      "timestamp": "",
      "body": "Man this was something that is still making me question if I want to vote NDP or not. Cause this has always been an issue and age verification laws don’t really work as kids will always find ways to try and skirt around blocked content they want."
    },
    {
      "author": "viewbtwnvillages",
      "timestamp": "",
      "body": "also the fact that depending on the wording of the bill and how vague it is its entirely possible itll block and stigmatize things that arent porn, like lgbt+ content or content regarding reproductive health"
    },
    {
      "author": "Low_Attention16",
      "timestamp": "",
      "body": "We also could never trust these companies with our children's data. Not without strong regulation and severe consequences for data breaches. With this data, attackers could be using our children's credit years before they come of age. This is why schools are such big targets for data beaches."
    },
    {
      "author": "Bleatmop",
      "timestamp": "",
      "body": "I find it hard to recognize the party anymore."
    },
    {
      "author": "SilverSpaceAce",
      "timestamp": "",
      "body": "Forgot to include this initially but here's a non-paywalled link:https://archive.is/YTmU1I would like to bring up that the Conseratives are going to be proposing their own alternative to Bill C-63 soon, as revealed here by CPC MP Michelle Rempel Garner:https://michellerempelgarner.substack.com/p/the-bill-to-protect-canadians-onlinewhich she claims is the legislation the Liberals should have introduced.According to her, this proposed legislation would require online operators to:Implement privacy-preserving and trustworthy age verification methods (for example, computer algorithms that ensure reliable age verification) to detect when a user is a minor and to restrict access to any content that is inappropriate for minors to such users while expressly prohibiting the use of a Digital ID for these purposes;The CPC are absolutely all in on wanting to erase Canadian's internet privacy while also claiming to be the only party fighting against any encroachment on it. It is shameful to see the NDP standing alongside the CPC in support of S-210 and I really don't care if it was just so they could hear what experts had to say about it, as some have claimed.I don't believe I can link it directly, but OpenMedia has an automated petition that once you fill it out emails your MP about S-210:https://openmedia.org/It might not accomplish much, but doing something is better than nothing."
    },
    {
      "author": "TragicRoadOfLoveLost",
      "timestamp": "",
      "body": "Cool. More surveillance wrapped in bullshit \"for the children\". Kids been looking at porn forever, they'll be fine for fucks sakes."
    },
    {
      "author": "The_T0me",
      "timestamp": "",
      "body": "Right? Education is way more important than trying to put up another wall around it.There's way more of an issue with teens taking and sending each other nudes, and there's no way to block that with age verification laws."
    },
    {
      "author": "queenringlets",
      "timestamp": "",
      "body": "If this comes to pass I’m sure as shit not uploading my ID to get eventually leaked. I recommend nobody comply with this either if you don’t want your identity stolen."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "GenericFatGuy",
      "timestamp": "",
      "body": "The things we suffer, so that parents don't have to do their jobs."
    }
  ]
}