{
  "subreddit": "Veterans",
  "post_id": "15eq3e9",
  "title": "VA website verifying state issued ID",
  "body": "Hello all, I’m currently applying for education benefits in the VA website. When trying to upload my state issued ID I’m always met with the same answer of “can’t verify ID” and now I’m locked out for 6 hours before I can try again. Has anyone else had similar problems or know a solution to getting your ID through?",
  "author": "Mother_Astronaut1252",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »'Have you looked in theWikifor an answer? We have a lot of information posted there.To contact VA Education, 1-888-442-4551, forVoc RehabVR&E (Veteran Readiness and Employment Program) assistance with appointments or problems with your Case Manager (not for missing payments): 1-202-461-9600.Payments for certain education benefits (DEA, VEAP) are paid at the end of the month you attend school - Department of Treasury issues these payments using a 10 business day window - these payments are not locked into a specific day of the month like VA disability/military pay is. For Voc Rehab missing payments, contact your Case Manager or your local **Regional OfficeFor Post 9/11 GI Bill only, If you signed up for direct deposit when you applied for education benefits,we’ll deposit your payment into your bank account 7 to 10 business days after you verify your school enrollment.This is the fastest way to receive your payment.Text Verification FAQMGIB and MGIB-SR have to do monthly verification threw theWAVE programand you should receive the payment within 3 to 5 business days.For Online Only training, the Post 9/11 GI Bill is currently (1 August 2022) paying $938.50 for those who started using their Post 9/11 GI Bill on/after 1 January 2018 and $988 for those who first used their Post 9/11 GI Bill benefits prior to 1 January 2018 - this is based on 1/2 of the National Average BAH paid to an E5 with dependents. Post 9/11 GI Bill MHA rates are adjusted 1 August of each year and are based on the 1 January DoD BAH rates for that year -so VA can't use 1 January 2023 BAH rates until 1 August 2023- for those who started training on/after 1 January 2018, the MHA rates are 95% of the DoD BAH rates.For VR&E, there are two different Subsistence Allowance programs -https://www.benefits.va.gov/vocrehab/subsistence_allowance_rates.aspThe P9/11 Subsistence Allowance is based on the BAH paid to an E5 with dependents. Those who started using VR&E on/after 1 January 2018 receive 95% of the BAH paid to an E5 with dependents. As of 1 January 2023 Online only students using VR&E are being paid $1054.50 if they started using VR&E on/after 1 January 2018 - those who started using VR&E prior to 1 January 2018 are being paid $1110.00 per month. The CH31 Subsistence Allowance rates are adjusted 1 October each year by Congress.VA Education is going paperless - make sure VA has a current email address for youFor FREE math Tutoring - contacthttps://www.armysmart.orgVA Award Letter explainationI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "IronRanger1-16INF",
      "timestamp": "",
      "body": "Happen to me .. Use a solid black back ground. Put you id on it and be careful of the lighting. I think used the flash on my phone. Good luck"
    },
    {
      "author": "SCOveterandretired",
      "timestamp": "",
      "body": "Are you trying to create a DS Login or Login.gov account? If so, go to the nearest VA Hospital and they will have someone assist you"
    },
    {
      "author": "Jacksonrogue02",
      "timestamp": "",
      "body": "I went to the post office, they were able to verify it there"
    },
    {
      "author": "GulfCoastLover",
      "timestamp": "",
      "body": "I once had problems with authentication on the VA website. I had to drive from Pensacola, Florida to the Biloxi Mississippi VA just to have somebody verify my ID in person."
    },
    {
      "author": "Mother_Astronaut1252",
      "timestamp": "",
      "body": "Well I guess the weekend trip to visit my mother in Gulfport will be worth it."
    }
  ]
}