{
  "subreddit": "google",
  "post_id": "xmpj12",
  "title": "I AM NOT ABLE TO VERIFY MY AGE",
  "body": "I am not able to verify my age\n\nI live in India\n\nI am not able to verify my age\n\nI went to :https://myaccount.google.com/age-verification\n\nbut it is showing -\"Verification isn’t available for this account. Try again with another account.\"",
  "author": "Icy_Mulberry_4427",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "That isn't the same thing. He is talking about age verification, where as you sent a link about verification prompts. I'm currently trying to figure out how to permanently share my location through google maps, and the only thing I have found isthis. There is a section talking about what to do if you are having issues sharing for more than 24 hours and it tells you to go to thisage verificationlink.I get the same screen as he does when going to that link. The only things I can find relating to it are this post and thisgoogle account helpresponse stating that they know it's an issue, but they don't have a timescale for when they think it will be resolved."
    },
    {
      "author": "GarysSquirtle",
      "timestamp": "",
      "body": "That isn't the same thing. He is talking about age verification, where as you sent a link about verification prompts. I'm currently trying to figure out how to permanently share my location through google maps, and the only thing I have found isthis. There is a section talking about what to do if you are having issues sharing for more than 24 hours and it tells you to go to thisage verificationlink.I get the same screen as he does when going to that link. The only things I can find relating to it are this post and thisgoogle account helpresponse stating that they know it's an issue, but they don't have a timescale for when they think it will be resolved."
    },
    {
      "author": "White_raven1467",
      "timestamp": "",
      "body": "Its still not fixed anyone found a way to fix it yet"
    },
    {
      "author": "Delta-Zone",
      "timestamp": "",
      "body": "just turned 18"
    },
    {
      "author": "TT_fwsketch",
      "timestamp": "",
      "body": "Can someone please reply how to fix"
    },
    {
      "author": "SimiReditt58",
      "timestamp": "",
      "body": "FOR ANYONE STILL UNABLE TO DO THIS, I'VE FOUND THE SOLUTIONYou need to go to Personal info -> Birthday in Google Account, select \"Anyone\" for \"Choose who can see your birthday\" AND turn on \"Also show year to people who can see your birthday\". Afterwards the age verification thing should workAfter successfully verifying, you can change the birthday privacy settings back to \"Only you\""
    },
    {
      "author": "Chillypepper14",
      "timestamp": "",
      "body": "It doesn't give me this option"
    },
    {
      "author": "robcxyz2",
      "timestamp": "",
      "body": "Anyone else here for signing up for Bard which now requires age verification?  This is insane that google has been letting this bug simmer for so long.Couple issues all from the last 6 months -246 votes/105 votes/41 votes"
    },
    {
      "author": "Icy_Mulberry_4427",
      "timestamp": "",
      "body": "I have the same problem anyone found a fix???"
    }
  ]
}