{
  "subreddit": "onlyfansadvice",
  "post_id": "16h0xwh",
  "title": "✨ A full checklist: How to get started on Only Fans ✨",
  "body": "Context:I see SO MANY GIRLIES asking how to get started that I felt inspired to write up the beginner's A-Z how-to guide I wish I had when I first entered the space. This community already has a ton of great advice but I tried to add more detail on things I personally struggled with, and combine it all into one place :) for context, revenue last month was ~$27k and trust me I have made my share of newbie mistakes lol.\n\nAlso, totally selfishly, I am hoping this helps cut down on the amount of people asking the same question so I can see more advanced questions to learn from 😇\n\nPlease note: All tools or resources linked in this post are from others who work in the industry unless specifically noted otherwise. I’ve chosen sources carefully because most “guides” online (aka the ones you find by searching on Google) are written by companies or people who clearly are not present in the space, so the advice is quite surface-level and tbh not helpful at all.\n\nBefore you can sell anything, you need to verify your identity and bank account. Do this first, as it can take a few days to get approved. You’ll need to submit a photo ID, your real name, social media and link a bank account. This information is used for verification purposes only and won’t be linked to your account publicly. I’ve read that linking your personal social media makes it easier to get verified, so try that if you’re having trouble getting verified with your work social media accounts.\n\nOptimizing your profile is essentially just the act of setting up the customizable parts of your profile to compel people to subscribe & buy content.\n\nProfile photo & banner images —>Upload high-quality images that give users a great indication of the wonderful content they’ll receive if they subscribe. For the banner image, I recommend making a collage of multiple images rather than uploading just one. Having multiple alluring images on your profile increases the chances that a viewer will resonate with one of them. If you don’t have access to Photoshop,Canvais a great free tool that you can make collages with.\n\nHide your likes & followers count —>When you’re a brand new creator, both of these will be 0. This is a bit of a red flag for potential subscribers, so it’s better to turn this off until you have numbers here that you’re proud to show.\n\nDecide if you want to be a free page or a paid page.This is a whole discussion in itself, but a simplified way to look at this is:\n\nFree page =you’ll get more subscribers because the barrier to enter is low (free), but your conversion rate of subscribers who buy things will be much lower. In my opinion, this works well for social media influencers or celebrities who can more easily get tens of thousands of fans, and only need to get 0.1% of them to buy something, in order to make a lot of money.\n\nPaid page =you’ll get less subscribers because the barrier to enter is higher (not free), but your conversion rate of subs who buy things will be higher. This happens because free subscribers will not be there to bring the conversion rate down, and there are plenty of marketing studies that show people who have already spent money are more likely to continue spending money. In my opinion, this works better for people who do not already have a huge social media presence.\n\nA mathematical way to express the above is:\n\nA free page may have 20,000 subscribers, and only 1% of them purchase $20 of ppv each month. That amounts to $4,000 in monthly revenue.\n\nA paid page has 500 subscribers, each paying a $20 subscription fee. That’s $10,000 in monthly revenue.\n\nYou’re welcome to adjust the numbers and conversion rates based on what you think your performance and cost would be! Personally, I would rather focus on figuring out how to get 500 paying subscribers, than 20,000 free subscribers.\n\nBio —>What you write here is crucial to getting fans to subscribe. This is an at-a-glance space for you to let fans know what to expect if they subscribe. Proper grammar is a must, and I recommend formatting your writing in a way that’s easy for somebody to digest at a glance. Hype up everything that fans will get for free, to make subscribing a no-brainer for them. Look at what other creators inside & outside of your niche write in their bios, to get a sense of what fans are used to seeing.\n\nWelcome message —>Your welcome message is an incredibly powerful tool to utilize because fans will receive it when they’re incredibly engaged with you: the second they subscribe. There is no “right way” to utilize this tool, but you should be aware of how valuable it is so you can make an informed decision on what to include in your welcome message. Whatever you decide to put here, there should be a strong reason for your choice. Some examples are:\n\nIf you’re new and don’t have many likes yet, ask fans to like X number of media items in exchange for a freebie.\n\nIf you want to figure out which social media platform results in the most subscribers, ask fans to tell you where they came from in exchange for a freebie.\n\nAsk them a series of intimate/fun questions to get to know them better, so you can excel at the GFE they’re here for.\n\nA wonderful suggestion from u/stacey_hot_momis to make sure you have DRM protection turned on. This prevents your videos from being recorded, BUT it only protects videos that have been uploaded after you turn DRM protection on. Turning it on in the beginning will protect all your videos moving forward, so don't procrastinate here!\n\nTo turn it on, go to your OnlyFans settings --> privacy & safety --> enable DRM video protection.\n\nThe fear of having your content used without your consent is real. If you want to take extra precaution, there are services that will help you detect & remove content that’s been reposted without your approval. Just google 'nsfw copyright protection' or something similar!\n\nUnder “Privacy & Security” you can block the area that you live in if you’re worried about friends and family seeing your content.\n\nSocial media apps like Instagram & TikTok will prompt you to sync with your contacts. If you allow this, it’s much more likely that your accounts will be recommended to your friends and family, and that they will be able to find you by searching your phone number.\n\nI can't say for sure if denying this consent actually stops apps from recommending you to your contacts or blocked locations (a hot take on TikTok is that they actually don't respect consent or privacy at all, hence why so many countries are trying to ban it.). Be mindful that with TikTok in particular, if you send a random video link (not your video, but one from your feed) to your friends, when your friends click on that link it will prompt them to follow your account.\n\nThe level of care you use here is totally up to you: some people use entirely separate phones and VPNs, others sign up with emails instead of phone numbers, while some may not be bothered by this at all.\n\nMake sure you have a good understanding of what is and isn’t allowed on the platform. Here is a great chart of regulations and restrictions, courtesy of u/moonbunny360, created by twitter.com/sophie_ladder.I suggest reading the rules thoroughly yourself as I’m not sure when the above chart was last updated, but a few things to note that I didn’t realize in the beginning are:\n\nThere are many restricted words that you cannot use anywhere (profile, chats, etc)\n\nYou are not allowed to meet up with people in real life, even other models for collaboration. If you’re doing any meetups, never discuss them on the platform.\n\nYou are not allowed to sell worn clothing, new clothing is fine. (Aka sell used panties at your own risk.)\n\nYou’re not allowed to receive payments on other platforms (for example, Cashapp). If you must receive money in another way, just ask the user to DM you on Instagram or Twitter to discuss details.\n\nCreating explicit content in public is not allowed.\n\nAny other person who appears in your photos or videos must complete a verification process and be tagged in every single piece of content they appear in. Failure to do this will get you flagged almost immediately.\n\nYour media library is the amount of posts, photos, and videos you’ve shared on your wall. People who see your profile will look for these numbers to get a sense of how worth it they feel it is to subscribe to your page.\n\nThis quick judgment happens regardless of if you have a free page, or a paid page.\n\nIf you’re a free page,very little media means there’s nothing there to entice them into subscribing to see more.\n\nIf you’re a paid page,very little media makes a potential subscriber feel like they wouldn’t get their money’s worth.\n\nThink about it from your own perspective: would you rather subscribe to somebody (free or not) that has 10 pieces of media, or someone who has 300? What would make you more excited?\n\nMedia count is SUCH an important element of perceived value when it comes to your profile, so try to get to 100 media items as quickly as possible, with at least 50% of them being videos. This should be your #1 goal for as long as possible until you reach this number. 100 items is the bare minimum for how much content people are expecting to see. Once you reach 100 items, you can begin focusing more on social media and marketing. Once you reach 200+ items, adding new media can be your second priority, with social media and marketing becoming your new priority #1.\n\nThere is no “best social media platform” that works for every single page. What works for you and your content might be the opposite of what works for somebody else. So, it’s important for you to figure out what works best for you, so you can have confidence that you’re dedicating time to the right platform for you.\n\nFor the paid page I’m focusing on, the self-reported breakdown of paid subscribers looks like this:\n\nInstagram —> 52%\n\nTikTok —> 17%\n\nReddit —> 16%\n\nTwitter —> 12%\n\n“I don’t remember” —> 3%\n\nAgain, this will likely be totally different for you, but seeing the above should help illustrate a key point:don’t focus on just ONE platform, test out your content on many.In the above example, if I was to completely ignore posting on Reddit, monthly revenue would drop by 16%.\n\nThe recipe for success comes down to developing an intuition for what kind of content is more likely to do well. To develop this intuition, you need to actually study what kind of content succeeds within your niche and learn how to create similar content.Seriously, succeeding on social media is not a yolo endeavor,you should be actively looking at how others succeed and learning from their success.\n\nIf you’re brand new to the space, or to marketing in general, you probably won’t have great intuition about what works and what doesn’t. Basing your ideas off of other people’s success will allow you to develop this intuition much more quickly than if you were just guessing what you think people will like.\n\nUnfortunately, Instagram is not very SW friendly, but understanding the rules will help you know how to succeed within them.Here’s a great article, \"How to survive the great shadowban” by Paulina Bachlakova on how Instagram’s community guidelines have changed over the last few years, and how this impacts SWers.\n\nCheck out this guide by u/kitty_neon here, “Promoting on Instagram: shadow banning and how to avoid it”.\n\nSome additional things to keep in mind for Instagram:\n\nBecause Instagram is not particularly SW friendly, you are far more likely to be flagged if you seem like an “obvious” SWer compared to if you’re an average girl who just likes to post photos in bikinis sometimes. It’s not fair, but there are ways to succeed within these constraints.\n\nDon’t ever link directly to OF, set up a Linktree and put that link in your bio instead.\n\nDon’t ever use explicit or soliciting language\n\nDon’t ever mention OF by name\n\nCreate a backup account and post to it as well, so that you don’t lose all of your Instagram traffic if your main account gets banned\n\nBecause TikTok is so quick to totally ban your account for breaking rules, the most classic advice for succeeding on TikTok as a SWer is “don’t be a SWer on TikTok”. What this means is find creative ways to show off your unique qualities beyond thirst traps. If you’re not sure how to do this, find SWers that perform well in the subreddits you follow, go to their bios, and look for their TikToks.\n\nIn terms of actually creating content that succeeds, many creators think they’ve been shadowbanned when they’re actually simply not creating content that the algorithm prefers. Many reputable publications and creators have written about how TikTok's algorithms work - you can just Google this to read about it :)\n\nSome additional things to keep in mind for TikTok:\n\nDon’t ever link directly to OF\n\nLink toanysocial media platform at your own risk. There are two schools of thought here: some people think it’s perfectly safe to link your Instagram or Twitter account, and others believe linking anything at all makes your account more likely to be flagged as a SWer. There’s no definitive proof for either side, so link at your own risk.\n\nIf you don’t link to other social medias, use your bio text space to cleverly hint at where viewers can find exciting content. This writing must be subtle, and NOT explicit in any way. For example, “my username is X on every single platform 😇”\n\nCreate a backup account and post to it as well, so that you don’t lose all of your traffic if your main account gets banned.\n\nIf you do get banned, not all hope is lost!Here’s a Reddit post on how u/curtygeexxx got her TIkTok back after being banned.There are also services that you can pay to get you unbanned - it sounds sketch but I personally know 2 creators who have done this. It costs about ~$2k and worked in about a week. Be careful of scammers and only use TikTok unbanners that come from recommendations of people you trust!!\n\nReddit can be a goldmine for SWers because of how subreddits work: there are so many people centered around incredibly niche interests, all eager to consume new original content. Reddit is so complex that it's worth setting time aside to focus on. Here's a super comprehensive guide I submitted in another post on Reddit:I hope it helps!\n\nSomething that sets Twitter apart from other social media platforms is their algorithm transparency. On most platforms, the algorithm is a mysterious set of rules that govern what kind of content gets pushed to people’s newsfeeds. On Twitter, the algorithm is actually open source: anybody can look at the actual code and analyze it.\n\nI haven't seen any SWers in particular analyze Twitter's algorithm, but there are so many tech creators and engineers who have written guides based on their analysis of this code. I enjoyed reading the breakdown from this particular account with 150K+ followers:Here is exactly how your tweets are ranked. He’s not the only person who has done this analysis though, feel free to look for others and see what you find.\n\nSome additional things to keep in mind for Twitter:\n\nThe algorithm favors tweets with videos or images attached\n\nTweets with links (even in threads or replies) get deprioritized\n\nTweets with multiple hashtags get deprioritized\n\nUnlike other social media platforms, Twitter does not prohibit users from putting their OF link directly in their bio. It’s unclear whether this has a negative effect (for example, suppressing tweets) so you can also link to your Linktree instead\n\nBe careful of interacting with users in your DMs in an explicit manner, since users do not have to be 18 in order to make an account. Best practice here is to direct people to your OF, where you know they’re of age.\n\nTake these as lessons from somebody who has spent far too much time chatting with fans ~\n\nNever, ever, send custom content without being paid upfront. Anybody who says they’ll “pay you afterward” will 100% not pay you afterward.\n\nSometimes, people will want to tip you for 99% of a video, then have you send it unlocked for the remaining few dollars.This is not a scam:this happens because a user’s unlocked content is stored in a folder for the user to easily access, and videos that are sent unlocked in the DMs (for example: when sexting) do not get stored in this same folder. A fan who requests this just wants to be able to see their paid content all in one place.\n\nNever, ever, feel pressured into chatting with somebody who does not spend money.\n\nAnybody whosaysthey have a lot of money to spend likely does not, big tippers typically happily tip without prompting.\n\nYou don’t have to justify your prices to anybody - if they don’t want to pay, that’s totally ok! They should instead subscribe to somebody within their budget.\n\nOften, you’ll see that a fan who was quite chatty yesterday is now a “deleted user”. This is very common, and says more about them than it does about you: most likely they felt guilty about what they did or said and deleted their account as a result.\n\nYes, sometimes you will be forced to give people back their money. Sadly, there isn’t really anything you can do about it. All of these platforms that allow payments by credit cards (including OF, Cashapp) can be abused by customers. All they have to do is tell the bank that somebody used their card without permission, and their bank will reverse the charges. Unfortunately, you will have to absorb that cost. The only way to completely avoid this is to have people pay via crypto, which is pretty difficult to do. One small element of protection you can give yourself is by not completing any customs for at least a few days, even a week. This isn’t much, since customers can still dispute charge months later, but can help prevent you from sending content to somebody who’s using a stolen credit card.\n\nOverall: don’t do anything you don’t feel like doing. A gentle way to assert yourself is to simply say “I appreciate you asking me for X! That’s not something I’m comfortable doing, but I hope you can find someone else who can ❤️”\n\nGood luck out there <3",
  "author": "princesskixo",
  "comments": [
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "2 minutes later…… New Post = “How do I start my OnlyFans?”"
    },
    {
      "author": "motherspicymoney",
      "timestamp": "",
      "body": "Noooooo 😭"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "stacey_hot_mom",
      "timestamp": "",
      "body": "First thing you do when you set up your account is make sure you turn DRM protection on. It protects your videos from being screen recorded. I didn’t see this on here, but I just scanned through this post. There is some awesome tips and tricks/advice in this post😘"
    },
    {
      "author": "cherryandbanana69",
      "timestamp": "",
      "body": "Extremely detailed and helpful. To me, this is like a bible on how to develop a successful OF. Thanks for the effort, patience and guidance ❤️❤️❤️"
    },
    {
      "author": "aphrodites_intern",
      "timestamp": "",
      "body": "POETRY 🙌🏼😩  thank you so much for writing this!"
    },
    {
      "author": "princesskixo",
      "timestamp": "",
      "body": "I do not have any intention of posting any videos, just photos. I saw that in a part of the post you said you should try to make 50% of the content videos. If I don’t post videos does that mean I will be unsuccessful? I just plan on posting lingerie photos, some nudity ones. But I’m not sure what I would post in my bio? Would this be like “soft core” content? Not sure what I should add to my bio, any advice would be appreciated!"
    }
  ]
}