{
  "subreddit": "VRchat",
  "post_id": "1hbfdcc",
  "title": "Age verification update video",
  "body": "",
  "author": "mikakor",
  "comments": [
    {
      "author": "Delicious_Web495",
      "timestamp": "",
      "body": "This video shows that this update is getting promising but we might need another update in regards to the Age Verification just to convince those who don't trust this to sign up for this feature. Now I am willing to sign up and verify my age if something like a passport or voting vote could be used rather than risking my ID or SSN. A public or group instance without the kids would be a nice breather and I would like to just join or casually walk around without thinking about a data breach happening at any point."
    },
    {
      "author": "millsj402zz",
      "timestamp": "",
      "body": "Yeah I would verify if I actually trusted them. I have alternative methods that worked with persona in the past"
    },
    {
      "author": "Dividedthought",
      "timestamp": "",
      "body": "My only question here has to do with VRC's insistence that personal deletes our information once the check is complete. How can we verify this?"
    },
    {
      "author": "landroverattack",
      "timestamp": "",
      "body": "I believe it's impossible to prove the non-existence of anything, let alone digital data. At some point, you have to take someone's word for it, I'm afraid."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I heavily criticized them for poor communication around anti-cheat.This is so much better in every possible way. Explaining first, listening to feedback, testing and then implementing it. Regardless of my feelings towards the actual thing being implemented, the whole team has done a pretty good job all things considered.In terms of the actual Age Verification.... . SSN would be a hard no-go simply because of how just...insecure that whole system is already. I think they already stated Passports are a valid ID, so I think that would be fine."
    },
    {
      "author": "Minxy57",
      "timestamp": "",
      "body": "Almost every bit of my personal data has been breached a dozen times over in countless hacks. Cyber security has become an oxymoron.With this change I trust Tupper far more than half the other institutions 'protecting' my personal information.I'll validate my age in a heartbeat once this becomes available."
    },
    {
      "author": "LegallyRegarded",
      "timestamp": "",
      "body": "agreed. I got my Credit locked for a reason."
    },
    {
      "author": "DepreMelon",
      "timestamp": "",
      "body": "Finally no more annoying people on a  power trip asking redundantly \"age and date of birth\" lmao"
    },
    {
      "author": "Jupiter_Five",
      "timestamp": "",
      "body": "i've only gone through them a few times but there was one instance where i stated my actual age as an adult, and the person asking just thought i was using a voice changer, probably thinking i was lying about my age, if i can verify it without having to risk compromising personal information then that means i finally will have to deal with those kinds of people a lot less"
    },
    {
      "author": "mikakor",
      "timestamp": "",
      "body": "Hey, it's a Runa!"
    }
  ]
}