{
  "subreddit": "BrettCooper",
  "post_id": "1bg0hw4",
  "title": "Age verification seems like a good idea, but is it worth normalizing uploading your ID and submitting a picture to a company like this? I'm curious where people stand on this.",
  "body": "",
  "author": "h_91_DRbull",
  "comments": [
    {
      "author": "Dr_prof_Luigi",
      "timestamp": "",
      "body": "While I certainly agree that minors should NOT be consuming p*rn (nobody should tbh), I'm not sure if it is worth normalizing submitting your ID to a website.I know some sites do this for things like tobacco products, but it is still a bit of a fringe concept.More and more people are concerned with online privacy, and this could be a serious step toward eroding our rights to use the internet (somewhat) anonymously.I'm genuinely torn on this one. Is it worth normalizing sending government documents to sites you visit (submitting your papers)?imo, parents should just be more aware of what their kids do online.It doesn't effect me, and maybe requiring people to submit ID will make them hesitate which could be a net good"
    },
    {
      "author": "CrabofAsclepius",
      "timestamp": "",
      "body": "People already submit their IDs and even biometrics to companies known to sell that information like Amazon and Meta. Not only that but there are apps that track such things as per their ToS like TikTok.This isn't really anything that people aren't already doing."
    },
    {
      "author": "Zetjex",
      "timestamp": "",
      "body": "While i think it is important to try and stop kids for finding porn online putting your ID in goes too far. Parents should be responsible for their kids internet behaviour. And schools need to teach internet safety incase they don't do that yet."
    },
    {
      "author": "Chrissyjustshowus",
      "timestamp": "",
      "body": "It’s just government just sitting in for no reason"
    },
    {
      "author": "bsheelflip",
      "timestamp": "",
      "body": "It’s a good idea. For a kid to engage with “adult content” 40 years ago they’d have had to steal it from the seedy gas station joint in town or wait until they had an ID and submit it at the desk. The consequence of our digital age is that there is no such barrier anymore. I was an unwitting victim of this, and my friends exposed me to it without me wanting it at an early age. What we stand to lose in sacrificing what we assume is anonymity we stand to gain so much more culturally and societally. Today is different than those days even, and what was once a seedy back-alley joint is now so integrated into our society that the pornstars are our neighbors. Supply and demand is so weird for sex these days and, like it or not, fostering a good relationship between the “supply” and “demand” is actually paramount to a good society. We’re in a stalemate where our sons are telling our daughters “put the OF down” our daughters telling our sons “stop creating the demand”. Why don’t you guys stop fighting and just go make babies already? Alas, I see it going nowhere without intervention."
    },
    {
      "author": "h_91_DRbull",
      "timestamp": "",
      "body": "It asked about this specific policy. You said this subject is terrible - something must be done. Appreciate you opening up your emotions on the issue - but what about on if forcing us to submit our official government ID credentials over the internet to access publicly available spaces a good law?"
    }
  ]
}