{
  "subreddit": "canada",
  "post_id": "1gjzavk",
  "title": "Canadian policy makers spar over age verification bills S-210, C-412",
  "body": "",
  "author": "brusaducj",
  "comments": [
    {
      "author": "erryonestolemyname",
      "timestamp": "",
      "body": "All this time and money being wasted so parents don't have to use the parental control functions that are built into every single fucking modem and router."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "linkass",
      "timestamp": "",
      "body": "I mean to be fair most kids will figure out a way around most in a few minutes, then add in phones with data plans"
    },
    {
      "author": "BlackSabbathFanatic1",
      "timestamp": "",
      "body": "Bill S-210 is closer to a final vote, and Canadians may see a censored and walled-off internet. Contact your MP and tell them to vote no on the bill, and if your MP is NDP, tell them that the Conservatives filibustered debate on this bill in committee.https://action.openmedia.org/page/142909/petition/1"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "More censorship. Just what Canada needs. Let me guess, all in the name of saving democracy."
    },
    {
      "author": "SkinnedIt",
      "timestamp": "",
      "body": "A fine example of fools tabling legislation to regulate something they don't understand."
    },
    {
      "author": "rathgrith",
      "timestamp": "",
      "body": "Boomers making rules for the internet. There’s no way this will be successfully implemented. The internet is too decentralized"
    },
    {
      "author": "Careless-Plum3794",
      "timestamp": "",
      "body": "Gotta love these policies no one mentioned while campaigning and no one voted for, pushed forward by a government lacking popular support. That's how you know you're living in a \"democracy\""
    },
    {
      "author": "brusaducj",
      "timestamp": "",
      "body": "pushed forward by a government lacking popular support.FWIW both of the bills referenced in the OP are being pushed by the parties that do not currently form government."
    }
  ]
}