{
  "subreddit": "AvakinOfficial",
  "post_id": "1cqxq01",
  "title": "Age Verification Benefits",
  "body": "I think any adult who has age verification should have the option to engage in adult activities in the privacy of there own home on avakin here's why I think so because if we're gonna go through the process of getting age verification why can't we have more benefits from it not just having adult conversations in public or at home using strong language why can't it be 1 step further? And to let people know that will say there's a rule on avakin about adult activities I know this i saw it when they posted about age verification and that 1 rule is the reason for this post to exist which leads me to ask why does that rule exist if only adults can get access to the age verified servers and age verified homes? The process for age verification has people do facial scanning or they have to take a picture of there ID or Driver's license to prove there a adult so unless a kid hacks the system or illegally shows a fake ID to get age verification there's no way a kid can get age verification so again why does the rule of no adult activities exist in age verified places? There are adults who pay for stuff in avakin that buy vip buy crowns buy coins you even have to spend a little money to get age verification so if LKWD is getting profit from the adults who are paying for stuff why can't LKWD remove that rule for the adults who do wanna take part in adult activities in age verified places and not have to worry about being banned? Or suspended? To me that rule is pointless now because that rule existed because there's kids on the game and to protect minors from predators well again kids can't get access to age verified places unless they do stuff illegally to get in. Here is the thing kids get on imvu all the time but they have ap on imvu and adults participate in adult activities all the time on there and there is no rule saying they can't only if it's in private or in a ap server someone told me once people can't do that stuff on imvu I been on imvu for 8 years almost 9 years now and I'm fully aware of what people do on imvu and what the rules are the only places you can't engage in adult activities is in a regular public server or if a house is on public mode so the option on imvu is available for people who want to participate in adult activities on imvu avakin literally takes ideas from imvu and quite honestly avakin is turning into imvu 2.0 the only difference is the selection of items and servers etc.. are fewer on avakin and you can't participate in adult activities and wear mature accessories or clothing on avakin YET. so I wanna hear what everyone thinks if LKWD should remove the no adult activities rule or if not why? Because originally avakin life was a adult game I was around to know that and the only reason why they changed it was because of the kids now with age verification they can go back to when avakin was a adult game and make it enjoyable for the adults I been on avakin life for 9 years I've seen the game evolve and again I know the rules I'm just posting this to hear what people think should happen and why this is my opinion people can take it or leave it.",
  "author": "deeisnuts",
  "comments": [
    {
      "author": "QueenAxo-",
      "timestamp": "",
      "body": "I agree. I also think the game should be 100% just an adult game."
    },
    {
      "author": "BansheeBlueskylard",
      "timestamp": "",
      "body": "I agree , it should be an adult game , when I joined it was adult game , I think we should have more privileges with age v , I also think we should be able to talk in private on a public server to another age v without being censored , it’s so annoying and it’s not even rude things they censor so much I end up now in the 18+ server all the time because I’m sick of having to be censored for saying even the simplest of words , but yes I totally agree , we are all adults with age v and have the right to say and do adult things ….."
    },
    {
      "author": "de58ie",
      "timestamp": "",
      "body": "💥💥.  And when you join just like me it was a adults and it was for adults and everybody used to talk to everybody. It didn’t matter where they come from what culture we all talk to each other friendly and it was very very rare. Did you see anyone arguing? Now since it’s been made 12  plus and now see? Nobody talking anymore? Oh arguing yes people bullying people yes it’s all just too much. The kids are ruined the game. 💥💥"
    },
    {
      "author": "Pyramid_Head_BR",
      "timestamp": "",
      "body": "Yes"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Yall so eager to have pixel shmex, just get the real thing 😭😭😭"
    },
    {
      "author": "flAvakin",
      "timestamp": "",
      "body": "It just needs to be a 100% adult game. Especially at the prices."
    },
    {
      "author": "TitleComfortable781",
      "timestamp": "",
      "body": "It used be back in the day"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "This would be interesting to hear from Maia about!I do believe it has to do with LEGAL ISSUES more than anything (avakin's commercial image matters too, they are working on being more accessible and appealing to ALL audiences and that's smart)!But the LEGAL side is the real thing, that stops it. Regardless of age, there's some issues (especially in MANY countries) for what is legally ok for a commercial application to allow or \"sponsor\" by giving content directly to users.Just as how in IMVU you have to go outside the app (and it's legal rules) for a LOT of the MORE adult content (and can lose your account if you do and lots do), though IMVU allow far more permissive things on the game of course.That said, what you might be missing, is that the rules are to protect avakin legally, NOT to ban or suspend you or your significant other(s). So learn how to type what you want in private with out getting astrix'd or triggering getting flagged and you won't run into issues (I.E. sexually explicit talk gets your account flagged, EVEN if you can type it when 18+ verified, and enough flags gets someone looking at your chats, ALL of them).There's a LOT of players who follow the rules in public verified or not. IF you know what I mean."
    },
    {
      "author": "sunpatiens",
      "timestamp": "",
      "body": "Yes! 🙌"
    },
    {
      "author": "deeisnuts",
      "timestamp": "",
      "body": "There is no reason why this game should be open to children. They serve only as a nuisance. I can’t even imagine my 13 year old niece playing Avakin."
    }
  ]
}