{
  "subreddit": "Upwork",
  "post_id": "hrb147",
  "title": "Verification When Underage (Through Misunderstanding)",
  "body": "Hey, UK person here.\n\nDue to the current crisis etc. I decided to use Upwork to try to make some money so, when I get to University, I don't completely struggle. I am 17, turn 18 in literally 28 days. I recently got asked to verify my account through ID and video call, so I spoke to my siblings about it and they asked whether I was old enough to do so. I said that I was, and referenced the ToS of Upwork -\n\n\"an individual who is 18 years or older (or have otherwise reached the age of majority in the jurisdiction in which you conduct business)  in each case who can form legally binding contracts.\"\n\nNow, I presumed this to be 17, as I have already had a contract with a company through employment before, and 17 is the legal age at which you can have a full Driving License and etc. However - I swiftly started researching and realised that this isn't the case.\n\nI wanted to ask if there was any way to contact Upwork and explain the situation, explain the misunderstanding and see whether they can hold my account for when I turn 18 (I want to be honest about this as I have a contract that I am also currently completing which is in the field that I want to go into), and what they've done in this instance before.\n\nOnce again, I have no intention of cheating the system at all, and if I have to start fresh in a month's time I am willing to do so, but I really want to keep the contract for when I am able to do so (in a month's time).\n\nIf anyone could advise me, that would be great.\n\nThanks!\n\nEDIT:\n\nEmail says this - \" If you are unable to complete the process in the next week, your Upwork account will be placed on a temporary hold until you do. This hold will prevent you from obtaining new work (existing proposals will be canceled and new ones can’t be submitted) and withdrawing funds. It will not affect your ability to work on your active contracts. \"; does this change anything?",
  "author": "Candid_Farm1512",
  "comments": [
    {
      "author": "quiet_repub",
      "timestamp": "",
      "body": "The age of majority means you are 100% legally liable for anything you do. You can sign legal contracts, live on your own, vote, join the military, etc. if you are not legally a full adult in your country then you are underage and not allowed to work or get paid through Upwork. You can be honest with them and let them know that you’d like to hold identification for one month, when you’ll be 18. Don’t, under any circumstances, try to fake it by using someone else’s if or having someone else verify for you. They would burn your account permanently."
    },
    {
      "author": "exacly",
      "timestamp": "",
      "body": "If it were me, I'd lay low for a month."
    },
    {
      "author": "lovedovee",
      "timestamp": "",
      "body": "The SAME EXACT thing happened to me.I started using Upwork in May, but my 18th birthday was early June. Upwork kept bugging me to submit proper ID verification, but after getting advice from Upwork customer service I decided to wait until after my birthday to submit. Obviously, they suspended my account but only temporarily. As soon as you turn 18, submit the proper verification, and your account will be unbanned. I'm still happily freelancing.The only thing that happens to your account during temporary suspension is that all your proposals are automatically withdrawn. Basically you lose your connects."
    },
    {
      "author": "Special-Manner2787",
      "timestamp": "",
      "body": "Is it kind of a shadowban? If so (if contract are already made with someone) we can just talk through mail to gain money right ?"
    },
    {
      "author": "Special-Manner2787",
      "timestamp": "",
      "body": "I'm exactly in the same situation, I turn to 18 in like 2 weeks but I'm afraid to lose my potential money (beacause I've already accepted a contract...) if I don't verify my age before the 3rd JanuaryAt least when I'm turning 18 I'll continue my work but for the moment it's going to be really annoying..."
    },
    {
      "author": "SafeTourist9088",
      "timestamp": "",
      "body": "when signing up you gave a false Date of birth so when you will try to verify your age they will ban you"
    },
    {
      "author": "Candid_Farm1512",
      "timestamp": "",
      "body": "So, what happened to you? I am in the same situation and afraid that i might get banned after verification"
    }
  ]
}