{
  "subreddit": "technology",
  "post_id": "1bvqsxd",
  "title": "Pornhub pulled access after Texas required age verification. Could the same happen in AZ?",
  "body": "",
  "author": "Swizzy88",
  "comments": [
    {
      "author": "--Satan--",
      "timestamp": "",
      "body": "The law actuallypassed both chambersearlier this week. Only a veto from Katie Hobbs can stop it now."
    },
    {
      "author": "InsuranceToTheRescue",
      "timestamp": "",
      "body": "Does the legislature likely have the votes needed to overturn a veto?"
    },
    {
      "author": "arekian",
      "timestamp": "",
      "body": "It’ll get vetoed. Hobbs has indicated she will veto any bills that do not pass with bipartisan support."
    },
    {
      "author": "lightknight7777",
      "timestamp": "",
      "body": "I guess some things are getting smaller in Texas."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Make a killing if you started a VPN named \"Patriot VPN\""
    },
    {
      "author": "El_Guap",
      "timestamp": "",
      "body": "Make a killing if you started a VPN named \"Patriot VPN\""
    },
    {
      "author": "Immolation_E",
      "timestamp": "",
      "body": "Yes it can. Texas isn't the only one that's had this happen. Just the latest and biggest. North Carolina, Montana, Virginia, Utah, Mississippi all did this. I might be missing some. South Carolina has a bill in their legislation too.  It feels like a variation of this type of bill is making its way through a lot of states. I wouldn't be surprised if it's being pushed by the same organization."
    },
    {
      "author": "astrozombie2012",
      "timestamp": "",
      "body": "Why parent when you can try and enforce your will on your everyone but your children instead! This is true freedom amiright?"
    },
    {
      "author": "LigerXT5",
      "timestamp": "",
      "body": "You'd think someone would realize they could make it easier on everyone, if parents used web filters on their devices.Frankly, cheap/low end routers wouldn't be able to keep up, but mid to high end routers can easily maintain a list of domains for Adult Content, and block access to these, even on a per device.I can very easily setup my DNS adblocking PiHole with a list for adult sites, and block them on select devices. At no cost (outside setup and hardware).You don't even have to setup hardware and setup stuff, there is free DNS services you can just plop the IP into the devices, and you're good to go. Just pick the IP of the DNS that does adult filtering.Or better yet, teach kids the natural bits about life, and stop hiding it like it's the devil."
    },
    {
      "author": "Swizzy88",
      "timestamp": "",
      "body": "We've had the same debate in the UK for a while. For some reason parents give their kids unfiltered unsupervised access to the internet and are then sho led to learn they don't just use it for homework. They are also screeching for government intervention when the truth is most devices have this filtering capability already."
    }
  ]
}