{
  "subreddit": "CamGirlProblems",
  "post_id": "1i6zcqy",
  "title": "Age verification?",
  "body": "If any of you promo on social media and chat, how do you ensure that you're not accidentally chatting with someone under age? I want age verify before I engage in anything explicit, do you have a method you use?",
  "author": "GoddexxGift",
  "comments": [
    {
      "author": "dublinrae1",
      "timestamp": "",
      "body": "Personally, I only use social media to bring people to platforms where they can be a verified. It’s not worth the risk."
    },
    {
      "author": "rachelwren",
      "timestamp": "",
      "body": "This is the way."
    },
    {
      "author": "Jade_Next_Door",
      "timestamp": "",
      "body": "I'll try to break down the typical methods for age verification (AV) below. ID was the common method, but with age verification laws, websites/apps have made themselves known for business. Since using Webscoop, many seem to pick Webscoop. If not, it's been via ID. I personally haven't had anyone select Yoti app, but I know others have.ID: they send you a pic of their redacted ID, with DOB onlySome SWers require a selfie with IDSome SWers require the selfie in the ID showing as wellSome SWers require ID and paper with username/dateYoti App: everyone must create an account on the app (not website) and it's free.They use ID and selfie to verify, then send a link/code to you that shows DOB onlyOnly need to verify once and can send to multiple SWers who have accounts.Webscoop: is a website for creators to utilize services like the AV portal, wishlists, etc. AV portal was free, but recently changed...but can still be free.AV Portal: 1 credit per person to verify. Pay $1 per credit. A person verifies and you get confirmation if they passed as 18+.Wishlist: 1) when someone buys you a gift, you get a certain amount of free credits, depending how much was spent on the gifts, and 2) you can setup AV to be required when buying from your wishlist.For yourself, you can just create an account on a fan-based site like LF, OF, Fansly, etc because adult sites are legally obligated to ensure we are 18+. You don't need to actually be active and such. Just note in your profile that it's for AV only. A fan account is not age verified, so don't use it as AV for a buyer. Youpay is a wishlist site like Throne or Wishtender, and you can AV and have an 18+ badge on that profile in your bio."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I think I'm going to use this!"
    },
    {
      "author": "momofyourdreams40",
      "timestamp": "",
      "body": "I think I'm going to use this!"
    },
    {
      "author": "GoddexxGift",
      "timestamp": "",
      "body": "I have not used it myself but I have heard of webscoop"
    }
  ]
}