{
  "subreddit": "CloudResearchConnect",
  "post_id": "1eo3lbc",
  "title": "got an email from them asking to confirm my identity by scanning my id?",
  "body": "Did anyone else get this? Is it safe?",
  "author": "AngeloD888",
  "comments": [
    {
      "author": "GungGravy",
      "timestamp": "",
      "body": "Don't trust Connect with my ID. They've not discussed who has access to it, how it's stored, or how long it's stored. All very valid concerns that should be addressed before rolling this out. I'm sure we'll get the usual silence from Connect, so why bother?"
    },
    {
      "author": "Dear-Ad-3614",
      "timestamp": "",
      "body": "I got it too. I'm not happy about it. Just yesterday I saw two different articles about ID confirmation businesses having major data breaches, and another company I work with is also asking for something similar. The more of these companies that have my ID the more likely it will get out there somehow."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "DeprestPhilosopher",
      "timestamp": "",
      "body": "Yeah I got it. I'm not doing that. That's way too risky for the amount I make per month. Hard pass. Sucks though because I do really like the platform and will miss it."
    },
    {
      "author": "Plus-Pineapple8755",
      "timestamp": "",
      "body": "I got it too, honestly just in time because I was thinking of quitting the site and getting a real job🤷🏽‍♀️"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "they can fuck right off with this shit"
    },
    {
      "author": "literallydondraper",
      "timestamp": "",
      "body": "Yep. I got this too when my identity should already be confirmed by ID. Why am I being asked to do this again? I did ID verification 4 months agoEDIT: Anyone else who recently confirmed their ID in the last few months being asked to do it again? Considering reaching out to Cloud over this."
    },
    {
      "author": "etharper",
      "timestamp": "",
      "body": "I just got this in the last couple of days and it pretty much means I'm done with Connect. My ID expired a couple years ago and since I don't have a car I don't really need one so I haven't gotten a new one. So it looks like after several years and no rejections I'll be done with Connect. I'm not making much money on the site anyway."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "AngeloD888",
      "timestamp": "",
      "body": "I wonder what happens if we don't do this. Is this mandatory?"
    }
  ]
}