{
  "subreddit": "escaperooms",
  "post_id": "pkmwaw",
  "title": "What happens if no one has an ID yet employees need an ID for the answer to a puzzle?",
  "body": "Marking it as spoiler in case for safety reasons. Also not sure if this question is allowed because it somewhat contains the answers to an escape room.\n\nSo my friends and I recently went to an escape room and the last part of the puzzle required some sort of pin to unlock the safe. Due to the clues before, we realized that the pin had to relate to the team leader (elected before we were put into the room). After finishing the escape room, my group discussed how did the employees of the room know the team leader'sbirthdayand use that as the code to unlock the safe. We figured out that they got it because the employees took the team leader's driver's license and used hisbirthdayas a pin.\n\nAfter, we were wondering if none of us brought ID, how would the employees change the escape room to ensure that my group of friends could complete it? We were thinking credit cards, or telephones but we thought they were too niche to think of.\n\nMy question is how would the staff change the escape room if there was a part of a puzzle that need someone's identification?",
  "author": "[deleted]",
  "comments": [
    {
      "author": "MuppetManiac",
      "timestamp": "",
      "body": "We require a birth date on waivers as verification you are 18."
    },
    {
      "author": "Exit_exe_",
      "timestamp": "",
      "body": "When I went to the escape room, I didn't need to verify I was 18. The only \"verification\" was when the team leader signed the wavier for safety reasons and took the team leader's driver license for \"verification purposes\" but it was for the code to the safe."
    },
    {
      "author": "AuShea",
      "timestamp": "",
      "body": "For us when you book online it asks you for your DOB aswell as our waiver form. Also in a case where we have a responsible suspicion that they put in a random birthday we swap out the lock for a last name or something similar"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Hi there!This is a reminder to please flair your post if it is an advertisement.Thanks!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    }
  ]
}