{
  "subreddit": "privacy",
  "post_id": "1ej56x4",
  "title": "Whats the deal with google wanting ID for age verification on youtube?",
  "body": "Youtube wanted me to verify my age to watch a video (context i have 2 google accounts for some reason because little me though youtube was separate from google, one i use for youtube and one ive used for everything else) when i clicked the link to verify it sent me to the other account i have that i dont watch youtube on, only it said my account doesnt require age verification? I have not sent google my ID or anything, at least i cant remember ever doing so. I dont really want google to have my ID so i was originally just gonna give up and not watch the youtube video i was interested in. But now im kinda worried i sent it in without remembering? idk im confused but cant find any info on why that is... Isnt that hella creepy?",
  "author": "d03j",
  "comments": [
    {
      "author": "Scous",
      "timestamp": "",
      "body": "Google is creepy."
    },
    {
      "author": "_Atsco_",
      "timestamp": "",
      "body": "Obviusly! im just really worried they have my fuckin ID without me knowing ??"
    },
    {
      "author": "TopExtreme7841",
      "timestamp": "",
      "body": "Because all the companies are being held to the standards of being people's parents now thanks to morons in power. Sadly, a lot of it is justified thanks to parents not doing their jobs and not teaching their kids real life from the Internet. But I've only seen that when using a couple specific VPN servers, 95% of the time it doesn't care. You're here, so I'm assuming you always have a VPN up, try a different server."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Have fun!"
    },
    {
      "author": "jkurratt",
      "timestamp": "",
      "body": "They want to steal your identity"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Use vanced"
    },
    {
      "author": "nnnnnnnnnnuria",
      "timestamp": "",
      "body": "Ir doesnt work on revanced"
    },
    {
      "author": "KaleidoscopeDue4603",
      "timestamp": "",
      "body": "At this point they're doing anything to get your info"
    },
    {
      "author": "d03j",
      "timestamp": "",
      "body": "I believe they use the DOB you give them when you create your account..."
    }
  ]
}