{
  "subreddit": "kansas",
  "post_id": "1dqjr4m",
  "title": "VPN to regain porn access in Kansas?",
  "body": "Soooo Kansas has decided to follow Louisiana's lead, enforcing an age verification mandate for adult content. We're talking about full-blown ID checks for accessing sites like Pornhub, which is outright banning all users in Kansas starting yesterday - June 27, 2024.\n\nAdvocates are rightfully up in arms over this, arguing that ID-based verification exposes users to risks of cyber-attacks and data breaches. But I feel like it’s not only that. It’s more about the fact that you have to hand over your personal information. This feels like a total invasion of privacy.\n\nI’m debating on getting a VPN not only cause it will potentially help bypass these ridiculous restrictions, but also protects your identity online. Considering the discounts I've seen mentioned everywhere, NordVPN goes as low as 3 bucks per month, making it a pretty solid option in my eyes.\n\nCan someone confirm? Does it really work to regain access?\n\nUPDATE: bought Nord via this discount that someone put in the thread. It worked for me:https://nordvpn.com/coupon/deal/?coupon=redditoffer",
  "author": "Quixan",
  "comments": [
    {
      "author": "Sufficient-Cress1958",
      "timestamp": "",
      "body": "These bans are getting out of control"
    },
    {
      "author": "chitphased",
      "timestamp": "",
      "body": "Porn is more regulated than guns."
    },
    {
      "author": "krisalyssa",
      "timestamp": "",
      "body": "ProtonVPN is free, based in Switzerland, and has traffic egress points around the world. The free version chooses an egress point for you, but the paid plan lets you choose what country you appear to be in."
    },
    {
      "author": "tapioca_slaughter",
      "timestamp": "",
      "body": "Can confirm it works. Using NordVPN."
    },
    {
      "author": "januaryemberr",
      "timestamp": "",
      "body": "Xvideos works fine..."
    },
    {
      "author": "gianthaze",
      "timestamp": "",
      "body": "Bet they had a spike in visits today"
    },
    {
      "author": "livethechaos",
      "timestamp": "",
      "body": "Xhamster, too. Despite the name, there's no hamsters involved."
    },
    {
      "author": "Vox_Causa",
      "timestamp": "",
      "body": "Stop. Voting. For. Republicans."
    },
    {
      "author": "cyberphlash",
      "timestamp": "",
      "body": "OP, why don't you do us all a favor and try logging into the Top 20 porn sites, see which ones you can or can't get into, and then just leave a big list here for everyone else. People probably don't even need a VPN - many of these sites are offshore and not going to follow Kansas laws like PornHub."
    },
    {
      "author": "Quixan",
      "timestamp": "",
      "body": "would you agree that this law doesn't do any good?it shouldn't have been put in place, it's a waste of time and money and likely only causes harm."
    }
  ]
}