{
  "subreddit": "BitcoinBeginners",
  "post_id": "1c1jh60",
  "title": "River Financial: problems with identity verification",
  "body": "I've been going through the process of setting up an account with River for the last couple of weeks. Last week, i went through the identity verification process, and I expected to be verified this week. Today I received an email saying that they didn't verify my account and that I can re-apply in a month. They wouldn't tell me anything on the phone about why there's a problem.\n\nDoes anybody know why they would have a problem with verification? I could easily provide other means of verifying my identity if they asked.\n\nUpdate: After a month, they let me resubmit my verification. This time, I realized that the problem might be caused by the fact that my credit checks are frozen with the 3 credit reporting agencies. I unfroze my accounts and tried to verify again, and this time it worked. It would have been very helpful if River had just told me that my credit reports were frozen, and that was the reason my verification failed.",
  "author": "CYjgb",
  "comments": [
    {
      "author": "flips712",
      "timestamp": "",
      "body": "I resubmitted my verification docs b/c it failed the first time. Now River has locked my account and canceled my reoccurring weekly buys and target buy orders. I thought they were supposed to be self-custody friendly. This started when I submitted my ID and selfie pic for verification so I could move BTC to a cold wallet. Now I can't even log into my account since they locked it. I opened the account around February. This is very frustrating"
    },
    {
      "author": "TightType6228",
      "timestamp": "",
      "body": "please who knows a similar app like river that i can buy bitcoin with my bank but less stressful like river"
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Scam Warning! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use thereportlink to report any suspicious private message to Reddit.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Single-Lobster1947",
      "timestamp": "",
      "body": "Try swan."
    },
    {
      "author": "Woody_L",
      "timestamp": "",
      "body": "Is Swan easier to deal with than River?"
    },
    {
      "author": "RiverOfficial",
      "timestamp": "",
      "body": "Thanks for bringing this to our attention! Can you DM us so we can take a look into this? We would be happy to work with you in attempt to resolve!"
    },
    {
      "author": "flips712",
      "timestamp": "",
      "body": "My ID verification also just failed. No clue why either"
    },
    {
      "author": "CYjgb",
      "timestamp": "",
      "body": "I tried to set up an account on River sevral times 6 months ago.  It was horrible.  I couldn't get it to work.  I gave up.  I got frustrated with how expensive kraken and Strike were being,  so I decided to try River again last week.  It finally worked.  I have no idea why all of a sudden it worked,  but it did.  I think they may need to iron out some bugs, but it seems to be good now that I'm on."
    }
  ]
}