{
  "subreddit": "SocialSecurity",
  "post_id": "1k33gb6",
  "title": "S.S. retierment concerns",
  "body": "There are a lot of people here (and rightly so) about the future of S.S. retierment. I received this today and wanted to share it with you. I hope it helps with some of your concerns. I turn 62 in May and applied for S.S. retierment. I'll let you know how long it takes.\n\nhttps://brindleandbay.activehosted.com/index.php?action=social&chash=f2fc990265c712c49d51a18a32b39f0c.242&s=b68753e166003f95f38baa0d4c979bea\n\nSocial Security Insecurity\n\n18 Apr 2025 Read time: 3 min 15 sec As if the world isn’t already worrisome enough, I’ve recently been fielding lots of questions regarding the current state of Social Security, so I wanted to address the most popular worries I’ve heard. As is true with anything the media gets ahold of, there are quite a few misconceptions about what is going on, so I’ll do my best to provide some clarity here.\n\nBefore I get started, I’d like to note that there is no way to eliminate political bias completely, so I am striving to avoid as much as possible by sharing information that comes exclusively from the Social Security Administration itself, rather than any particular media outlet. Here we go.\n\nWhat I’ve Heard: Social Security is cutting its staff by 50%. From the Source: Social Security is reducing its workforce, but not by anything close to 50%. They have stated that they are reducing their total workforce from 57,000 to 50,000, with the goal of these reductions being to eliminate redundancies and non-mission-critical work efforts. It is expected that most of the reductions will be accomplished through retirements and voluntary separations. (SSA Article)\n\nWhat I’ve Heard: Social Security is closing local field offices. From the Source: As of this writing, Social Security has not announced the closure of any local field offices. This misunderstanding may be a result of the announced restructuring plan in which SSA stated that it is reducing its regional offices from ten to four. (SSA Article #1, SSA Article #2)\n\nWhat I’ve Heard: Social Security is eliminating phone services for benefits help. From the Source: At this time, all telephone-related services remain available in their historical form with one exception: The only change is that SSA will now require either online or in-person identity verification when making changes to direct deposit information. According to SSA, approximately 40% of Social Security direct deposit fraud is associated with someone calling SSA to change direct deposit information, so this new requirement is intended to protect beneficiaries and ensure the integrity of the program. (SSA Article)\n\nRelated Note to All Three Concerns Above: There have been reports about longer wait times for both telephone and in-person service due to these changes. This may be true, but based on my experience, long wait times are not a new complaint, nor are they limited to the SSA. I can only assume that you have noticed, as I have, that longer wait times and poor service are becoming more common across all industries (in both public and private organizations), so it’s possible that this could just be a sign of the times, more than anything else.\n\nWhat I’ve Heard (Again): Social Security is going bankrupt. From the Source: According to the most recent (2024) \"Social Security Trustees Report,\" Social Security can pay full benefits through 2035, at which point, the famed Social Security trust fund would be depleted. Beyond that time, assuming Congress takes no further action to remedy this issue, the SSA would initially still be able to pay about 83% of all scheduled benefits, despite the depleted trust fund. This is because Social Security is mostly a \"pay-as-you-go\" system. Obviously, this potential outcome is not ideal, but it’s far from the doomsday scenario of $0 benefits payable to beneficiaries that some recipients seem to believe is inevitable.\n\nFurthermore, it's encouraging that the calculated changes that would be required to bring Social Security back to full funding status through about 2098 are currently manageable.\n\nAdmittedly, getting our elected officials to make these changes may seem like a tall order. But given the incredible importance of the Social Security program to millions of Americans, I’d like to think that the voices of the masses will grow loud enough to get Congress to shore up what I believe is one of the best-run public pension programs in the world. (Sources: SSA Report; Summary of Report: Center on Budget and Policy Priorities)\n\nI’m sure there are other concerns, but these seem to be the primary ones right now. I’ll include the disclaimer that all information included here is subject to change at any moment.\n\nBefore I go, there is one action item that nearly everyone should consider, regardless of age. That is, you should go online to create your personal \"my Social Security account.\" This online portal allows you to handle many necessary tasks without ever needing to visit an office, which might help you avoid many of the service-related concerns noted above.\n\nI hope you find this note helpful in clearing up some popular misconceptions. As always, I welcome your questions and concerns. Stay the course!",
  "author": "No-Clue-835",
  "comments": [
    {
      "author": "Extension-College783",
      "timestamp": "",
      "body": "Thank you for bringing some sanity and clarity to this issue. I try not to get caught up in the news cycle about this and other things. Can things change...? Yes. But will they? I cannot spend my life in a state of worry."
    },
    {
      "author": "TX-911",
      "timestamp": "",
      "body": "Good summary of current concerns I see all the time, especially the “bankrupt” one. I’m curious what the “calculated changes” are to get back to full funding status. I’ve seen a number of ideas like raising the cap, raising the retirement age, etc. Nothing currently proposed though since this topic will likely get kicked down the road until closer to the 2035 date. The next Trustees Report should be out next month which will no doubt energize the discussion."
    },
    {
      "author": "dadjeff1",
      "timestamp": "",
      "body": "It'll likely involve raising the FRA."
    },
    {
      "author": "gsquaredmarg",
      "timestamp": "",
      "body": "What's the over-under on how far it gets kicked down the road? Unfortunately, I'm putting it in the next decade...which will make it even harder to solve."
    },
    {
      "author": "Neither-Complex5391",
      "timestamp": "",
      "body": "Theyve been sabotaging SS for years because they want people to have a negative view of it so they'll go along with the push to privatize it and dump the money in wall street."
    },
    {
      "author": "Cloudy_Automation",
      "timestamp": "",
      "body": "The common meaning of bankruptcy is that an organization is unable to fulfill all its obligations. By that definition, Social Security and Medicare will be bankrupt. It doesn't mean it has no ability to pay its obligations, just not all of them. Bankruptcy is also a legal term for the judicial process for how creditors get paid, and I don't know of any of the bankruptcy chapters which would apply to the Social Security Administration.If no legislation is passed to fix this deficiency, it's unclear what SSA could do. Would it prioritize low benefit recipients? Disability? People claiming on their own record instead of their spouse's? Would people with independent retirement assets be penalized? SSA doesn't have the authority to make any of those choices. I can guarantee that no session of Congress wants to touch this, as there will be bigger losers and smaller losers, and they all vote. Some of the losers will be retirees, and some will be workers.Here's what Congress has to say:https://www.congress.gov/crs-product/RL33514By 2095, the amount SSA can pay for Social Security benefits will be down to 74%. Will our grandchildren want to pay into such a system?There is no way any tax cuts should be supported while leaving these problems unsolved. Talking points about privatization are also likely to be disastrous, as people who have paid into Social Security, but not yet retired, will want something, and that will come out of current retirees assets supporting monthly payments. And, if you complain about Social Security being taxed, you can bet a privatized Social Security would be partially taxed for everyone. The employer's contribution and interest were never taxes."
    },
    {
      "author": "ReddyKiloWit",
      "timestamp": "",
      "body": "It's not the media spreading rumors, well, not entirely. It is statements made by certain people in the administration, or adjacent to, that are driving concerns. It's not comforting to hear someone supposedly in charge of changes describe Social Security, in an interview, only in terms pulled from myths and conspiracy theories. Or a cabinet secretary say if payments were stopped ONLY those committing fraud would complain. Or see a list of field offices that WILL close being distributed apparently from official sources.These aren't media exaggerations. And if they have no basis in reality the Administration isn't really doing much to make that clear. And reassurances from affected departments are no longer reassuring since they seem to lack authority on their own these days."
    },
    {
      "author": "puzzleahead",
      "timestamp": "",
      "body": "This is an excellent summary! Thank you."
    },
    {
      "author": "LoveCareThinkDo",
      "timestamp": "",
      "body": "Oddly, my last two payments have shown up in my bank account about a day earlier than they normally would.Medicare had been sending me all kinds of stuff to make sure I know what I need to know to apply for benefits. If I take the defaults, then I don't even have to apply for anything. Even the \"Extra Help\" that I qualify for due to my extreme poverty, is automatically applied. They even sent me a whole huge book, letter sized paper, about ½\" thick, with all the benefits in large-ish font, and dozens of tables in the back listing comparisons of all the Advantage plans in my state.Sure, up until I actually get my payment, I am still terrified that it just won't show up, with no notice, reason, or recourse. But, I can't live my life in a perpetual state of terror, or then they win anyway."
    },
    {
      "author": "No-Clue-835",
      "timestamp": "",
      "body": "I have had great success working with the local SS office. If you call first thing in the morning you can get most questions answered.  They made sure I got all the new benefits I was due from the new Fairness Act- a monthly increase of $1600 within about a month after my phone appointment."
    }
  ]
}