{
  "subreddit": "VRchat",
  "post_id": "1hkc2xk",
  "title": "I really wonder how the Christmas and new year is going to be with the age verification system",
  "body": "For the past years, we would have huge increase of players who would get their headsets as a Christmas presents and all of the mirror dwellers who does not want to deal with constant waves of kids saying slurs and memes, would hide in their private instances, I wonder how this year is going to be like? And how it would feel from a new players perspective.",
  "author": "Remarkable_Guide_394",
  "comments": [
    {
      "author": "rcbif",
      "timestamp": "",
      "body": "Age verification is still in Beta phase, no likely no real change."
    },
    {
      "author": "Hexent_Armana",
      "timestamp": "",
      "body": "Man, thats a shame. While I have met SOME chill minors I haven't met many. Overall VRChat would be a more enjoyable game if these children couldn't even log in."
    },
    {
      "author": "Breaker1ove",
      "timestamp": "",
      "body": "Christmas after noon and the day after Christmas I unmute visitors and help them with learning the menu and stuff. You are free to do the same. Im often the only one doing it."
    },
    {
      "author": "Rune_Fox",
      "timestamp": "",
      "body": "I've started making it a tradition of changing my status to something like \"new to vrc? Ask me for help\" around Christmas."
    },
    {
      "author": "RevolutionarySpare87",
      "timestamp": "",
      "body": "I try and do that anytime I meet someone new to vrc.The two months i spent with personal space on cause i was never told i could turn it off won’t be repeated by any new people haha."
    },
    {
      "author": "Syvestral",
      "timestamp": "",
      "body": "This is so nice, I'll be doing this too :) thanks for the idea. Merry Christmas!"
    },
    {
      "author": "Sanquinity",
      "timestamp": "",
      "body": "I doubt it'll get fully implemented before new year's since it's less than 2 weeks away. That being said, groups weren't a thing yet last year. So I think that'll already make a big change. I think there will be a lot more adults in group publics now, whom in turn will try to keep kids out as much as possible."
    },
    {
      "author": "zyclonix",
      "timestamp": "",
      "body": "Im actually kinda hyped. While we did have floods of kids the last few years thanks to the quest we can now open up 18+ instances, so meeting new people will actually become fun again, i wont really be bothered by kids this year"
    },
    {
      "author": "aplen22",
      "timestamp": "",
      "body": "System still in Beta and Devs are in a code freeze for the holidays. Nothing is happening until January."
    },
    {
      "author": "Remarkable_Guide_394",
      "timestamp": "",
      "body": "the only reason i'm not completely sure on age vari is because of the people who are under 18, but have multiple years on the game and are known or trusted users who are just trying to meet new people. the whole age vari thing would leave me in a world wit ha bunch of 12 years old's moaning at the top of their lungs just to be funny and nobody to talk to."
    }
  ]
}