{
  "subreddit": "Louisiana",
  "post_id": "102zcly",
  "title": "Does VPN bypass PornHub age verification requirements?",
  "body": "I don't want to share my personal information with this website. Maybe someone could check if I can use a VPN as a workaround? If yes, which VPN do you use?",
  "author": "phynn",
  "comments": [
    {
      "author": "redog",
      "timestamp": "",
      "body": "Mozilla VPN because I want to support a project I like"
    },
    {
      "author": "Esper21",
      "timestamp": "",
      "body": "hide.me chrome plug-in.  Free, no sign up required.  Install, turn on / off as needed."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Honestly, I tested it- my wifi triggers it, but my data does not."
    },
    {
      "author": "thatgibbyguy",
      "timestamp": "",
      "body": "Yeah this is pretty much what VPN are made for.I use one that's connected with my password manager, but you can use Mozilla's, or tunnel bear, or any of the plethora of other providers."
    },
    {
      "author": "zaneak",
      "timestamp": "",
      "body": "Yes.  Comanipes are using ip addresses to geofence the state.  They dont want to force everyone to do it for one stupid law, that will probably end up gone in years if challenged.  So as long as it looks to them like you aren't in Louisiana, it will work."
    },
    {
      "author": "petit_cochon",
      "timestamp": "",
      "body": "Just don't watch porn. Problem solved. It's unhealthy anyway. The state is doing you a favor.I'm kidding. We're adults. This state is obsessed with inserting its unclean fingers into our bedrooms, sexuality, reproductive rights, and gender. It's exhausting, dumb, costs taxpayer money (of course this law will be challenged in court), andcreepy. Like shut the fuck up about libraries, porn, abortions, and trans people. Fix the roads. Improve flood protection. Improve education. It's absurd how hard our legislators work to avoid doing any real work."
    },
    {
      "author": "zaneak",
      "timestamp": "",
      "body": "They did a lot of yelling in the name of freedom, trying to fight against mask requirements in places for COVID.  Saying like Adults shouldn't be inconvenienced and have freedom restricted in the name of protecting people.  Now, they are trying to inconvience and restrict freedom in the name of protecting people...."
    },
    {
      "author": "octopusboots",
      "timestamp": "",
      "body": "Tee hee, unintended consequence of draconian laws is that everyone is going to learn how to use VPN’s.   By the way, can someone please eli5 a vpn to me, Im tech-illiterate."
    },
    {
      "author": "phynn",
      "timestamp": "",
      "body": "The really short version is a VPN makes you look like you're online in a different location.That's enough."
    }
  ]
}