{
  "subreddit": "escaperooms",
  "post_id": "zpe9dx",
  "title": "Age Restrictions",
  "body": "In the UK escape rooms have an age restriction of 16 but do they ID you even if you look of age would take an adult to supervise but the max limit is 6 and we already have 6 4 of us look of age and 2 look under will they ID",
  "author": "TheRubester_tm",
  "comments": [
    {
      "author": "Orjazzms",
      "timestamp": "",
      "body": "Depends on the company. I would call and ask.The reason for the age limit is damage limitation. Kids tend to make more new and be more likely to break periods without adult supervision, but they may make an exception if you behave and act maturely.The limit may be 6, but they'll likely allow an adult be present in the room with you as a 7th, providing there are no safety or other limiting factors that prevent more. The 6 limit is usually just the maximum before it becomes a bit crowded and less fun for the players, but if one of the party is not participating in the puzzles, this is less of a concern."
    },
    {
      "author": "tomius",
      "timestamp": "",
      "body": "16 minimum age... Even with an adult? I hope not, because that's insane."
    },
    {
      "author": "MuppetManiac",
      "timestamp": "",
      "body": "Depends on the room. I’ve seen some that were 21 plus for very good reason."
    },
    {
      "author": "Bunnypopsford",
      "timestamp": "",
      "body": "They are mainly worried about you trashing the room, running around screaming, not engaging in the puzzles etc. So, don't do that and you'll be OK."
    },
    {
      "author": "TheRubester_tm",
      "timestamp": "",
      "body": "Our rooms you have to be 16+ without an adult present to take responsibility for the group, however if someone is over the age they can consent to being the responsible party and sign as such for the under 16s. If we have a 12 year olds party for example we ask parents to listen to the safety briefing along with the kids and sign to say they take responsibility and the kids understand even if they are not going into the room. We do not check ID but we do ask. Best advice is to just call and ask, and if needed have an adult come along for the safety bit at the start then go grab a coffee or something."
    }
  ]
}