{
  "subreddit": "CashApp",
  "post_id": "1jn1nsx",
  "title": "ID verification",
  "body": "I can’t do ANYTHING without verifying my ID?? I can’t send $20 I can’t receive $25??? I thought you could still do things as long as it was below a certain amount?",
  "author": "SouthRoutine2664",
  "comments": [
    {
      "author": "Round_Degree_91",
      "timestamp": "",
      "body": "If you verify it you can still have it not show your actual full name. I mean to verify it you have to upload your legal full name. Going into settings > personal, it will show your legal name but it literally says only you can see that info & it’s not shared with anyone else it’s just for identity purposes. But if you go to settings > edit profile it allows you to change your profile name which is what people would see when you send them money or when they send you money."
    },
    {
      "author": "iamdemirey",
      "timestamp": "",
      "body": "Idk.. ID verification is usually an option to help prevent fraud. It's not necessarily mandatory unless otherwise."
    },
    {
      "author": "RedPill_86",
      "timestamp": "",
      "body": "if you do it you can keep the account for future sending or receiving. at least that's a plus"
    },
    {
      "author": "Ok_Fan_6810",
      "timestamp": "",
      "body": "https://cash.app/help/gb/3122-verify-account"
    },
    {
      "author": "Random44441",
      "timestamp": "",
      "body": "Is there any way to make it so people can’t see my full name on there then?"
    },
    {
      "author": "justtire",
      "timestamp": "",
      "body": "Why would you not just verify"
    },
    {
      "author": "Random44441",
      "timestamp": "",
      "body": "I don’t like having my last name and everything on display just to send a few dollars"
    },
    {
      "author": "torovictorioso",
      "timestamp": "",
      "body": "It used to be that a lifetime limit of $1500 was available for non verified users.Have you crossed the $1500 threshold?"
    },
    {
      "author": "bobby_the_buizel",
      "timestamp": "",
      "body": "Ohh buddy then you must not like banking or anything that requires identity verification. Should become Amish and fear technology"
    },
    {
      "author": "SouthRoutine2664",
      "timestamp": "",
      "body": "I'm in"
    }
  ]
}