{
  "subreddit": "paypigsupportgroup",
  "post_id": "1bszu71",
  "title": "Age verification",
  "body": "Despite being adamant that they Findom is sex work, no Domme (I've sent to at least a dozen) has ever sought to verify that I am legally an adult. I find this very curious. Dommes, do you age verify subs? How, and under what circumstances would you do so? Subs, has a Domme ever asked you to verify your age? (I would have asked this in the Findom support group too, but I'm unsure about their policy regarding subs posting. The rules say commenting is okay, but posting is not mentioned).",
  "author": "QueenArtemis1",
  "comments": [
    {
      "author": "Environmental_War_34",
      "timestamp": "",
      "body": "i’ve asked several to send a blacked out photo of their ID next to a slip of paper that says their reddit username and the date. just need the birthday on the ID!"
    },
    {
      "author": "GoddessIGuess23",
      "timestamp": "",
      "body": "This is how I do it as well. It's quick and easy, and I have peace of mind knowing that a kid isn't where they're not supposed to be."
    },
    {
      "author": "alleriamystic",
      "timestamp": "",
      "body": "I make all my subs go through my adult sites at least once. You need to agree to their age verification."
    },
    {
      "author": "goddessnatalia9",
      "timestamp": "",
      "body": "That’s one of the first things I do. I’ll ask for ID with everything blacked out except birthday with a handwritten note with the date and my user name."
    },
    {
      "author": "lilmistressmalice",
      "timestamp": "",
      "body": "If you check out my pinned post on my profile, I line out my expectations for prospective subs, one of which includes verifying your age with me either via an age verifying website (LF, OF, Fansly, etc) or a photo with face, ID & username, all information on ID can be blurred/blocked out except for DOB. I am very adamant that this isn't a space for minors and I have no interest in interacting with one."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "With my first ownership, the domme verified me only when I joined her discord server, after a few weeks.I'm back after a break now, not a verification request sending to dommes as a community."
    },
    {
      "author": "Bumblebee1515",
      "timestamp": "",
      "body": "Subs have to either sub to any of my AV sites as well or send me a picture of their ID card with their info covered besides the birthdate. And I also allow them to cover the eyes of the picture but I need to see the face on the ID as well.Plus I usually have them do a picture with specific things written on a piece of paper"
    },
    {
      "author": "cherryssence",
      "timestamp": "",
      "body": "I ALWAYS age verify possible subs before starting any kind of dynamic. I make sure to tell them that if they don't feel like using a third-party site to verify, just send a picture of their ID with everything covered except for the DOB. It doesn't get any simpler than that!"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Obviously for things like silent sends or initial tribute you often don’t get an opportunity to, but as soon as someone messages me that’s one of the first things I mention is how important it is that they verify for me. Unless they sent and all of our interactions are through an adult site I will have them either use an app called Yoti or send me a picture of their ID on a piece of paper with their username, my username, the date written on it and all info except their DOB blacked out."
    },
    {
      "author": "QueenArtemis1",
      "timestamp": "",
      "body": "I ask. But I've been ghosted several times when I  do. It's like I've asked for their firstborn."
    }
  ]
}