{
  "subreddit": "sandiego",
  "post_id": "1cmvoge",
  "title": "Escape room for 10-11 years kids",
  "body": "My daughter, 10 years old, suddenly asked me to go to an escape room for her birthday. I have never been doing it, so I have no idea what it is like.\n\nI looked up escape rooms in SD, but it appears no escpae rooms for kids. Do you think 10-11years kids can enjoy the escape room? I am worried it might be to difficult for them to enjoy. If you happen to know suitable place for kids, it would be highly appreciated.\n\nThanks in advance.",
  "author": "trewstyuik",
  "comments": [
    {
      "author": "myfavouritemuse",
      "timestamp": "",
      "body": "Red Door at Fashion Valley has kid appropriate rooms. We’ve taken our 8 year old and we have a great time! Adults have to supervise I think. There’s a fairy tale one, a carnival one and then their seasonal/rotating ones have been kid friendly as well."
    },
    {
      "author": "CoastSquirrel",
      "timestamp": "",
      "body": "Check outEscapologyat Belmont ParkWho can play Escapology?dropdown arrow grey Our games are best for players aged 12 and up, although younger children may participate as long as they are with an adult. The experience may not be ideal for children under the age of 7, as the puzzles might be too challenging for them to solve. Participants under 18 years of age must have a waiver signed by a parent or a legal guardian at the time of their experience."
    },
    {
      "author": "trewstyuik",
      "timestamp": "",
      "body": "My kid and I did one around that age.  We didn’t have our own group but just went in with strangers which ended up being a mixed age family group (parents, grandparents, teens and a bit younger) and we had a great time.  The mixed ages made it pretty fun because of all the different strategies.   So I recommend Including  a few adults or friendly older siblings and you’re good.   The escape room at Belmont Park should be pretty family friendly"
    }
  ]
}