{
  "subreddit": "AustralianPolitics",
  "post_id": "1ckos3n",
  "title": "The federal government has given an online age verification pilot the green light. Here's what we know about it",
  "body": "",
  "author": "CptUnderpants-",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Greetings humans.Please make sure your comment fits withinTHE RULESand that you have put in some effort to articulate your opinions to the best of your ability.I mean it!! Aspire to be as \"scholarly\" and \"intellectual\" as possible. If you can't, then maybe this subreddit is not for you.A friendly reminder from your political robot overlordI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "roberto_angler",
      "timestamp": "",
      "body": "It's a pilot. Surely we could learn something from the results?  The objective is a reasonable one. Why not have a go and see if we can pull it off without completely eroding civil liberties?"
    },
    {
      "author": "Nevyn_Cares",
      "timestamp": "",
      "body": "LOL money for friends to \"work\" on the impossible."
    },
    {
      "author": "Street_Buy4238",
      "timestamp": "",
      "body": "You mean it's impossible to get between horny teenage boys and that post jizz dopamine hit?!!?!"
    },
    {
      "author": "unepmloyed_boi",
      "timestamp": "",
      "body": "Many IT professionals will tell you parental tools are sufficient for monitoring your kid and have come a LONG way over the years, being more easy to use and setup...rather than an ID passport system that opens the door to ID theft, phishing and blackmail by tying people's browsing history to their ID and likely to cost taxpayers billions in damages.Makes you wonder if the government actually bothered consulting industry experts and professionals before putting forward these laws or if they have alternate motives."
    },
    {
      "author": "CptUnderpants-",
      "timestamp": "",
      "body": "And kids spending hours a day on smartphones and computers are bound to stumble across it, even if they're not looking for it.In my experience (I work IT in a school), stumbling upon a porn site isn't the common way a child first accesses porn. It is most commonly shared by other older children, often unsolicited.The only exception to this is Web advertising. Some innocuous sites may contain ads for porn sites. This hasn't been raised at all by this process and needs to be. It should be an offence to display a pornographic advertisement to a minor, and the advertising networks should be the ones responsible. It would effectively remove porn advertising to anyone in Australia.Responding to eSafety's roadmap last year, the government set a few tests that any age verification scheme would have to meet. They includedconfidence it can't be circumvented, can be easily applied to companies based abroad, and don't risk the privacy of adults looking to legally access porn.Well, there is the issue. Circumvention for all of this is trivial. They can't ban VPNs because business and government uses them extensively. They may not care so much about individuals, but it would be a considerable obstacle for businesses and government departments to fund equally secure and functional tech to replace it."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I would find this concerning, however, as a 30 year old man I can’t help but reflect on every failed attempt parents and teachers have made to police the internet (or anything else for that matter) in my lifetime. Teenagers, find a way, and just banning things never really works. Focus on something proactive, like education, not a typical boomer-solution like a ‘net-nanny’."
    },
    {
      "author": "unepmloyed_boi",
      "timestamp": "",
      "body": "Teenagers, find a wayExactly. Back when I was in highschool, even schoolmates that weren't tech savvy just dug through the internet for tutorials on how to bypass restrictions or jumped through other very intricate loops that made most bank heists look mundane. And now they have Ai to make researching bypasses even easier and give you eli5 explanations."
    },
    {
      "author": "CptUnderpants-",
      "timestamp": "",
      "body": "Education is the key. There are plenty of good programs to help educate children about the risks of porn, but particularly about how it doesn't reflect real world relationships or sex. However, many schools won't run them or don't have the money to. Some won't because the parents will believe their innocent little darlings would never access porn and so in their minds it would only achieve educating their child on how to access it."
    }
  ]
}