{
  "subreddit": "modhelp",
  "post_id": "n454ya",
  "title": "question about AGE verification, official Reddit position thereof. and if 3rd party Age verification is ALLOWED",
  "body": "thanks for both the time and effort involved in this. I run a NSFW reddit, that deals in a Very controversial topic/fetish. I DON'T want any issues, so have been asking for the mod team to help Verify. but I need to know, what/how can I Verify their age in a legit way. Thank you very much for your time",
  "author": "kallisti_gold",
  "comments": [
    {
      "author": "TheBulletBot",
      "timestamp": "",
      "body": "You could restrict your subreddit and have users request access by age verification."
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Hiu/deanec64, please seeour Intro & Rules. We are volunteer-run,not managed byReddit staff/admin. Volunteer mods' powers are limited to groups they mod. Automated responses are compiled from answers given by fellow volunteer mod helpers.Moderation works best on a cache-cleared desktop/laptop browser.Resources for mods are:(1)r/modguide'sVery HelpfulIndexby fellow moderators on How-To-Do-Things,(2)Mod Help Center,(3)r/automoderator'sWikiandLibrary of Common Rules. Many Mod Resources are in thesidebarand>>this FAQ wiki<<. Pleasesearchthis subreddit as well. Thanks!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Found regex match: NSFWYou might be asking about NSFW matters.  These are frequently-asked questions, so this auto-response has been set up for any mention of \"NSFW\" and \"18+\".FOR INFO ON:#how to change NSFW subreddit/post settings,#what limits NSFW subreddits face, and#advice on NSFW matters,please click here. Please also refer to Reddit'sNSFW content policy.Subreddit settings work best in a cache-cleareddesktop browser.(Limited option: mobile browser on desktop view.)If you found your answer, feel free to reply with \"<3 Automod\" or \"Thanks, Automod\". Otherwise wait for a human helper to come along to help you. This post hasNOTbeen removed.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "kallisti_gold",
      "timestamp": "",
      "body": "Plenty of NSFW subreddits require users to verify themselves before posting. Go look atr/gonewild's process for an example. Try reaching out to mods of various subreddits that require user verification to get their input on their methods."
    }
  ]
}