{
  "subreddit": "Quest2",
  "post_id": "1ics9tc",
  "title": "The ensh*tific@tion has began anew. Notice the feature is locked behind a VRC+ pay wall? Well, because so many users are going to want this to escape sqeakers, be in ERP servers without minors, and etc.? You're (likely) going to have to get it, cause they'll be the only type of servers with adults.",
  "body": "",
  "author": "countjj",
  "comments": [
    {
      "author": "LouisianaBurns",
      "timestamp": "",
      "body": "i would ask why do we have to use our id..is there any other way to do it?"
    },
    {
      "author": "PotatoSaladThe3rd",
      "timestamp": "",
      "body": "How else would you verify your real age?"
    },
    {
      "author": "LunarstarPony",
      "timestamp": "",
      "body": "I mean you can use passports("
    },
    {
      "author": "ShirBlackspots",
      "timestamp": "",
      "body": "Just now noticing this?  If you watch their update videos (which it shows you don't), you would understand why its available to VRChat+ members at the moment.  Using Personify costs them money, so for now, its available to paid members.  Eventually it will be rolled out system wide."
    },
    {
      "author": "mr_gooses_uncle",
      "timestamp": "",
      "body": "Idk what sort of places you people go. I just stand around at mcdonalds with my friend or play golf or whatever. Usually it's private instances, not because of kids, just because of randos interrupting.It's not gonna make me verify for that, right?"
    },
    {
      "author": "SomeHorologist",
      "timestamp": "",
      "body": "NoWhen you make it an instance, you can set it as adult only, which only age-verified people can enterProbably only gonna be used for things like ERP, or adult-only lobbies (ancients of VRC and such) where there will be drinking, or you just plain don't want to deal with kids"
    },
    {
      "author": "Ludo_IE",
      "timestamp": "",
      "body": "Servers with no kids.Take my money."
    },
    {
      "author": "Ancient-Data-8339",
      "timestamp": "",
      "body": "Get a job"
    },
    {
      "author": "countjj",
      "timestamp": "",
      "body": "Guess it’s time to move to banter :3"
    }
  ]
}