{
  "subreddit": "CashApp",
  "post_id": "1cnlzcg",
  "title": "can't verify my identity",
  "body": "Im new to cashapp so I dont know if this is my own fault but I've been trying to verify my identity so I can actually use my account but this error keeps popping up. After it asks for my id photos it asks me to take a picture of myself, so I click continue but before it even gives me the chance to take a picture it says there was an error verifying my identity. I've tried to contact the in app support multiple times but no matter what I can't verify my identity. The support did give me a link to submit images of my id claiming they'd verify but my verification is still having the same issue and I don't know why.",
  "author": "RepresentativeGas270",
  "comments": [
    {
      "author": "Aggressive_Trade_886",
      "timestamp": "",
      "body": "Hello, anyone with Cashapp. I have spent the last week submitting my identification and personal info at least 30 times, because that is all your customer service reps know to tell your customers . My ID is legitimate, my pics and personal information match, but you guys have kept me from having access to the money in my account for over a week now after speaking or chatting with no less than 10 different CSR's at your company. I had a Top Secret SCI clearance for 9 years in the Army, the highest you can get, but Cashapp has told me for a week straight that they can't verify my ID, even though everything is legible and up to date and accurate. Someone, anyone, please explain to me how that is not just possible, but in what universe is this acceptable to anyone on Cashapp's management team or employee at any level that takes pride in their job performance and/or quality of service given?"
    },
    {
      "author": "RoutineRutabaga3806",
      "timestamp": "",
      "body": "You have the latest version of cashapp right? Like it’s updated"
    },
    {
      "author": "CashAppAndi",
      "timestamp": "",
      "body": "Hey - please know the identity verification of the app allows you to verify your identity at your convenience. You can verify your account by:Visit the profile section in the top-rightScroll down to Security & PrivacyChoose Verify at the Identity Verification sectionFollow the promptsIf you're still experiencing an issue after attempting these steps, please send me a PM to look into this for you."
    },
    {
      "author": "kingschorr",
      "timestamp": "",
      "body": "y'all love to copy and paste this same message as if we haven't already tried those prompts 10 damn times"
    },
    {
      "author": "CashAppAndi",
      "timestamp": "",
      "body": "Hi there, Andi here. Feel free to send me a PM when you get a chance."
    },
    {
      "author": "Pho2gr4",
      "timestamp": "",
      "body": "I can't verify my identity because the picture on my government ID is from 1999 and I've grown older since then and my face has changed since then.Customer service sucks... First they tell me that they're working on the problem and then I get a new email that tells me to re-verify my account.  WTF?"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Im trying to do this to and it won’t even let me input my info it’s just errors when I try to start the process it’s annoying I can’t do anything"
    },
    {
      "author": "Alternative_Horse525",
      "timestamp": "",
      "body": "Literally going through the exact same thing and every time I contact support they just make me do the whole process over again... It's been a week and I finally said to hell with it and made a new account. I'm glad I'm not like some of the people in here with a larger amount of money in the account. Because I'd be LIVIDDDDD"
    },
    {
      "author": "ReturnPuzzled457",
      "timestamp": "",
      "body": "Bro I had a sponsorship with my mother, and I had direct deposit set up through cash app so when she cancelled the sponsorship, the money I was supposed to get from my paycheck disappeared and my boss said it went through so that sucks."
    },
    {
      "author": "RepresentativeGas270",
      "timestamp": "",
      "body": "I can't verify my identity and support won't help me I have.y social security checks direct deposit into my account and I've lost 1500+ at this point I'm so fed up someone please help I've been dealing with this for over two months now"
    }
  ]
}