{
  "subreddit": "PonyTown",
  "post_id": "1gt2k4o",
  "title": "Minors in 18+ server",
  "body": "The developers need to do something about minors in the 18+ server. Like put age verification or something. I just encountered a minor who was bragging about the fact that they just turned 16, and they were only interested in people who are 18 and older. And then a random person came to defend them, come to find out they were a minor as well. Who was arguing that they could be on the 18+ server, because they were the age of consent in their state. I’m so done.",
  "author": "Zero-The-Prizimix",
  "comments": [
    {
      "author": "Sketchy-_-Artist",
      "timestamp": "",
      "body": "I came across an 11 year old about a month ago! I was just talking to them and they were speaking about something very immature and childish so I asked their age. I let them know that this was an 18+ server and not a safe place for them to be and to check out the safe server instead. They left, but looking back on it, I should have screenshotted and reported them. Who knows if they took my advice or not."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Age verification would be good, but how would it work? ID?In most places (or my state atleast) You can't legally get an ID card until you're sixteen."
    },
    {
      "author": "Crypt1c_Chaos",
      "timestamp": "",
      "body": "ID could work. I know there’s a bunch of websites and apps that have used that for age verification. I would go through the extra steps just to verify my age if it meant keeping minor off of the 18+ server."
    },
    {
      "author": "ShinyKitsun3",
      "timestamp": "",
      "body": "Roblox use id or phone number for the verification sistem"
    },
    {
      "author": "mylittlepegasister",
      "timestamp": "",
      "body": "Phone numbers may not work seeing that everyone, including kids, have smartphones nowadays."
    },
    {
      "author": "jigsawsunderling",
      "timestamp": "",
      "body": "\"you're a pedophile!\" over an 18+ joke in an adult server 😭"
    },
    {
      "author": "Bre3zy23",
      "timestamp": "",
      "body": "Tbh.. safe server isn't that safe either for minors. 18+ isn't either."
    },
    {
      "author": "Abiskaamex",
      "timestamp": "",
      "body": "When i was 12 i was playing on pg and i met a person who then gr∅omed me when we moved on discord. He was 18 at the time. You'll never be safe even on pg but at least the chance is lower.. i think"
    },
    {
      "author": "Acceptable-Road2210",
      "timestamp": "",
      "body": "It’s almost disheartening in a way? I totally understand kids will be kids and unfortunately that means getting curious and trying to bypass ways to access 18+ things but I remember seeing someone who admitted they were 10 on there- A bunch of people were telling them to get off and I just remember them saying at some point “silly adults, they think they know whats best for me” and I remember getting so SO concered for them. I should’ve screenshotted who they were, but all I can do is hope they’re being safe."
    },
    {
      "author": "Zero-The-Prizimix",
      "timestamp": "",
      "body": "I find it funny that things have been said for a LOOOOONG time now about minors being in the 18+ but the staff honestly wont do much else than whats set up because its too much effort to add a security option with ID verification. its been done before but they wont do it because what has been done is enough to be considered legal so why put in the work to secure it more. Nothing will be done and sadly adults need to be used to being on guard about possibly accidentally talking to a minor pretending to be an adult and then the minors being open about being kids and being targeted by creeps. I dont wanna sound like a downer but ive been on this game for years and people complained and complained and nothing is ever done.edit: They have more important things to do like adding the abily to smile and nod and adding more cloths for the characters /s"
    }
  ]
}