{
  "subreddit": "CamGirlProblems",
  "post_id": "f8tx6d",
  "title": "Please Help: Age verification process on Chaturbate (got denied 8 tines now)",
  "body": "I've been trying for 4 hours now... I've submitted both pictures of my ID and a pic with me holding the ID... I've tried it 8 times now and it always says that my Face or the ID is not entirely visible ; even tho it is clearly visible , not cropped,I dont cover my face with the ID or anything... (I did try taking new pictures)\n\nIts just so frustrating,I already contacted the support but nothing.\n\nPlease help me , thanks in advance.\n\nEdit: after trying and trying the 18th attempt was approved\n\nThanks for your help :)",
  "author": "anxiety-rate747",
  "comments": [
    {
      "author": "mirkraa",
      "timestamp": "",
      "body": "This happened to me few times too, I get how frustrating it can be. I took milion of photos and they all got denied for same reasons like yours.My only advice is to just retake photos on the best light possible, not with a front camera and just try again. Make sure your whole face is in, ID can’t cover even a little part of your face. I was thinking everything is perfect but there always was some problem. Then I had my bf taking photos of me in front of the window, great lighting, ID was readable, no fingers covering any part of ID and so. I don’t think they were any better than my photos but after another try, boom, I got verified. I was honestly in shock, I have no idea what’s the reason but you better just try and try. I actually wrote to support too asking what to do but I don’t think my message even got to them as I tried again just after I send it and suddenly it was working."
    },
    {
      "author": "Sundae-Mcflurry",
      "timestamp": "",
      "body": "Thank you so much, I well keep on trying :)"
    },
    {
      "author": "rainbowbite83",
      "timestamp": "",
      "body": "I had to look straight forward at the camera, no angles, to get approved."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Have you written to support? Sometimes it helps getting a human involved so they can look at it. That happened to me to a while ago and actually mailing support fixed it quickly."
    },
    {
      "author": "alexislayne31",
      "timestamp": "",
      "body": "I found I have to hold the ID card in a very specific way at the edges, take the photo with the back camera, & be dead on, no angles to the side, up or down, & look DIRECTLY at the camera lens. I've gotten six people approved on my account thus far, & yeah, that's what it takes for it to go through the first time."
    },
    {
      "author": "anxiety-rate747",
      "timestamp": "",
      "body": "Hi,quick question, i have the same issue with the age verification, did you do 8 different picture and submitted it to them till they accepted it?or you juat uploaded it 8 time till they did? Thanks"
    }
  ]
}