{
  "subreddit": "japanlife",
  "post_id": "n4i53m",
  "title": "Tinder age verification not reading my ID",
  "body": "Anyone else have this issue?  Basically, I've tried using all my different ID forms for Tinder's age verification.   I've tried getting the perfect picture with no glare over and over, and it keeps rejecting it.   I've tried my residence card, and passport, yet no luck.  I was hoping to use the app to just get a quick language exchange partner/more friends over here but you can't chat unless you get age verified and it just won't cooperate.\n\nI searched and didn't seem to find this question anywhere answered cleanly so thought I'd post it here and get a feel for if its a common or rare problem.\n\nIs this a common problem?\n\nUpdate: Got a Japan driver's license, which worked, so I'm wondering if it's not just something wrong with my passport.  So problem fixed!",
  "author": "ShoujoSchmoe",
  "comments": [
    {
      "author": "KabukichoThottie",
      "timestamp": "",
      "body": "This post is so thirsty I actually walked into a conbini to buy a drink because it sucked the moisture from the air around me.“Quick language exchange” lmao who are you trying to convince?"
    },
    {
      "author": "P_Castiglione",
      "timestamp": "",
      "body": "Probably a typo. Pillow talk instead of hello talk?"
    },
    {
      "author": "ShoujoSchmoe",
      "timestamp": "",
      "body": "Considering I just learned hello talk exists, and that people told me Tinder was a good place to find people in Japan who were just looking to get free language practice, I'm probably going to ditch Tinder tbh.  The only person I found on there that I actually wanted to message regarding language exchange and the system blocks me.  Plus, I just looked into Hello Talk and it seems like a better way to go about it."
    },
    {
      "author": "Y0y0y000",
      "timestamp": "",
      "body": "“quick language exchange”"
    },
    {
      "author": "vproeco",
      "timestamp": "",
      "body": "Jesus man."
    },
    {
      "author": "bloggie2",
      "timestamp": "",
      "body": "hello talk doesn't require age verification to just chat"
    },
    {
      "author": "ShoujoSchmoe",
      "timestamp": "",
      "body": "Just learned this exists, so probably going to just swap to this.  I never really liked Tinder all that much anyways."
    },
    {
      "author": "nihilestsanctum",
      "timestamp": "",
      "body": "Never had any issue with my driver's license, so try that if you have one.By the way, Tinder is awful for a \"quick exchange and friends\", but works wonders for one night stands and hooking up with married housewives."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Ignore the a*holes in the comment section. Do your thing!"
    },
    {
      "author": "ShoujoSchmoe",
      "timestamp": "",
      "body": "It is weird how many people came out of the wood work just to berate.  It's like, if it was a \"thirsty\" post, 1: there's nothing wrong with dating and sexuality?  So it's weird having everyone put up a stink about it  2: I heard TONS of people recommend the Tinder way of getting free language practice with native people so long as you exchange English, though I've yet to have luck in that realm.I can't imagine what the ACTUAL \"dating in Japan\" posts are like in this subreddit and how the comments are on those."
    }
  ]
}