{
  "subreddit": "technology",
  "post_id": "1jz6p8y",
  "title": "Why I Emphatically Oppose Online Age Verification Mandates",
  "body": "",
  "author": "Friggin_Grease",
  "comments": [
    {
      "author": "gordonjames62",
      "timestamp": "",
      "body": "This is a big deal.Any time you give people the opportunity to access your ID, you give them the opportunity to manipulate your ID and use it for their purposes which may not be legal or in your best interest.  Also consider how many websites have had data breaches where user data is now for sale on the dark web.I strongly oppose porn, but using the existence of porn sites as an excuse to track Internet users and access their government ID is a mistake.Here is the direction I think it will go.Require \"age verification\" for pornRequire \"age verification\"  for social media accounts (we must protect the children)require age verification for streaming mediaAll these will be part of the trend towards a digital ID that allows tracking at every point on the web.this is a bad idea at every pointIt is my job as a parent to monitor my minor kids internet use.I do not trust government policy to parent my kids."
    },
    {
      "author": "Friggin_Grease",
      "timestamp": "",
      "body": "I can't believe anybody thinks any of this is a good idea"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "N/A"
    },
    {
      "author": "Redd868",
      "timestamp": "",
      "body": "The reason I oppose it is because it is a war on anonymous speech.Protections for anonymous speech are vital to democratic discourse. Allowing dissenters to shield their identities frees them to express critical minority views . . . Anonymity is a shield from the tyranny of the majority. . . . It thus exemplifies the purpose behind the Bill of Rights and of the First Amendment in particular: to protect unpopular individuals from retaliation . . . at the hand of an intolerant society.McIntyre v. Ohio Elections Commission 514 U.S. 334 (1995)There is a war on political speech, where if one opposes a practice of ethnic cleansing, that political position is deem antithetical to U.S. foreign policy."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I think less people should think of the children, if we're being honest"
    },
    {
      "author": "Friggin_Grease",
      "timestamp": "",
      "body": "I think less people should think of the children, if we're being honest"
    }
  ]
}