{
  "subreddit": "linkedin",
  "post_id": "1clt22h",
  "title": "Linkedin ID verification with withpersona. How safe or legal is this?",
  "body": "Basically, Linkedin temporarily restricted my account without any warning and refuses to explain the exact reason for the restriction. Last things i did was update some settings on my account, more exactly remove my phone number, activate MFA and update my password. i don't if it was exactly this reason.\n\nI managed to open a support ticket and i am still until today talking to them on twitter, they have a twitter help account. The whole conversation i had so far, is them making me verify myself in this platform called withpersona with my government ID, driver's license or passaport.\n\nOne thing to address, i've never heard of withPersona until now, and i don't trust its reliability.\n\nMy question here is: How safe is this kind of verification requested by Linkedin? Is this even legal?",
  "author": "Mr_Xano",
  "comments": [
    {
      "author": "Relevant-Pop-2595",
      "timestamp": "",
      "body": "Same happened to my account about a month ago. Couple of days before that I've changed my psw, updated phone number and added MFA. Since then everything was working fine for few days, it felt good that my LinkedIn security got bit stronger. Then suddenly out of nowhere without any logical explanation my account became restricted and basically inaccessible. This directly impacted login steps which when logging in through web redirected me to the LinkedIn app where I was asked to verify my ID viaPersonaservice. Unfortunately bad luck in my case even after uploading 2 different IDs this service became stuck and continued to show this message for over a WEEK!After that I've started to seriously push both Persona and LinkedIn starting with Persona first through theirhelp centerand their onlysupport contactI found. Unfortunately Persona covered their \"ID data collecting\" back and finger pointed LinkedIn for this situation in classic blaming game and repeatedly stated to contact them first. However double bad luck was that LinkedIn doesn't allow to place support ticket under account which is currently restricted or inaccessible. Finally Persona gave me one more option to contact them through \"Data Subject Access Request\" (DSAR), however this option didn't help as well and their response was same as before to contact LinkedIn! By then I was really pi$$ed and started to knock really loud on LinkedIn & Microsoft \"heaven\" HELL doors\"!As I've mentioned LinkedIn doesn't allow users to place ticket under account which is restricted/inaccessible, because in order to do that guess what?! - you need to be LOGGED IN! So you are basically stuck and left with only option to contact their support through other unrestricted/accessible account, which I had to register. However, even after creating support ticket under new account regarding restricted account they are unable to help and kept repeating - that it has to be done from account user is placing ticket. By then I was really, REALLY PI$$ED! and I've started to write messages to theirLinkedIn pageto immediately start solving my account restriction! Somehow I got lucky and person from LinkedIn support sent me psw reset link to restricted account email, which miraculously worked and I was finally able to access my account without Persona ID verification restriction. BTW, I've tried psw reset through login forgot psw option before that and it didn't work!Later on in conversation with LinkedIn support they mentioned there's a \"hidden\" way tocontactthem even with restricted/inaccessible account through thislink.Their representative also continued to explain possible reasons why accounts can become restricted/inaccessible and benefits of the verification badge:1. ID verification during account restriction:here are possible reasons why LinkedIn restricts an account. During an account restriction,we need to verify your identity to ensure that only you regain access to your account and not any unauthorized person.2. Verifications on your LinkedIn profile: A verification badge on your profile shows that you were able to confirm specific information about your account.The benefits can be explored in this link.All of that doesn't answer MAIN QUESTION - why in HELL! isn't LinkedIn under all mighty Microsoft able to verify and unblock users with active MFAand verified phones when their accounts become restricted/inaccessible and they are stuck by Persona ID verification which takes over week or more to complete?!Once again big tech corporations have shown that quality of their user support is on the bottom of their investment bucket list. They rather spend billions on something which will push their loyal users even further away from them. It can be worse (Meta), but also much better!Hope this will be helpful to somebody in similar situation."
    },
    {
      "author": "MilkAdCreative",
      "timestamp": "",
      "body": "Welcome to the family. I've been trying on and off for 6 months through Persona and through Clear. I've had Linkedin for 10 years and they blocked my account randomly one day. They told me to go to a notary and verify my ID, then send them an email. I'm not paying $55 to verify an ID that's active and legit."
    },
    {
      "author": "Beardcore84",
      "timestamp": "",
      "body": "It’s not withPersona, it’s Persona, it’s safe, well known, and obviously legal."
    },
    {
      "author": "A1sculsett",
      "timestamp": "",
      "body": "\"well known\""
    },
    {
      "author": "TheAgonyUncle",
      "timestamp": "",
      "body": "Is Persona a Government agency? No! So why is it safe to share personal Government ID with a ‘well known’ third party company?"
    },
    {
      "author": "ssqq43",
      "timestamp": "",
      "body": "Why so obvious? Many of these share data with poorly defined \"3rd parties\". More obviously not legal - grey area."
    },
    {
      "author": "Building_The_Rainbow",
      "timestamp": "",
      "body": "Hi! here is a help center article that speaks about Personahttps://www.linkedin.com/help/linkedin/answer/a1631613?hcppcid=search- This might help with your questions"
    },
    {
      "author": "Less-Opportunity5117",
      "timestamp": "",
      "body": "It's an excuse that's all it's a data harvesting excuse. The reasons regarding combating misinformation and security ostensibly makes sense but is the standard excuses, just corporate boiler plate.. there's always a reason, and then a good reason, and the real reason. and the real reason here is data harvesting. And frankly LinkedIn is going to find itself in a position in which it ends up with a lawsuit at some point."
    },
    {
      "author": "Ok_Dot_2150",
      "timestamp": "",
      "body": "I am in similar situation - my account is restricted temporarily. Did not get email about it, nothing. I suspect my account was blocked because I might have VPN on and was logging in, but I am guessing.To get it back Linkedin requires ID verification.I have 2mfa enabled. I have my email. I have both devices I used to login and same home network. I could even ask people who know me on Linkedin to confirm I am trying to login (something like Facebook has). I think ID verification like this is too much!Is Persona safe? Probably yes. I don't know them.Not sure what you will choose to do, but I will never upload my valid ID anywhere online!So right now I have my account closed and I don't think I will ever try to have another social media account with my real name on it :("
    },
    {
      "author": "Mr_Xano",
      "timestamp": "",
      "body": "I feel you brother. I am sort of in a war against them. I am talking to them via email and twitter and they refuse to do anything or answer my questions about why i got the restriction unless i upload my id.I've never seen a social media requesting this kind of verification and the legality of this is something i have been questioning a lot lately.Funny, is that they only answer your DMs on Twitter if you publicly call them out.One thing i did was to film my facing holding a paper with my name and DMd that video to them on twitter. I even hurted my eyes because i used an old pair of glasses that i use in my Linkedin pfp. Lets see if they have enough brain cells to reason with this."
    }
  ]
}