{
  "subreddit": "ProlificAc",
  "post_id": "1czvlpi",
  "title": "Is it normal for ID verification to take longer than 10 days?",
  "body": "I submitted my ID two weeks ago, and the onboarding page still just says the process could take \"up to 10 days\".\n\nI contacted support near the end of day 10 or beginning of day 11 to see if there was an issue. They said the team would review my ID \"as soon as possible\" and thanked me for my patience. I thanked them for their response, and again asked if there was an issue with my ID or if this was normal. That was 3 days ago, and they have not responded.\n\nAnyone who has joined recently, did you have to wait more than 10 days for ID verification? Were there any issues you had to resolve? I'm just trying to figure out if I should be waiting patiently or troubleshooting.\n\nMy spouse joined on the same day as me (we both got promoted off the waitlist at the same time) and they are also still waiting.",
  "author": "Ok-Refuse6642",
  "comments": [
    {
      "author": "kayennz",
      "timestamp": "",
      "body": "I joined on Thursday and my ID was verified almost instantly. I used my NZ passport if that makes a difference? I assumed since it was processed so quickly it was an automated check/pass.I wonder if yours has failed an initial auto inspection so has now gone for human review which is causing the delay."
    },
    {
      "author": "btgreenone",
      "timestamp": "",
      "body": "They are absolutely overwhelmed right now so there's not much you can do other than wait."
    },
    {
      "author": "ThrowawayTheOutlier",
      "timestamp": "",
      "body": "Good to know, thank you!I don't mind waiting if that's all that's happening, I understand the staff are only human. I was just afraid there'd been some issue with our IDs that we would just never find out about 😅"
    },
    {
      "author": "Ok_Confection_9936",
      "timestamp": "",
      "body": "Dd thy approve n accept u"
    },
    {
      "author": "ThrowawayTheOutlier",
      "timestamp": "",
      "body": "Yes they eventually got to us!"
    },
    {
      "author": "Ok-Refuse6642",
      "timestamp": "",
      "body": "My verification has taken nearly 2 months so far, I'm from the UK and i used my drivers license. 😫"
    }
  ]
}