{
  "subreddit": "CreatorsAdvice",
  "post_id": "11y27ci",
  "title": "ID verification via YOTI and Jumio - help me understand?",
  "body": "I have been creating on patreon and they have now switched to IDVerification using Jumio. I have opted not to ID verify up.until this point because I have concerns about data breeches/leaks. I don't necessarily mind if I'm linked back to patreon, but I'm scared of identity theft if the services are hacked/breeched.\n\nMy fiance works in IT and even he doesnt have great answers for me in terms of explanation and Google searches are useless. I've even asked cyber security sub reddits and got nothing.\n\nI assume many here use ID verification. Can you explain how you know it'd safe and trust it? I'm thinking of getting Aura if I decide to verify.",
  "author": "Active-Proof2330",
  "comments": [
    {
      "author": "SansaAdvice",
      "timestamp": "",
      "body": "There is always a chance of data breach, no two ways about it.IDs have been leaked before on sextpanther but that was due to hugely negligent data handling and basically 0 security measures. This is big time speculation on my part but I think sites like onlyfans and patreon using a third party to verify ID could potentially be a good thing because it seems less likely that information like images of your ID are being stored in the same place as account information and these company's entire business is handling sensitive data, its their only job so hopefully they are good at it. They have a page about their securityhttps://www.jumio.com/about/technology-security/. If identity theft is your biggest concern there are fraud prevention services you can contact if a leak ever happens and they can help prevent someone taking out credit cards in your name and all the rest. It's not likely but you are not wrong to consider it."
    },
    {
      "author": "VioletViceAudio",
      "timestamp": "",
      "body": "I am thinking about getting Aura if I go ahead with this (aura is an identity theft prevention service)"
    },
    {
      "author": "Active-Proof2330",
      "timestamp": "",
      "body": "Jumio is totally secure. They have the best data and IT security team."
    }
  ]
}