{
  "subreddit": "FACEITcom",
  "post_id": "1agzhsq",
  "title": "Verification method is excessive and unreasonable",
  "body": "Hello there.\n\nI've never thought I would be posting on reddit about faceit... And still, here I am...\n\nAfter a game I and some of my friends got \"u should verify profile...\" kind of thing. \"Ok\" I thought, but then I've read the way verification should be done, aaaand... I have strong issues with the way verification is established... By points:\n\nmy main point is that for me as a casual player this seems ridiculous to be verified on GAMING platform by personal photo and passport like for gambling or crypto exchange of some kind\n\nI don't really get, how it helps in any kind of \"suspicious activity\" prevention, as I've played with dozens of players without verification with somehow 30-50 matches (on faceit) and empty steam profiles with 1-2 free to play games and 100-300h of CS. If one can create new profile, smurfs and multiaccs will always exist, boosters will boost (in party even on verified accounts and on someones accounts by using their creds and on new unverified accs) and for anticheat it is... u know... anticheat\n\nI have steam profile with 15 years history, with lots of bought games (CS was bought too, when it wasn't free to play), inventory for 300+$ and almost 2k hours of CS on record etc, so it looks pretty \"verified\" for me. And I cannot unlink my profile or use it for new acc on faceit. Screenshots for eye catching)\n\n\n\n\n\n90% of time (or more) I was playing with my friends (which have been my friends for years on steam and most of them in real life). What suspicious u can see in it idk.\n\nI've send all those thoughts to faceit support (ticket 5670557) but it (support) seems pretty \"scripted\" and not very responsive.\n\nSo, in conclusion, here on reddit is kinda my last resort to stay with faceit, as (again) I'am not ready to send this kind of data to GAMING platform for casually playing game I own (even for services this platform provide) and I don't really see any point, why I should (btw even in terms and conditions there is not a word about requirements to send THIS kind of data to use platform services), as even steam, where I can buy mature games and trade items for real money, don't ask me to do so. But I really would like to have opportunity to play on faceit, cause my mates play there and CS is the way I communicate with my friends abroad.\n\nThanks for all who has read and for those who would help (if would)).\n\nThat's it, folks)",
  "author": "eebro",
  "comments": [
    {
      "author": "Laretus",
      "timestamp": "",
      "body": "+this doesn't seem to stop smurfing in anyway"
    },
    {
      "author": "Aggravating_Math_623",
      "timestamp": "",
      "body": "I had a friend in master league who told me verified accounts cost $15, so yeah, it does nothing."
    },
    {
      "author": "LexFennx",
      "timestamp": "",
      "body": "when the verification shit rolled out I was quoted 45-60 bucks for a level 10 acc with verification XD"
    },
    {
      "author": "ActiveSelect5144",
      "timestamp": "",
      "body": "I did it, waste of time as there are still no verified only queues, which were promised.Don't worry though, faceit have added voice comms.. (like who asked for this)??Faceit too busy catering to pro players demands via twitter rather than addressing the majority playerbase who are not pro, but actually prop up this mediocre (at best) platform."
    },
    {
      "author": "orhunadam",
      "timestamp": "",
      "body": "verification has no purpose, you will still get matched with unverified people and there are plenty of people selling verified accounts."
    },
    {
      "author": "FACEIT_Darwin",
      "timestamp": "",
      "body": "I believe this article will explain most parts of your concerns -https://support.faceit.com/hc/en-us/articles/8650124346780-Verification-FAQIf you have any other questions after reading that, let me know and I will try my best to answer them or send them to someone who is better placed than I to do so."
    },
    {
      "author": "Asatopskii",
      "timestamp": "",
      "body": "Not OP but I do have a questionWill it ever happen that verified users will play strictly against verified users?And the question that you can leave unanswered: is it still not done because that will affect the amount of premium subscriptions? I mean verified queue already seems on par with supermatch"
    },
    {
      "author": "SpaceINpacE",
      "timestamp": "",
      "body": "Hello, thanks a lot for a response.I've read this article before and read it one more time now.There are statements that doesn't seem valid. Like it is not clear, how it gain it's aims. There are still lots of unverified users and possibility to create new steam->faceit account any time you want (even during all this verification process u're asked weather this account is \"main\") and use it to ruin others game experience.There is a point about competitions and it is totally ok, but not for casual play.Generally, I've never counted \"smurfs\" as a problem (is it really important why someone plays better than you, cause he is talented or smurf, you just not good enough to deal with him?).I've heard different opinions yet still I'm not ok with sending my data to anyone to play computer game (especially if I don't really get the point).Anyway, as far as I understand there is no way to restore game queue availability for me without verification?Thank you, once again.Best regards."
    },
    {
      "author": "SpaceINpacE",
      "timestamp": "",
      "body": "P.S. I may have been ok with \"just selfie\" verification type of thing, but it is still \"coming\"."
    },
    {
      "author": "eebro",
      "timestamp": "",
      "body": "It’s an external service, they have certain standards. Faceit buys the service, so you going to support won’t matter at all.You aren’t sending any data to Faceit. You’re sending it to the service provider, who serve airfaring companies, healthcare systems, banks, etc.And the whole process takes about 5minutes if you have a valid id and a phone.Edit: for you personally, I recommend verifying, because it improves the quality of games. You’ll get much less unverified users in your games."
    }
  ]
}