{
  "subreddit": "Mercari",
  "post_id": "1j9pffv",
  "title": "I’m so frustrated with the ID verification",
  "body": "This is so frustrating!!☹️\n\nI joined this platform, listed items, verified my email and phone, successfully sold a few things. Then, out of nowhere, I’m told I need to verify my government ID to access shipping labels.\n\nI tried to comply because I didn’t want buyers to experience delays. But the third-party verification app kept failing - I suppose it wouldn’t recognize my face or ID (I used 2 different legitimate, government-issued IDs). Now, I’m stuck having to contact customer service to verify my identity.\n\nI immediately reached out, uploaded my IDs, and followed up multiple times - no response. I called, but the system said the wait time was over 10min and automatically ended the calls.\n\nHas anyone else dealt with this? Any tips on how to get this resolved faster?",
  "author": "dontdownvotemethx",
  "comments": [
    {
      "author": "No-Impact-9868",
      "timestamp": "",
      "body": "Same. My ID has been in \"Submission in review\" for MONTHS now. And my email verification link never shows, no matter how many times I click it. I was able to still list via the app instead until recently. Support has done absoultely nothing to help. I hate to say it, but it may be time to move on. Mercari is clearly incompetent when it comes to this whole verification process."
    },
    {
      "author": "Party-Confusion3728",
      "timestamp": "",
      "body": "No I've been selling with them for years is this new?"
    },
    {
      "author": "dontdownvotemethx",
      "timestamp": "",
      "body": "I guess so? I joined a week ago and am barred from accessing the shipping labels since I don’t have the gov id verification complete :("
    },
    {
      "author": "Constant-Onion9987",
      "timestamp": "",
      "body": "The more you fail the verification, there will be a point where it will suspend your account. Support is literally the worse and won't respond in time.An ID just to access a shipping label is the dumbest thing I have seen from a selling platform.eBay doesn't do this crap, Poshmark nor Etsy does this."
    },
    {
      "author": "dontdownvotemethx",
      "timestamp": "",
      "body": "Yeahhh literally what happened to me. I failed it for many times (idk why, it was a valid id but the app just didn’t recognize it) so they’ve blocked the verification for me. Right now they are giving me BS answers without any solution, not picking up calls. I’m so very angry"
    },
    {
      "author": "akpana65",
      "timestamp": "",
      "body": "Also have to have a debit or credit card on file….in the fine print"
    },
    {
      "author": "Party-Confusion3728",
      "timestamp": "",
      "body": "Or bank account"
    },
    {
      "author": "dontdownvotemethx",
      "timestamp": "",
      "body": "Thank you for letting me know! And yes I do have that."
    }
  ]
}