{
  "subreddit": "ShopifyeCommerce",
  "post_id": "1jttya3",
  "title": "What's new in e-commerce? 🔥 Week of April 7th, 2025",
  "body": "Hir/ShopifyeCommerce- I'm Paul and I follow the e-commerce industry closely for my Shopifreaks E-commerce Newsletter. Every week for the past 3+ years I've posted a summary recap of the week's top stories on this subreddit, which I cover in depth with sources in the full edition. Let's dive in to this week's top e-commerce news...\n\nSTAT OF THE WEEK:Two-thirds of jobs on Indeed demand skills that AI can already handle, leaving around 300M jobs at threat, according to the company's CEO Chris Hyams. However he claims that there's not a single job posted on the job platform that AI could do completely alone, and that people will still be needed at the core of every department. Great, so only 90% of the department will be fired…\n\nAmazonhas begun testing a new AI-powered feature called“Buy for Me,”which allows its app to make purchases for you from other websites. When a customer searches for an item from a particular brand, they may see a section of results labeled “Shop brand sites directly.” If they click the “Buy for Me” button underneath an item, they are taken to a product detail page inside the Amazon app that provides product information similar to what they'd see on one of Amazon's own listings, and if they decide to move forward with the transaction, Amazon will purchase the item for them from the brand's website. The feature is currently in beta and only available to a subset of customers in the US via the Amazon app, featuring a limited number of brand stores and products for now.\n\nTheUNaccusedTikTokof “profiting from people's misery” by taking fees and commission of up to 70% on digital gifts given to children who beg on the platform via TikTok Live. TikTok says it bans child begging and other forms of begging it considers exploitative, and that it has strict policies on users who go live, but an Observer investigation found the practice to be widespread. Many of the live streams showed families with young children begging in their homes, elderly individuals in wheelchairs, and even people doing degrading and dangerous stunts in exchange for virtual gifts.\n\nGooglerolled out a new feature that automatically uses a businesses' e-mail newsletter to automatically display marketing content such as new arrivals, sales, and promotions across Search, Shopping, and Maps. Google will particularly extract and showcase links to social media channels, highlighted social media content, current and upcoming sales / promotions, brand images and videos, and brand voice values. Merchants are automatically enrolled in the program but can opt-out anytime via Merchant Center.\n\n​Over the past week,President Trumphas made major changes tointernational tariffs, some which have been deemed early successes, and others which have quickly come back to bite us. On April 2nd, Trump declared the day as \"Liberation Day,\" unveiling extensive tariffs across more than 60 countries, including an additional 34% on Chinese goods, totaling an effective rate of 54% when combined with existing tariffs. China announced a 34% tariff on all US goods in response, and both the EU and Canada signaled intentions to implement countermeasures. The announcements led to significant declines in global stock markets.\n\nOn April 4th, 2025, President Trump signed an executive order granting another75-day extensionforByteDanceto divest its US operations before a ban would be put in place, aiming to provide additional time to finalize a deal that aligns with US regulatory requirements. Negotiations for the sale of TikTok's US operations later faced setbacks after President Trump announced new tariffs on Chinese imports, including a 54% tariff rate on Chinese goods. This action led China to halt approval processes for the deal until there could be negotiations about trade and tariffs. Ooh, so close!\n\nAffirm's COO Michael Linfordsaid the company wasn't interested in competing with Klarna for Walmart's business because doing so wouldn't have made economic sense, as Walmart accounts for only a sliver of its business. Walmart, which Affirm first partnered with in 2019, made up about 5% of the company's GMV and 2% of its adjusted operating income in the second half of last year. Last month,Klarnadisclosed that it would be the sole provider of BNPL loans through OnePay, a Walmart-backed app that customers can use to pay in-store or online. It was recently revealed that Klarna had to offer Walmart 15.3M warrants that can be converted into Klarna stock, valued at $500M, in order to land the exclusive partnership.\n\nSpeaking of Klarna...the company revealed that they've decided to postpone their IPO yet again due to newly announced tariffs and other market conditions. Klarna was aiming to raise more than $1B at a more than $15B valuation. Ticketing marketplace StubHub has also delayed its IPO plans, citing similar reasons. contemplated an IPO in 2021, but decided not to proceed due to unfavorable market conditions. They confidentially filed to go public in November 2024, and last month publicly filed its IPO prospectus, planning to list on the NYSE under the ticker symbol “KLAR” — but two days ago, changed their mind. Oh well, there's always 2029!\n\nSpotifyintroduced a new programmatic offering called Spotify Ad Exchange (SAX), which allows advertisers to reach its logged-in users via real-time auctions of its audio, video, and display formats across music, with podcast support on the way. Spotify also announced that it inked new partnerships with Google's Display & Video 360 and Magnite (available now), with Yahoo DSP, Adform and others coming soon. Lastly, the company added generative AI audio ads to its ads manager, allowing buyers to generate a script, edit the draft, add voice-overs from a library of voices, and select background music.\n\nAmazon's average prices for sponsored product adswere 48% higher in Q1 2025 than in Q1 2019, compared to a 41% rise on Google ad prices, a 37% rise on Instagram, and a 24% decrease on Facebook, according to data from the Tinuiti ad agency. The increase in ad prices, along with new ad placements that litter customers' shopping experiences across every page, have helped turn Amazon’s ads business into a $56B a year empire. However the rising cost of ads may also be causing some sellers to switch to offering discounts and coupons (which have also recently gotten more expensive), or at times, move their ad dollars to other platforms.\n\nThe cost of ads are one factor that are leading tohigher prices for consumers on Amazon.The average price of goods sold by 3P sellers on Amazon rose by 6.7% from December 2023 to December 2024, according to SmartScout's Amazon Inflation Tracker, outpacing the Consumer Prices Index, which rose 2.9% during the same period. Scott Needham, CEO of SmartScout, says that rising FBA fees are at the heart of the price increases, which is why nearly 65% of third-party sellers increased their prices on the marketplace last year. 39.5% of Amazon Prime members said they noticed significantly higher prices versus a year ago for household essentials items.\n\nBrazil's antitrust regulator, Cade, is investigatingApple's App Tracking Transparencyfeature following a complaint from Meta, which alleges that Apple's own apps are exempt from the user consent requirements imposed on third-party apps. Cade is examining whether Apple collects and processes user data under more favorable conditions than those offered to third parties, potentially leading to future penalties if the practices are deemed unfair. The App Tracking Transparency feature was introduced in 2021, requiring third-party apps to show a pop-up asking if iOS users want to allow a specific app to track them across other apps and websites, which unsurprisingly caused most people to opt-out of being tracked.\n\nShopifysigned a lease for office space in Bellevue, Washington, subleasing approximately 31,000 sq. ft. from Google at the 112 @ 12th building east of Seattle, becoming the latest tech company to tap into the Seattle region's talent pool. There are more than 100 companies with engineering centers in Seattle including Amazon, eBay, Salesforce, WeWork, Zoom, OpenAI, and ByteDance. Hmm… opening a new US office… switching its stock listing to Nasdaq… listing a US address alongside its Canadian headquarters for the first time as principal executive offices… It kind of feels like Shopify is moving towards becoming a US citizen.\n\nAmazonprojects that its AI shopping assistantRufuswill indirectly contribute over $700M in operating profits this year as a result of its product recommendations increasing consumer spending on its marketplaces, according to an internal planning document obtained by Business Insider. The outlook is part of a metric called “downstream impact,” which is an internal financial figure the company uses to measure a product's potential to generate additional consumer spending. The document revealed that Amazon plans to expand Rufus globally and enhance its AI model for better service.\n\nQVC Groupentered into an agreement to host shoppable livestreams onTikTok Shop, featuring original QVC and HSN content created specifically for the platform. QVC first launched on TikTok Shop last August, and the expanded agreement introduces a wider assortment of brands and products to the platform alongside the opportunity to collaborate with TikTok Creators. Since launching on TikTok Shop, QVC reports that over 74k creators have featured its items on shoppable videos and livestreams.\n\nAmazonpromised free DSP spend for brands that committed to increase ad spend in 2025, and then delivered untargeted placements that they couldn't sell elsewhere. Brandon Fishman, CEO of VitaCup, shared his company's results after spending their $74,496 of free bonus DSP dollars, which showed 21.5M impressions, 3,670 clicks (0.02% CTR), 1,752 add-to-carts, 426 purchase, and $11,277 in total sales. Despite many brands being pitched this “guaranteed inventory” opportunity for 2025 commitments, Fishman says his data shows that it's simply not worth it.\n\nMozillais turning its Thunderbird open source e-mail client into a full communications platform with the launch of Thundermail and Thunderbird Pro to compete with Gmail and Microsoft 365. Mozilla's offering aims to stand out with its open source values of privacy, freedom, transparency, and user respect. With the launch of Thunderbird Pro, Mozilla is adding a scheduling tool for sharing calendar links, a rebuild of its discontinued encrypted file-sharing service Firefox Send, and a new AI-powered writing tool intended to do the processing locally to eliminate privacy concerns. Lastly, Thundermail will offer a cloud e-mail hosting service using the open-source Stalwart stack, and users will be able to pick between thundermail.com and tb.pro domains. I hate them both. Support custom domain e-mails!\n\nAmazonresumed making drone deliveries in Texas and Arizona, following a two month hiatus after suspending Prime Air deliveries to correct issues with the drone's altitude sensor caused by dusty air, which could have potentially caused its system to produce an inaccurate reading of its position relative to the ground. The company has returned to drone deliveries with a bang, setting a goal to deliver 500M packages by drone per year by the end of the decade.\n\nGoodRx, a healthcare platform that helps American consumers save on prescription medications by offering price comparisons and discounts, launched an e-commerce experience for retail pharmacies in collaboration with grocery chain Hy-Vee that checks inventories when a consumer searches for medication to determine whether it's available at the pharmacy and can be purchased online. The company will then validate the prescription and complete the order after the consumer pays the GoodRx price online. The tool is part of a larger innovation strategy by the company designed to streamline prescription purchasing for consumers while supporting retail pharmacies.\n\nAmazon Haul,the company's direct-from-China marketplace that it launched in November to compete with Temu, is now available on desktop, previously only available through Amazon's mobile app. Despite President Trump ending the de minimis loophole that lets cheap goods into the country duty-free, Amazon appears to be moving forward with its plans to expand Haul. Perhaps they know something we don't.\n\nSarah Wynn-Williams, the ex-Meta employee who authored theCareless Peoplebook (which I'm currently halfway through), will testify before a Senate Judiciary subcommittee next week to address Facebook’s “cooperation with the Communist regime in China, including FB’s plan to build censorship tools,” despite Meta's attempts to block her from communicating with members of Congress. The hearing will also address Facebook's alleged plans to “make American users' data available for Chinese use.” Members of the European Union and the UK have also asked to speak with her.\n\nA new Arkansas lawrequiring age verificationto create new social media accounts was declared unconstitutional and permanently blocked by a federal judge for being a “content-based restriction on speech that is not narrowly tailored to serve a compelling government interest.” Chris Marchese, litigation director for NetChoice, which filed a lawsuit against the state in June 2023 that resulted in a preliminary injunction two weeks before the law was set to take effect, said in a statement, “This ruling protects Americans from having to hand over their IDs or biometric data just to access constitutionally protected speech online. It reaffirms that parents — not politicians or bureaucrats — should decide what's appropriate for their children.”\n\nPetSmartnow fulfills 90% of its online orders from its 1,600 stores instead of from its seven distribution centers, just two years after beginning the initiative. The company says that shipping products from stores gets them to customers faster and at a lower cost, as 70% of orders are to customers within 20 miles of the store, allowing the company to deliver to customers quickly and offer same-day delivery through partners like DoorDash, InstaCart, Uber Eats, and Shipt. The company said that it has not closed any of its distribution centers, but that they are now focused on getting products to the stores or fulfilling orders of larger items that aren't available in stores.\n\nA massive X profile data leakexposed the details of 2.8B user profiles — the result of a disgruntled X employee who allegedly stole the data during a period of mass layoffs after Elon Musk took over the company. The poster on Breach Forums claims that they tried contacting X through multiple methods but received no response, so they took matters into their own hands and merged the newly leaked data with data from another breach from January 2023. The new leak doesn't contain e-mail addresses, but does hold profile metadata including account creation dates, screennames, profile descriptions and URLs, location and time zones, follower counts, follower lists, and more.\n\nTemuentered into an agreement withDHL Groupto use its logistics solutions for its local-to-local initiative, which the company expects to eventually account for 80% of its sales in Europe. The agreement aims to enhance collaboration to better support small- and medium-sized businesses in established European markets. Additionally down the road, DHL will assist Temu in growing its presence in e-commerce markets in the Middle East and Africa.\n\nTikTokshared an update aboutProject Clover,which is aimed at tackling data security, with an initial goal of ensuring that EU data isn't accessed by Chinese employees and government officials. The initiative was first shared last July, and now the company has reached a milestone with its EU data center in operation in Hamar, Norway. The location supports 200 jobs including cooling experts, engineers, and electricians. It is also working with the NCC cybersecurity group to oversee and confirm all data controls.\n\nShopifyis expandingSidekick, its AI-powered commerce assistant, from English-only to 20 supported languages, making the AI tool accessible to its global merchant base. Sidekick now automatically detects and respond in the merchant's language, blending Shopify's knowledgebase with a merchant's store data to provide personalized guidance, analyze business data, enhance product descriptions, automate tasks, and more.\n\nGoogleis withholding the release ofAI Overviews, its search-integrated AI feature, in most European countries due to regulatory uncertainty, according to a senior executive at the company. AI Overviews was launched in eight EU member states including Austria, Belgium, Germany, Ireland, Italy, Poland, Portugal, Spain, and Switzerland, nine months after launching in the US, but in late March, Google held back in the remaining EU countries including France, which has strict national rules about copyright.\n\nNintendowill no longer open preorders for the Switch 2 in the United States this week in order to assess the impact of tariffs and evolving market conditions, following the introduction of steep tariffs on exports from Japan. Nintendo unveiled its much-anticipated console on Wednesday, the same day President Trump announced his sweeping global tariffs. The company says it still intends to launch the console on June 5th as originally planned.\n\nAutomattic, the parent company of WordPress, WooCommerce, and Tumblr, is laying off 16% of its workforce, or around 280 employees, as part of CEO Matt Mullenweg's mission to “protect Automattic's long-term future.” In October, following the start of a public beef with WP Engine, Mullenweg offered his employees $30,000 or six months of salary to leave if they didn't agree with his decision to fight the managed WordPress host, which led to around 8.4% of Automattic's employees leaving the company. A memo to employees said that this “restructuring” was necessary due to the competitive nature of the market and the speed with which technology is evolving, although it sounds like Automattic needs to free up some funds to pay for its legal battle with WP Engine.\n\nTelus, a Canadian tech company, let go of over 2,000 people from its content moderation center in Barcelona, Spain after Meta severed its contract, following the termination of its fact checking program in the US. A spokesperson for Meta said the company has simply moved the services that were being performed in Barcelona to other locations, and is not actually reducing its content review efforts, but that doesn't seem very earnest given the recent news surrounding its fact checking program, and also given the fact that I'm halfway through reading theCareless Peoplememoir, and my trust in Meta is at an all-time low.\n\nEU regulatorsare considering fining X up to $1B after allegations that the company has breached Europe's strict Digital Markets Act, which allows for tech companies to be fined up to 6% of their global turnover. The results of the investigation, which revolves around X being accused of allowing illicit content and disinformation to be distributed and promoted through the platform are expected to be published this summer. New York Times anonymous sources said regulators are concerned about further antagonizing President Trump in view of the latest tariff war and Musk and Trump's close relationship, which could impact their final decision.\n\nThis week in corporate shakeups… Jamie Siminoff, who founded Ring, which was acquired by Amazon in 2018, is back at Amazon after leaving the position of Ring's CEO in 2023, following his launch and sale of another startup.Jonathan Poma, the co-founder and former CEO of Loop Returns, joined Shopify as director of go-to-market initiatives.Jeremy Segal, founder of Proozy, joined Zulily as its new CEO.Marcin Kusmierzwas appointed to head Allegro as its new CEO. BigCommerce announced that its CTO, Brian Dhatt, will depart from his position at the end of April, to be succeeded byMarcus Groff, the company's senior VP of Engineering. Lastly,David Lau, Tesla's VP of software engineering, is stepping down after having been with the company for 12 years, with no replacement named yet.\n\nBigCommerceannounced the winners of its 2025 BigCommerce and Feedonomics Customer and Partner Awards, which recognize the most innovative and inspiring customers and partners on its platforms in Europe, the Middle East and Africa. This year's EMEA awards featured 24 categories such as “Achievement in Growth” and “B2B Excellence Award,” with applicants evaluated by a panel of company employees and executives.\n\nEvery platform is Tiktok now.Substackis introducing a scrollable TikTok-like video feed in its app, aiming to capitalize on the potential void left by TikTok if it faces a ban in the US. The move comes a month after Substack announced that it would start allowing creators to monetize their videos on the platform and publish videos directly from the app. Substack first launched native video in 2022 and later introduced an in-house Media Tab in 2024, which has now been redesigned into a scrollable feed that will feature short-form videos, with plans to launch long-form and podcast previews in the feed soon.\n\nKlarnaannounced the relaunch ofLaybuyin New Zealand, combining a Kiwi brand with Klarna's global BNPL capabilities. Laybuy launched in New Zealand in 2017, expanded into Australia and the UK shortly after, and then ceased accepting new transactions and entered into receivership in June 2024. Two months later, Klarna acquired the company's assets in New Zealand and announced plans to relaunch the service and build upon its established brand in the region. I predict Klarna will leverage the brand to jumpstart its relaunch in the New Zealand market, slowly begin introducing Klarna branding alongside it, and then publish some corporate AI-generated announcement a few months later about how they've decided to fully rebrand to Klarna in the country.\n\nAmazonreleased a new feature called Recaps for the Kindle that reminds readers what happened in previous editions of books in a series, similar to “Previously on…” segments when viewing TV shows. Recaps are available for best-selling English-language books on all Kindle devices in the US and will soon be available for the Kindle app on iOS as well. Shortly after the feature rolled out, users began expressing concerns about the use of generative AI to write the summaries, particularly about the possibility of the technology hallucinating plot elements that aren't actually in the books. Amazon should let authors replace the AI recaps with their own personally written Recaps if they choose to do so.\n\nPinduoduosays it will invest more than $13B over the next three years to support merchants by driving traffic and investing in other resources to strengthen its e-commerce ecosystem. PDD, which also owns Temu, reported slower quarterly profit and revenue growth in Q4 2024, and is now facing tariffs and other uncertainty in the US, one of its key growth markets.\n\n🏆 This week's most ridiculous story… A Microsoft employee named Ibtihal Aboussad disrupted the company's 50th anniversary event and then sent an e-mail to a number of distribution lists that contain thousands of employees in protest of Microsoft's AI technology being used to power genocide in Palestine. Aboussad said that when she moved to AI Platform, she was excited to contribute to cutting-edge AI technology and its applications for the good of humanity, and was not informed that Microsoft would sell her work to the Israeli military and government “with the purpose of spying on and murdering journalists, doctors, aid workers, and entire civilian families.” She says that “silence is complicity” and that it's the responsibility of Microsoft workers to make their voices heard and demand that the company stop selling technology to the Israeli military. Note that I'm not calling Aboussad's actions ridiculous, but rather, the position she was put in.\n\nPlus 11 seed rounds, IPOs, and acquisitions of interest, includingOpenAIclosing its much anticipated $40B funding round last Monday at a $300B valuation, marking the most money ever raised by a private tech company in history. The valuation puts OpenAI behind only SpaceX at $350B and ByteDance at just over $300B among the world’s most richly valued private companies.\n\nI hope you found this recap helpful. See you next week!\n\nFor more details on each story and sources, see the full edition:\n\nhttps://www.shopifreaks.com/amazon-buy-for-me-tiktok-misery-profiteering-google-reads-your-newsletters/\n\nWhat else is new in e-commerce?\n\nShare stories of interesting in the comments below (including in your own business) or onr/Shopifreaks/.\n\n-PAUL Editor of Shopifreaks E-commerce Newsletter\n\nPS: Want the full editions delivered to your Inbox each week? Join free atwww.shopifreaks.com",
  "author": "404NotAFool",
  "comments": [
    {
      "author": "ai-dork",
      "timestamp": "",
      "body": "Really interesting to see AI becoming such a core part of e-commerce. As someone deep in the optimization space, I've noticed the biggest challenge isn't implementing AI - it's making it actually deliver value.I built an AI conversion optimization tool to help growing businesses, focusing on automatic optimization that actually leads to conversion lift. While solutions like Amazon's Rufus are interesting, small/medium businesses need tools that work without massive data requirements.The key is making AI practical and revenue-focused, not just another shiny feature."
    },
    {
      "author": "Prize_Confusion_3660",
      "timestamp": "",
      "body": "Artsnow is winding down their operation."
    },
    {
      "author": "404NotAFool",
      "timestamp": "",
      "body": ""
    }
  ]
}