{
  "subreddit": "BadRPerStories",
  "post_id": "1555by5",
  "title": "Let's talk about staying safe online and minors lying about their age.",
  "body": "So, a lot of this was originally posted as a comment on a post here. But I got feedback saying it was really helpful to some people and that they thought it should be its own post. Well, that's all the encouragement I needed, so let's gets started!\n\nSo, the truth is you probably don't. Theoretically the most surefire way to rule out someone being a minor is to get them on a video call and ask them to give you a tour of your house/introduce you to their family to see how they live. If they've got a family of their own, or you can tell they have an adult's relationship with their household and you've seen that on video, that's pretty goddamn strong evidence they're not 14. But there are ways to fudge even that process. They have no family. They live alone. They're good at pretending to be responsible for their household. It's just the most over the top aggressive method of verifying without meeting up IRL.\n\nIf you ask people to do what I just described in the previous paragraph you're going to get blocked 99% of the time because it's an extreme invasion of privacy. You'll get blocked for much less. Some Discord servers make you show a license in an effort to \"prove\" you're an adult, but that only discourages kids who aren't willing to make up an excuse to see their parents' license or wait for an opportunity to 'borrow' it without them knowing. There are absolutely kids getting past that. There are also kids who run their own NSFW servers with similar verification processes and then secretly steal/distribute the pictures you send them to use for themselves/their friends.\n\nYou will get blocked for asking people to show you their IDs too. Anything remotely aggressive that you do to verify people's identities is going to weed out a bunch of adults who are just trying to be safe in an entirely different way online. And they're not wrong for wanting to protect their privacy. So there is no winning move here.\n\nThere are things you can do to passively reduce your odds of RPing with a child that won't get you blocked because you don't have to confront anyone to do these things. Here are some examples:\n\nDon't RP with people who type like children. Don't tolerate excuses and apologia. Yes, it is possible for an adult to never learn how to type properly and just type like a child texting in class for their entire life. No, that isn't a good reason to ignore the fact that children are associated with it for a reason. Having some basic standards will in fact weed out a bunch of small kids as a bonus.\n\nSimilarly, kids are disproportionately going to fall into smaller post camps. You can passively further reduce the odds of RPing with kids by raising your minimums there too. I think that diminishing returns are going to kick in by 1-2 paragraphs. The type of kid who is already writing 2 paragraphs can probably write 4 if they really want to, so at that point you're not weeding out very many people compared to when you filter out one liners and semi-para.\n\nPay attention to their ability to be mature. Adults can have immature senses of humor or be selectively immature and that's fine, but if an \"adult\" is generally immature to a point that they just kinda act like a kid, maybe you should reconsider ERPing with them. Obviously this is dependent on your own judgement.\n\nThese don't create a perfect shield that protects you from being contacted by children lying about their age, however they do make a significant difference. And they all just happen to also help you find higher quality RP partners as well, so they really shouldn't be a big deal.\n\nObligatory disclaimer; I am not a lawyer. I am unqualified to give you legal advice. Do not get legal advice from strangers over the internet. If you are getting legal advise, you should know the full name of the person giving it to you so that you can verify they are in fact a lawyer who can be held responsible for legal misinformation. There is enough fearmongering around this particular part of the topic that we're now seeingposts on this subof adults losing their heads and doing wacky shit like publicly harassing minors because they're so scared they think any interaction with a minor will land them in a prison.\n\n...The answer is it probably won't, with a couple of caveats. If you send pornographic images to minors that's a big no-no. And courts really don't like it if something you say/do could be interpreted as you wanting to meet up/do things with a minor IRL. That's also a big no-no. So my advice is to reconsider sending that dickpic to that stranger, delete any sent to you, and don't hit on strangers OOC. I know we make fun of the people who do that stuff here, but they are unironically the people who are most at risk of getting in trouble over this. You can reduce the already tiny chance of getting in trouble to near zero by simply not doing these things.\n\nThere's also a potential edge-case in which someone who writes in first person and isn't zealous about making sure IC and OOC are both easily and clearly distinguished might confuse a third party into thinking they were soliciting a minor OOC because of something that was meant to be IC. I don't know how likely that is, but if you needed an excuse to give third person a try and it helps you feel safer go for it.\n\nSo, the worst came to pass. Someone lied about their age and you didn't find out until an angry parent/guardianbegan yelling at you through their account. We've already covered that these are most likely empty threats, but how should you respond?\n\nYou are not under any obligation to speak to the parent/guardian. If they ask if you knew the account belonged to a minor, telling them no you didn't is probably fine. The child might omit that they lied about their age if they think it can get them out of trouble, so clarifying that one detail might actually be helpful. But otherwise, it's time for you to block and move on. You don't have the power to stop their child from lying about their age and hitting up other adults. The parents/guardian are the only ones who can do that. Offering yourself up as a punching bag full of apologies is just going to distract them from the self-reflection they should be doing about how they could've prevented this from happening.\n\nThe good news is that this is actually the best case scenario. Not for you--you have to deal with reading an uncomfortable message and your RP just imploded and all that--but for the child. Their parents caught them. They're probably being removed from the dangerous situation they were in, likely from a bunch of other people they tricked into RPing with them as well. And their parent/guardian just got a rude wake up call about the dangers of unrestricted internet access. The appropriate reaction is to feel relieved that they were caught. Karma caught up with them for all that lying and they are in the best possible circumstances to prevent it from happening again.",
  "author": "Super_Door",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome to BadRPerStories! If you are new here, please take a moment to look at ourbanned words list on the wiki.We now have aGoogle docthat lists all known RP hubs, forums, and subreddits. If you know of a place for RP that isn't on this document, there is a link in the document to request an addition. Please be aware this is just a knowledge base, not a recommendations list, and the moderators of BadRPerStories do not condone anything that happens in the spaces listed here.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Phoenician-Purple",
      "timestamp": "",
      "body": "It never hurts to ask their age and get it in writing, preferably via e-mail so that they can't delete the message later."
    },
    {
      "author": "ObjectiveAd208",
      "timestamp": "",
      "body": "Or screen shot it"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Great post! I would like to add something, although I never saw this mentioned in relation to roleplaying spaces, there is a widely known scam where people act like you chatted with a minor to try to get you to send them money. If someone claims that you roleplayed erp content with a minor and now they need a large sum of money because the minor hurt themself because of you and you need to pay the hospital bill/they will leak the chats if you don't comply/ or any other story that results in them needing money because you traumatised their child, that is not real. You never chatted with a minor, but with an adult who is trying to scam you. I don't know if this ever happened in a roleplaying context, but I just thought it might be better to warn people because this scam is widely used in other spaces and might extend to roleplay in the future."
    },
    {
      "author": "CharmyDracoDreamer",
      "timestamp": "",
      "body": "Thanks for the insight! I hadn't heard of that before. It definitely sounds like the sort of thing that's bound to happen at least once given enough time, I think, so hopefully it helps someone avoid a lot of unneeded stress."
    },
    {
      "author": "dship89",
      "timestamp": "",
      "body": "Amen, happened to me almost ten years ago and I went straight to the cops with everything"
    },
    {
      "author": "ShotAddition",
      "timestamp": "",
      "body": "This sounds like the equivalent of the \"Your kid just got involved in a road accident' scam. I've never heard of it in this format but that sounds vile"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Ask their age and stalk their reddit comment history before responding. Sure post history is great too but people are often very close to how they really are and people are less carefull than with their posts. Do they tell their age in comments and is it inconsistent? Are they commenting in subreddits mostly associated with kids or teens?Do they not introduce themselfs with their age? Do they respond during odd times where most people have to work in their timezone? (it is easier to respond when still going to school).The good thing about erp is that you do not need to start with smut the first scene you write together. Plan at least one scene where you just build up tension or set up the plot, have your ocs talk to each other or anything else. These interactions will often be very telling and shows a lack of understanding in consent, communication and maturity and whether that person is a kid or just a very lost adult is not important at this point anyway, because it is not going anywhere. Better to try to make sure during the planning phase but still include it. Better safe than sorry."
    },
    {
      "author": "Super_Door",
      "timestamp": "",
      "body": "I'd be curiouse If someone people think I'm underage 😂 I post odd things, rarely mention my age and respond all hours because I'm on disability 😂"
    }
  ]
}