{
  "subreddit": "BadRPerStories",
  "post_id": "18r7g8v",
  "title": "\"Standard\" ID verification? Am I behind the times? When did this become standard?",
  "body": "",
  "author": "Irohsgranddaughter",
  "comments": [
    {
      "author": "AutoModerator",
      "timestamp": "",
      "body": "Moderator AnnouncementRead More »Welcome to BadRPerStories! If you are new here, please take a moment to look at ourbanned words list on the wiki.We now have aGoogle docthat lists RP hubs, forums, and subreddits. If you know of a place for RP that isn't on this document, there is a link in the document to request an addition. Please be aware this is just a knowledge base, not a recommendations list, and the moderators of BadRPerStories do not condone anything that happens in the spaces listed here.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns."
    },
    {
      "author": "Fiohel",
      "timestamp": "",
      "body": "I've only ever heard of people looking for ID verification in this subreddit, and always in regards to discord. I understand why this might've become a thing but it would be an instant no for me. You do not get to see my private information, thank you.The way I avoid this is by visiting sites that are advertised as being exclusively 18+ where everyone is already supposed to be an adult. No need to ask for age that way, and if you suspect anyone is too young, you can just report them and let the moderators handle it.I would never agree to someone seeking ID verification (let alone a picture of me?) but if you plan to go through with this, do make sure to block out any important information, including your address and the like.Edit: I've been writing for about two decades now, never had someone ask."
    },
    {
      "author": "ChaserNeverRests",
      "timestamp": "",
      "body": "I've been active online since before AOL existed and a grand total of three online people know my RL first name, no one knows my full name.No way in hell some random RP group would get personal information from me. There are plenty of other groups out there!"
    },
    {
      "author": "rayezin",
      "timestamp": "",
      "body": "When our server asks for this (in the case of reported or suspected underage - not as a requirement), we ask for the entire ID to be blocked out EXCEPT for the date of birth so that we don’t see any personally identifying information. If some random underage kid has an adult’s ID handy to photograph and jot their discord name within a few minutes, good on them I guess - but despite claiming they’re happy to provide one, no one has ever actually done so. Being called  out is enough to get them to admit they’re underage or just show themselves out. Fortunately this is a very rare occurrence."
    },
    {
      "author": "Oracle_Of_Shadows",
      "timestamp": "",
      "body": "This was written in a post that was advertising a group RP server, by the way."
    },
    {
      "author": "EmbarrassedPudding22",
      "timestamp": "",
      "body": "So to join this community I have to provide a picture and a copy of my id? Yeah, nothing suspect about that. Thanks for advertising it's a shady community before I get involved."
    },
    {
      "author": "totalimmoral",
      "timestamp": "",
      "body": "Yeah, this is the quickest way to get me to nope from a server and I'm almost 40. People like to act like this is the big way to keep minors from joining and forget that most minors live with other people and have access to parents and older siblings licenses.If a kid is really determined to get in, they're gonna get in. Just use your best judgement and if you suspect someone of being underaged, then boot them."
    },
    {
      "author": "Upbeat_Ice1921",
      "timestamp": "",
      "body": "All you need to do is advertise your server as being over 18, put a mechanism in place for reporting suspected underage players and enforce your rules and you’re fine.I’d never give rl info out just to join a server."
    },
    {
      "author": "SweeTea_Aloe330",
      "timestamp": "",
      "body": "I’m sure there might be good and secure roleplay servers out there. But personally, if any server asks me of this, it’s a no for me.I am pretty much in my Mid 20s. But no way I will provide my ID for something, unless it’s for work or government or other documents. I become extra cautious when it comes to my personal info and the internet."
    },
    {
      "author": "Irohsgranddaughter",
      "timestamp": "",
      "body": "Personally, I'd be at least extremely reluctant to show someone my actual ID. Mostly because it is entirely possible to recover the picture's original state if you blur out the truly sensitive information.Either way, it's also not my problem, because I don't do group roleplays anymore and it's unlikely I'll ever get back to it agaoin."
    }
  ]
}