{
  "subreddit": "teenagers",
  "post_id": "1hyhweb",
  "title": "Age verification on r/teenagers",
  "body": "Heyo, I just had a thought that could maybe make this subreddit better. I am new to reddit and this subreddit, however, I have already seen countless posts complaining about unwanted, creepy, DMs from pedophiles to minors through this subreddit. Due to this apparently prevelent issue, there should be some sort of age verification requirement to be aloud to join this subreddit, that would only allow people from the ages of 13-19 to join.\n\nThe issue: I understand that the traditional photo id via passport or healthcard for verification may not be a viable option on this subreddit, due to the fact that not all minors will have a photo id, and having minors give out photo id over the internet is not a great idea. That being said, there may be other forms of verification.\n\nIdea: My first thought was a type of quiz, and the questions would only be answerable by someone who is a teenager, or at least around that age range. The problem is that with this idea, even if we did a locked quiz in google forms, that person can easily just whip out another device and google the anwers.\n\nCurious to see what ideas others have. Let's come up with some ideas in the comments.",
  "author": "BoredKitKat",
  "comments": [
    {
      "author": "SadBoiGrey",
      "timestamp": "",
      "body": "Other than ID's which frankly will not work on Reddit for a vast number of reasons, there's no real way to guarantee anything. It's just how the internet works. People have to be smart with who they reply to, how they reply and whatnot."
    },
    {
      "author": "Dupec",
      "timestamp": "",
      "body": "No"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I don't think age verficiation has ever been a thing here because they want it open to adults that have questions and parents too, there's a reason why the sub has an OLD flair. My opinion on that is mixed, but I doubt age verification will be put here for that reason."
    },
    {
      "author": "samy_2023",
      "timestamp": "",
      "body": "that would only allow people from the ages of 13-19 to join.There's no way to prevent people from joining a public subreddit and viewing its content, you can only stop them from making posts and comments (which would already be an improvement but the current pedos thzt post get caught pretty quickly here usually)The ID verification seems a good idea but sharing the private informations that an ID card contains will cause lots of privacy issues like the risk that a malicious person manage to become a moderator and uses the IDs for bad purposes.The quiz... not so much. It would require that every teenager here is up to date with the latest trends etc..., which might not be the case for some teenagers  (like me), and prevent us from interacting here.And sorry, but I don't have any idea on how to have a perfect identification system to prevent pedos from posting here"
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "I mean, sure, I guess. But what about:Non-pedo creeps with teen-appropriate ages?Actual good-willed adults who don't engage in that sort of behavior and just have general questions and try to understand younger generations?What about teens who join now, and verify their age, but years later cease to be teens?What about people who are indeed creepy pervs and were banned, but just created new accounts and join again? When there's a will, there's a way, or so they say.The intention is good, and I agree with the sentiment, but it'd be quite the can of worms to manage. Maybe even straight up impossible, even."
    },
    {
      "author": "[deleted]",
      "timestamp": "",
      "body": "Hey"
    },
    {
      "author": "smartuwu",
      "timestamp": "",
      "body": "Hey"
    },
    {
      "author": "BoredKitKat",
      "timestamp": "",
      "body": "it’s the internet, just gotta accept the dangers. can’t safeguard everything"
    }
  ]
}